#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserDiscoverItemRow_Homebar

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar
// 0x0160 (0x0160 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInPeekState;                       // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMovingOffscreen_1;                   // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayAnimation;                       // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActive_1;                          // 0x0007(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          K2Node_DynamicCast_AsActivity_Browser_Arrow_Button; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserArrowButton_C*          K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMovingOffscreen;                     // 0x005A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_3;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0078(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_3;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_4;         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue_1;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActive;                            // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0108(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserTile_Homebar_NEW_VM_C*  K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserTile_Homebar_NEW_VM_C*  K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM_1; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreatePlayAnimationProxyObject_StartAtTime_ImplicitCast; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar) == 0x000008, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar) == 0x000160, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, EntryPoint) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Event_bIsInPeekState) == 0x000004, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Event_bIsInPeekState' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Event_bMovingOffscreen_1) == 0x000005, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Event_bMovingOffscreen_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Event_bPlayAnimation) == 0x000006, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Event_bPlayAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Event_bIsActive_1) == 0x000007, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Event_bIsActive_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000008, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_AsActivity_Browser_Arrow_Button) == 0x000010, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_AsActivity_Browser_Arrow_Button' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1) == 0x000020, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Array_Add_ReturnValue_1) == 0x00002C, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_byte_Variable) == 0x000058, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000059, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Event_bMovingOffscreen) == 0x00005A, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Event_bMovingOffscreen' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x000070, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_IsAnimationPlaying_ReturnValue_3) == 0x000071, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_IsAnimationPlaying_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetIsActive_ReturnValue) == 0x000072, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetIsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_BooleanOR_ReturnValue) == 0x000073, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_byte_Variable_1) == 0x000074, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_CreateDelegate_OutputDelegate_2) == 0x000078, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_CustomEvent_NewInputType) == 0x000084, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_byte_Variable_2) == 0x000085, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000088, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_byte_Variable_3) == 0x000090, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_IsAnimationPlaying_ReturnValue_4) == 0x000091, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_IsAnimationPlaying_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetEndTime_ReturnValue) == 0x000094, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000098, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_SelectFloat_ReturnValue) == 0x0000A8, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000B0, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B8, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_byte_Variable_4) == 0x0000D0, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Select_Default) == 0x0000D1, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetIsActive_ReturnValue_1) == 0x0000D2, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetIsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, Temp_int_Array_Index_Variable) == 0x0000D4, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetRenderOpacity_ReturnValue) == 0x0000D8, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_Event_bIsActive) == 0x0000E9, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_Event_bIsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000F0, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000F8, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_ComponentBoundEvent_Widget_1) == 0x000100, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_CreateDelegate_OutputDelegate_3) == 0x000108, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM) == 0x000118, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_ComponentBoundEvent_Widget) == 0x000128, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM_1) == 0x000130, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_CreatePlayAnimationProxyObject_StartAtTime_ImplicitCast) == 0x000150, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_CreatePlayAnimationProxyObject_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000154, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000158, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged, NewInputType) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_HandleInputMethodChanged::NewInputType' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.OnCategoryItemChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged, bPlayAnimation) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_OnCategoryItemChanged::bPlayAnimation' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.OnQueryStatusChanged_1
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1 final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1, bIsActive) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_OnQueryStatusChanged_1::bIsActive' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.OnRowIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_OnRowIsActiveChanged::bIsActive' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.OnRowMoveDown
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown final
{
public:
	bool                                          bMovingOffscreen;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown, bMovingOffscreen) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveDown::bMovingOffscreen' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.OnRowMoveUp
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp final
{
public:
	bool                                          bMovingOffscreen;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp, bMovingOffscreen) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_OnRowMoveUp::bMovingOffscreen' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.OnRowPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged) == 0x000001, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged) == 0x000001, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged, bIsInPeekState) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_OnRowPeekStateChanged::bIsInPeekState' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.ResetOnPeekAnimation
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation) == 0x000004, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation) == 0x000010, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnPeekAnimation::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.ResetOnRowActiveInactiveAnimation
// 0x0014 (0x0014 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation final
{
public:
	bool                                          IsRowActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation) == 0x000004, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation) == 0x000014, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation, IsRowActive) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation::IsRowActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_ResetOnRowActiveInactiveAnimation::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.SnapToEndOfAnimation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation) == 0x000008, "Wrong alignment on ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation");
static_assert(sizeof(ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation) == 0x000018, "Wrong size on ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation, InAnimation) == 0x000000, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation, PlayMode) == 0x000008, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ActivityBrowserDiscoverItemRow_Homebar_C_SnapToEndOfAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C.Update Padding for List View Entries
// 0x00D0 (0x00D0 - 0x0000)
struct ActivityBrowserDiscoverItemRow_Homebar_C_Update_Padding_for_List_View_Entries final
{
public:
	float                                         Temp_real_Variable;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0068(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue_1;   // 0x0078(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_Small_C* K2Node_DynamicCast_AsWBP_Activity_Browser_Tile_Joinable_Party_Rounded_Corners_Small; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserTile_Homebar_NEW_VM_C*  K2Node_DynamicCast_AsActivity_Browser_Tile_Homebar_NEW_VM; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
