#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserCategoryTile

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserCategoryTile.ActivityBrowserCategoryTile_C.ExecuteUbergraph_ActivityBrowserCategoryTile
// 0x0030 (0x0030 - 0x0000)
struct ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTileActive;                        // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile) == 0x000008, "Wrong alignment on ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile");
static_assert(sizeof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile) == 0x000030, "Wrong size on ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, EntryPoint) == 0x000000, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, K2Node_Event_bIsTileActive) == 0x000004, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::K2Node_Event_bIsTileActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'ActivityBrowserCategoryTile_C_ExecuteUbergraph_ActivityBrowserCategoryTile::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function ActivityBrowserCategoryTile.ActivityBrowserCategoryTile_C.OnTileActiveSet
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserCategoryTile_C_OnTileActiveSet final
{
public:
	bool                                          bIsTileActive;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserCategoryTile_C_OnTileActiveSet) == 0x000001, "Wrong alignment on ActivityBrowserCategoryTile_C_OnTileActiveSet");
static_assert(sizeof(ActivityBrowserCategoryTile_C_OnTileActiveSet) == 0x000001, "Wrong size on ActivityBrowserCategoryTile_C_OnTileActiveSet");
static_assert(offsetof(ActivityBrowserCategoryTile_C_OnTileActiveSet, bIsTileActive) == 0x000000, "Member 'ActivityBrowserCategoryTile_C_OnTileActiveSet::bIsTileActive' has a wrong offset!");

}

