#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDiscoverView_NEW_VM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDiscoverView_NEW_VM.ActivityDiscoverView_NEW_VM_C
// 0x0150 (0x0960 - 0x0810)
class UActivityDiscoverView_NEW_VM_C final : public UFortActivityDiscoverViewV2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0810(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_DiscoverFullscreenOffsetItemPadding;          // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAndHideRowLoadingSpinner;                      // 0x0820(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0828(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ClippingBoundary;                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Nav;                                       // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Throbber_C*                  WBP_UIKit_Throbber;                                // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               NextImage;                                         // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   KeyArtParameter;                                   // 0x0850(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               DefaultImage;                                      // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPlayIntro;                                       // 0x0860(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasIntroPlayed;                                    // 0x0870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DetailsMaxHeight;                                  // 0x0878(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetailsMaxHeightMobile;                            // 0x0880(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KeyArtMaxWidth;                                    // 0x0888(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KeyArtMaxWidthMobile;                              // 0x0890(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         KeyArt_ImageWidgets;                               // 0x0898(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsPromotedContentDisplayed;                        // 0x08A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsPromoted, bool IsFirstRow)> OnRowUpdated;                                      // 0x08B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsImageLoadingSpinnerActive;                       // 0x08C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(double ItemOffset, double DistanceRemaining)> OnListScrolled;                                    // 0x08C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool IsFirstRow)> OnHomeBarUpdated;                                  // 0x08D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         RowIndex;                                          // 0x08E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8EC[0x4];                                      // 0x08EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              BroadcastToHomespaceTileClicked;                   // 0x08F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             AmbientBackgroundLoop;                             // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BackgroundAmbience;                                // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundSubmix*                           MusicSubmix;                                       // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USubmixEffectDynamicReverbPreset*       ReverbSubmixEffect;                                // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundControlBusMix*                    ControlBusMix;                                     // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAthenaLobbyBase*                       Athena_Lobby;                                      // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnOverSwipeUp;                                     // 0x0930(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsFullscreen;                                      // 0x0940(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSwipeDownWhenCollapsed;                          // 0x0948(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AllowMouseWheelScrolling(bool AllowMouseWheelScrolling_0);
	void BndEvt__ActivityDiscoverView_NEW_VM_BrowserList_Activities_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__ActivityDiscoverView_NEW_VM_BrowserList_Activities_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void Construct();
	void ExecuteUbergraph_ActivityDiscoverView_NEW_VM(int32 EntryPoint);
	void Finished_D6F6433E42FC8CEA7FE92DAE4F5C3129();
	void GetHasIntroPlayed(bool* IsFinishedLoading);
	void GetIndexOfCurrentActivity(int32* TileIndex);
	void OnActivityUpdated();
	void OnListViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnQueryActivitiesFinished();
	void OnReceivedTileClickFromHomebarRow();
	void OnRowChanged(const int32 NewCategoryIndex);
	void OnTransitionDiscoverFullscreen(bool IsDiscoverFullscreen);
	void ResetScreenState();
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDiscoverView_NEW_VM_C">();
	}
	static class UActivityDiscoverView_NEW_VM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDiscoverView_NEW_VM_C>();
	}
};
static_assert(alignof(UActivityDiscoverView_NEW_VM_C) == 0x000010, "Wrong alignment on UActivityDiscoverView_NEW_VM_C");
static_assert(sizeof(UActivityDiscoverView_NEW_VM_C) == 0x000960, "Wrong size on UActivityDiscoverView_NEW_VM_C");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, UberGraphFrame) == 0x000810, "Member 'UActivityDiscoverView_NEW_VM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, Anim_DiscoverFullscreenOffsetItemPadding) == 0x000818, "Member 'UActivityDiscoverView_NEW_VM_C::Anim_DiscoverFullscreenOffsetItemPadding' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, ShowAndHideRowLoadingSpinner) == 0x000820, "Member 'UActivityDiscoverView_NEW_VM_C::ShowAndHideRowLoadingSpinner' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, Intro) == 0x000828, "Member 'UActivityDiscoverView_NEW_VM_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, Overlay_ClippingBoundary) == 0x000830, "Member 'UActivityDiscoverView_NEW_VM_C::Overlay_ClippingBoundary' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, Overlay_Nav) == 0x000838, "Member 'UActivityDiscoverView_NEW_VM_C::Overlay_Nav' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, WBP_UIKit_Throbber) == 0x000840, "Member 'UActivityDiscoverView_NEW_VM_C::WBP_UIKit_Throbber' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, NextImage) == 0x000848, "Member 'UActivityDiscoverView_NEW_VM_C::NextImage' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, KeyArtParameter) == 0x000850, "Member 'UActivityDiscoverView_NEW_VM_C::KeyArtParameter' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, DefaultImage) == 0x000858, "Member 'UActivityDiscoverView_NEW_VM_C::DefaultImage' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, OnPlayIntro) == 0x000860, "Member 'UActivityDiscoverView_NEW_VM_C::OnPlayIntro' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, HasIntroPlayed) == 0x000870, "Member 'UActivityDiscoverView_NEW_VM_C::HasIntroPlayed' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, DetailsMaxHeight) == 0x000878, "Member 'UActivityDiscoverView_NEW_VM_C::DetailsMaxHeight' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, DetailsMaxHeightMobile) == 0x000880, "Member 'UActivityDiscoverView_NEW_VM_C::DetailsMaxHeightMobile' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, KeyArtMaxWidth) == 0x000888, "Member 'UActivityDiscoverView_NEW_VM_C::KeyArtMaxWidth' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, KeyArtMaxWidthMobile) == 0x000890, "Member 'UActivityDiscoverView_NEW_VM_C::KeyArtMaxWidthMobile' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, KeyArt_ImageWidgets) == 0x000898, "Member 'UActivityDiscoverView_NEW_VM_C::KeyArt_ImageWidgets' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, IsPromotedContentDisplayed) == 0x0008A8, "Member 'UActivityDiscoverView_NEW_VM_C::IsPromotedContentDisplayed' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, OnRowUpdated) == 0x0008B0, "Member 'UActivityDiscoverView_NEW_VM_C::OnRowUpdated' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, IsImageLoadingSpinnerActive) == 0x0008C0, "Member 'UActivityDiscoverView_NEW_VM_C::IsImageLoadingSpinnerActive' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, OnListScrolled) == 0x0008C8, "Member 'UActivityDiscoverView_NEW_VM_C::OnListScrolled' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, OnHomeBarUpdated) == 0x0008D8, "Member 'UActivityDiscoverView_NEW_VM_C::OnHomeBarUpdated' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, RowIndex) == 0x0008E8, "Member 'UActivityDiscoverView_NEW_VM_C::RowIndex' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, BroadcastToHomespaceTileClicked) == 0x0008F0, "Member 'UActivityDiscoverView_NEW_VM_C::BroadcastToHomespaceTileClicked' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, AmbientBackgroundLoop) == 0x000900, "Member 'UActivityDiscoverView_NEW_VM_C::AmbientBackgroundLoop' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, BackgroundAmbience) == 0x000908, "Member 'UActivityDiscoverView_NEW_VM_C::BackgroundAmbience' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, MusicSubmix) == 0x000910, "Member 'UActivityDiscoverView_NEW_VM_C::MusicSubmix' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, ReverbSubmixEffect) == 0x000918, "Member 'UActivityDiscoverView_NEW_VM_C::ReverbSubmixEffect' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, ControlBusMix) == 0x000920, "Member 'UActivityDiscoverView_NEW_VM_C::ControlBusMix' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, Athena_Lobby) == 0x000928, "Member 'UActivityDiscoverView_NEW_VM_C::Athena_Lobby' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, OnOverSwipeUp) == 0x000930, "Member 'UActivityDiscoverView_NEW_VM_C::OnOverSwipeUp' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, IsFullscreen) == 0x000940, "Member 'UActivityDiscoverView_NEW_VM_C::IsFullscreen' has a wrong offset!");
static_assert(offsetof(UActivityDiscoverView_NEW_VM_C, OnSwipeDownWhenCollapsed) == 0x000948, "Member 'UActivityDiscoverView_NEW_VM_C::OnSwipeDownWhenCollapsed' has a wrong offset!");

}

