#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserCategoryTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserCategoryTile.ActivityBrowserCategoryTile_C
// 0x0020 (0x1550 - 0x1530)
class UActivityBrowserCategoryTile_C final : public UFortActivityCategoryTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TileHover;                                         // 0x1538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Tile;                                        // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void Construct();
	void ExecuteUbergraph_ActivityBrowserCategoryTile(int32 EntryPoint);
	void OnTileActiveSet(const bool bIsTileActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserCategoryTile_C">();
	}
	static class UActivityBrowserCategoryTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserCategoryTile_C>();
	}
};
static_assert(alignof(UActivityBrowserCategoryTile_C) == 0x000010, "Wrong alignment on UActivityBrowserCategoryTile_C");
static_assert(sizeof(UActivityBrowserCategoryTile_C) == 0x001550, "Wrong size on UActivityBrowserCategoryTile_C");
static_assert(offsetof(UActivityBrowserCategoryTile_C, UberGraphFrame) == 0x001530, "Member 'UActivityBrowserCategoryTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserCategoryTile_C, TileHover) == 0x001538, "Member 'UActivityBrowserCategoryTile_C::TileHover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserCategoryTile_C, Image_Tile) == 0x001540, "Member 'UActivityBrowserCategoryTile_C::Image_Tile' has a wrong offset!");

}

