#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRow_NEW_VM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C
// 0x0078 (0x0440 - 0x03C8)
class UActivityBrowserRow_NEW_VM_C final : public UFortActivityBrowserRowList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLoadingMore;                                     // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPeek;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          InactiveDarken;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveOverlayDim;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UActivityBrowserArrowButton_C*>  ArrowButtons;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   FontHoverAnimateParam;                             // 0x0418(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontPressedAnimateParam;                           // 0x041C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LoadingMoreDisplayDelay;                           // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreVisible;                              // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreQueryActive;                          // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LoadingMoreDelayTimer;                             // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ActivityBrowserRow_NEW_VM(int32 EntryPoint);
	void Finished_31D944D34F22F7FC82BF4F889F26EF09();
	void Finished_3E73331A4DD3EBC5CBA16D833A7500EF();
	void FinishedLoadingMoreDelay();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnQueryStatusChanged(bool bIsActive);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void ResetOnPeekAnimation();
	void ResetOnRowActiveInactiveAnimation(bool IsRowActive);
	void Set_Font_Category_Size();
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserRow_NEW_VM_C">();
	}
	static class UActivityBrowserRow_NEW_VM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserRow_NEW_VM_C>();
	}
};
static_assert(alignof(UActivityBrowserRow_NEW_VM_C) == 0x000008, "Wrong alignment on UActivityBrowserRow_NEW_VM_C");
static_assert(sizeof(UActivityBrowserRow_NEW_VM_C) == 0x000440, "Wrong size on UActivityBrowserRow_NEW_VM_C");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, UberGraphFrame) == 0x0003C8, "Member 'UActivityBrowserRow_NEW_VM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, OnLoadingMore) == 0x0003D0, "Member 'UActivityBrowserRow_NEW_VM_C::OnLoadingMore' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, OnPeek) == 0x0003D8, "Member 'UActivityBrowserRow_NEW_VM_C::OnPeek' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, OnRowActiveInactiveAnim) == 0x0003E0, "Member 'UActivityBrowserRow_NEW_VM_C::OnRowActiveInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, InactiveDarken) == 0x0003E8, "Member 'UActivityBrowserRow_NEW_VM_C::InactiveDarken' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, InactiveOverlayDim) == 0x0003F0, "Member 'UActivityBrowserRow_NEW_VM_C::InactiveOverlayDim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, VBContent) == 0x0003F8, "Member 'UActivityBrowserRow_NEW_VM_C::VBContent' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, WBP_LoadingMorePages) == 0x000400, "Member 'UActivityBrowserRow_NEW_VM_C::WBP_LoadingMorePages' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, ArrowButtons) == 0x000408, "Member 'UActivityBrowserRow_NEW_VM_C::ArrowButtons' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, FontHoverAnimateParam) == 0x000418, "Member 'UActivityBrowserRow_NEW_VM_C::FontHoverAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, FontPressedAnimateParam) == 0x00041C, "Member 'UActivityBrowserRow_NEW_VM_C::FontPressedAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, IsWaitingForInactiveAnim) == 0x000420, "Member 'UActivityBrowserRow_NEW_VM_C::IsWaitingForInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, LoadingMoreDisplayDelay) == 0x000428, "Member 'UActivityBrowserRow_NEW_VM_C::LoadingMoreDisplayDelay' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, IsLoadingMoreVisible) == 0x000430, "Member 'UActivityBrowserRow_NEW_VM_C::IsLoadingMoreVisible' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, IsLoadingMoreQueryActive) == 0x000431, "Member 'UActivityBrowserRow_NEW_VM_C::IsLoadingMoreQueryActive' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_NEW_VM_C, LoadingMoreDelayTimer) == 0x000438, "Member 'UActivityBrowserRow_NEW_VM_C::LoadingMoreDelayTimer' has a wrong offset!");

}

