#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityCategoryTilePanelBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityCategoryTilePanelBase.ActivityCategoryTilePanelBase_C.EnableMouseWheelInput
// 0x0001 (0x0001 - 0x0000)
struct ActivityCategoryTilePanelBase_C_EnableMouseWheelInput final
{
public:
	bool                                          bListenForInput;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityCategoryTilePanelBase_C_EnableMouseWheelInput) == 0x000001, "Wrong alignment on ActivityCategoryTilePanelBase_C_EnableMouseWheelInput");
static_assert(sizeof(ActivityCategoryTilePanelBase_C_EnableMouseWheelInput) == 0x000001, "Wrong size on ActivityCategoryTilePanelBase_C_EnableMouseWheelInput");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_EnableMouseWheelInput, bListenForInput) == 0x000000, "Member 'ActivityCategoryTilePanelBase_C_EnableMouseWheelInput::bListenForInput' has a wrong offset!");

// Function ActivityCategoryTilePanelBase.ActivityCategoryTilePanelBase_C.ExecuteUbergraph_ActivityCategoryTilePanelBase
// 0x0040 (0x0040 - 0x0000)
struct ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bListenForInput;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEntryWidth_NewWidth_ImplicitCast;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEntryHeight_NewHeight_ImplicitCast;    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase) == 0x000008, "Wrong alignment on ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase");
static_assert(sizeof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase) == 0x000040, "Wrong size on ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, EntryPoint) == 0x000000, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000008, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, K2Node_Event_IsDesignTime) == 0x000020, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, K2Node_CustomEvent_bListenForInput) == 0x000021, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::K2Node_CustomEvent_bListenForInput' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, K2Node_CustomEvent_IsActive) == 0x000022, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000028, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000030, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_SetEntryWidth_NewWidth_ImplicitCast) == 0x000038, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_SetEntryWidth_NewWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase, CallFunc_SetEntryHeight_NewHeight_ImplicitCast) == 0x00003C, "Member 'ActivityCategoryTilePanelBase_C_ExecuteUbergraph_ActivityCategoryTilePanelBase::CallFunc_SetEntryHeight_NewHeight_ImplicitCast' has a wrong offset!");

// Function ActivityCategoryTilePanelBase.ActivityCategoryTilePanelBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityCategoryTilePanelBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityCategoryTilePanelBase_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityCategoryTilePanelBase_C_PreConstruct");
static_assert(sizeof(ActivityCategoryTilePanelBase_C_PreConstruct) == 0x000001, "Wrong size on ActivityCategoryTilePanelBase_C_PreConstruct");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityCategoryTilePanelBase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityCategoryTilePanelBase.ActivityCategoryTilePanelBase_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct ActivityCategoryTilePanelBase_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityCategoryTilePanelBase_C_SetActive) == 0x000001, "Wrong alignment on ActivityCategoryTilePanelBase_C_SetActive");
static_assert(sizeof(ActivityCategoryTilePanelBase_C_SetActive) == 0x000001, "Wrong size on ActivityCategoryTilePanelBase_C_SetActive");
static_assert(offsetof(ActivityCategoryTilePanelBase_C_SetActive, IsActive) == 0x000000, "Member 'ActivityCategoryTilePanelBase_C_SetActive::IsActive' has a wrong offset!");

}

