#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityHabaneroButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ActivityHabaneroButton.ActivityHabaneroButton_C.ExecuteUbergraph_ActivityHabaneroButton
// 0x0078 (0x0078 - 0x0000)
struct ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0059(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton) == 0x000008, "Wrong alignment on ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton");
static_assert(sizeof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton) == 0x000078, "Wrong size on ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, EntryPoint) == 0x000000, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, Temp_bool_Variable) == 0x000004, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, Temp_byte_Variable) == 0x000005, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, Temp_byte_Variable_1) == 0x000006, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000020, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000028, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000030, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000038, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000040, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_IsUsingGamepad_ReturnValue) == 0x000048, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000050, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, K2Node_Event_IsDesignTime) == 0x000058, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, K2Node_Event_bIsSelected) == 0x000059, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, K2Node_Select_Default) == 0x00005A, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'ActivityHabaneroButton_C_ExecuteUbergraph_ActivityHabaneroButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ActivityHabaneroButton.ActivityHabaneroButton_C.OnDesiredHabaneroSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged) == 0x000001, "Wrong alignment on ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged");
static_assert(sizeof(ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged) == 0x000001, "Wrong size on ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged");
static_assert(offsetof(ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged, bIsSelected) == 0x000000, "Member 'ActivityHabaneroButton_C_OnDesiredHabaneroSelectionChanged::bIsSelected' has a wrong offset!");

// Function ActivityHabaneroButton.ActivityHabaneroButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityHabaneroButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityHabaneroButton_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityHabaneroButton_C_PreConstruct");
static_assert(sizeof(ActivityHabaneroButton_C_PreConstruct) == 0x000001, "Wrong size on ActivityHabaneroButton_C_PreConstruct");
static_assert(offsetof(ActivityHabaneroButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityHabaneroButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityHabaneroButton.ActivityHabaneroButton_C.Toggle Disabled Dimmer
// 0x0010 (0x0010 - 0x0000)
struct ActivityHabaneroButton_C_Toggle_Disabled_Dimmer final
{
public:
	bool                                          Is_Disabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer) == 0x000008, "Wrong alignment on ActivityHabaneroButton_C_Toggle_Disabled_Dimmer");
static_assert(sizeof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer) == 0x000010, "Wrong size on ActivityHabaneroButton_C_Toggle_Disabled_Dimmer");
static_assert(offsetof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer, Is_Disabled) == 0x000000, "Member 'ActivityHabaneroButton_C_Toggle_Disabled_Dimmer::Is_Disabled' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer, Temp_bool_Variable) == 0x000001, "Member 'ActivityHabaneroButton_C_Toggle_Disabled_Dimmer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer, Temp_byte_Variable) == 0x000002, "Member 'ActivityHabaneroButton_C_Toggle_Disabled_Dimmer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer, Temp_byte_Variable_1) == 0x000003, "Member 'ActivityHabaneroButton_C_Toggle_Disabled_Dimmer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer, K2Node_Select_Default) == 0x000004, "Member 'ActivityHabaneroButton_C_Toggle_Disabled_Dimmer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityHabaneroButton_C_Toggle_Disabled_Dimmer, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ActivityHabaneroButton_C_Toggle_Disabled_Dimmer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

