#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserStatusFavoriteButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserStatusFavoriteButton.ActivityBrowserStatusFavoriteButton_C
// 0x0050 (0x14E0 - 0x1490)
class UActivityBrowserStatusFavoriteButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnUnfavorited;                                     // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFavorited;                                       // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPCHoverUnHover;                                  // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FavoriteIcon;                                // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pulse;                                       // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ScalingSB;                                         // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TagName;                                      // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Favorite;                                       // 0x14D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D1[0x3];                                     // 0x14D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bIsInactiveParam;                                  // 0x14D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   bOnHoverSharpenParam;                              // 0x14D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   bOnHoverScaleParam;                                // 0x14DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ActivityBrowserStatusFavoriteButton(int32 EntryPoint);
	void OnIsFavoriteChanged(bool bIsFavorite);
	void PreConstruct(bool IsDesignTime);
	void SetFavoriteNoAnim(bool IsFavorite);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserStatusFavoriteButton_C">();
	}
	static class UActivityBrowserStatusFavoriteButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserStatusFavoriteButton_C>();
	}
};
static_assert(alignof(UActivityBrowserStatusFavoriteButton_C) == 0x000010, "Wrong alignment on UActivityBrowserStatusFavoriteButton_C");
static_assert(sizeof(UActivityBrowserStatusFavoriteButton_C) == 0x0014E0, "Wrong size on UActivityBrowserStatusFavoriteButton_C");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, UberGraphFrame) == 0x001490, "Member 'UActivityBrowserStatusFavoriteButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, OnUnfavorited) == 0x001498, "Member 'UActivityBrowserStatusFavoriteButton_C::OnUnfavorited' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, OnFavorited) == 0x0014A0, "Member 'UActivityBrowserStatusFavoriteButton_C::OnFavorited' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, OnPCHoverUnHover) == 0x0014A8, "Member 'UActivityBrowserStatusFavoriteButton_C::OnPCHoverUnHover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, Image_FavoriteIcon) == 0x0014B0, "Member 'UActivityBrowserStatusFavoriteButton_C::Image_FavoriteIcon' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, Image_Pulse) == 0x0014B8, "Member 'UActivityBrowserStatusFavoriteButton_C::Image_Pulse' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, ScalingSB) == 0x0014C0, "Member 'UActivityBrowserStatusFavoriteButton_C::ScalingSB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, Text_TagName) == 0x0014C8, "Member 'UActivityBrowserStatusFavoriteButton_C::Text_TagName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, Is_Favorite) == 0x0014D0, "Member 'UActivityBrowserStatusFavoriteButton_C::Is_Favorite' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, bIsInactiveParam) == 0x0014D4, "Member 'UActivityBrowserStatusFavoriteButton_C::bIsInactiveParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, bOnHoverSharpenParam) == 0x0014D8, "Member 'UActivityBrowserStatusFavoriteButton_C::bOnHoverSharpenParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusFavoriteButton_C, bOnHoverScaleParam) == 0x0014DC, "Member 'UActivityBrowserStatusFavoriteButton_C::bOnHoverScaleParam' has a wrong offset!");

}

