#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityCategoryTilePanelBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityCategoryTilePanelBase.ActivityCategoryTilePanelBase_C
// 0x0030 (0x0388 - 0x0358)
class UActivityCategoryTilePanelBase_C final : public UFortActivityCategoryTilePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnMoveUpOutOfView;                                 // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActiveInactivate;                                  // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        EntryHeight;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EntryWidth;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void EnableMouseWheelInput(bool bListenForInput);
	void ExecuteUbergraph_ActivityCategoryTilePanelBase(int32 EntryPoint);
	void MoveDownIntoView();
	void MoveUpOutOfView();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetActive(bool IsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityCategoryTilePanelBase_C">();
	}
	static class UActivityCategoryTilePanelBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCategoryTilePanelBase_C>();
	}
};
static_assert(alignof(UActivityCategoryTilePanelBase_C) == 0x000008, "Wrong alignment on UActivityCategoryTilePanelBase_C");
static_assert(sizeof(UActivityCategoryTilePanelBase_C) == 0x000388, "Wrong size on UActivityCategoryTilePanelBase_C");
static_assert(offsetof(UActivityCategoryTilePanelBase_C, UberGraphFrame) == 0x000358, "Member 'UActivityCategoryTilePanelBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_C, OnMoveUpOutOfView) == 0x000360, "Member 'UActivityCategoryTilePanelBase_C::OnMoveUpOutOfView' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_C, ActiveInactivate) == 0x000368, "Member 'UActivityCategoryTilePanelBase_C::ActiveInactivate' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_C, VerticalBox_Content) == 0x000370, "Member 'UActivityCategoryTilePanelBase_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_C, EntryHeight) == 0x000378, "Member 'UActivityCategoryTilePanelBase_C::EntryHeight' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_C, EntryWidth) == 0x000380, "Member 'UActivityCategoryTilePanelBase_C::EntryWidth' has a wrong offset!");

}

