#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserDiscoverItemRow_Homebar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserDiscoverItemRow_Homebar.ActivityBrowserDiscoverItemRow_Homebar_C
// 0x00A0 (0x0498 - 0x03F8)
class UActivityBrowserDiscoverItemRow_Homebar_C final : public UFortDiscoverItemBrowserRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLoadingMore;                                     // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPeek;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveDownIntoView;                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveUpOutOfViewAnim;                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          InactiveDarken;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveOverlayDim;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UActivityBrowserArrowButton_C*>  ArrowButtons;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   FontHoverAnimateParam;                             // 0x0458(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontPressedAnimateParam;                           // 0x045C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LoadingMoreDisplayDelay;                           // 0x0468(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreVisible;                              // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreQueryActive;                          // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LoadingMoreDelayTimer;                             // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRowBroadcastClickToDiscover;                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        EntriesSpacing;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__ActivityBrowserDiscoverItemRow_Homebar_ListView_Tiles_K2Node_ComponentBoundEvent_1_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ActivityBrowserDiscoverItemRow_Homebar(int32 EntryPoint);
	void Finished_05D2D3C94079FFB769F02F9935EAEEF7();
	void FinishedLoadingMoreDelay();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnQueryStatusChanged_1(bool bIsActive);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowMoveDown(const bool bMovingOffscreen);
	void OnRowMoveUp(const bool bMovingOffscreen);
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void OnRowReceivedTileClick();
	void ResetOnPeekAnimation();
	void ResetOnRowActiveInactiveAnimation(bool IsRowActive);
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void Update_Padding_for_List_View_Entries();
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserDiscoverItemRow_Homebar_C">();
	}
	static class UActivityBrowserDiscoverItemRow_Homebar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserDiscoverItemRow_Homebar_C>();
	}
};
static_assert(alignof(UActivityBrowserDiscoverItemRow_Homebar_C) == 0x000008, "Wrong alignment on UActivityBrowserDiscoverItemRow_Homebar_C");
static_assert(sizeof(UActivityBrowserDiscoverItemRow_Homebar_C) == 0x000498, "Wrong size on UActivityBrowserDiscoverItemRow_Homebar_C");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, UberGraphFrame) == 0x0003F8, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, OnLoadingMore) == 0x000400, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::OnLoadingMore' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, OnPeek) == 0x000408, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::OnPeek' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, OnRowMoveDownIntoView) == 0x000410, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::OnRowMoveDownIntoView' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, OnRowMoveUpOutOfViewAnim) == 0x000418, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::OnRowMoveUpOutOfViewAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, OnRowActiveInactiveAnim) == 0x000420, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::OnRowActiveInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, InactiveDarken) == 0x000428, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::InactiveDarken' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, InactiveOverlayDim) == 0x000430, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::InactiveOverlayDim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, VBContent) == 0x000438, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::VBContent' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, WBP_LoadingMorePages) == 0x000440, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::WBP_LoadingMorePages' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, ArrowButtons) == 0x000448, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::ArrowButtons' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, FontHoverAnimateParam) == 0x000458, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::FontHoverAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, FontPressedAnimateParam) == 0x00045C, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::FontPressedAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, IsWaitingForInactiveAnim) == 0x000460, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::IsWaitingForInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, LoadingMoreDisplayDelay) == 0x000468, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::LoadingMoreDisplayDelay' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, IsLoadingMoreVisible) == 0x000470, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::IsLoadingMoreVisible' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, IsLoadingMoreQueryActive) == 0x000471, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::IsLoadingMoreQueryActive' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, LoadingMoreDelayTimer) == 0x000478, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::LoadingMoreDelayTimer' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, OnRowBroadcastClickToDiscover) == 0x000480, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::OnRowBroadcastClickToDiscover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_Homebar_C, EntriesSpacing) == 0x000490, "Member 'UActivityBrowserDiscoverItemRow_Homebar_C::EntriesSpacing' has a wrong offset!");

}

