#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserStatusFavorite

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserStatusFavorite.ActivityBrowserStatusFavorite_C.ExecuteUbergraph_ActivityBrowserStatusFavorite
// 0x0040 (0x0040 - 0x0000)
struct ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFavorited;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_3;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite) == 0x000008, "Wrong alignment on ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite");
static_assert(sizeof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite) == 0x000040, "Wrong size on ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, EntryPoint) == 0x000000, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000004, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, K2Node_CustomEvent_IsFavorited) == 0x000018, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::K2Node_CustomEvent_IsFavorited' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_GetEndTime_ReturnValue) == 0x00001C, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_GetEndTime_ReturnValue_1) == 0x000028, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000038, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x000039, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite, CallFunc_IsAnimationPlaying_ReturnValue_3) == 0x00003A, "Member 'ActivityBrowserStatusFavorite_C_ExecuteUbergraph_ActivityBrowserStatusFavorite::CallFunc_IsAnimationPlaying_ReturnValue_3' has a wrong offset!");

// Function ActivityBrowserStatusFavorite.ActivityBrowserStatusFavorite_C.SetFavoriteNoAnimation
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation final
{
public:
	bool                                          IsFavorited_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation) == 0x000001, "Wrong alignment on ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation");
static_assert(sizeof(ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation) == 0x000001, "Wrong size on ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation");
static_assert(offsetof(ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation, IsFavorited_0) == 0x000000, "Member 'ActivityBrowserStatusFavorite_C_SetFavoriteNoAnimation::IsFavorited_0' has a wrong offset!");

}

