#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserArrowButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.ExecuteUbergraph_ActivityBrowserArrowButton
// 0x0150 (0x0150 - 0x0000)
struct ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_1;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_3;         // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_2;     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_4;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_5;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_3;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0114(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue;  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton) == 0x000008, "Wrong alignment on ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton");
static_assert(sizeof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton) == 0x000150, "Wrong size on ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, EntryPoint) == 0x000000, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable) == 0x000008, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable_1) == 0x000018, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_object_Variable) == 0x000028, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_object_Variable_1) == 0x000030, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_bool_Variable) == 0x000038, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_bool_Variable_1) == 0x000039, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_object_Variable_2) == 0x000040, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Event_IsDesignTime) == 0x000048, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_object_Variable_3) == 0x000060, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Select_Default) == 0x000068, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_bool_Variable_2) == 0x000078, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000079, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_CustomEvent_IsActive_1) == 0x000088, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_CustomEvent_IsActive_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000090, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000098, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_CustomEvent_IsActive) == 0x000099, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation) == 0x0000A8, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_1) == 0x0000B0, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0000C0, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x0000C1, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_IsAnimationPlaying_ReturnValue_3) == 0x0000C2, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_IsAnimationPlaying_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_2) == 0x0000C8, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_IsAnimationPlaying_ReturnValue_4) == 0x0000D0, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_IsAnimationPlaying_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_IsAnimationPlaying_ReturnValue_5) == 0x0000D1, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_IsAnimationPlaying_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_3) == 0x0000D8, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000E0, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable_2) == 0x0000E8, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000F8, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable_3) == 0x000100, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_bool_Variable_3) == 0x000110, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_CreateDelegate_OutputDelegate) == 0x000114, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Select_Default_1) == 0x000120, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000130, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue) == 0x000138, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Select_Default_2) == 0x000140, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Select_Default_3) == 0x000148, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Select_Default_3' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.GetActiveAnimation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserArrowButton_C_GetActiveAnimation final
{
public:
	class UWidgetAnimation*                       ActiveAnimation;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_GetActiveAnimation) == 0x000008, "Wrong alignment on ActivityBrowserArrowButton_C_GetActiveAnimation");
static_assert(sizeof(ActivityBrowserArrowButton_C_GetActiveAnimation) == 0x000018, "Wrong size on ActivityBrowserArrowButton_C_GetActiveAnimation");
static_assert(offsetof(ActivityBrowserArrowButton_C_GetActiveAnimation, ActiveAnimation) == 0x000000, "Member 'ActivityBrowserArrowButton_C_GetActiveAnimation::ActiveAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_GetActiveAnimation, Temp_bool_Variable) == 0x000008, "Member 'ActivityBrowserArrowButton_C_GetActiveAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_GetActiveAnimation, K2Node_Select_Default) == 0x000010, "Member 'ActivityBrowserArrowButton_C_GetActiveAnimation::K2Node_Select_Default' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.HandleInputMethodChanged
// 0x0002 (0x0002 - 0x0000)
struct ActivityBrowserArrowButton_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_HandleInputMethodChanged");
static_assert(sizeof(ActivityBrowserArrowButton_C_HandleInputMethodChanged) == 0x000002, "Wrong size on ActivityBrowserArrowButton_C_HandleInputMethodChanged");
static_assert(offsetof(ActivityBrowserArrowButton_C_HandleInputMethodChanged, bNewInputType) == 0x000000, "Member 'ActivityBrowserArrowButton_C_HandleInputMethodChanged::bNewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_HandleInputMethodChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'ActivityBrowserArrowButton_C_HandleInputMethodChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.OnRowActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserArrowButton_C_OnRowActiveChanged final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_OnRowActiveChanged) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_OnRowActiveChanged");
static_assert(sizeof(ActivityBrowserArrowButton_C_OnRowActiveChanged) == 0x000001, "Wrong size on ActivityBrowserArrowButton_C_OnRowActiveChanged");
static_assert(offsetof(ActivityBrowserArrowButton_C_OnRowActiveChanged, IsActive_0) == 0x000000, "Member 'ActivityBrowserArrowButton_C_OnRowActiveChanged::IsActive_0' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.OnRowReset
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserArrowButton_C_OnRowReset final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_OnRowReset) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_OnRowReset");
static_assert(sizeof(ActivityBrowserArrowButton_C_OnRowReset) == 0x000001, "Wrong size on ActivityBrowserArrowButton_C_OnRowReset");
static_assert(offsetof(ActivityBrowserArrowButton_C_OnRowReset, IsActive_0) == 0x000000, "Member 'ActivityBrowserArrowButton_C_OnRowReset::IsActive_0' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_PreConstruct");
static_assert(sizeof(ActivityBrowserArrowButton_C_PreConstruct) == 0x000001, "Wrong size on ActivityBrowserArrowButton_C_PreConstruct");
static_assert(offsetof(ActivityBrowserArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityBrowserArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.UpdateArrowColor
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserArrowButton_C_UpdateArrowColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_UpdateArrowColor) == 0x000004, "Wrong alignment on ActivityBrowserArrowButton_C_UpdateArrowColor");
static_assert(sizeof(ActivityBrowserArrowButton_C_UpdateArrowColor) == 0x000020, "Wrong size on ActivityBrowserArrowButton_C_UpdateArrowColor");
static_assert(offsetof(ActivityBrowserArrowButton_C_UpdateArrowColor, Color) == 0x000000, "Member 'ActivityBrowserArrowButton_C_UpdateArrowColor::Color' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_UpdateArrowColor, HoverColor) == 0x000010, "Member 'ActivityBrowserArrowButton_C_UpdateArrowColor::HoverColor' has a wrong offset!");

}

