#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityModeSetSelectionModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityModeSetSelectionModal.ActivityModeSetSelectionModal_C
// 0x0078 (0x04F8 - 0x0480)
class UActivityModeSetSelectionModal_C final : public UFortActivityModeSetSelectionModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnImageLoaded;                                     // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ModeSelection;                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayDim;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_BackButton;                               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Thumbnail;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ThumbnailParameter;                                // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ThumbnailOpacityParameter;                         // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CloseDelay;                                        // 0x04D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CloseDelayTimer;                                   // 0x04E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPanelVisible;                                   // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHabaneroMode;                                    // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             WhooshSound;                                       // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ActivityModeSetSelectionModal_ActivityPrivacyButton_K2Node_ComponentBoundEvent_4_OnPrivacyAvailableChanged__DelegateSignature(bool IsAvailable);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CloseModal();
	void ExecuteUbergraph_ActivityModeSetSelectionModal(int32 EntryPoint);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSubModeSelected();
	void SetHabaneroValues(bool bHabaneroEnabled, bool bHabaneroExists);
	void SetIsRankedSwitchAvailable(const bool bIsRankedSwitchAvailable);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityModeSetSelectionModal_C">();
	}
	static class UActivityModeSetSelectionModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityModeSetSelectionModal_C>();
	}
};
static_assert(alignof(UActivityModeSetSelectionModal_C) == 0x000008, "Wrong alignment on UActivityModeSetSelectionModal_C");
static_assert(sizeof(UActivityModeSetSelectionModal_C) == 0x0004F8, "Wrong size on UActivityModeSetSelectionModal_C");
static_assert(offsetof(UActivityModeSetSelectionModal_C, UberGraphFrame) == 0x000480, "Member 'UActivityModeSetSelectionModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, OnImageLoaded) == 0x000488, "Member 'UActivityModeSetSelectionModal_C::OnImageLoaded' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, HorizontalBox_ModeSelection) == 0x000490, "Member 'UActivityModeSetSelectionModal_C::HorizontalBox_ModeSelection' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Image_Background) == 0x000498, "Member 'UActivityModeSetSelectionModal_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Overlay_1) == 0x0004A0, "Member 'UActivityModeSetSelectionModal_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, OverlayDim) == 0x0004A8, "Member 'UActivityModeSetSelectionModal_C::OverlayDim' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SafeZone) == 0x0004B0, "Member 'UActivityModeSetSelectionModal_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SafeZone_BackButton) == 0x0004B8, "Member 'UActivityModeSetSelectionModal_C::SafeZone_BackButton' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SizeBox_Thumbnail) == 0x0004C0, "Member 'UActivityModeSetSelectionModal_C::SizeBox_Thumbnail' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Thumbnail) == 0x0004C8, "Member 'UActivityModeSetSelectionModal_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, ThumbnailParameter) == 0x0004D0, "Member 'UActivityModeSetSelectionModal_C::ThumbnailParameter' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, ThumbnailOpacityParameter) == 0x0004D4, "Member 'UActivityModeSetSelectionModal_C::ThumbnailOpacityParameter' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, CloseDelay) == 0x0004D8, "Member 'UActivityModeSetSelectionModal_C::CloseDelay' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, CloseDelayTimer) == 0x0004E0, "Member 'UActivityModeSetSelectionModal_C::CloseDelayTimer' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, bIsPanelVisible) == 0x0004E8, "Member 'UActivityModeSetSelectionModal_C::bIsPanelVisible' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, IsHabaneroMode) == 0x0004E9, "Member 'UActivityModeSetSelectionModal_C::IsHabaneroMode' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, WhooshSound) == 0x0004F0, "Member 'UActivityModeSetSelectionModal_C::WhooshSound' has a wrong offset!");

}

