#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRow_NEW_VM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.ExecuteUbergraph_ActivityBrowserRow_NEW_VM
// 0x0158 (0x0158 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayAnimation;                       // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActive_1;                          // 0x0038(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInPeekState;                       // 0x0039(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          K2Node_DynamicCast_AsActivity_Browser_Arrow_Button; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserArrowButton_C*          K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_4;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInPeekState_ReturnValue;             // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue;                  // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActive;                            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_2;    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue_1;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreatePlayAnimationProxyObject_StartAtTime_ImplicitCast; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM) == 0x000008, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM) == 0x000158, "Wrong size on ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, EntryPoint) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_byte_Variable) == 0x000010, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_Event_bPlayAnimation) == 0x000020, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_Event_bPlayAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000024, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000028, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_Event_bIsActive_1) == 0x000038, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_Event_bIsActive_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_Event_bIsInPeekState) == 0x000039, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_Event_bIsInPeekState' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_byte_Variable_1) == 0x00003A, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_byte_Variable_2) == 0x000050, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000051, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_DynamicCast_AsActivity_Browser_Arrow_Button) == 0x000058, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_DynamicCast_AsActivity_Browser_Arrow_Button' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1) == 0x000068, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Array_Add_ReturnValue_1) == 0x000074, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_byte_Variable_3) == 0x00007C, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_int_Array_Index_Variable) == 0x000080, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Array_Get_Item) == 0x000088, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A0, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000A8, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_byte_Variable_4) == 0x0000B0, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetIsInPeekState_ReturnValue) == 0x0000B2, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetIsInPeekState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000B8, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0000C0, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C8, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000D0, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetIsActive_ReturnValue) == 0x0000D2, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetIsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_BooleanOR_ReturnValue) == 0x0000D3, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_Event_bIsActive) == 0x0000D4, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_Event_bIsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_CustomEvent_NewInputType) == 0x0000E4, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, K2Node_Select_Default) == 0x0000E5, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000E8, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x0000F0, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetEndTime_ReturnValue) == 0x0000F4, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetAnimationCurrentTime_ReturnValue_2) == 0x0000F8, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetAnimationCurrentTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000100, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_SelectFloat_ReturnValue) == 0x000108, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000110, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000118, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, Temp_int_Loop_Counter_Variable) == 0x000130, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_GetIsActive_ReturnValue_1) == 0x00013C, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_GetIsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_CreatePlayAnimationProxyObject_StartAtTime_ImplicitCast) == 0x000150, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_CreatePlayAnimationProxyObject_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000154, "Member 'ActivityBrowserRow_NEW_VM_C_ExecuteUbergraph_ActivityBrowserRow_NEW_VM::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged) == 0x000001, "Wrong size on ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged, NewInputType) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_HandleInputMethodChanged::NewInputType' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.OnCategoryItemChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged) == 0x000001, "Wrong size on ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged, bPlayAnimation) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_OnCategoryItemChanged::bPlayAnimation' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.OnQueryStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged) == 0x000001, "Wrong size on ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_OnQueryStatusChanged::bIsActive' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.OnRowIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged) == 0x000001, "Wrong size on ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_OnRowIsActiveChanged::bIsActive' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.OnRowPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged) == 0x000001, "Wrong size on ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged, bIsInPeekState) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_OnRowPeekStateChanged::bIsInPeekState' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.ResetOnPeekAnimation
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation) == 0x000008, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation) == 0x000008, "Wrong size on ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnPeekAnimation::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.ResetOnRowActiveInactiveAnimation
// 0x0048 (0x0048 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation final
{
public:
	bool                                          IsRowActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation) == 0x000008, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation) == 0x000048, "Wrong size on ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, IsRowActive) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::IsRowActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, Temp_struct_Variable) == 0x000004, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, Temp_struct_Variable_1) == 0x000014, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, Temp_bool_Variable) == 0x000024, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, K2Node_Select_Default) == 0x000028, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000038, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000040, "Member 'ActivityBrowserRow_NEW_VM_C_ResetOnRowActiveInactiveAnimation::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.Set Font Category Size
// 0x00B8 (0x00B8 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMobileFontSizeMultiplier_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0040(0x0058)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size) == 0x000008, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size) == 0x0000B8, "Wrong size on ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, Temp_bool_Variable) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_GetMobileFontSizeMultiplier_ReturnValue) == 0x000004, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_GetMobileFontSizeMultiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_IsMobileGame_ReturnValue) == 0x000008, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00000C, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, K2Node_Select_Default) == 0x000018, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000020, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Conv_StringToInt_ReturnValue) == 0x000030, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, K2Node_MakeStruct_SlateFontInfo) == 0x000040, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, K2Node_Select_Option_1_ImplicitCast) == 0x0000A0, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0000A8, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size, K2Node_MakeStruct_Size_ImplicitCast) == 0x0000B0, "Member 'ActivityBrowserRow_NEW_VM_C_Set_Font_Category_Size::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.SnapToEndOfAnimation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation) == 0x000008, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation) == 0x000018, "Wrong size on ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation, InAnimation) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation, PlayMode) == 0x000008, "Member 'ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ActivityBrowserRow_NEW_VM_C_SnapToEndOfAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityBrowserRow_NEW_VM.ActivityBrowserRow_NEW_VM_C.UpdateNewRow
// 0x0040 (0x0040 - 0x0000)
struct ActivityBrowserRow_NEW_VM_C_UpdateNewRow final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayAnimation_0;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInPeekState_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_NEW_VM_C_UpdateNewRow) == 0x000008, "Wrong alignment on ActivityBrowserRow_NEW_VM_C_UpdateNewRow");
static_assert(sizeof(ActivityBrowserRow_NEW_VM_C_UpdateNewRow) == 0x000040, "Wrong size on ActivityBrowserRow_NEW_VM_C_UpdateNewRow");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_UpdateNewRow, IsActive) == 0x000000, "Member 'ActivityBrowserRow_NEW_VM_C_UpdateNewRow::IsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_UpdateNewRow, PlayAnimation_0) == 0x000001, "Member 'ActivityBrowserRow_NEW_VM_C_UpdateNewRow::PlayAnimation_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_NEW_VM_C_UpdateNewRow, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ActivityBrowserRow_NEW_VM_C_UpdateNewRow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
