#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTileDetailsDisplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.ColumnSizeToTileSize
// 0x0070 (0x0070 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize final
{
public:
	int32                                         NewColumnSize;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              NewTileSize;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize) == 0x000008, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize) == 0x000070, "Wrong size on ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, NewColumnSize) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::NewColumnSize' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, NewTileSize) == 0x000008, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::NewTileSize' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_FCeil_ReturnValue) == 0x000050, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000058, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'ActivityBrowserTileDetailsDisplay_C_ColumnSizeToTileSize::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.ExecuteUbergraph_ActivityBrowserTileDetailsDisplay
// 0x01F0 (0x01F0 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFavorite;                          // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoading_1;                         // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         K2Node_Event_Texture_1;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Discovery_DetailsButton_C*         K2Node_DynamicCast_AsWBP_Discovery_Details_Button; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Discovery_DetailsButton_C*         K2Node_DynamicCast_AsWBP_Discovery_Details_Button_1; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Discovery_DetailsButton_C*         K2Node_DynamicCast_AsWBP_Discovery_Details_Button_2; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTileActive;                        // 0x008A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PartySize;                            // 0x008C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesActivityRequirePurchase_ReturnValue;  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRequiresPurchase;                    // 0x00C2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesActivityRequirePurchase_ReturnValue_1; // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModeSetActivity_ReturnValue;            // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivityFavorited_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivityFavorited_ReturnValue_1;        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewColumnSize;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ColumnSizeToTileSize_NewTileSize;         // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoading;                           // 0x0162(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         K2Node_Event_Texture;                              // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      K2Node_DynamicCast_AsTexture_2DDynamic;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlayTileVideo_bOutResult;           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_CCUCount;                             // 0x0194(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumPlaying;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivityLocked_ReturnValue;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivityLocked_ReturnValue_1;           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActivityCreatorDisplayText_ReturnValue; // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActivityCreatorDisplayText_ReturnValue_1; // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortGameActivity*                      K2Node_Event_GameActivity;                         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay) == 0x000008, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay) == 0x0001F0, "Wrong size on ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, EntryPoint) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bIsFavorite) == 0x000004, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bIsFavorite' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bIsLoading_1) == 0x000005, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bIsLoading_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_Texture_1) == 0x000008, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_Texture_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_ListItemObject) == 0x000040, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bIsSelected) == 0x000048, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bIsExpanded) == 0x000049, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_AsWBP_Discovery_Details_Button) == 0x000060, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_AsWBP_Discovery_Details_Button' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000069, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_AsWBP_Discovery_Details_Button_1) == 0x000070, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_AsWBP_Discovery_Details_Button_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_AsWBP_Discovery_Details_Button_2) == 0x000080, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_AsWBP_Discovery_Details_Button_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsMobileGame_ReturnValue) == 0x000089, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bIsTileActive) == 0x00008A, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bIsTileActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_PartySize) == 0x00008C, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_PartySize' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_byte_Variable) == 0x000090, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000098, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000A0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0000A8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x0000AC, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_IsDesignTime) == 0x0000C0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_DoesActivityRequirePurchase_ReturnValue) == 0x0000C1, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_DoesActivityRequirePurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bRequiresPurchase) == 0x0000C2, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bRequiresPurchase' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_byte_Variable_1) == 0x0000C3, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_byte_Variable_2) == 0x0000C4, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_DoesActivityRequirePurchase_ReturnValue_1) == 0x0000C5, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_DoesActivityRequirePurchase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsModeSetActivity_ReturnValue) == 0x0000C6, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsModeSetActivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x0000C7, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000D0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x0000D8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000E0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x0000E8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsActivityFavorited_ReturnValue) == 0x0000F0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsActivityFavorited_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsActivityFavorited_ReturnValue_1) == 0x0000F1, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsActivityFavorited_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsConsolePlatform_ReturnValue) == 0x0000F2, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_bool_Variable) == 0x0000F3, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000F8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_MakeStruct_Margin) == 0x000100, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000110, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_NewColumnSize) == 0x000118, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_NewColumnSize' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_ColumnSizeToTileSize_NewTileSize) == 0x000120, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_ColumnSizeToTileSize_NewTileSize' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_MakeStruct_Margin_1) == 0x000130, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_MakeStruct_Margin_2) == 0x000140, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_MakeStruct_Margin_3) == 0x000150, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_byte_Variable_3) == 0x000160, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_byte_Variable_4) == 0x000161, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_bIsLoading) == 0x000162, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_bIsLoading' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_Texture) == 0x000168, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_bool_Variable_1) == 0x000170, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_AsTexture_2DDynamic) == 0x000178, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_AsTexture_2DDynamic' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_bSuccess_3) == 0x000180, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_AsTexture_2D) == 0x000188, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_DynamicCast_bSuccess_4) == 0x000190, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_Not_PreBool_ReturnValue_1) == 0x000191, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_ShouldPlayTileVideo_bOutResult) == 0x000192, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_ShouldPlayTileVideo_bOutResult' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_CCUCount) == 0x000194, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_CCUCount' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x000198, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_SlotAsOverlaySlot_ReturnValue_3) == 0x0001A0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_SlotAsOverlaySlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_bool_Variable_2) == 0x0001A8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, Temp_byte_Variable_5) == 0x0001A9, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Select_Default) == 0x0001AA, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Select_Default_1) == 0x0001AB, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_NumPlaying) == 0x0001AC, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_NumPlaying' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsActivityLocked_ReturnValue) == 0x0001B0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsActivityLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_BooleanOR_ReturnValue) == 0x0001B1, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_IsActivityLocked_ReturnValue_1) == 0x0001B2, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_IsActivityLocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_GetActivityCreatorDisplayText_ReturnValue) == 0x0001B8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_GetActivityCreatorDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Select_Default_2) == 0x0001C8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_GetActivityCreatorDisplayText_ReturnValue_1) == 0x0001D0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_GetActivityCreatorDisplayText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, K2Node_Event_GameActivity) == 0x0001E0, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::K2Node_Event_GameActivity' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0001E8, "Member 'ActivityBrowserTileDetailsDisplay_C_ExecuteUbergraph_ActivityBrowserTileDetailsDisplay::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.Grow Tile on Select for Non Hero Rows
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows) == 0x000008, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows) == 0x000010, "Wrong size on ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows, Temp_bool_Variable) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows, Temp_byte_Variable) == 0x000001, "Member 'ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows, Temp_byte_Variable_1) == 0x000002, "Member 'ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows, K2Node_Select_Default) == 0x000004, "Member 'ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ActivityBrowserTileDetailsDisplay_C_Grow_Tile_on_Select_for_Non_Hero_Rows::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.OnFriendsPlayingChanged
// 0x0004 (0x0004 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged final
{
public:
	int32                                         NumPlaying;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged) == 0x000004, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged) == 0x000004, "Wrong size on ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged, NumPlaying) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_OnFriendsPlayingChanged::NumPlaying' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.OnIsFavoriteChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged final
{
public:
	bool                                          bIsFavorite;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged) == 0x000001, "Wrong alignment on ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged");
static_assert(sizeof(ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged) == 0x000001, "Wrong size on ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged");
static_assert(offsetof(ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged, bIsFavorite) == 0x000000, "Member 'ActivityBrowserTileDetailsDisplay_C_OnIsFavoriteChanged::bIsFavorite' has a wrong offset!");

// Function ActivityBrowserTileDetailsDisplay.ActivityBrowserTileDetailsDisplay_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserTileDetailsDisplay_C_OnListItemObjectSet final
{
public:
