#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityPrivacyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityPrivacyButton.ActivityPrivacyButton_C
// 0x00F0 (0x15A0 - 0x14B0)
class UActivityPrivacyButton_C final : public UFortActivityPrivacyButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x14B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x14C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dimmer;                                      // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextToggle_C*                          TextToggle;                                        // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x14F8(0x0018)(Edit, BlueprintVisible)
	double                                        TextShearX;                                        // 0x1510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextShearY;                                        // 0x1518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TextPadding;                                       // 0x1520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDisabled;                                        // 0x1530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1531[0x7];                                     // 0x1531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ButtonMaterial;                                    // 0x1538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonSharpnessX;                                  // 0x1540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonSharpnessY;                                  // 0x1548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UseBoxScalingX;                                    // 0x1550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UseBoxScalingY;                                    // 0x1558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonBoxScaleSizeX;                               // 0x1560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonBoxScaleSizeY;                               // 0x1568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DisabledParamName;                                 // 0x1570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SharpnessVParamName;                               // 0x1574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SharpnessUParamName;                               // 0x1578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UseBoxScaleUParamName;                             // 0x157C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UseBoxScaleVParamName;                             // 0x1580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideButtonBackingOnGamepad;                        // 0x1584(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPlayReversed;                                // 0x1585(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1586[0x2];                                     // 0x1586(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsAvailable)> OnPrivacyAvailableChanged;                         // 0x1588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PadLeft;                                           // 0x1598(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PadRight;                                          // 0x1599(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceEnabled;                                     // 0x159A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ActivityPrivacyButton(int32 EntryPoint);
	void Finished_36C2CEC0400119679F9DB4ADF6A040E2();
	void OnDesiredPrivacySelectionChanged(const bool bIsSelected);
	void OnPrivacyAvailabilityChanged(const bool bIsAvailable, const bool bShouldBeVisibile);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityPrivacyButton_C">();
	}
	static class UActivityPrivacyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityPrivacyButton_C>();
	}
};
static_assert(alignof(UActivityPrivacyButton_C) == 0x000010, "Wrong alignment on UActivityPrivacyButton_C");
static_assert(sizeof(UActivityPrivacyButton_C) == 0x0015A0, "Wrong size on UActivityPrivacyButton_C");
static_assert(offsetof(UActivityPrivacyButton_C, UberGraphFrame) == 0x0014B0, "Member 'UActivityPrivacyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, Pressed) == 0x0014B8, "Member 'UActivityPrivacyButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, Hover) == 0x0014C0, "Member 'UActivityPrivacyButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ContentHB) == 0x0014C8, "Member 'UActivityPrivacyButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, Image_BG) == 0x0014D0, "Member 'UActivityPrivacyButton_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, Image_Dimmer) == 0x0014D8, "Member 'UActivityPrivacyButton_C::Image_Dimmer' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, SafeZone) == 0x0014E0, "Member 'UActivityPrivacyButton_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, Text_Title) == 0x0014E8, "Member 'UActivityPrivacyButton_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, TextToggle) == 0x0014F0, "Member 'UActivityPrivacyButton_C::TextToggle' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, Button_Description) == 0x0014F8, "Member 'UActivityPrivacyButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, TextShearX) == 0x001510, "Member 'UActivityPrivacyButton_C::TextShearX' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, TextShearY) == 0x001518, "Member 'UActivityPrivacyButton_C::TextShearY' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, TextPadding) == 0x001520, "Member 'UActivityPrivacyButton_C::TextPadding' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, IsDisabled) == 0x001530, "Member 'UActivityPrivacyButton_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ButtonMaterial) == 0x001538, "Member 'UActivityPrivacyButton_C::ButtonMaterial' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ButtonSharpnessX) == 0x001540, "Member 'UActivityPrivacyButton_C::ButtonSharpnessX' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ButtonSharpnessY) == 0x001548, "Member 'UActivityPrivacyButton_C::ButtonSharpnessY' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, UseBoxScalingX) == 0x001550, "Member 'UActivityPrivacyButton_C::UseBoxScalingX' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, UseBoxScalingY) == 0x001558, "Member 'UActivityPrivacyButton_C::UseBoxScalingY' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ButtonBoxScaleSizeX) == 0x001560, "Member 'UActivityPrivacyButton_C::ButtonBoxScaleSizeX' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ButtonBoxScaleSizeY) == 0x001568, "Member 'UActivityPrivacyButton_C::ButtonBoxScaleSizeY' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, DisabledParamName) == 0x001570, "Member 'UActivityPrivacyButton_C::DisabledParamName' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, SharpnessVParamName) == 0x001574, "Member 'UActivityPrivacyButton_C::SharpnessVParamName' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, SharpnessUParamName) == 0x001578, "Member 'UActivityPrivacyButton_C::SharpnessUParamName' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, UseBoxScaleUParamName) == 0x00157C, "Member 'UActivityPrivacyButton_C::UseBoxScaleUParamName' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, UseBoxScaleVParamName) == 0x001580, "Member 'UActivityPrivacyButton_C::UseBoxScaleVParamName' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, HideButtonBackingOnGamepad) == 0x001584, "Member 'UActivityPrivacyButton_C::HideButtonBackingOnGamepad' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, ShouldPlayReversed) == 0x001585, "Member 'UActivityPrivacyButton_C::ShouldPlayReversed' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, OnPrivacyAvailableChanged) == 0x001588, "Member 'UActivityPrivacyButton_C::OnPrivacyAvailableChanged' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, PadLeft) == 0x001598, "Member 'UActivityPrivacyButton_C::PadLeft' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, PadRight) == 0x001599, "Member 'UActivityPrivacyButton_C::PadRight' has a wrong offset!");
static_assert(offsetof(UActivityPrivacyButton_C, bForceEnabled) == 0x00159A, "Member 'UActivityPrivacyButton_C::bForceEnabled' has a wrong offset!");

}

