#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserBrowseView_VM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.Animate to Next Panel
// 0x0028 (0x0028 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel final
{
public:
	int32                                         NextPanelIndex;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized_1; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel) == 0x000028, "Wrong size on ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, NextPanelIndex) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::NextPanelIndex' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized) == 0x000004, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized_1) == 0x00001C, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel, CallFunc_Min_ReturnValue) == 0x000024, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Next_Panel::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.Animate to Previous Panel
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel final
{
public:
	int32                                         PreviousPanelIndex;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel) == 0x000020, "Wrong size on ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel, PreviousPanelIndex) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel::PreviousPanelIndex' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel, CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized) == 0x000014, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel::CallFunc_IsWidgetFullSizedAndOnScreen_IsFullSized' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel, CallFunc_Max_ReturnValue) == 0x000018, "Member 'ActivityBrowserBrowseView_VM_C_Animate_to_Previous_Panel::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.AnimatePanelOpacity
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity final
{
public:
	int32                                         AnimateAwayFromIndex;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimateToIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityCategoryTilePanelBase_C*       CallFunc_GetTilePanelFromIndex_TilePanel;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActivityCategoryTilePanelBase_C*       CallFunc_GetTilePanelFromIndex_TilePanel_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity) == 0x000020, "Wrong size on ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity, AnimateAwayFromIndex) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity::AnimateAwayFromIndex' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity, AnimateToIndex) == 0x000004, "Member 'ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity::AnimateToIndex' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity, CallFunc_GetTilePanelFromIndex_TilePanel) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity::CallFunc_GetTilePanelFromIndex_TilePanel' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity, CallFunc_GetTilePanelFromIndex_TilePanel_1) == 0x000018, "Member 'ActivityBrowserBrowseView_VM_C_AnimatePanelOpacity::CallFunc_GetTilePanelFromIndex_TilePanel_1' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.AnimateToDesiredPanel
// 0x0030 (0x0030 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel final
{
public:
	int32                                         NewDesiredIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewClampedPanel;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel) == 0x000030, "Wrong size on ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, NewDesiredIndex) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::NewDesiredIndex' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, NewClampedPanel) == 0x000004, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::NewClampedPanel' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000011, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_Clamp_ReturnValue) == 0x00001C, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'ActivityBrowserBrowseView_VM_C_AnimateToDesiredPanel::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_BndEvt__ActivityBrowserBrowseView_VM_WBP_BottomBarHack_BackToTop_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.ExecuteUbergraph_ActivityBrowserBrowseView_VM
// 0x0070 (0x0070 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortActivityCategoryTilePanel*   K2Node_Event_SelectedPanel;                        // 0x0030(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActivityCategoryTilePanelBase_C*       K2Node_DynamicCast_AsActivity_Category_Tile_Panel_Base; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM) == 0x000070, "Wrong size on ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, EntryPoint) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, CallFunc_GetEndTime_ReturnValue) == 0x00001C, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_CustomEvent_NewInputType) == 0x000028, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_Event_IsDesignTime) == 0x00002A, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_Event_SelectedPanel) == 0x000030, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_Event_SelectedPanel' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_DynamicCast_AsActivity_Category_Tile_Panel_Base) == 0x000038, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_DynamicCast_AsActivity_Category_Tile_Panel_Base' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'ActivityBrowserBrowseView_VM_C_ExecuteUbergraph_ActivityBrowserBrowseView_VM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.GetIndexOfPanel
// 0x0068 (0x0068 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_GetIndexOfPanel final
{
public:
	const class UWidget*                          Widget;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               K2Node_DynamicCast_AsSize_Box;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_GetIndexOfPanel");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel) == 0x000068, "Wrong size on ActivityBrowserBrowseView_VM_C_GetIndexOfPanel");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, Widget) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::Widget' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, Index_0) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::Index_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, Temp_int_Array_Index_Variable) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_Array_Get_Item) == 0x000038, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, K2Node_DynamicCast_AsSize_Box) == 0x000048, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::K2Node_DynamicCast_AsSize_Box' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_GetChildAt_ReturnValue) == 0x000058, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetIndexOfPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000060, "Member 'ActivityBrowserBrowseView_VM_C_GetIndexOfPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.GetLocalPanelPosition
// 0x0070 (0x0070 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Position;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0018(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition) == 0x000070, "Wrong size on ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, Index_0) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::Index_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, Position) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::Position' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, CallFunc_GetCachedGeometry_ReturnValue) == 0x000018, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, CallFunc_GetLocalTopLeft_ReturnValue) == 0x000050, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::CallFunc_GetLocalTopLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, CallFunc_BreakVector2D_X) == 0x000060, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition, CallFunc_BreakVector2D_Y) == 0x000068, "Member 'ActivityBrowserBrowseView_VM_C_GetLocalPanelPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.IsWidgetFullSizedAndOnScreen
// 0x0100 (0x0100 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullSized;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0034(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x0080(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen) == 0x000100, "Wrong size on ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, Widget) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::Widget' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, IsFullSized) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::IsFullSized' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_GetDesiredSize_ReturnValue) == 0x000010, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BreakVector2D_X) == 0x000020, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_GetCachedGeometry_ReturnValue) == 0x000034, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_GetLocalTopLeft_ReturnValue) == 0x000070, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_GetLocalTopLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_GetCachedGeometry_ReturnValue_1) == 0x000080, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_GetCachedGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000B8, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_GetLocalSize_ReturnValue) == 0x0000C8, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BreakVector2D_X_1) == 0x0000D8, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BreakVector2D_Y_1) == 0x0000E0, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BreakVector2D_X_2) == 0x0000E8, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BreakVector2D_Y_2) == 0x0000F0, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000F9, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen, CallFunc_BooleanAND_ReturnValue) == 0x0000FA, "Member 'ActivityBrowserBrowseView_VM_C_IsWidgetFullSizedAndOnScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.NavAllToFeatured
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_NavAllToFeatured final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_NavAllToFeatured) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_NavAllToFeatured");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_NavAllToFeatured) == 0x000010, "Wrong size on ActivityBrowserBrowseView_VM_C_NavAllToFeatured");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_NavAllToFeatured, Navigation_0) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_NavAllToFeatured::Navigation_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_NavAllToFeatured, ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_NavAllToFeatured::ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.NavFeaturedToAll
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_NavFeaturedToAll final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_NavFeaturedToAll) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_NavFeaturedToAll");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_NavFeaturedToAll) == 0x000010, "Wrong size on ActivityBrowserBrowseView_VM_C_NavFeaturedToAll");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_NavFeaturedToAll, Navigation_0) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_NavFeaturedToAll::Navigation_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_NavFeaturedToAll, ReturnValue) == 0x000008, "Member 'ActivityBrowserBrowseView_VM_C_NavFeaturedToAll::ReturnValue' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.OnCategoryTilePanelSelected_1
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1 final
{
public:
	const class UFortActivityCategoryTilePanel*   SelectedPanel;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1) == 0x000008, "Wrong size on ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1, SelectedPanel) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_OnCategoryTilePanelSelected_1::SelectedPanel' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.OnInputChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_OnInputChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_OnInputChanged) == 0x000001, "Wrong alignment on ActivityBrowserBrowseView_VM_C_OnInputChanged");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_OnInputChanged) == 0x000001, "Wrong size on ActivityBrowserBrowseView_VM_C_OnInputChanged");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnInputChanged, NewInputType) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_OnInputChanged::NewInputType' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.OnMouseWheel
// 0x02F8 (0x02F8 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue_1; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_OnMouseWheel_ReturnValue;                 // 0x0178(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0230(0x00B8)()
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserBrowseView_VM_C_OnMouseWheel) == 0x000008, "Wrong alignment on ActivityBrowserBrowseView_VM_C_OnMouseWheel");
static_assert(sizeof(ActivityBrowserBrowseView_VM_C_OnMouseWheel) == 0x0002F8, "Wrong size on ActivityBrowserBrowseView_VM_C_OnMouseWheel");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, ReturnValue) == 0x0000B0, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000168, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue_1) == 0x00016C, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000170, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000171, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_OnMouseWheel_ReturnValue) == 0x000178, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_OnMouseWheel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000230, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002E8, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ActivityBrowserBrowseView_VM_C_OnMouseWheel, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0002F0, "Member 'ActivityBrowserBrowseView_VM_C_OnMouseWheel::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ActivityBrowserBrowseView_VM.ActivityBrowserBrowseView_VM_C.PostUpdatePanelSize
// 0x0058 (0x0058 - 0x0000)
struct ActivityBrowserBrowseView_VM_C_PostUpdatePanelSize final
{
public:
	double                                        AccumulatedY;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CurrentWidget;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0014(0x0008)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
