#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityVideoCycleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityVideoCycleWidget.ActivityVideoCycleWidget_C
// 0x0048 (0x0390 - 0x0348)
class UActivityVideoCycleWidget_C final : public UFortActivityVideoCycle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInBumper;                                      // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimVideoOpacity;                                  // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_Bumper;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOutroPlaying;                                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      VideoMaterial;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserMovieWidgetV2_C*        CastedActivityBrowserWidget;                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIntroHasPlayed;                                   // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           VideoBumperTimer;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ActivityVideoCycleWidget(int32 EntryPoint);
	void FadeInVideoBumper();
	void FadeOutVideoBumper();
	void Finished_022303174E05E5768341DC8A5E6D655D();
	void Finished_97010535430B0CDA5130E19BA286CFE0();
	void PlayVideoBumper();
	void PlayVideoIntro();
	void PlayVideoOutro();
	void PreConstruct(bool IsDesignTime);
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityVideoCycleWidget_C">();
	}
	static class UActivityVideoCycleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityVideoCycleWidget_C>();
	}
};
static_assert(alignof(UActivityVideoCycleWidget_C) == 0x000008, "Wrong alignment on UActivityVideoCycleWidget_C");
static_assert(sizeof(UActivityVideoCycleWidget_C) == 0x000390, "Wrong size on UActivityVideoCycleWidget_C");
static_assert(offsetof(UActivityVideoCycleWidget_C, UberGraphFrame) == 0x000348, "Member 'UActivityVideoCycleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, FadeInBumper) == 0x000350, "Member 'UActivityVideoCycleWidget_C::FadeInBumper' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, AnimVideoOpacity) == 0x000358, "Member 'UActivityVideoCycleWidget_C::AnimVideoOpacity' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, SqueegeeSlot_Bumper) == 0x000360, "Member 'UActivityVideoCycleWidget_C::SqueegeeSlot_Bumper' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, bOutroPlaying) == 0x000368, "Member 'UActivityVideoCycleWidget_C::bOutroPlaying' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, VideoMaterial) == 0x000370, "Member 'UActivityVideoCycleWidget_C::VideoMaterial' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, CastedActivityBrowserWidget) == 0x000378, "Member 'UActivityVideoCycleWidget_C::CastedActivityBrowserWidget' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, bIntroHasPlayed) == 0x000380, "Member 'UActivityVideoCycleWidget_C::bIntroHasPlayed' has a wrong offset!");
static_assert(offsetof(UActivityVideoCycleWidget_C, VideoBumperTimer) == 0x000388, "Member 'UActivityVideoCycleWidget_C::VideoBumperTimer' has a wrong offset!");

}

