#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserStatusWarning

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserStatusWarning.ActivityBrowserStatusWarning_C.ExecuteUbergraph_ActivityBrowserStatusWarning
// 0x0028 (0x0028 - 0x0000)
struct ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_In_Warning_Text;                // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning) == 0x000008, "Wrong alignment on ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning");
static_assert(sizeof(ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning) == 0x000028, "Wrong size on ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning");
static_assert(offsetof(ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning, EntryPoint) == 0x000000, "Member 'ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning, K2Node_CustomEvent_In_Warning_Text) == 0x000008, "Member 'ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning::K2Node_CustomEvent_In_Warning_Text' has a wrong offset!");
static_assert(offsetof(ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'ActivityBrowserStatusWarning_C_ExecuteUbergraph_ActivityBrowserStatusWarning::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ActivityBrowserStatusWarning.ActivityBrowserStatusWarning_C.Play Start Animation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserStatusWarning_C_Play_Start_Animation final
{
public:
	class FText                                   In_Warning_Text;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(ActivityBrowserStatusWarning_C_Play_Start_Animation) == 0x000008, "Wrong alignment on ActivityBrowserStatusWarning_C_Play_Start_Animation");
static_assert(sizeof(ActivityBrowserStatusWarning_C_Play_Start_Animation) == 0x000018, "Wrong size on ActivityBrowserStatusWarning_C_Play_Start_Animation");
static_assert(offsetof(ActivityBrowserStatusWarning_C_Play_Start_Animation, In_Warning_Text) == 0x000000, "Member 'ActivityBrowserStatusWarning_C_Play_Start_Animation::In_Warning_Text' has a wrong offset!");

}

