#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityCategoryTilePanelBase_VM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityCategoryTilePanelBase_VM.ActivityCategoryTilePanelBase_VM_C
// 0x0050 (0x0338 - 0x02E8)
class UActivityCategoryTilePanelBase_VM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnMoveUpOutOfView;                                 // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActiveInactivate;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortActivityTileView*                  TileView_Categories;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        EntryHeight;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EntryWidth;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPanelItemClicked;                                // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void EnableMouseWheelInput(bool bListenForInput);
	void ExecuteUbergraph_ActivityCategoryTilePanelBase_VM(int32 EntryPoint);
	void MoveDownIntoView();
	void MoveUpOutOfView();
	void OnInitialized();
	void OnItemClicked(class UObject* Item);
	void PreConstruct(bool IsDesignTime);
	void Set_Categories(TArray<class UFortActivityViewModel*>& In_Categories);
	void Set_Panel_Display_Name(const class FText& In_Panel_Name);
	void SetActive(bool IsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityCategoryTilePanelBase_VM_C">();
	}
	static class UActivityCategoryTilePanelBase_VM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCategoryTilePanelBase_VM_C>();
	}
};
static_assert(alignof(UActivityCategoryTilePanelBase_VM_C) == 0x000008, "Wrong alignment on UActivityCategoryTilePanelBase_VM_C");
static_assert(sizeof(UActivityCategoryTilePanelBase_VM_C) == 0x000338, "Wrong size on UActivityCategoryTilePanelBase_VM_C");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, UberGraphFrame) == 0x0002E8, "Member 'UActivityCategoryTilePanelBase_VM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, OnMoveUpOutOfView) == 0x0002F0, "Member 'UActivityCategoryTilePanelBase_VM_C::OnMoveUpOutOfView' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, ActiveInactivate) == 0x0002F8, "Member 'UActivityCategoryTilePanelBase_VM_C::ActiveInactivate' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, Text_Title) == 0x000300, "Member 'UActivityCategoryTilePanelBase_VM_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, TileView_Categories) == 0x000308, "Member 'UActivityCategoryTilePanelBase_VM_C::TileView_Categories' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, VerticalBox_Content) == 0x000310, "Member 'UActivityCategoryTilePanelBase_VM_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, EntryHeight) == 0x000318, "Member 'UActivityCategoryTilePanelBase_VM_C::EntryHeight' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, EntryWidth) == 0x000320, "Member 'UActivityCategoryTilePanelBase_VM_C::EntryWidth' has a wrong offset!");
static_assert(offsetof(UActivityCategoryTilePanelBase_VM_C, OnPanelItemClicked) == 0x000328, "Member 'UActivityCategoryTilePanelBase_VM_C::OnPanelItemClicked' has a wrong offset!");

}

