#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserCreatorPageViewV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserCreatorPageViewV2.ActivityBrowserCreatorPageViewV2_C.BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'ActivityBrowserCreatorPageViewV2_C_BndEvt__ActivityPlayerBrowserCreateView_TileView_PlayerActivities_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function ActivityBrowserCreatorPageViewV2.ActivityBrowserCreatorPageViewV2_C.ExecuteUbergraph_ActivityBrowserCreatorPageViewV2
// 0x0070 (0x0070 - 0x0000)
struct ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActivityPlayerBrowserTile_C*           K2Node_DynamicCast_AsActivity_Player_Browser_Tile; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserTileDetailsDisplay_C*   K2Node_DynamicCast_AsActivity_Browser_Tile_Details_Display; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEntryHeight_NewHeight_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2) == 0x000008, "Wrong alignment on ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2");
static_assert(sizeof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2) == 0x000070, "Wrong size on ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, EntryPoint) == 0x000000, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_GetNumItems_ReturnValue) == 0x000018, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_ComponentBoundEvent_Item) == 0x000020, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_ComponentBoundEvent_Widget) == 0x000028, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_DynamicCast_AsActivity_Player_Browser_Tile) == 0x000030, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_DynamicCast_AsActivity_Player_Browser_Tile' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_DynamicCast_AsActivity_Browser_Tile_Details_Display) == 0x000040, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_DynamicCast_AsActivity_Browser_Tile_Details_Display' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, K2Node_Event_IsDesignTime) == 0x000049, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_BreakVector2D_X) == 0x000050, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_BreakVector2D_Y) == 0x000058, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2, CallFunc_SetEntryHeight_NewHeight_ImplicitCast) == 0x000068, "Member 'ActivityBrowserCreatorPageViewV2_C_ExecuteUbergraph_ActivityBrowserCreatorPageViewV2::CallFunc_SetEntryHeight_NewHeight_ImplicitCast' has a wrong offset!");

// Function ActivityBrowserCreatorPageViewV2.ActivityBrowserCreatorPageViewV2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserCreatorPageViewV2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserCreatorPageViewV2_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityBrowserCreatorPageViewV2_C_PreConstruct");
static_assert(sizeof(ActivityBrowserCreatorPageViewV2_C_PreConstruct) == 0x000001, "Wrong size on ActivityBrowserCreatorPageViewV2_C_PreConstruct");
static_assert(offsetof(ActivityBrowserCreatorPageViewV2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityBrowserCreatorPageViewV2_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

