#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserDiscoverItemRow_NEW_VM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserDiscoverItemRow_NEW_VM.ActivityBrowserDiscoverItemRow_C
// 0x0088 (0x0480 - 0x03F8)
class UActivityBrowserDiscoverItemRow_C final : public UFortDiscoverItemBrowserRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLoadingMore;                                     // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPeek;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveDownIntoView;                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveUpOutOfViewAnim;                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          InactiveDarken;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveOverlayDim;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LoadingMoreTilesHB;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UActivityBrowserArrowButton_C*>  ArrowButtons;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   FontHoverAnimateParam;                             // 0x0458(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontPressedAnimateParam;                           // 0x045C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LoadingMoreDisplayDelay;                           // 0x0468(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreVisible;                              // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreQueryActive;                          // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LoadingMoreDelayTimer;                             // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ActivityBrowserDiscoverItemRow(int32 EntryPoint);
	void Finished_253F0024495A98586C919ABDB8DFE39D();
	void Finished_854414D0424F841AD183C6B047DDF5C2();
	void FinishedLoadingMoreDelay();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnQueryStatusChanged_1(bool bIsActive);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowMoveDown(const bool bMovingOffscreen);
	void OnRowMoveUp(const bool bMovingOffscreen);
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void ResetOnPeekAnimation();
	void ResetOnRowActiveInactiveAnimation(bool IsRowActive);
	void Set_Font_Category_Size();
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserDiscoverItemRow_C">();
	}
	static class UActivityBrowserDiscoverItemRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserDiscoverItemRow_C>();
	}
};
static_assert(alignof(UActivityBrowserDiscoverItemRow_C) == 0x000008, "Wrong alignment on UActivityBrowserDiscoverItemRow_C");
static_assert(sizeof(UActivityBrowserDiscoverItemRow_C) == 0x000480, "Wrong size on UActivityBrowserDiscoverItemRow_C");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, UberGraphFrame) == 0x0003F8, "Member 'UActivityBrowserDiscoverItemRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, OnLoadingMore) == 0x000400, "Member 'UActivityBrowserDiscoverItemRow_C::OnLoadingMore' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, OnPeek) == 0x000408, "Member 'UActivityBrowserDiscoverItemRow_C::OnPeek' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, OnRowMoveDownIntoView) == 0x000410, "Member 'UActivityBrowserDiscoverItemRow_C::OnRowMoveDownIntoView' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, OnRowMoveUpOutOfViewAnim) == 0x000418, "Member 'UActivityBrowserDiscoverItemRow_C::OnRowMoveUpOutOfViewAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, OnRowActiveInactiveAnim) == 0x000420, "Member 'UActivityBrowserDiscoverItemRow_C::OnRowActiveInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, InactiveDarken) == 0x000428, "Member 'UActivityBrowserDiscoverItemRow_C::InactiveDarken' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, InactiveOverlayDim) == 0x000430, "Member 'UActivityBrowserDiscoverItemRow_C::InactiveOverlayDim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, LoadingMoreTilesHB) == 0x000438, "Member 'UActivityBrowserDiscoverItemRow_C::LoadingMoreTilesHB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, VBContent) == 0x000440, "Member 'UActivityBrowserDiscoverItemRow_C::VBContent' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, ArrowButtons) == 0x000448, "Member 'UActivityBrowserDiscoverItemRow_C::ArrowButtons' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, FontHoverAnimateParam) == 0x000458, "Member 'UActivityBrowserDiscoverItemRow_C::FontHoverAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, FontPressedAnimateParam) == 0x00045C, "Member 'UActivityBrowserDiscoverItemRow_C::FontPressedAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, IsWaitingForInactiveAnim) == 0x000460, "Member 'UActivityBrowserDiscoverItemRow_C::IsWaitingForInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, LoadingMoreDisplayDelay) == 0x000468, "Member 'UActivityBrowserDiscoverItemRow_C::LoadingMoreDisplayDelay' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, IsLoadingMoreVisible) == 0x000470, "Member 'UActivityBrowserDiscoverItemRow_C::IsLoadingMoreVisible' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, IsLoadingMoreQueryActive) == 0x000471, "Member 'UActivityBrowserDiscoverItemRow_C::IsLoadingMoreQueryActive' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_C, LoadingMoreDelayTimer) == 0x000478, "Member 'UActivityBrowserDiscoverItemRow_C::LoadingMoreDelayTimer' has a wrong offset!");

// WidgetBlueprintGeneratedClass ActivityBrowserDiscoverItemRow_NEW_VM.ActivityBrowserDiscoverItemRow_NEW_VM_C
// 0x0088 (0x0480 - 0x03F8)
class UActivityBrowserDiscoverItemRow_NEW_VM_C final : public UFortDiscoverItemBrowserRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLoadingMore;                                     // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPeek;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveDownIntoView;                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveUpOutOfViewAnim;                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          InactiveDarken;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InactiveOverlayDim;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UActivityBrowserArrowButton_C*>  ArrowButtons;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   FontHoverAnimateParam;                             // 0x0458(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontPressedAnimateParam;                           // 0x045C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LoadingMoreDisplayDelay;                           // 0x0468(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreVisible;                              // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreQueryActive;                          // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LoadingMoreDelayTimer;                             // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ActivityBrowserDiscoverItemRow_NEW_VM(int32 EntryPoint);
	void Finished_23AB013B46BF1CC5C591239F71E2255D();
	void Finished_FB0709D4467EE7211C9ABDB604DA8A87();
	void FinishedLoadingMoreDelay();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnQueryStatusChanged_1(bool bIsActive);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowMoveDown(const bool bMovingOffscreen);
	void OnRowMoveUp(const bool bMovingOffscreen);
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void ResetOnPeekAnimation();
	void ResetOnRowActiveInactiveAnimation(bool IsRowActive);
	void Set_Font_Category_Size();
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserDiscoverItemRow_NEW_VM_C">();
	}
	static class UActivityBrowserDiscoverItemRow_NEW_VM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserDiscoverItemRow_NEW_VM_C>();
	}
};
static_assert(alignof(UActivityBrowserDiscoverItemRow_NEW_VM_C) == 0x000008, "Wrong alignment on UActivityBrowserDiscoverItemRow_NEW_VM_C");
static_assert(sizeof(UActivityBrowserDiscoverItemRow_NEW_VM_C) == 0x000480, "Wrong size on UActivityBrowserDiscoverItemRow_NEW_VM_C");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, UberGraphFrame) == 0x0003F8, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, OnLoadingMore) == 0x000400, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::OnLoadingMore' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, OnPeek) == 0x000408, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::OnPeek' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, OnRowMoveDownIntoView) == 0x000410, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::OnRowMoveDownIntoView' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, OnRowMoveUpOutOfViewAnim) == 0x000418, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::OnRowMoveUpOutOfViewAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, OnRowActiveInactiveAnim) == 0x000420, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::OnRowActiveInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, InactiveDarken) == 0x000428, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::InactiveDarken' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, InactiveOverlayDim) == 0x000430, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::InactiveOverlayDim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, VBContent) == 0x000438, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::VBContent' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, WBP_LoadingMorePages) == 0x000440, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::WBP_LoadingMorePages' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, ArrowButtons) == 0x000448, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::ArrowButtons' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, FontHoverAnimateParam) == 0x000458, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::FontHoverAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, FontPressedAnimateParam) == 0x00045C, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::FontPressedAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, IsWaitingForInactiveAnim) == 0x000460, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::IsWaitingForInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, LoadingMoreDisplayDelay) == 0x000468, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::LoadingMoreDisplayDelay' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, IsLoadingMoreVisible) == 0x000470, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::IsLoadingMoreVisible' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, IsLoadingMoreQueryActive) == 0x000471, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::IsLoadingMoreQueryActive' has a wrong offset!");
static_assert(offsetof(UActivityBrowserDiscoverItemRow_NEW_VM_C, LoadingMoreDelayTimer) == 0x000478, "Member 'UActivityBrowserDiscoverItemRow_NEW_VM_C::LoadingMoreDelayTimer' has a wrong offset!");

}

