#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIPatrolPath

#include "Basic.hpp"


namespace SDK
{

// Enum AIPatrolPath.EAIPatrolPathVersion
// NumValues: 0x0005
enum class EAIPatrolPathVersion : uint8
{
	InitialVersion                           = 0,
	TemplateFromQuickBarVersion              = 1,
	PatrolPointMovedToUserSettingsVersion    = 2,
	VersionPlusOne                           = 3,
	LatestVersion                            = 2,
};

// Enum AIPatrolPath.SegmentPathStatus
// NumValues: 0x0005
enum class ESegmentPathStatus : uint8
{
	INVALID                                  = 0,
	CALCULATING                              = 1,
	RECALCULATING_PENDING                    = 2,
	PATH_FAILED                              = 3,
	PATH_SUCCESS                             = 4,
};

// ScriptStruct AIPatrolPath.PatrolPathSegmentDetails
// 0x0108 (0x0108 - 0x0000)
struct FPatrolPathSegmentDetails final
{
public:
	uint8                                         Pad_0[0xA8];                                       // 0x0000(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationPath*                        Path;                                              // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIPatrolPathComponent*                 Start;                                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIPatrolPathComponent*                 End;                                               // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x48];                                      // 0x00C0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPatrolPathSegmentDetails) == 0x000008, "Wrong alignment on FPatrolPathSegmentDetails");
static_assert(sizeof(FPatrolPathSegmentDetails) == 0x000108, "Wrong size on FPatrolPathSegmentDetails");
static_assert(offsetof(FPatrolPathSegmentDetails, Path) == 0x0000A8, "Member 'FPatrolPathSegmentDetails::Path' has a wrong offset!");
static_assert(offsetof(FPatrolPathSegmentDetails, Start) == 0x0000B0, "Member 'FPatrolPathSegmentDetails::Start' has a wrong offset!");
static_assert(offsetof(FPatrolPathSegmentDetails, End) == 0x0000B8, "Member 'FPatrolPathSegmentDetails::End' has a wrong offset!");

}

