#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirJellyfishRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class AirJellyfishRuntime.FortAirJellyfishAnimInstance
// 0x0020 (0x0580 - 0x0560)
class UFortAirJellyfishAnimInstance final : public UFortAnimInstance
{
public:
	float                                         RotatorLerpRate;                                   // 0x0558(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityDirectionScalar;                           // 0x055C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RootRotation;                                      // 0x0560(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAirJellyfishAnimInstance">();
	}
	static class UFortAirJellyfishAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAirJellyfishAnimInstance>();
	}
};
static_assert(alignof(UFortAirJellyfishAnimInstance) == 0x000010, "Wrong alignment on UFortAirJellyfishAnimInstance");
static_assert(sizeof(UFortAirJellyfishAnimInstance) == 0x000580, "Wrong size on UFortAirJellyfishAnimInstance");
static_assert(offsetof(UFortAirJellyfishAnimInstance, RotatorLerpRate) == 0x000558, "Member 'UFortAirJellyfishAnimInstance::RotatorLerpRate' has a wrong offset!");
static_assert(offsetof(UFortAirJellyfishAnimInstance, VelocityDirectionScalar) == 0x00055C, "Member 'UFortAirJellyfishAnimInstance::VelocityDirectionScalar' has a wrong offset!");
static_assert(offsetof(UFortAirJellyfishAnimInstance, RootRotation) == 0x000560, "Member 'UFortAirJellyfishAnimInstance::RootRotation' has a wrong offset!");

}

