#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AISpawner

#include "Basic.hpp"


namespace SDK::Params
{

// Function AISpawner.AISpawnerPreviewerComponent.SetActorForPreview
// 0x0008 (0x0008 - 0x0000)
struct AISpawnerPreviewerComponent_SetActorForPreview final
{
public:
	TSubclassOf<class AActor>                     InActorClass;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AISpawnerPreviewerComponent_SetActorForPreview) == 0x000008, "Wrong alignment on AISpawnerPreviewerComponent_SetActorForPreview");
static_assert(sizeof(AISpawnerPreviewerComponent_SetActorForPreview) == 0x000008, "Wrong size on AISpawnerPreviewerComponent_SetActorForPreview");
static_assert(offsetof(AISpawnerPreviewerComponent_SetActorForPreview, InActorClass) == 0x000000, "Member 'AISpawnerPreviewerComponent_SetActorForPreview::InActorClass' has a wrong offset!");

// Function AISpawner.AISpawnerPreviewerComponent.SetCIDForPreview
// 0x0008 (0x0008 - 0x0000)
struct AISpawnerPreviewerComponent_SetCIDForPreview final
{
public:
	class UAthenaCharacterItemDefinition*         InCID;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AISpawnerPreviewerComponent_SetCIDForPreview) == 0x000008, "Wrong alignment on AISpawnerPreviewerComponent_SetCIDForPreview");
static_assert(sizeof(AISpawnerPreviewerComponent_SetCIDForPreview) == 0x000008, "Wrong size on AISpawnerPreviewerComponent_SetCIDForPreview");
static_assert(offsetof(AISpawnerPreviewerComponent_SetCIDForPreview, InCID) == 0x000000, "Member 'AISpawnerPreviewerComponent_SetCIDForPreview::InCID' has a wrong offset!");

}

