#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimationLayeringRuntime

#include "Basic.hpp"

#include "AnimationLayeringRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AnimationLayeringRuntime.BoneMaskDefinitionDataAsset
// 0x0010 (0x0040 - 0x0030)
class UBoneMaskDefinitionDataAsset : public UDataAsset
{
public:
	struct FBoneMaskDefinition                    BoneMaskDefinition;                                // 0x0030(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoneMaskDefinitionDataAsset">();
	}
	static class UBoneMaskDefinitionDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoneMaskDefinitionDataAsset>();
	}
};
static_assert(alignof(UBoneMaskDefinitionDataAsset) == 0x000008, "Wrong alignment on UBoneMaskDefinitionDataAsset");
static_assert(sizeof(UBoneMaskDefinitionDataAsset) == 0x000040, "Wrong size on UBoneMaskDefinitionDataAsset");
static_assert(offsetof(UBoneMaskDefinitionDataAsset, BoneMaskDefinition) == 0x000030, "Member 'UBoneMaskDefinitionDataAsset::BoneMaskDefinition' has a wrong offset!");

// Class AnimationLayeringRuntime.BoneMaskFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBoneMaskFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BP_BoneMask_GetBodyPartWeights(const struct FBoneMask& BoneMask, class FName Name_0, float* LocalSpaceWeight, float* MeshSpaceWeight);
	static void BP_BoneMask_UpdateBodyPartLocalSpaceWeight(struct FBoneMask& BoneMask, class FName Name_0, float LocalSpaceWeight);
	static void BP_BoneMask_UpdateBodyPartMeshSpaceWeight(struct FBoneMask& BoneMask, class FName Name_0, float MeshSpaceWeight);
	static void BP_BoneMask_UpdateBodyPartWeights(struct FBoneMask& BoneMask, class FName Name_0, float LocalSpaceWeight, float MeshSpaceWeight);
	static void BP_BoneMask_UpdateBodyPartWeightsMulti(struct FBoneMask& BoneMask, const TArray<struct FBoneMaskUpdateMultiParam>& Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoneMaskFunctionLibrary">();
	}
	static class UBoneMaskFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoneMaskFunctionLibrary>();
	}
};
static_assert(alignof(UBoneMaskFunctionLibrary) == 0x000008, "Wrong alignment on UBoneMaskFunctionLibrary");
static_assert(sizeof(UBoneMaskFunctionLibrary) == 0x000028, "Wrong size on UBoneMaskFunctionLibrary");

}

