#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayForceFeedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_PlayForceFeedback.AnimNotify_PlayForceFeedback_C.Received_Notify
// 0x0098 (0x0098 - 0x0000)
struct AnimNotify_PlayForceFeedback_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayLocalForceFeedbackAtLocationMulti_InnerRadius_ImplicitCast; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayLocalForceFeedbackAtLocationMulti_OuterRadius_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_PlayForceFeedback_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_PlayForceFeedback_C_Received_Notify");
static_assert(sizeof(AnimNotify_PlayForceFeedback_C_Received_Notify) == 0x000098, "Wrong size on AnimNotify_PlayForceFeedback_C_Received_Notify");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, EventReference) == 0x000010, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, K2Node_DynamicCast_AsFort_Pawn) == 0x000050, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_GetController_ReturnValue) == 0x000078, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000080, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_IsLocalController_ReturnValue) == 0x000089, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x00008A, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_PlayLocalForceFeedbackAtLocationMulti_InnerRadius_ImplicitCast) == 0x00008C, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_PlayLocalForceFeedbackAtLocationMulti_InnerRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayForceFeedback_C_Received_Notify, CallFunc_PlayLocalForceFeedbackAtLocationMulti_OuterRadius_ImplicitCast) == 0x000090, "Member 'AnimNotify_PlayForceFeedback_C_Received_Notify::CallFunc_PlayLocalForceFeedbackAtLocationMulti_OuterRadius_ImplicitCast' has a wrong offset!");

}

