#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimationLayeringRuntime

#include "Basic.hpp"

#include "AnimationLayeringRuntime_structs.hpp"


namespace SDK::Params
{

// Function AnimationLayeringRuntime.BoneMaskFunctionLibrary.BP_BoneMask_GetBodyPartWeights
// 0x0060 (0x0060 - 0x0000)
struct BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights final
{
public:
	struct FBoneMask                              BoneMask;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalSpaceWeight;                                  // 0x0054(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeshSpaceWeight;                                   // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights) == 0x000008, "Wrong alignment on BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights");
static_assert(sizeof(BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights) == 0x000060, "Wrong size on BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights, BoneMask) == 0x000000, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights::BoneMask' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights, Name_0) == 0x000050, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights::Name_0' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights, LocalSpaceWeight) == 0x000054, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights::LocalSpaceWeight' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights, MeshSpaceWeight) == 0x000058, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_GetBodyPartWeights::MeshSpaceWeight' has a wrong offset!");

// Function AnimationLayeringRuntime.BoneMaskFunctionLibrary.BP_BoneMask_UpdateBodyPartLocalSpaceWeight
// 0x0058 (0x0058 - 0x0000)
struct BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight final
{
public:
	struct FBoneMask                              BoneMask;                                          // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalSpaceWeight;                                  // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight) == 0x000008, "Wrong alignment on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight");
static_assert(sizeof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight) == 0x000058, "Wrong size on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight, BoneMask) == 0x000000, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight::BoneMask' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight, Name_0) == 0x000050, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight::Name_0' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight, LocalSpaceWeight) == 0x000054, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartLocalSpaceWeight::LocalSpaceWeight' has a wrong offset!");

// Function AnimationLayeringRuntime.BoneMaskFunctionLibrary.BP_BoneMask_UpdateBodyPartMeshSpaceWeight
// 0x0058 (0x0058 - 0x0000)
struct BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight final
{
public:
	struct FBoneMask                              BoneMask;                                          // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeshSpaceWeight;                                   // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight) == 0x000008, "Wrong alignment on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight");
static_assert(sizeof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight) == 0x000058, "Wrong size on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight, BoneMask) == 0x000000, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight::BoneMask' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight, Name_0) == 0x000050, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight::Name_0' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight, MeshSpaceWeight) == 0x000054, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartMeshSpaceWeight::MeshSpaceWeight' has a wrong offset!");

// Function AnimationLayeringRuntime.BoneMaskFunctionLibrary.BP_BoneMask_UpdateBodyPartWeights
// 0x0060 (0x0060 - 0x0000)
struct BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights final
{
public:
	struct FBoneMask                              BoneMask;                                          // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalSpaceWeight;                                  // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeshSpaceWeight;                                   // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights) == 0x000008, "Wrong alignment on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights");
static_assert(sizeof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights) == 0x000060, "Wrong size on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights, BoneMask) == 0x000000, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights::BoneMask' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights, Name_0) == 0x000050, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights::Name_0' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights, LocalSpaceWeight) == 0x000054, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights::LocalSpaceWeight' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights, MeshSpaceWeight) == 0x000058, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeights::MeshSpaceWeight' has a wrong offset!");

// Function AnimationLayeringRuntime.BoneMaskFunctionLibrary.BP_BoneMask_UpdateBodyPartWeightsMulti
// 0x0060 (0x0060 - 0x0000)
struct BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti final
{
public:
	struct FBoneMask                              BoneMask;                                          // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FBoneMaskUpdateMultiParam>      Params_0;                                          // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti) == 0x000008, "Wrong alignment on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti");
static_assert(sizeof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti) == 0x000060, "Wrong size on BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti, BoneMask) == 0x000000, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti::BoneMask' has a wrong offset!");
static_assert(offsetof(BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti, Params_0) == 0x000050, "Member 'BoneMaskFunctionLibrary_BP_BoneMask_UpdateBodyPartWeightsMulti::Params_0' has a wrong offset!");

}

