#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaExclusiveRewardBannerLeft

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaExclusiveRewardBannerLeft.AthenaExclusiveRewardBannerLeft_C.ExecuteUbergraph_AthenaExclusiveRewardBannerLeft
// 0x0050 (0x0050 - 0x0000)
struct AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue_1;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTexture2D*                       K2Node_Event_RewardIcon;                           // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft) == 0x000008, "Wrong alignment on AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft");
static_assert(sizeof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft) == 0x000050, "Wrong size on AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, EntryPoint) == 0x000000, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000004, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_IsAnimationPlayingForward_ReturnValue_1) == 0x000020, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_IsAnimationPlayingForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, K2Node_Event_RewardIcon) == 0x000030, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::K2Node_Event_RewardIcon' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000048, "Member 'AthenaExclusiveRewardBannerLeft_C_ExecuteUbergraph_AthenaExclusiveRewardBannerLeft::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function AthenaExclusiveRewardBannerLeft.AthenaExclusiveRewardBannerLeft_C.OnInitBannerIcon
// 0x0008 (0x0008 - 0x0000)
struct AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon final
{
public:
	const class UTexture2D*                       RewardIcon;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon) == 0x000008, "Wrong alignment on AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon");
static_assert(sizeof(AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon) == 0x000008, "Wrong size on AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon");
static_assert(offsetof(AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon, RewardIcon) == 0x000000, "Member 'AthenaExclusiveRewardBannerLeft_C_OnInitBannerIcon::RewardIcon' has a wrong offset!");

}

