#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStatsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaStatsTab.AthenaStatsTab_C
// 0x00C8 (0x0800 - 0x0738)
class UAthenaStatsTab_C final : public UAthenaStatsScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0738(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Entrance;                                          // 0x0740(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tabs_Paginate;                                     // 0x0748(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       AccountLevelLabel;                                 // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_0;                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Divider;                                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Divider1;                                          // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Divider2;                                          // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FriendMatchXpBoostPointsLabel;                     // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxNoStats;                                       // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            HiddenSwitcher;                                    // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LastUpdatedTimeBox;                                // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            MainStatWidgetSwitcher;                            // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MatchXpBoostPointsLabel;                           // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton_Disabled;                        // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoStatsText;                                       // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton_Disabled;                       // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerRankEmblem_C*                    PlayerRankEmblem;                                  // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonLabel;                                       // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UpdatingBox;                                       // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxbannerstats;                                   // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxStats;                                         // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__MobileCloseButton2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabID);
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_AthenaStatsTab(int32 EntryPoint);
	class FText GetAccountLevelText();
	void GetFriendMatchXpBoostText(class FText* Result);
	void HandleBack(bool* Passthrough);
	void OnQueryFinished(bool bWasSuccessful, bool bHasStatsToDisplay);
	void OnQueryStarted();
	void SetPlatformButtonText(const class FText& PlatformButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaStatsTab_C">();
	}
	static class UAthenaStatsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStatsTab_C>();
	}
};
static_assert(alignof(UAthenaStatsTab_C) == 0x000008, "Wrong alignment on UAthenaStatsTab_C");
static_assert(sizeof(UAthenaStatsTab_C) == 0x000800, "Wrong size on UAthenaStatsTab_C");
static_assert(offsetof(UAthenaStatsTab_C, UberGraphFrame) == 0x000738, "Member 'UAthenaStatsTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, Entrance) == 0x000740, "Member 'UAthenaStatsTab_C::Entrance' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, Tabs_Paginate) == 0x000748, "Member 'UAthenaStatsTab_C::Tabs_Paginate' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, AccountLevelLabel) == 0x000750, "Member 'UAthenaStatsTab_C::AccountLevelLabel' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, CloseButton) == 0x000758, "Member 'UAthenaStatsTab_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, CloseIcon) == 0x000760, "Member 'UAthenaStatsTab_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, CommonWidgetSwitcher_0) == 0x000768, "Member 'UAthenaStatsTab_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, Divider) == 0x000770, "Member 'UAthenaStatsTab_C::Divider' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, Divider1) == 0x000778, "Member 'UAthenaStatsTab_C::Divider1' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, Divider2) == 0x000780, "Member 'UAthenaStatsTab_C::Divider2' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, FriendMatchXpBoostPointsLabel) == 0x000788, "Member 'UAthenaStatsTab_C::FriendMatchXpBoostPointsLabel' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, HBoxNoStats) == 0x000790, "Member 'UAthenaStatsTab_C::HBoxNoStats' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, HiddenSwitcher) == 0x000798, "Member 'UAthenaStatsTab_C::HiddenSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, LastUpdatedTimeBox) == 0x0007A0, "Member 'UAthenaStatsTab_C::LastUpdatedTimeBox' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, MainStatWidgetSwitcher) == 0x0007A8, "Member 'UAthenaStatsTab_C::MainStatWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, MatchXpBoostPointsLabel) == 0x0007B0, "Member 'UAthenaStatsTab_C::MatchXpBoostPointsLabel' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, MobileCloseButton_Disabled) == 0x0007B8, "Member 'UAthenaStatsTab_C::MobileCloseButton_Disabled' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, NoStatsText) == 0x0007C0, "Member 'UAthenaStatsTab_C::NoStatsText' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, OverlayCloseButton_Disabled) == 0x0007C8, "Member 'UAthenaStatsTab_C::OverlayCloseButton_Disabled' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, PlayerRankEmblem) == 0x0007D0, "Member 'UAthenaStatsTab_C::PlayerRankEmblem' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, ProgressSpinner) == 0x0007D8, "Member 'UAthenaStatsTab_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, SeasonLabel) == 0x0007E0, "Member 'UAthenaStatsTab_C::SeasonLabel' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, UpdatingBox) == 0x0007E8, "Member 'UAthenaStatsTab_C::UpdatingBox' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, VBoxbannerstats) == 0x0007F0, "Member 'UAthenaStatsTab_C::VBoxbannerstats' has a wrong offset!");
static_assert(offsetof(UAthenaStatsTab_C, VBoxStats) == 0x0007F8, "Member 'UAthenaStatsTab_C::VBoxStats' has a wrong offset!");

}

