#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaFrontend

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "S12_CineTransitionData_structs.hpp"


namespace SDK::Params
{

// Function AthenaFrontend.AthenaFrontend_C.BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature");
static_assert(sizeof(AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature");
static_assert(offsetof(AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature, Selected) == 0x000008, "Member 'AthenaFrontend_C_BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature::Selected' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.DisplayDebugFlowText
// 0x0018 (0x0018 - 0x0000)
struct AthenaFrontend_C_DisplayDebugFlowText final
{
public:
	class FText                                   DebugFlowText;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaFrontend_C_DisplayDebugFlowText) == 0x000008, "Wrong alignment on AthenaFrontend_C_DisplayDebugFlowText");
static_assert(sizeof(AthenaFrontend_C_DisplayDebugFlowText) == 0x000018, "Wrong size on AthenaFrontend_C_DisplayDebugFlowText");
static_assert(offsetof(AthenaFrontend_C_DisplayDebugFlowText, DebugFlowText) == 0x000000, "Member 'AthenaFrontend_C_DisplayDebugFlowText::DebugFlowText' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.ExecuteUbergraph_AthenaFrontend
// 0x0140 (0x0140 - 0x0000)
struct AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     CallFunc_GetPTTState_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_3;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     CallFunc_GetPTTState_ReturnValue_1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable_3;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_4;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     CallFunc_GetPTTState_ReturnValue_2;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPTTState NewPushToTalkState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFrontendVisibilityMode                       K2Node_Event_InFrontendVisibilityMode;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           K2Node_Event_MediaPlayer;                          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0094(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default_1;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTopBar_C*                              K2Node_DynamicCast_AsTop_Bar;                      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTopBar_C*                              K2Node_DynamicCast_AsTop_Bar_1;                    // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_DebugFlowText;                        // 0x00F0(0x0018)(ConstParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTopBar_C*                              K2Node_DynamicCast_AsTop_Bar_2;                    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTopBar_C*                              K2Node_DynamicCast_AsTop_Bar_3;                    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaChatWidget_C*                    K2Node_DynamicCast_AsAthena_Chat_Widget;           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend) == 0x000008, "Wrong alignment on AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend");
static_assert(sizeof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend) == 0x000140, "Wrong size on AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, EntryPoint) == 0x000000, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_byte_Variable) == 0x000004, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_byte_Variable_2) == 0x000006, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetContext_ReturnValue_2) == 0x000018, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetPTTState_ReturnValue) == 0x00002C, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetPTTState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetContext_ReturnValue_3) == 0x000030, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetPTTState_ReturnValue_1) == 0x000038, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetPTTState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_ComponentBoundEvent_Selected) == 0x000048, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_byte_Variable_3) == 0x000049, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetContext_ReturnValue_4) == 0x000050, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_class_Variable) == 0x000058, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_GetPTTState_ReturnValue_2) == 0x000060, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_GetPTTState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_Select_Default) == 0x000061, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_class_Variable_1) == 0x000070, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_Event_InFrontendVisibilityMode) == 0x000078, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_Event_InFrontendVisibilityMode' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_SwitchEnum_CmpSuccess) == 0x000079, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_Event_MediaPlayer) == 0x000080, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_Event_MediaPlayer' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_CreateDelegate_OutputDelegate_3) == 0x000094, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A0, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_bool_Variable) == 0x0000B8, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_byte_Variable_4) == 0x0000C0, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_Select_Default_1) == 0x0000C8, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_AsTop_Bar) == 0x0000D0, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_AsTop_Bar' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_AsTop_Bar_1) == 0x0000E0, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_AsTop_Bar_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_byte_Variable_5) == 0x0000E9, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_Event_DebugFlowText) == 0x0000F0, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_Event_DebugFlowText' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, Temp_bool_Variable_1) == 0x000108, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_AsTop_Bar_2) == 0x000110, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_AsTop_Bar_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_Select_Default_2) == 0x000119, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_AsTop_Bar_3) == 0x000120, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_AsTop_Bar_3' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_AsAthena_Chat_Widget) == 0x000130, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_AsAthena_Chat_Widget' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend, K2Node_DynamicCast_bSuccess_4) == 0x000138, "Member 'AthenaFrontend_C_ExecuteUbergraph_AthenaFrontend::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.InitChatVisibilityButton
// 0x0004 (0x0004 - 0x0000)
struct AthenaFrontend_C_InitChatVisibilityButton final
{
public:
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_InitChatVisibilityButton) == 0x000001, "Wrong alignment on AthenaFrontend_C_InitChatVisibilityButton");
static_assert(sizeof(AthenaFrontend_C_InitChatVisibilityButton) == 0x000004, "Wrong size on AthenaFrontend_C_InitChatVisibilityButton");
static_assert(offsetof(AthenaFrontend_C_InitChatVisibilityButton, CallFunc_IsMobileGame_ReturnValue) == 0x000000, "Member 'AthenaFrontend_C_InitChatVisibilityButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_InitChatVisibilityButton, CallFunc_GetSubGame_ReturnValue) == 0x000001, "Member 'AthenaFrontend_C_InitChatVisibilityButton::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_InitChatVisibilityButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'AthenaFrontend_C_InitChatVisibilityButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_InitChatVisibilityButton, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'AthenaFrontend_C_InitChatVisibilityButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.OnSetFrontendVisibilityMode
// 0x0001 (0x0001 - 0x0000)
struct AthenaFrontend_C_OnSetFrontendVisibilityMode final
{
public:
	EFrontendVisibilityMode                       InFrontendVisibilityMode;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_OnSetFrontendVisibilityMode) == 0x000001, "Wrong alignment on AthenaFrontend_C_OnSetFrontendVisibilityMode");
static_assert(sizeof(AthenaFrontend_C_OnSetFrontendVisibilityMode) == 0x000001, "Wrong size on AthenaFrontend_C_OnSetFrontendVisibilityMode");
static_assert(offsetof(AthenaFrontend_C_OnSetFrontendVisibilityMode, InFrontendVisibilityMode) == 0x000000, "Member 'AthenaFrontend_C_OnSetFrontendVisibilityMode::InFrontendVisibilityMode' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.OnTrailerMediaEnded
// 0x0020 (0x0020 - 0x0000)
struct AthenaFrontend_C_OnTrailerMediaEnded final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_OnTrailerMediaEnded) == 0x000008, "Wrong alignment on AthenaFrontend_C_OnTrailerMediaEnded");
static_assert(sizeof(AthenaFrontend_C_OnTrailerMediaEnded) == 0x000020, "Wrong size on AthenaFrontend_C_OnTrailerMediaEnded");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaEnded, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaFrontend_C_OnTrailerMediaEnded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaEnded, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaFrontend_C_OnTrailerMediaEnded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaEnded, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaFrontend_C_OnTrailerMediaEnded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaEnded, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaFrontend_C_OnTrailerMediaEnded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaEnded, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'AthenaFrontend_C_OnTrailerMediaEnded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaEnded, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaFrontend_C_OnTrailerMediaEnded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.OnTrailerMediaOpened
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaFrontend_C_OnTrailerMediaOpened final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS12_CineTransitionData                K2Node_MakeStruct_S12_CineTransitionData;          // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS12_CineTransitionData                K2Node_MakeStruct_S12_CineTransitionData_1;        // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Offset_8_666511AB4581BEDE8FBD39BD6B910118_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Offset_8_666511AB4581BEDE8FBD39BD6B910118_ImplicitCast_1; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_OnTrailerMediaOpened) == 0x000008, "Wrong alignment on AthenaFrontend_C_OnTrailerMediaOpened");
static_assert(sizeof(AthenaFrontend_C_OnTrailerMediaOpened) == 0x0000B8, "Wrong size on AthenaFrontend_C_OnTrailerMediaOpened");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, OpenedUrl) == 0x000000, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::OpenedUrl' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000010, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_GetDuration_ReturnValue) == 0x000018, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_GetTotalSeconds_ReturnValue) == 0x000020, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000028, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, K2Node_MakeStruct_S12_CineTransitionData) == 0x000040, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::K2Node_MakeStruct_S12_CineTransitionData' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, K2Node_MakeStruct_S12_CineTransitionData_1) == 0x000050, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::K2Node_MakeStruct_S12_CineTransitionData_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Array_Add_ReturnValue_1) == 0x000064, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Array_Add_ReturnValue_2) == 0x000080, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, K2Node_MakeStruct_Offset_8_666511AB4581BEDE8FBD39BD6B910118_ImplicitCast) == 0x000098, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::K2Node_MakeStruct_Offset_8_666511AB4581BEDE8FBD39BD6B910118_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0000A0, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0000A8, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerMediaOpened, K2Node_MakeStruct_Offset_8_666511AB4581BEDE8FBD39BD6B910118_ImplicitCast_1) == 0x0000B0, "Member 'AthenaFrontend_C_OnTrailerMediaOpened::K2Node_MakeStruct_Offset_8_666511AB4581BEDE8FBD39BD6B910118_ImplicitCast_1' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.OnTrailerTransitionAudioCheck
// 0x0050 (0x0050 - 0x0000)
struct AthenaFrontend_C_OnTrailerTransitionAudioCheck final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTime_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_OnTrailerTransitionAudioCheck) == 0x000008, "Wrong alignment on AthenaFrontend_C_OnTrailerTransitionAudioCheck");
static_assert(sizeof(AthenaFrontend_C_OnTrailerTransitionAudioCheck) == 0x000050, "Wrong size on AthenaFrontend_C_OnTrailerTransitionAudioCheck");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_GetTime_ReturnValue) == 0x000008, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_GetTotalSeconds_ReturnValue) == 0x000010, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00003C, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_OnTrailerTransitionAudioCheck, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'AthenaFrontend_C_OnTrailerTransitionAudioCheck::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.SetChatButtonVisibility
// 0x0001 (0x0001 - 0x0000)
struct AthenaFrontend_C_SetChatButtonVisibility final
{
public:
	bool                                          ShouldButtonBeVisible;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_SetChatButtonVisibility) == 0x000001, "Wrong alignment on AthenaFrontend_C_SetChatButtonVisibility");
static_assert(sizeof(AthenaFrontend_C_SetChatButtonVisibility) == 0x000001, "Wrong size on AthenaFrontend_C_SetChatButtonVisibility");
static_assert(offsetof(AthenaFrontend_C_SetChatButtonVisibility, ShouldButtonBeVisible) == 0x000000, "Member 'AthenaFrontend_C_SetChatButtonVisibility::ShouldButtonBeVisible' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.SetChatWidgetAlignment
// 0x0058 (0x0058 - 0x0000)
struct AthenaFrontend_C_SetChatWidgetAlignment final
{
public:
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default_1;                           // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaFrontend_C_SetChatWidgetAlignment) == 0x000008, "Wrong alignment on AthenaFrontend_C_SetChatWidgetAlignment");
static_assert(sizeof(AthenaFrontend_C_SetChatWidgetAlignment) == 0x000058, "Wrong size on AthenaFrontend_C_SetChatWidgetAlignment");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, Temp_byte_Variable) == 0x000000, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, Temp_byte_Variable_1) == 0x000001, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, Temp_bool_Variable) == 0x000002, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, Temp_bool_Variable_1) == 0x000003, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, K2Node_MakeStruct_Margin) == 0x000004, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000018, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue) == 0x000030, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000038, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, K2Node_Select_Default) == 0x000040, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetAlignment, K2Node_Select_Default_1) == 0x000044, "Member 'AthenaFrontend_C_SetChatWidgetAlignment::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.SetChatWidgetVisibility
// 0x0020 (0x0020 - 0x0000)
struct AthenaFrontend_C_SetChatWidgetVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_SetChatWidgetVisibility) == 0x000008, "Wrong alignment on AthenaFrontend_C_SetChatWidgetVisibility");
static_assert(sizeof(AthenaFrontend_C_SetChatWidgetVisibility) == 0x000020, "Wrong size on AthenaFrontend_C_SetChatWidgetVisibility");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, Visible) == 0x000000, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::Visible' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_GetVisibility_ReturnValue) == 0x000010, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_GetFeatureState_OutFeatureState) == 0x000011, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_GetFeatureState_OutReason) == 0x000012, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000014, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_GetSelected_ReturnValue) == 0x000015, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000017, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetChatWidgetVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'AthenaFrontend_C_SetChatWidgetVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.SetOverlayTitleBarVisibility
// 0x0001 (0x0001 - 0x0000)
struct AthenaFrontend_C_SetOverlayTitleBarVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_SetOverlayTitleBarVisibility) == 0x000001, "Wrong alignment on AthenaFrontend_C_SetOverlayTitleBarVisibility");
static_assert(sizeof(AthenaFrontend_C_SetOverlayTitleBarVisibility) == 0x000001, "Wrong size on AthenaFrontend_C_SetOverlayTitleBarVisibility");
static_assert(offsetof(AthenaFrontend_C_SetOverlayTitleBarVisibility, Visible) == 0x000000, "Member 'AthenaFrontend_C_SetOverlayTitleBarVisibility::Visible' has a wrong offset!");

// Function AthenaFrontend.AthenaFrontend_C.SetVoiceChannelSpeakerContainerVisibility
// 0x0005 (0x0005 - 0x0000)
struct AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility final
{
public:
	bool                                          ShouldBeVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility) == 0x000001, "Wrong alignment on AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility");
static_assert(sizeof(AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility) == 0x000005, "Wrong size on AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility");
static_assert(offsetof(AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility, ShouldBeVisible) == 0x000000, "Member 'AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility::ShouldBeVisible' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility, Temp_bool_Variable) == 0x000001, "Member 'AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility, Temp_byte_Variable) == 0x000002, "Member 'AthenaFrontend_C_SetVoiceChannelSpeakerContainerVisibility::Temp_byte_Variable' has a wrong offset!");
