#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_ConfirmationWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_ConfirmationWindow.Athena_ConfirmationWindow_C
// 0x0038 (0x04B8 - 0x0480)
class UAthena_ConfirmationWindow_C final : public UAthenaConfirmationWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_66;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_145;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Description;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_ConfirmationWindow(int32 EntryPoint);
	void OnSetButtonText(class UCommonButtonBase* Button, const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_ConfirmationWindow_C">();
	}
	static class UAthena_ConfirmationWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_ConfirmationWindow_C>();
	}
};
static_assert(alignof(UAthena_ConfirmationWindow_C) == 0x000008, "Wrong alignment on UAthena_ConfirmationWindow_C");
static_assert(sizeof(UAthena_ConfirmationWindow_C) == 0x0004B8, "Wrong size on UAthena_ConfirmationWindow_C");
static_assert(offsetof(UAthena_ConfirmationWindow_C, UberGraphFrame) == 0x000480, "Member 'UAthena_ConfirmationWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_ConfirmationWindow_C, Intro) == 0x000488, "Member 'UAthena_ConfirmationWindow_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthena_ConfirmationWindow_C, Image_66) == 0x000490, "Member 'UAthena_ConfirmationWindow_C::Image_66' has a wrong offset!");
static_assert(offsetof(UAthena_ConfirmationWindow_C, Image_Separator_Down) == 0x000498, "Member 'UAthena_ConfirmationWindow_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(UAthena_ConfirmationWindow_C, Image_Separator_Up) == 0x0004A0, "Member 'UAthena_ConfirmationWindow_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(UAthena_ConfirmationWindow_C, SafeZone_145) == 0x0004A8, "Member 'UAthena_ConfirmationWindow_C::SafeZone_145' has a wrong offset!");
static_assert(offsetof(UAthena_ConfirmationWindow_C, ScrollBox_Description) == 0x0004B0, "Member 'UAthena_ConfirmationWindow_C::ScrollBox_Description' has a wrong offset!");

}

