#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaVariantTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaVariantTileButton.AthenaVariantTileButton_C
// 0x0030 (0x15B0 - 0x1580)
class UAthenaVariantTileButton_C final : public UFortVariantTileButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Test;                                              // 0x1588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Outline_C*             Block_Outline;                                     // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool IsConflicting, class FText ConflictReason)> OnConflictStatusUpdated;                           // 0x15A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_AthenaVariantTileButton(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void UpdateConflictStatus(const bool bIsConflicting, const class FText& ConflictReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaVariantTileButton_C">();
	}
	static class UAthenaVariantTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaVariantTileButton_C>();
	}
};
static_assert(alignof(UAthenaVariantTileButton_C) == 0x000010, "Wrong alignment on UAthenaVariantTileButton_C");
static_assert(sizeof(UAthenaVariantTileButton_C) == 0x0015B0, "Wrong size on UAthenaVariantTileButton_C");
static_assert(offsetof(UAthenaVariantTileButton_C, UberGraphFrame) == 0x001580, "Member 'UAthenaVariantTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaVariantTileButton_C, Test) == 0x001588, "Member 'UAthenaVariantTileButton_C::Test' has a wrong offset!");
static_assert(offsetof(UAthenaVariantTileButton_C, Block_Outline) == 0x001590, "Member 'UAthenaVariantTileButton_C::Block_Outline' has a wrong offset!");
static_assert(offsetof(UAthenaVariantTileButton_C, ImageBackground) == 0x001598, "Member 'UAthenaVariantTileButton_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UAthenaVariantTileButton_C, OnConflictStatusUpdated) == 0x0015A0, "Member 'UAthenaVariantTileButton_C::OnConflictStatusUpdated' has a wrong offset!");

}

