#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_ProgressModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_ProgressModal.Athena_ProgressModal_C
// 0x0020 (0x0430 - 0x0410)
class UAthena_ProgressModal_C final : public UAthenaProgressModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Dialog_Base_C*               WBP_UIKit_Dialog_Base;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Throbber_C*                  WBP_UIKit_Throbber;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_Athena_ProgressModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_ProgressModal_C">();
	}
	static class UAthena_ProgressModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_ProgressModal_C>();
	}
};
static_assert(alignof(UAthena_ProgressModal_C) == 0x000008, "Wrong alignment on UAthena_ProgressModal_C");
static_assert(sizeof(UAthena_ProgressModal_C) == 0x000430, "Wrong size on UAthena_ProgressModal_C");
static_assert(offsetof(UAthena_ProgressModal_C, UberGraphFrame) == 0x000410, "Member 'UAthena_ProgressModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_ProgressModal_C, Intro) == 0x000418, "Member 'UAthena_ProgressModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthena_ProgressModal_C, WBP_UIKit_Dialog_Base) == 0x000420, "Member 'UAthena_ProgressModal_C::WBP_UIKit_Dialog_Base' has a wrong offset!");
static_assert(offsetof(UAthena_ProgressModal_C, WBP_UIKit_Throbber) == 0x000428, "Member 'UAthena_ProgressModal_C::WBP_UIKit_Throbber' has a wrong offset!");

}

