#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCreativeSpawnDrop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaCreativeSpawnDrop_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_BlueprintOnInteract");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_BlueprintOnInteract) == 0x000010, "Wrong size on AthenaCreativeSpawnDrop_C_BlueprintOnInteract");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaCreativeSpawnDrop_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x0000E8, "Wrong size on AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.ExecuteUbergraph_AthenaCreativeSpawnDrop
// 0x0508 (0x0508 - 0x0000)
struct AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0078(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0238(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0270(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0368(0x0018)()
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0390(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0398(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x03B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CE[0x2];                                      // 0x03CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x03E8(0x0020)(ConstParm)
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x0408(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop) == 0x000508, "Wrong size on AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, EntryPoint) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_DamagedActor) == 0x000010, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_Damage) == 0x000018, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_InstigatedBy) == 0x000020, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_DamageCauser) == 0x000028, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_HitLocation) == 0x000030, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_FHitComponent) == 0x000048, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_BoneName) == 0x000050, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_Momentum) == 0x000058, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_HasAuthority_ReturnValue) == 0x000070, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_ComponentBoundEvent_ImpactResult) == 0x000078, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_bBlockingHit) == 0x000160, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_bInitialOverlap) == 0x000161, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Location) == 0x000170, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_ImpactPoint) == 0x000188, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Normal) == 0x0001A0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_PhysMat) == 0x0001D0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitActor) == 0x0001D8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitComponent) == 0x0001E0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitBoneName) == 0x0001E8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_BoneName) == 0x0001EC, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitItem) == 0x0001F0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_ElementIndex) == 0x0001F4, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_FaceIndex) == 0x0001F8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_TraceStart) == 0x000200, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_TraceEnd) == 0x000218, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_Damage) == 0x000230, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_DamageTags) == 0x000238, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_Momentum) == 0x000258, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_HitInfo) == 0x000270, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_InstigatedBy) == 0x000358, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_DamageCauser) == 0x000360, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_EffectContext) == 0x000368, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000380, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_DynamicCast_bSuccess) == 0x000388, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_InteractingPawn) == 0x000390, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_Event_InteractionBeingAttempted) == 0x000398, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_GetController_ReturnValue) == 0x0003A0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x0003A8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_DynamicCast_bSuccess_1) == 0x0003B0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_Not_PreBool_ReturnValue) == 0x0003B1, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_MakeArray_Array) == 0x0003B8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_HasAuthority_ReturnValue_1) == 0x0003C8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x0003C9, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x0003CA, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x0003CB, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003CC, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BooleanAND_ReturnValue) == 0x0003CD, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_GetGameState_ReturnValue) == 0x0003D0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0003D8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_DynamicCast_bSuccess_2) == 0x0003E0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_PlaylistName) == 0x0003E4, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, K2Node_CustomEvent_PlaylistContextTags) == 0x0003E8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x000408, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_HasTag_ReturnValue) == 0x000428, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_HasTag_ReturnValue_1) == 0x000429, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000430, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000438, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000439, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Time_1) == 0x00043C, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Distance_1) == 0x000440, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Location_1) == 0x000448, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000460, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_Normal_1) == 0x000478, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000490, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_PhysMat_1) == 0x0004A8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitActor_1) == 0x0004B0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitComponent_1) == 0x0004B8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitBoneName_1) == 0x0004C0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_BoneName_1) == 0x0004C4, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_HitItem_1) == 0x0004C8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_ElementIndex_1) == 0x0004CC, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_FaceIndex_1) == 0x0004D0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_TraceStart_1) == 0x0004D8, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop, CallFunc_BreakHitResult_TraceEnd_1) == 0x0004F0, "Member 'AthenaCreativeSpawnDrop_C_ExecuteUbergraph_AthenaCreativeSpawnDrop::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.OnDeathServer
// 0x0150 (0x0150 - 0x0000)
struct AthenaCreativeSpawnDrop_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0138(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_OnDeathServer) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_OnDeathServer");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_OnDeathServer) == 0x000150, "Wrong size on AthenaCreativeSpawnDrop_C_OnDeathServer");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, Damage) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, DamageTags) == 0x000008, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, Momentum) == 0x000028, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, HitInfo) == 0x000040, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, InstigatedBy) == 0x000128, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, DamageCauser) == 0x000130, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnDeathServer, EffectContext) == 0x000138, "Member 'AthenaCreativeSpawnDrop_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.OnLandingLocationChanged
// 0x0060 (0x0060 - 0x0000)
struct AthenaCreativeSpawnDrop_C_OnLandingLocationChanged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_OnLandingLocationChanged");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged) == 0x000060, "Wrong size on AthenaCreativeSpawnDrop_C_OnLandingLocationChanged");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, DamagedActor) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::DamagedActor' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, Damage) == 0x000008, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::Damage' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, InstigatedBy) == 0x000010, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, DamageCauser) == 0x000018, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, HitLocation) == 0x000020, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::HitLocation' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, FHitComponent) == 0x000038, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::FHitComponent' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, BoneName) == 0x000040, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::BoneName' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnLandingLocationChanged, Momentum) == 0x000048, "Member 'AthenaCreativeSpawnDrop_C_OnLandingLocationChanged::Momentum' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.OnSetCustomDepthStencilValue
// 0x0038 (0x0038 - 0x0000)
struct AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue final
{
public:
	TArray<class UPrimitiveComponent*>            PrimComponents;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bUseCustomDepth;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StencilValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutConsume;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue) == 0x000038, "Wrong size on AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, PrimComponents) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::PrimComponents' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, bUseCustomDepth) == 0x000010, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::bUseCustomDepth' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, StencilValue) == 0x000014, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::StencilValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, bOutConsume) == 0x000018, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::bOutConsume' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, Temp_int_Array_Index_Variable) == 0x000020, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'AthenaCreativeSpawnDrop_C_OnSetCustomDepthStencilValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct AthenaCreativeSpawnDrop_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_PlaylistLoaded) == 0x000008, "Wrong alignment on AthenaCreativeSpawnDrop_C_PlaylistLoaded");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_PlaylistLoaded) == 0x000028, "Wrong size on AthenaCreativeSpawnDrop_C_PlaylistLoaded");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'AthenaCreativeSpawnDrop_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C.PlayLootedFX
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaCreativeSpawnDrop_C_PlayLootedFX final
{
public:
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCreativeSpawnDrop_C_PlayLootedFX) == 0x000010, "Wrong alignment on AthenaCreativeSpawnDrop_C_PlayLootedFX");
static_assert(sizeof(AthenaCreativeSpawnDrop_C_PlayLootedFX) == 0x0000C0, "Wrong size on AthenaCreativeSpawnDrop_C_PlayLootedFX");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlayLootedFX, Temp_bool_Has_Been_Initd_Variable) == 0x000000, "Member 'AthenaCreativeSpawnDrop_C_PlayLootedFX::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlayLootedFX, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'AthenaCreativeSpawnDrop_C_PlayLootedFX::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlayLootedFX, Temp_bool_IsClosed_Variable) == 0x000002, "Member 'AthenaCreativeSpawnDrop_C_PlayLootedFX::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlayLootedFX, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'AthenaCreativeSpawnDrop_C_PlayLootedFX::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCreativeSpawnDrop_C_PlayLootedFX, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'AthenaCreativeSpawnDrop_C_PlayLootedFX::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
