#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaWatchers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaWatchers.AthenaWatchers_C
// 0x0018 (0x0350 - 0x0338)
class UAthenaWatchers_C final : public UAthenaWatchers
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnValueChanged;                                    // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaWatcherEye_C*                    AthenaWatcherEye;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaWatchers(int32 EntryPoint);
	void SpectatorCountChanged_BP(int32 NewCount);
	void SpectatorRemoved();
	void SpectatorsAdded(bool bBigGroup);
	void SpectatorsBegan(bool bBigGroup);
	void SpectatorsEnded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaWatchers_C">();
	}
	static class UAthenaWatchers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWatchers_C>();
	}
};
static_assert(alignof(UAthenaWatchers_C) == 0x000008, "Wrong alignment on UAthenaWatchers_C");
static_assert(sizeof(UAthenaWatchers_C) == 0x000350, "Wrong size on UAthenaWatchers_C");
static_assert(offsetof(UAthenaWatchers_C, UberGraphFrame) == 0x000338, "Member 'UAthenaWatchers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaWatchers_C, OnValueChanged) == 0x000340, "Member 'UAthenaWatchers_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UAthenaWatchers_C, AthenaWatcherEye) == 0x000348, "Member 'UAthenaWatchers_C::AthenaWatcherEye' has a wrong offset!");

}

