#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCreativeSpawnDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaCreativeSpawnDrop.AthenaCreativeSpawnDrop_C
// 0x0098 (0x0BA8 - 0x0B10)
class AAthenaCreativeSpawnDrop_C final : public AFortAthenaCreativeSupplyDrop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        treasure_pinata_loop_Cue;                          // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LlamaStaticMesh;                                   // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxCollision;                                      // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTableName;                                     // 0x0B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3C[0x4];                                      // 0x0B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LootSpawnOffset;                                   // 0x0B40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        LlamaLootFX;                                       // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   FXSocketName;                                      // 0x0B60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B64[0x4];                                      // 0x0B64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_Looted;                                      // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Destroyed;                                   // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Ambient;                                     // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Looted;                                            // 0x0B80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B81[0x7];                                      // 0x0B81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  ControllerWhoOpenedLlama;                          // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B94[0x4];                                      // 0x0B94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CreativeMode;                                      // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void ExecuteUbergraph_AthenaCreativeSpawnDrop(int32 EntryPoint);
	void Multicast_ApplyGravityForFall();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnLandingLocationChanged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnRep_Looted();
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void PlayLootedFX();
	void ReceiveBeginPlay();
	void Setup_Bind_To_Building_Actor(class UObject* Object);
	void SpawnAllLoot();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCreativeSpawnDrop_C">();
	}
	static class AAthenaCreativeSpawnDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaCreativeSpawnDrop_C>();
	}
};
static_assert(alignof(AAthenaCreativeSpawnDrop_C) == 0x000008, "Wrong alignment on AAthenaCreativeSpawnDrop_C");
static_assert(sizeof(AAthenaCreativeSpawnDrop_C) == 0x000BA8, "Wrong size on AAthenaCreativeSpawnDrop_C");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, UberGraphFrame) == 0x000B10, "Member 'AAthenaCreativeSpawnDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, treasure_pinata_loop_Cue) == 0x000B18, "Member 'AAthenaCreativeSpawnDrop_C::treasure_pinata_loop_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, LlamaStaticMesh) == 0x000B20, "Member 'AAthenaCreativeSpawnDrop_C::LlamaStaticMesh' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, BoxCollision) == 0x000B28, "Member 'AAthenaCreativeSpawnDrop_C::BoxCollision' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, ProjectileMovement) == 0x000B30, "Member 'AAthenaCreativeSpawnDrop_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, LootTableName) == 0x000B38, "Member 'AAthenaCreativeSpawnDrop_C::LootTableName' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, LootSpawnOffset) == 0x000B40, "Member 'AAthenaCreativeSpawnDrop_C::LootSpawnOffset' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, LlamaLootFX) == 0x000B58, "Member 'AAthenaCreativeSpawnDrop_C::LlamaLootFX' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, FXSocketName) == 0x000B60, "Member 'AAthenaCreativeSpawnDrop_C::FXSocketName' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, Sound_Looted) == 0x000B68, "Member 'AAthenaCreativeSpawnDrop_C::Sound_Looted' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, Sound_Destroyed) == 0x000B70, "Member 'AAthenaCreativeSpawnDrop_C::Sound_Destroyed' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, Sound_Ambient) == 0x000B78, "Member 'AAthenaCreativeSpawnDrop_C::Sound_Ambient' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, Looted) == 0x000B80, "Member 'AAthenaCreativeSpawnDrop_C::Looted' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, ControllerWhoOpenedLlama) == 0x000B88, "Member 'AAthenaCreativeSpawnDrop_C::ControllerWhoOpenedLlama' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, ObjBackendName) == 0x000B90, "Member 'AAthenaCreativeSpawnDrop_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, QuestItem) == 0x000B98, "Member 'AAthenaCreativeSpawnDrop_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AAthenaCreativeSpawnDrop_C, CreativeMode) == 0x000BA0, "Member 'AAthenaCreativeSpawnDrop_C::CreativeMode' has a wrong offset!");

}

