#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapLayerContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaMapLayerContainer.AthenaMapLayerContainer_C.ExecuteUbergraph_AthenaMapLayerContainer
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_Play_Mode;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CallFunc_GetMinigame_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bFullscreenMapVisible)>   K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortControllerComponent_Minimap*       CallFunc_GetMiniMapComponent_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFullscreenMapVisible;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bFullscreenMapVisible)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortControllerComponent_Minimap*       CallFunc_GetMiniMapComponent_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer) == 0x000008, "Wrong alignment on AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer");
static_assert(sizeof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer) == 0x0000B8, "Wrong size on AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, EntryPoint) == 0x000000, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, Temp_bool_Variable) == 0x000005, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_IsInPlayMode_Play_Mode) == 0x000010, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_IsInPlayMode_Play_Mode' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000018, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_GetMinigame_ReturnValue) == 0x000028, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_GetMinigame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_BooleanNOR_ReturnValue) == 0x000031, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, Temp_real_Variable) == 0x000034, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000038, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000040, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_GetMiniMapComponent_ReturnValue) == 0x000058, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_GetMiniMapComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_CustomEvent_bFullscreenMapVisible) == 0x000060, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_CustomEvent_bFullscreenMapVisible' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000068, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x000080, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, Temp_real_Variable_1) == 0x00008C, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_GetMiniMapComponent_ReturnValue_1) == 0x000090, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_GetMiniMapComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_Select_Default) == 0x000098, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_IsValid_ReturnValue_2) == 0x00009C, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, K2Node_MakeStruct_Margin) == 0x0000A0, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000B0, "Member 'AthenaMapLayerContainer_C_ExecuteUbergraph_AthenaMapLayerContainer::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function AthenaMapLayerContainer.AthenaMapLayerContainer_C.OnFullScreenMapToggle
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapLayerContainer_C_OnFullScreenMapToggle final
{
public:
	bool                                          bFullscreenMapVisible;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMapLayerContainer_C_OnFullScreenMapToggle) == 0x000001, "Wrong alignment on AthenaMapLayerContainer_C_OnFullScreenMapToggle");
static_assert(sizeof(AthenaMapLayerContainer_C_OnFullScreenMapToggle) == 0x000001, "Wrong size on AthenaMapLayerContainer_C_OnFullScreenMapToggle");
static_assert(offsetof(AthenaMapLayerContainer_C_OnFullScreenMapToggle, bFullscreenMapVisible) == 0x000000, "Member 'AthenaMapLayerContainer_C_OnFullScreenMapToggle::bFullscreenMapVisible' has a wrong offset!");

}

