#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMainMenuLeaveButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMainMenuLeaveButton.AthenaMainMenuLeaveButton_C
// 0x0028 (0x0340 - 0x0318)
class UAthenaMainMenuLeaveButton_C final : public UFortMainMenuLeaveButtonWrapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MainMenuButton_C*                  CommonButtonInternal;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0328(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaMainMenuLeaveButton(int32 EntryPoint);
	void OnTextChanged(const class FText& Text_0);
	void OnTimerTextChanged(const class FText& Text_0);
	void OnTimerVisibilityChanged(ESlateVisibility InVisibility);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMainMenuLeaveButton_C">();
	}
	static class UAthenaMainMenuLeaveButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMainMenuLeaveButton_C>();
	}
};
static_assert(alignof(UAthenaMainMenuLeaveButton_C) == 0x000008, "Wrong alignment on UAthenaMainMenuLeaveButton_C");
static_assert(sizeof(UAthenaMainMenuLeaveButton_C) == 0x000340, "Wrong size on UAthenaMainMenuLeaveButton_C");
static_assert(offsetof(UAthenaMainMenuLeaveButton_C, UberGraphFrame) == 0x000318, "Member 'UAthenaMainMenuLeaveButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMainMenuLeaveButton_C, CommonButtonInternal) == 0x000320, "Member 'UAthenaMainMenuLeaveButton_C::CommonButtonInternal' has a wrong offset!");
static_assert(offsetof(UAthenaMainMenuLeaveButton_C, Text) == 0x000328, "Member 'UAthenaMainMenuLeaveButton_C::Text' has a wrong offset!");

}

