#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaChatWidget.AthenaChatWidget_C
// 0x0060 (0x0498 - 0x0438)
class UAthenaChatWidget_C final : public UFortActivatableChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BottomBarDecoyButton_C*            Button_HoldToChat_HackForBottomBar;                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseUserListAction;                               // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    OpenUserListAction;                                // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CurrentUserListAction;                             // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bEnteringChat;                                     // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool EnteredChat)> OnEnteredChat;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UChatContainer_C*                       Chat_Container;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__AthenaChatWidget_Button_HoldToChat_HackForBottomBar_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_AthenaChatWidget(int32 EntryPoint);
	void FocusChat(bool bFocus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaChatWidget_C">();
	}
	static class UAthenaChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChatWidget_C>();
	}
};
static_assert(alignof(UAthenaChatWidget_C) == 0x000008, "Wrong alignment on UAthenaChatWidget_C");
static_assert(sizeof(UAthenaChatWidget_C) == 0x000498, "Wrong size on UAthenaChatWidget_C");
static_assert(offsetof(UAthenaChatWidget_C, UberGraphFrame) == 0x000438, "Member 'UAthenaChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, Button_HoldToChat_HackForBottomBar) == 0x000440, "Member 'UAthenaChatWidget_C::Button_HoldToChat_HackForBottomBar' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, CloseUserListAction) == 0x000448, "Member 'UAthenaChatWidget_C::CloseUserListAction' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, OpenUserListAction) == 0x000458, "Member 'UAthenaChatWidget_C::OpenUserListAction' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, CurrentUserListAction) == 0x000468, "Member 'UAthenaChatWidget_C::CurrentUserListAction' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, bEnteringChat) == 0x000478, "Member 'UAthenaChatWidget_C::bEnteringChat' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, OnEnteredChat) == 0x000480, "Member 'UAthenaChatWidget_C::OnEnteredChat' has a wrong offset!");
static_assert(offsetof(UAthenaChatWidget_C, Chat_Container) == 0x000490, "Member 'UAthenaChatWidget_C::Chat_Container' has a wrong offset!");

}

