#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapNavigableIconStackOfChallenges

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C
// 0x0078 (0x0438 - 0x03C0)
class UAthenaMapNavigableIconStackOfChallenges_C final : public UAthenaMapNavigableIconStackOfChallenges
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSelectAnim_FromHover;                            // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Flare_Loop;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnStartAnim;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnChangingStackIndexAnim;                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelectedAnim;                                    // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack_Count;                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Bang;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Flare;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               DefaultIcon;                                       // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ChangingStackIndexBaseStateTime;                   // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnforceHideCount;                                 // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges(int32 EntryPoint);
	void OnBeginIntroAnimation();
	void OnChallengeIconOverriden(const class UTexture2D* Icon);
	void OnChallengeReset();
	void OnChallengeSet(bool bIsComplete, bool bIsLocked, bool bHasIconOverride, float Progress, bool bShouldShowBang, bool bIsPinned, bool bChallengeSelected);
	void OnChangeBangVisibility(bool bShouldShow);
	void OnChangedStackData(int32 NewStackCount, int32 NonCompletedCount);
	void OnChangingStackIndexAnimFinished();
	void OnHovered(bool bUserInteraction);
	void OnSelected(bool bUserInteraction);
	void OnSetHasLocation(bool bHasLocation);
	void OnSetIsInGame(bool bIsInGame);
	void OnUnhovered(bool bUserInteraction);
	void OnUnselected(bool bUserInteraction);
	void SetAnywhereState(bool bIsAnytimeChallenge);
	void SetMaterialState(bool Complete, bool Locked, bool HasIconOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMapNavigableIconStackOfChallenges_C">();
	}
	static class UAthenaMapNavigableIconStackOfChallenges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapNavigableIconStackOfChallenges_C>();
	}
};
static_assert(alignof(UAthenaMapNavigableIconStackOfChallenges_C) == 0x000008, "Wrong alignment on UAthenaMapNavigableIconStackOfChallenges_C");
static_assert(sizeof(UAthenaMapNavigableIconStackOfChallenges_C) == 0x000438, "Wrong size on UAthenaMapNavigableIconStackOfChallenges_C");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, UberGraphFrame) == 0x0003C0, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnSelectAnim_FromHover) == 0x0003C8, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnSelectAnim_FromHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnHover) == 0x0003D0, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Flare_Loop) == 0x0003D8, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Flare_Loop' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnStartAnim) == 0x0003E0, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnStartAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnChangingStackIndexAnim) == 0x0003E8, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnChangingStackIndexAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnSelectedAnim) == 0x0003F0, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnSelectedAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, CommonText_Stack) == 0x0003F8, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::CommonText_Stack' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, CommonText_Stack_Count) == 0x000400, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::CommonText_Stack_Count' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Image_Bang) == 0x000408, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Image_Bang' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Image_Flare) == 0x000410, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Image_Flare' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Overlay_1) == 0x000418, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, DefaultIcon) == 0x000420, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::DefaultIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, ChangingStackIndexBaseStateTime) == 0x000428, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::ChangingStackIndexBaseStateTime' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, bEnforceHideCount) == 0x000430, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::bEnforceHideCount' has a wrong offset!");

}

