#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum AtomRuntime.EAtomModelMergedMeshSelection
// NumValues: 0x0003
enum class EAtomModelMergedMeshSelection : uint8
{
	AllMeshes                                = 0,
	OnlyOpaqueMeshes                         = 1,
	OnlyTransparentMeshes                    = 2,
};

// Enum AtomRuntime.EAtomMaterialType
// NumValues: 0x0005
enum class EAtomMaterialType : uint8
{
	Standard                                 = 0,
	Transparent                              = 1,
	Glitter                                  = 2,
	Opalescent                               = 3,
	Metallic                                 = 4,
};

// Enum AtomRuntime.EAtomPrimitiveCollisionVolumeType
// NumValues: 0x0006
enum class EAtomPrimitiveCollisionVolumeType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	Cylinder                                 = 3,
	Tube                                     = 4,
	Crate                                    = 5,
};

// Enum AtomRuntime.EPrimitiveAutoCollisionType
// NumValues: 0x0007
enum class EPrimitiveAutoCollisionType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	NDOP10_X                                 = 2,
	NDOP10_Y                                 = 3,
	NDOP10_Z                                 = 4,
	NDOP18                                   = 5,
	NDOP26                                   = 6,
};

// Enum AtomRuntime.EPrimitiveGeometryComplexity
// NumValues: 0x0006
enum class EPrimitiveGeometryComplexity : uint8
{
	JustShell                                = 0,
	ShellAndUncommonParts                    = 1,
	ShellWithInsideDetailsAndUncommonParts   = 2,
	ShellWithInsideDetails                   = 3,
	ShellWithFlatCapAndUncommonParts         = 4,
	ShellWithFlatCap                         = 5,
};

// Enum AtomRuntime.EGetCommonPartDescriptionResult
// NumValues: 0x0002
enum class EGetCommonPartDescriptionResult : uint8
{
	Valid                                    = 0,
	Invalid                                  = 1,
};

// Enum AtomRuntime.EAtomShaderType
// NumValues: 0x000A
enum class EAtomShaderType : uint32
{
	Unknown                                  = 0,
	ShinyPlastic                             = 1,
	MattePlastic                             = 2,
	Rubber                                   = 3,
	ShinySteel                               = 4,
	BrushedSteel                             = 5,
	MatteSteel                               = 6,
	Glitter                                  = 7,
	Metallic                                 = 8,
	Opalescence                              = 9,
};

// Enum AtomRuntime.EColorEffects
// NumValues: 0x0004
enum class EColorEffects : uint8
{
	None                                     = 0,
	Metallic                                 = 1,
	Glitter                                  = 2,
	Opalescent                               = 3,
};

// Enum AtomRuntime.EAtomModelCommonPartOptimizationFlag
// NumValues: 0x0006
enum class EAtomModelCommonPartOptimizationFlag : uint8
{
	None                                     = 0,
	RemoveConnected                          = 1,
	RemoveKnobs                              = 2,
	RemoveTubes                              = 4,
	RemovePins                               = 8,
	All                                      = 15,
};

// Enum AtomRuntime.EAtomModelPivotAnchor
// NumValues: 0x0004
enum class EAtomModelPivotAnchor : uint32
{
	Original                                 = 0,
	TopCenter                                = 1,
	Center                                   = 2,
	BottomCenter                             = 3,
};

// Enum AtomRuntime.EAtomIssue
// NumValues: 0x0010
enum class EAtomIssue : uint32
{
	None                                     = 0,
	FailedToLoadModelFile                    = 1,
	UnsupportedLxFMLVersion                  = 2,
	UnsupportedLxFMLSticker                  = 3,
	MissingPrimitive                         = 4,
	MismatchedPrimitive                      = 5,
	UnsupportedPrimitive                     = 6,
	UnplacedPrimitive                        = 7,
	MissingPrimitiveSourceGeometry           = 8,
	ExcludedByFilter                         = 9,
	UnsupportedCommonPart                    = 10,
	OldVersionPrimitive                      = 11,
	UnknownDecorationTexture                 = 12,
	UnknownDecorationSurface                 = 13,
	DuplicatedSelectionSet                   = 14,
	EmptySelectionSet                        = 15,
};

// Enum AtomRuntime.EAtomModelInstanceType
// NumValues: 0x0005
enum class EAtomModelInstanceType : uint8
{
	Components                               = 0,
	Actors                                   = 1,
	HISM                                     = 2,
	ComponentsWithVertexColor                = 3,
	RenderStylesComponents                   = 4,
};

// Enum AtomRuntime.EAtomPlatform
// NumValues: 0x0015
enum class EAtomPlatform : uint8
{
	NA                                       = 0,
	Duplo                                    = 1,
	Atom                                     = 2,
	Technic                                  = 3,
	Clickits                                 = 4,
	ActionFigures                            = 5,
	Outdoor                                  = 6,
	SoftPrimitives                           = 7,
	ExtendedLine                             = 8,
	Scala                                    = 9,
	Znap                                     = 10,
	Toolo                                    = 11,
	Storage                                  = 12,
	MusicBuilder                             = 13,
	StoryBuilder                             = 14,
	Quatro                                   = 15,
	Ccbs                                     = 16,
	Primo1                                   = 17,
	AtomFoundation                           = 18,
	DieCutToStickers                         = 98,
	GeneralPlatform                          = 99,
};

// Enum AtomRuntime.EAtomCommonPartType
// NumValues: 0x0019
enum class EAtomCommonPartType : uint8
{
	None                                     = 0,
	Dknob_01_C                               = 1,
	Dknob_01_D                               = 2,
	Dpin_01_C                                = 3,
	Dtube_01_C                               = 4,
	Dtube_02_C                               = 5,
	Dtube_03_C                               = 6,
	Dtube_04_C                               = 7,
	knob_01_C                                = 8,
	knob_01_D                                = 9,
	knob_01_P                                = 10,
	knob_01_PC                               = 11,
	knob_02_P                                = 12,
	knob_02_PC                               = 13,
	knob_03_P                                = 14,
	knob_03_PC                               = 15,
	knob_04_P                                = 16,
	knob_04_PC                               = 17,
	pin_01_C                                 = 18,
	pin_01_D                                 = 19,
	pin_02_C                                 = 20,
	pin_02_D                                 = 21,
	tube_01_D                                = 22,
	tube_02_D                                = 23,
	tube_03_D                                = 24,
};

// Enum AtomRuntime.EAtomCommonPartCategory
// NumValues: 0x0004
enum class EAtomCommonPartCategory : uint8
{
	None                                     = 0,
	Knob                                     = 1,
	Pin                                      = 2,
	Tube                                     = 3,
};

// Enum AtomRuntime.EAtomPrimitiveImportWarningFlags
// NumValues: 0x0008
enum class EAtomPrimitiveImportWarningFlags : uint8
{
	None                                     = 0,
	UnableToFindUnwrappedMeshUVSet           = 1,
	BrokenPrincipalUVSet                     = 2,
	InvalidFBXFile                           = 4,
	InvalidMeshInFBXScene                    = 8,
	CommonPartMeshNotFound                   = 16,
	FullyTriangulated                        = 32,
	TransformedMeshes                        = 64,
};

// Enum AtomRuntime.EAtomPrimitiveGeoOptimization
// NumValues: 0x0003
enum class EAtomPrimitiveGeoOptimization : uint8
{
	Default                                  = 0,
	UseForDetailOnly                         = 1,
	UseApproximationForLODs                  = 2,
};

// Enum AtomRuntime.EAtomPrimitiveGeoOptimization_Old
// NumValues: 0x0003
enum class EAtomPrimitiveGeoOptimization_Old : uint32
{
	Default                                  = 0,
	UseForDetailOnly                         = 1,
	UseApproximationForLODs                  = 2,
};

// Enum AtomRuntime.EAtomPrimitiveApproximationShapeType
// NumValues: 0x0005
enum class EAtomPrimitiveApproximationShapeType : uint8
{
	Auto                                     = 0,
	OrientedBox                              = 1,
	ExtrudedConvexHull2D                     = 2,
	ConvexHull3D                             = 3,
	Extrusion                                = 4,
};

// Enum AtomRuntime.EAtomPrimitiveApproximationShapeType_Old
// NumValues: 0x0005
enum class EAtomPrimitiveApproximationShapeType_Old : uint32
{
	Auto                                     = 0,
	OrientedBox                              = 1,
	ExtrudedConvexHull2D                     = 2,
	ConvexHull3D                             = 3,
	Extrusion                                = 4,
};

// Enum AtomRuntime.EConnectionFieldType
// NumValues: 0x000A
enum class EConnectionFieldType : uint8
{
	Planar                                   = 0,
	Hinge                                    = 1,
	Axle                                     = 2,
	Ball                                     = 3,
	Cardan                                   = 4,
	Fixed                                    = 5,
	Rail                                     = 6,
	Slider                                   = 7,
	Gear                                     = 8,
	User                                     = 9,
};

// Enum AtomRuntime.EConnectionFieldSuperType
// NumValues: 0x0003
enum class EConnectionFieldSuperType : uint8
{
	Planar                                   = 0,
	Line                                     = 1,
	Point                                    = 2,
};

// Enum AtomRuntime.EConnectionFieldGender
// NumValues: 0x0003
enum class EConnectionFieldGender : uint8
{
	Receptor                                 = 0,
	Connector                                = 1,
	Any                                      = 2,
};

// Enum AtomRuntime.EFieldConnectResult
// NumValues: 0x000E
enum class EFieldConnectResult : uint8
{
	NoConnection                             = 0,
	Rejection                                = 1,
	FixedConnection                          = 2,
	FreeConnection                           = 3,
	HingeConnection                          = 4,
	CardanConnection                         = 5,
	BallConnection                           = 6,
	PrismaticConnection                      = 7,
	CylindricalConnection                    = 8,
	PrismaticAPerpendicularHingeConnection   = 9,
	PrismaticBPerpendicularHingeConnection   = 10,
	ConnectResultMax                         = 11,
	FirstConnection                          = 2,
	LastConnection                           = 10,
};

// Enum AtomRuntime.EAxleDiameter
// NumValues: 0x0003
enum class EAxleDiameter : uint8
{
	Tiny                                     = 0,
	Medium                                   = 1,
	Large                                    = 2,
};

// Enum AtomRuntime.EConnectionAxleType
// NumValues: 0x0017
enum class EConnectionAxleType : uint8
{
	UnusedReceptor                           = 0,
	UnusedConnector                          = 1,
	RoundAxleReceptor                        = 2,
	RoundAxleConnector                       = 3,
	CrossAxleReceptor                        = 4,
	CrossAxleConnector                       = 5,
	SecondaryPinReceptor                     = 6,
	SecondaryPinConnector                    = 7,
	PlateRoundCrossAxleReceptor              = 8,
	UnusedPlateRoundCrossAxleConnector       = 9,
	MiniFigNeckReceptor                      = 10,
	MiniFigNeckConnector                     = 11,
	RoundCrossAxleReceptor                   = 12,
	RoundCrossAxleConnector                  = 13,
	TinyPinReceptor                          = 14,
	TinyPinConnector                         = 15,
	UnusedCrossAxlePegHoleCapAlignmentReceptor = 16,
	CrossAxlePegHoleCapAlignmentConnector    = 17,
	UnusedRoundAxleReceptorDontRejectSecondaryPinConnector = 18,
	RoundAxleConnectorDontRejectSecondaryPinConnector = 19,
	UnusedSecondaryPinReceptorDontRejectTinyPinConnector = 20,
	SecondaryPinConnectorDontRejectTinyPinConnector = 21,
	SubTypeSize                              = 22,
};

// Enum AtomRuntime.EConnectionPointType
// NumValues: 0x002E
enum class EConnectionPointType : uint8
{
	Knob                                     = 0,
	HollowKnob                               = 1,
	KnobFitInPegHole                         = 2,
	HollowKnobFitInPegHole                   = 3,
	SquareKnob                               = 4,
	Tube                                     = 5,
	TubeWithRib                              = 6,
	BottomTube                               = 7,
	BottomTubeWithRib                        = 8,
	SecondaryPin                             = 9,
	SecondaryPinWithRib                      = 10,
	SecondaryPinWithTinyPinReceptor          = 11,
	SecondaryPinWithRibAndTinyPinReceptor    = 12,
	FixedTube                                = 13,
	FixedTubeWithAntiKnob                    = 14,
	AntiKnob                                 = 15,
	PegHole                                  = 16,
	SquareAntiKnob                           = 17,
	TubeGap                                  = 18,
	TubeGrabber                              = 19,
	TinyPin                                  = 20,
	TinyPinReceptor                          = 21,
	Edge                                     = 22,
	EdgeGap                                  = 23,
	KnobReject                               = 24,
	PowerFuncLeftTop                         = 25,
	PowerFuncRightTop                        = 26,
	PowerFuncLeftBottom                      = 27,
	PowerFuncRightBottom                     = 28,
	VoidFeature                              = 29,
	DuploKnob                                = 30,
	DuploHollowKnob                          = 31,
	DuploAntiKnob                            = 32,
	DuploTube                                = 33,
	DuploFixedTube                           = 34,
	DuploTubeGap                             = 35,
	DuploAnimalKnob                          = 36,
	DuploAnimalTube                          = 37,
	SecondaryPinReceptor                     = 38,
	DuploFixedAnimalTube                     = 39,
	DuploSecondaryPinWithRib                 = 40,
	DuploSecondaryPin                        = 41,
	DuploKnobReject                          = 42,
	_size                                    = 43,
	_duploBegin                              = 30,
	_duploEnd                                = 42,
};

// Enum AtomRuntime.EConnectionPointFlags
// NumValues: 0x0014
enum class EConnectionPointFlags : uint32
{
	SquareFeature                            = 1,
	RoundFeature                             = 2,
	KnobWithHole                             = 4,
	KnobWithMiniFigHandHole                  = 8,
	KnobWithSingleCollision                  = 16,
	SingleFeature                            = 32,
	ReceptorDontRemoveKnobCollision          = 64,
	KnobWithoutCollision                     = 128,
	CreationValidFlags                       = 255,
	ThisSideTransparent                      = 256,
	ThisSideHidden                           = 512,
	DynamicValidFlags                        = 768,
	InternalIsDuploSecondaryPin              = 268435456,
	InternalIsQuadConnector                  = 536870912,
	InternalIsSecondaryPin                   = 1073741824,
	InternalIsAnyKnob                        = 2147483648,
	SquareOcclusionShapeIndex                = 1,
	RoundOcclusionShapeIndex                 = 2,
	OtherOcclusionShapeIndex                 = 0,
	OcclusionShapeMask                       = 3,
};

// ScriptStruct AtomRuntime.AtomColorInfo
// 0x0020 (0x0028 - 0x0008)
struct FAtomColorInfo final : public FTableRowBase
{
public:
	struct FColor                                 Color;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMaterialType                             MaterialType;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomColorInfo) == 0x000008, "Wrong alignment on FAtomColorInfo");
static_assert(sizeof(FAtomColorInfo) == 0x000028, "Wrong size on FAtomColorInfo");
static_assert(offsetof(FAtomColorInfo, Color) == 0x000008, "Member 'FAtomColorInfo::Color' has a wrong offset!");
static_assert(offsetof(FAtomColorInfo, MaterialType) == 0x00000C, "Member 'FAtomColorInfo::MaterialType' has a wrong offset!");
static_assert(offsetof(FAtomColorInfo, Name) == 0x000010, "Member 'FAtomColorInfo::Name' has a wrong offset!");
static_assert(offsetof(FAtomColorInfo, bIsActive) == 0x000020, "Member 'FAtomColorInfo::bIsActive' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomMergedMeshLODDistanceSettings
// 0x0020 (0x0020 - 0x0000)
struct FAtomMergedMeshLODDistanceSettings final
{
public:
	bool                                          bOverrideLODScreenSizes;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseLODScreenSize;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLODScreenSizeScaling;                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 LODDistances;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomMergedMeshLODDistanceSettings) == 0x000008, "Wrong alignment on FAtomMergedMeshLODDistanceSettings");
static_assert(sizeof(FAtomMergedMeshLODDistanceSettings) == 0x000020, "Wrong size on FAtomMergedMeshLODDistanceSettings");
static_assert(offsetof(FAtomMergedMeshLODDistanceSettings, bOverrideLODScreenSizes) == 0x000000, "Member 'FAtomMergedMeshLODDistanceSettings::bOverrideLODScreenSizes' has a wrong offset!");
static_assert(offsetof(FAtomMergedMeshLODDistanceSettings, BaseLODScreenSize) == 0x000004, "Member 'FAtomMergedMeshLODDistanceSettings::BaseLODScreenSize' has a wrong offset!");
static_assert(offsetof(FAtomMergedMeshLODDistanceSettings, BaseLODScreenSizeScaling) == 0x000008, "Member 'FAtomMergedMeshLODDistanceSettings::BaseLODScreenSizeScaling' has a wrong offset!");
static_assert(offsetof(FAtomMergedMeshLODDistanceSettings, LODDistances) == 0x000010, "Member 'FAtomMergedMeshLODDistanceSettings::LODDistances' has a wrong offset!");

// ScriptStruct AtomRuntime.CommonPartInstanceDescription
// 0x0040 (0x0040 - 0x0000)
struct FCommonPartInstanceDescription final
{
public:
	struct FTransform3f                           Transform;                                         // 0x0000(0x0030)(Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MeshIdx;                                           // 0x0030(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MaterialIdx;                                       // 0x0032(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         UUIDIdx;                                           // 0x0034(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ColorId;                                           // 0x0036(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCommonPartInstanceDescription) == 0x000010, "Wrong alignment on FCommonPartInstanceDescription");
static_assert(sizeof(FCommonPartInstanceDescription) == 0x000040, "Wrong size on FCommonPartInstanceDescription");
static_assert(offsetof(FCommonPartInstanceDescription, Transform) == 0x000000, "Member 'FCommonPartInstanceDescription::Transform' has a wrong offset!");
static_assert(offsetof(FCommonPartInstanceDescription, MeshIdx) == 0x000030, "Member 'FCommonPartInstanceDescription::MeshIdx' has a wrong offset!");
static_assert(offsetof(FCommonPartInstanceDescription, MaterialIdx) == 0x000032, "Member 'FCommonPartInstanceDescription::MaterialIdx' has a wrong offset!");
static_assert(offsetof(FCommonPartInstanceDescription, UUIDIdx) == 0x000034, "Member 'FCommonPartInstanceDescription::UUIDIdx' has a wrong offset!");
static_assert(offsetof(FCommonPartInstanceDescription, ColorId) == 0x000036, "Member 'FCommonPartInstanceDescription::ColorId' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomCommonPartInstancesCache
// 0x0050 (0x0050 - 0x0000)
struct FAtomCommonPartInstancesCache final
{
public:
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          UUIDs;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCommonPartInstanceDescription> Instances;                                         // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform3f>                   InstanceTransforms;                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomCommonPartInstancesCache) == 0x000008, "Wrong alignment on FAtomCommonPartInstancesCache");
static_assert(sizeof(FAtomCommonPartInstancesCache) == 0x000050, "Wrong size on FAtomCommonPartInstancesCache");
static_assert(offsetof(FAtomCommonPartInstancesCache, Meshes) == 0x000000, "Member 'FAtomCommonPartInstancesCache::Meshes' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartInstancesCache, Materials) == 0x000010, "Member 'FAtomCommonPartInstancesCache::Materials' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartInstancesCache, UUIDs) == 0x000020, "Member 'FAtomCommonPartInstancesCache::UUIDs' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartInstancesCache, Instances) == 0x000030, "Member 'FAtomCommonPartInstancesCache::Instances' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartInstancesCache, InstanceTransforms) == 0x000040, "Member 'FAtomCommonPartInstancesCache::InstanceTransforms' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomCommonPartAssetDescription
// 0x000C (0x000C - 0x0000)
struct FAtomCommonPartAssetDescription final
{
public:
	EAtomCommonPartType                           CommonPartType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CommonPartStyle;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomCommonPartAssetDescription) == 0x000004, "Wrong alignment on FAtomCommonPartAssetDescription");
static_assert(sizeof(FAtomCommonPartAssetDescription) == 0x00000C, "Wrong size on FAtomCommonPartAssetDescription");
static_assert(offsetof(FAtomCommonPartAssetDescription, CommonPartType) == 0x000000, "Member 'FAtomCommonPartAssetDescription::CommonPartType' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartAssetDescription, CommonPartStyle) == 0x000004, "Member 'FAtomCommonPartAssetDescription::CommonPartStyle' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartAssetDescription, Scale) == 0x000008, "Member 'FAtomCommonPartAssetDescription::Scale' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomModelPartGuid
// 0x0014 (0x0014 - 0x0000)
struct FAtomModelPartGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartIndex;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomModelPartGuid) == 0x000004, "Wrong alignment on FAtomModelPartGuid");
static_assert(sizeof(FAtomModelPartGuid) == 0x000014, "Wrong size on FAtomModelPartGuid");
static_assert(offsetof(FAtomModelPartGuid, Guid) == 0x000000, "Member 'FAtomModelPartGuid::Guid' has a wrong offset!");
static_assert(offsetof(FAtomModelPartGuid, PartIndex) == 0x000010, "Member 'FAtomModelPartGuid::PartIndex' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomModelPartColorInfo
// 0x000C (0x000C - 0x0000)
struct FAtomModelPartColorInfo final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColorId;                                           // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMaterialType                             MaterialType;                                      // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomModelPartColorInfo) == 0x000004, "Wrong alignment on FAtomModelPartColorInfo");
static_assert(sizeof(FAtomModelPartColorInfo) == 0x00000C, "Wrong size on FAtomModelPartColorInfo");
static_assert(offsetof(FAtomModelPartColorInfo, Color) == 0x000000, "Member 'FAtomModelPartColorInfo::Color' has a wrong offset!");
static_assert(offsetof(FAtomModelPartColorInfo, ColorId) == 0x000004, "Member 'FAtomModelPartColorInfo::ColorId' has a wrong offset!");
static_assert(offsetof(FAtomModelPartColorInfo, MaterialType) == 0x000008, "Member 'FAtomModelPartColorInfo::MaterialType' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomModelPartDecorationInfo
// 0x0028 (0x0028 - 0x0000)
struct FAtomModelPartDecorationInfo final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrimitiveSurfaceName;                              // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrimitiveSurfaceIndex;                             // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomModelPartDecorationInfo) == 0x000008, "Wrong alignment on FAtomModelPartDecorationInfo");
static_assert(sizeof(FAtomModelPartDecorationInfo) == 0x000028, "Wrong size on FAtomModelPartDecorationInfo");
static_assert(offsetof(FAtomModelPartDecorationInfo, Material) == 0x000000, "Member 'FAtomModelPartDecorationInfo::Material' has a wrong offset!");
static_assert(offsetof(FAtomModelPartDecorationInfo, Texture) == 0x000008, "Member 'FAtomModelPartDecorationInfo::Texture' has a wrong offset!");
static_assert(offsetof(FAtomModelPartDecorationInfo, PrimitiveSurfaceName) == 0x000010, "Member 'FAtomModelPartDecorationInfo::PrimitiveSurfaceName' has a wrong offset!");
static_assert(offsetof(FAtomModelPartDecorationInfo, PrimitiveSurfaceIndex) == 0x000020, "Member 'FAtomModelPartDecorationInfo::PrimitiveSurfaceIndex' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomCommonPartAndTransform
// 0x0070 (0x0070 - 0x0000)
struct FAtomCommonPartAndTransform final
{
public:
	EAtomCommonPartType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomCommonPartAndTransform) == 0x000010, "Wrong alignment on FAtomCommonPartAndTransform");
static_assert(sizeof(FAtomCommonPartAndTransform) == 0x000070, "Wrong size on FAtomCommonPartAndTransform");
static_assert(offsetof(FAtomCommonPartAndTransform, Type) == 0x000000, "Member 'FAtomCommonPartAndTransform::Type' has a wrong offset!");
static_assert(offsetof(FAtomCommonPartAndTransform, Transform) == 0x000010, "Member 'FAtomCommonPartAndTransform::Transform' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomModelPartInstanceInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FAtomModelPartInstanceInfo final
{
public:
	struct FAtomModelPartGuid                     PartGuid;                                          // 0x0000(0x0014)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartId;                                            // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitive*                         Primitive;                                         // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Transforms;                                        // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartDecorationInfo>   Decorations;                                       // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartColorInfo>        Colors;                                            // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         SelectionSets;                                     // 0x0058(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Group;                                             // 0x0068(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParentGroup;                                       // 0x0078(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomCommonPartAndTransform>    CommonParts;                                       // 0x0088(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsUndersideVisible;                               // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomModelPartInstanceInfo) == 0x000008, "Wrong alignment on FAtomModelPartInstanceInfo");
static_assert(sizeof(FAtomModelPartInstanceInfo) == 0x0000A0, "Wrong size on FAtomModelPartInstanceInfo");
static_assert(offsetof(FAtomModelPartInstanceInfo, PartGuid) == 0x000000, "Member 'FAtomModelPartInstanceInfo::PartGuid' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, PartId) == 0x000018, "Member 'FAtomModelPartInstanceInfo::PartId' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, Primitive) == 0x000020, "Member 'FAtomModelPartInstanceInfo::Primitive' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, Transforms) == 0x000028, "Member 'FAtomModelPartInstanceInfo::Transforms' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, Decorations) == 0x000038, "Member 'FAtomModelPartInstanceInfo::Decorations' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, Colors) == 0x000048, "Member 'FAtomModelPartInstanceInfo::Colors' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, SelectionSets) == 0x000058, "Member 'FAtomModelPartInstanceInfo::SelectionSets' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, Group) == 0x000068, "Member 'FAtomModelPartInstanceInfo::Group' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, ParentGroup) == 0x000078, "Member 'FAtomModelPartInstanceInfo::ParentGroup' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, CommonParts) == 0x000088, "Member 'FAtomModelPartInstanceInfo::CommonParts' has a wrong offset!");
static_assert(offsetof(FAtomModelPartInstanceInfo, bIsUndersideVisible) == 0x000098, "Member 'FAtomModelPartInstanceInfo::bIsUndersideVisible' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomModelPartsCollection
// 0x0080 (0x0080 - 0x0000)
struct FAtomModelPartsCollection final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Pivot;                                             // 0x0010(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartInstanceInfo>     Parts;                                             // 0x0070(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomModelPartsCollection) == 0x000010, "Wrong alignment on FAtomModelPartsCollection");
static_assert(sizeof(FAtomModelPartsCollection) == 0x000080, "Wrong size on FAtomModelPartsCollection");
static_assert(offsetof(FAtomModelPartsCollection, Name) == 0x000000, "Member 'FAtomModelPartsCollection::Name' has a wrong offset!");
static_assert(offsetof(FAtomModelPartsCollection, Pivot) == 0x000010, "Member 'FAtomModelPartsCollection::Pivot' has a wrong offset!");
static_assert(offsetof(FAtomModelPartsCollection, Parts) == 0x000070, "Member 'FAtomModelPartsCollection::Parts' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeBase
// 0x0020 (0x0020 - 0x0000)
struct FAtomPrimitiveCollisionVolumeBase
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        BoneIndex;                                         // 0x0018(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeBase) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeBase");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeBase) == 0x000020, "Wrong size on FAtomPrimitiveCollisionVolumeBase");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeBase, Location) == 0x000000, "Member 'FAtomPrimitiveCollisionVolumeBase::Location' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeBase, BoneIndex) == 0x000018, "Member 'FAtomPrimitiveCollisionVolumeBase::BoneIndex' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeBox
// 0x0030 (0x0050 - 0x0020)
struct FAtomPrimitiveCollisionVolumeBox final : public FAtomPrimitiveCollisionVolumeBase
{
public:
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                HalfExtent;                                        // 0x0038(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeBox) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeBox");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeBox) == 0x000050, "Wrong size on FAtomPrimitiveCollisionVolumeBox");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeBox, Rotation) == 0x000020, "Member 'FAtomPrimitiveCollisionVolumeBox::Rotation' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeBox, HalfExtent) == 0x000038, "Member 'FAtomPrimitiveCollisionVolumeBox::HalfExtent' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeCapsule
// 0x0020 (0x0040 - 0x0020)
struct FAtomPrimitiveCollisionVolumeCapsule final : public FAtomPrimitiveCollisionVolumeBase
{
public:
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeCapsule) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeCapsule");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeCapsule) == 0x000040, "Wrong size on FAtomPrimitiveCollisionVolumeCapsule");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeCapsule, Rotation) == 0x000020, "Member 'FAtomPrimitiveCollisionVolumeCapsule::Rotation' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeCapsule, Radius) == 0x000038, "Member 'FAtomPrimitiveCollisionVolumeCapsule::Radius' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeCapsule, HalfLength) == 0x00003C, "Member 'FAtomPrimitiveCollisionVolumeCapsule::HalfLength' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeCylinder
// 0x0020 (0x0040 - 0x0020)
struct FAtomPrimitiveCollisionVolumeCylinder final : public FAtomPrimitiveCollisionVolumeBase
{
public:
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeCylinder) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeCylinder");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeCylinder) == 0x000040, "Wrong size on FAtomPrimitiveCollisionVolumeCylinder");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeCylinder, Rotation) == 0x000020, "Member 'FAtomPrimitiveCollisionVolumeCylinder::Rotation' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeCylinder, Radius) == 0x000038, "Member 'FAtomPrimitiveCollisionVolumeCylinder::Radius' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeCylinder, HalfLength) == 0x00003C, "Member 'FAtomPrimitiveCollisionVolumeCylinder::HalfLength' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeTube
// 0x0028 (0x0048 - 0x0020)
struct FAtomPrimitiveCollisionVolumeTube final : public FAtomPrimitiveCollisionVolumeBase
{
public:
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterRadius;                                       // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfLength;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeTube) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeTube");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeTube) == 0x000048, "Wrong size on FAtomPrimitiveCollisionVolumeTube");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeTube, Rotation) == 0x000020, "Member 'FAtomPrimitiveCollisionVolumeTube::Rotation' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeTube, InnerRadius) == 0x000038, "Member 'FAtomPrimitiveCollisionVolumeTube::InnerRadius' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeTube, OuterRadius) == 0x00003C, "Member 'FAtomPrimitiveCollisionVolumeTube::OuterRadius' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeTube, HalfLength) == 0x000040, "Member 'FAtomPrimitiveCollisionVolumeTube::HalfLength' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeSphere
// 0x0008 (0x0028 - 0x0020)
struct FAtomPrimitiveCollisionVolumeSphere final : public FAtomPrimitiveCollisionVolumeBase
{
public:
	float                                         Radius;                                            // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeSphere) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeSphere");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeSphere) == 0x000028, "Wrong size on FAtomPrimitiveCollisionVolumeSphere");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeSphere, Radius) == 0x000020, "Member 'FAtomPrimitiveCollisionVolumeSphere::Radius' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionVolumeContainer
// 0x0050 (0x0050 - 0x0000)
struct FAtomPrimitiveCollisionVolumeContainer final
{
public:
	TArray<struct FAtomPrimitiveCollisionVolumeBox> Boxes;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeSphere> Spheres;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeCapsule> Capsules;                                          // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeCylinder> Cylinders;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveCollisionVolumeTube> Tubes;                                             // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveCollisionVolumeContainer) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionVolumeContainer");
static_assert(sizeof(FAtomPrimitiveCollisionVolumeContainer) == 0x000050, "Wrong size on FAtomPrimitiveCollisionVolumeContainer");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeContainer, Boxes) == 0x000000, "Member 'FAtomPrimitiveCollisionVolumeContainer::Boxes' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeContainer, Spheres) == 0x000010, "Member 'FAtomPrimitiveCollisionVolumeContainer::Spheres' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeContainer, Capsules) == 0x000020, "Member 'FAtomPrimitiveCollisionVolumeContainer::Capsules' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeContainer, Cylinders) == 0x000030, "Member 'FAtomPrimitiveCollisionVolumeContainer::Cylinders' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveCollisionVolumeContainer, Tubes) == 0x000040, "Member 'FAtomPrimitiveCollisionVolumeContainer::Tubes' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveCollisionGeometry
// 0x0078 (0x0078 - 0x0000)
struct FAtomPrimitiveCollisionGeometry final
{
public:
	struct FKAggregateGeom                        AggGeom;                                           // 0x0000(0x0078)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveCollisionGeometry) == 0x000008, "Wrong alignment on FAtomPrimitiveCollisionGeometry");
static_assert(sizeof(FAtomPrimitiveCollisionGeometry) == 0x000078, "Wrong size on FAtomPrimitiveCollisionGeometry");
static_assert(offsetof(FAtomPrimitiveCollisionGeometry, AggGeom) == 0x000000, "Member 'FAtomPrimitiveCollisionGeometry::AggGeom' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveGeometryLODs
// 0x0090 (0x0090 - 0x0000)
struct FAtomPrimitiveGeometryLODs final
{
public:
	TArray<class UAtomPrimitiveGeometry*>         GeometryLODs;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 HiResNaniteGeomery;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveCollisionGeometry        Collision;                                         // 0x0018(0x0078)(BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveGeometryLODs) == 0x000008, "Wrong alignment on FAtomPrimitiveGeometryLODs");
static_assert(sizeof(FAtomPrimitiveGeometryLODs) == 0x000090, "Wrong size on FAtomPrimitiveGeometryLODs");
static_assert(offsetof(FAtomPrimitiveGeometryLODs, GeometryLODs) == 0x000000, "Member 'FAtomPrimitiveGeometryLODs::GeometryLODs' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveGeometryLODs, HiResNaniteGeomery) == 0x000010, "Member 'FAtomPrimitiveGeometryLODs::HiResNaniteGeomery' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveGeometryLODs, Collision) == 0x000018, "Member 'FAtomPrimitiveGeometryLODs::Collision' has a wrong offset!");

// ScriptStruct AtomRuntime.AtomPrimitiveGeometryAndTransform
// 0x0040 (0x0040 - 0x0000)
struct FAtomPrimitiveGeometryAndTransform final
{
public:
	class UAtomPrimitiveGeometry*                 AtomPrimitiveGeometry;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPrimitiveGeometryAndTransform) == 0x000010, "Wrong alignment on FAtomPrimitiveGeometryAndTransform");
static_assert(sizeof(FAtomPrimitiveGeometryAndTransform) == 0x000040, "Wrong size on FAtomPrimitiveGeometryAndTransform");
static_assert(offsetof(FAtomPrimitiveGeometryAndTransform, AtomPrimitiveGeometry) == 0x000000, "Member 'FAtomPrimitiveGeometryAndTransform::AtomPrimitiveGeometry' has a wrong offset!");
static_assert(offsetof(FAtomPrimitiveGeometryAndTransform, Transform) == 0x000010, "Member 'FAtomPrimitiveGeometryAndTransform::Transform' has a wrong offset!");

// ScriptStruct AtomRuntime.ConnectionField
// 0x0040 (0x0040 - 0x0000)
struct FConnectionField
{
public:
	struct FQuat                                  Rotation;                                          // 0x0000(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Subtype;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        BoneIndex;                                         // 0x003C(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionFieldType                          Type;                                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConnectionField) == 0x000010, "Wrong alignment on FConnectionField");
static_assert(sizeof(FConnectionField) == 0x000040, "Wrong size on FConnectionField");
static_assert(offsetof(FConnectionField, Rotation) == 0x000000, "Member 'FConnectionField::Rotation' has a wrong offset!");
static_assert(offsetof(FConnectionField, Location) == 0x000020, "Member 'FConnectionField::Location' has a wrong offset!");
static_assert(offsetof(FConnectionField, Subtype) == 0x000038, "Member 'FConnectionField::Subtype' has a wrong offset!");
static_assert(offsetof(FConnectionField, BoneIndex) == 0x00003C, "Member 'FConnectionField::BoneIndex' has a wrong offset!");
static_assert(offsetof(FConnectionField, Type) == 0x00003E, "Member 'FConnectionField::Type' has a wrong offset!");

// ScriptStruct AtomRuntime.ConnectionFieldLine
// 0x0010 (0x0050 - 0x0040)
struct FConnectionFieldLine : public FConnectionField
{
public:
	double                                        Length;                                            // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartCapped;                                       // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EndCapped;                                         // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConnectionFieldLine) == 0x000010, "Wrong alignment on FConnectionFieldLine");
static_assert(sizeof(FConnectionFieldLine) == 0x000050, "Wrong size on FConnectionFieldLine");
static_assert(offsetof(FConnectionFieldLine, Length) == 0x000040, "Member 'FConnectionFieldLine::Length' has a wrong offset!");
static_assert(offsetof(FConnectionFieldLine, StartCapped) == 0x000048, "Member 'FConnectionFieldLine::StartCapped' has a wrong offset!");
static_assert(offsetof(FConnectionFieldLine, EndCapped) == 0x000049, "Member 'FConnectionFieldLine::EndCapped' has a wrong offset!");

// ScriptStruct AtomRuntime.ConnectionFieldAxle
// 0x0010 (0x0060 - 0x0050)
struct FConnectionFieldAxle final : public FConnectionFieldLine
{
public:
	bool                                          Grabbing;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireGrabbing;                                   // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DiscreteSnapInterval;                              // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConnectionFieldAxle) == 0x000010, "Wrong alignment on FConnectionFieldAxle");
static_assert(sizeof(FConnectionFieldAxle) == 0x000060, "Wrong size on FConnectionFieldAxle");
static_assert(offsetof(FConnectionFieldAxle, Grabbing) == 0x000050, "Member 'FConnectionFieldAxle::Grabbing' has a wrong offset!");
static_assert(offsetof(FConnectionFieldAxle, RequireGrabbing) == 0x000051, "Member 'FConnectionFieldAxle::RequireGrabbing' has a wrong offset!");
static_assert(offsetof(FConnectionFieldAxle, DiscreteSnapInterval) == 0x000054, "Member 'FConnectionFieldAxle::DiscreteSnapInterval' has a wrong offset!");

// ScriptStruct AtomRuntime.ConnectionFieldPoint
// 0x0000 (0x0040 - 0x0040)
struct FConnectionFieldPoint : public FConnectionField
{
};
static_assert(alignof(FConnectionFieldPoint) == 0x000010, "Wrong alignment on FConnectionFieldPoint");
static_assert(sizeof(FConnectionFieldPoint) == 0x000040, "Wrong size on FConnectionFieldPoint");

// ScriptStruct AtomRuntime.ConnectionFieldBall
// 0x0000 (0x0040 - 0x0040)
struct FConnectionFieldBall final : public FConnectionFieldPoint
{
};
static_assert(alignof(FConnectionFieldBall) == 0x000010, "Wrong alignment on FConnectionFieldBall");
static_assert(sizeof(FConnectionFieldBall) == 0x000040, "Wrong size on FConnectionFieldBall");

