#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioWorldization

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum AudioWorldization.ETraceDirection
// NumValues: 0x0006
enum class ETraceDirection : uint8
{
	N                                        = 0,
	E                                        = 1,
	S                                        = 2,
	W                                        = 3,
	Up                                       = 4,
	None                                     = 5,
};

// ScriptStruct AudioWorldization.AudioWorldizationSend
// 0x0068 (0x0068 - 0x0000)
struct FAudioWorldizationSend final
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class USoundModulatorBase*>              VolumeModulators;                                  // 0x0008(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundEffectSubmixPreset*>       EffectChain;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAudioWorldizationSend) == 0x000008, "Wrong alignment on FAudioWorldizationSend");
static_assert(sizeof(FAudioWorldizationSend) == 0x000068, "Wrong size on FAudioWorldizationSend");
static_assert(offsetof(FAudioWorldizationSend, Submix) == 0x000000, "Member 'FAudioWorldizationSend::Submix' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSend, VolumeModulators) == 0x000008, "Member 'FAudioWorldizationSend::VolumeModulators' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSend, EffectChain) == 0x000058, "Member 'FAudioWorldizationSend::EffectChain' has a wrong offset!");

// ScriptStruct AudioWorldization.AudioWorldizationSettings
// 0x0078 (0x0078 - 0x0000)
struct FAudioWorldizationSettings final
{
public:
	class FName                                   Identifier;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAudioWorldizationSend>         Sends;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         EnclosureSmoothSpeed;                              // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallDistanceSmoothSpeed;                           // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceRadius;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrossfadeTime;                                     // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TracePoints;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TracesPerFrame;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SideQuadrantDegrees;                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpQuadrantDegrees;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceOrigin;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             TraceChannel;                                      // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECollisionChannel>                     ResponseChannels;                                  // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UAudioWorldizationTracePolicyBase> TracePolicy;                                       // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAudioWorldizationTraceDirectionPolicyBase> TraceDirectionPolicy;                              // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAudioWorldizationSettings) == 0x000008, "Wrong alignment on FAudioWorldizationSettings");
static_assert(sizeof(FAudioWorldizationSettings) == 0x000078, "Wrong size on FAudioWorldizationSettings");
static_assert(offsetof(FAudioWorldizationSettings, Identifier) == 0x000000, "Member 'FAudioWorldizationSettings::Identifier' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, Sends) == 0x000008, "Member 'FAudioWorldizationSettings::Sends' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, EnclosureSmoothSpeed) == 0x000018, "Member 'FAudioWorldizationSettings::EnclosureSmoothSpeed' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, WallDistanceSmoothSpeed) == 0x00001C, "Member 'FAudioWorldizationSettings::WallDistanceSmoothSpeed' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TraceRadius) == 0x000020, "Member 'FAudioWorldizationSettings::TraceRadius' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, CrossfadeTime) == 0x000024, "Member 'FAudioWorldizationSettings::CrossfadeTime' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TracePoints) == 0x000028, "Member 'FAudioWorldizationSettings::TracePoints' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TracesPerFrame) == 0x00002C, "Member 'FAudioWorldizationSettings::TracesPerFrame' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, SideQuadrantDegrees) == 0x000030, "Member 'FAudioWorldizationSettings::SideQuadrantDegrees' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, UpQuadrantDegrees) == 0x000034, "Member 'FAudioWorldizationSettings::UpQuadrantDegrees' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TraceOrigin) == 0x000038, "Member 'FAudioWorldizationSettings::TraceOrigin' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TraceChannel) == 0x000050, "Member 'FAudioWorldizationSettings::TraceChannel' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, ResponseChannels) == 0x000058, "Member 'FAudioWorldizationSettings::ResponseChannels' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TracePolicy) == 0x000068, "Member 'FAudioWorldizationSettings::TracePolicy' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationSettings, TraceDirectionPolicy) == 0x000070, "Member 'FAudioWorldizationSettings::TraceDirectionPolicy' has a wrong offset!");

// ScriptStruct AudioWorldization.AudioWorldizationQuadrantSettings
// 0x0010 (0x0010 - 0x0000)
struct FAudioWorldizationQuadrantSettings final
{
public:
	class USoundControlBus*                       WallDistanceBus;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       EnclosureBus;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAudioWorldizationQuadrantSettings) == 0x000008, "Wrong alignment on FAudioWorldizationQuadrantSettings");
static_assert(sizeof(FAudioWorldizationQuadrantSettings) == 0x000010, "Wrong size on FAudioWorldizationQuadrantSettings");
static_assert(offsetof(FAudioWorldizationQuadrantSettings, WallDistanceBus) == 0x000000, "Member 'FAudioWorldizationQuadrantSettings::WallDistanceBus' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationQuadrantSettings, EnclosureBus) == 0x000008, "Member 'FAudioWorldizationQuadrantSettings::EnclosureBus' has a wrong offset!");

// ScriptStruct AudioWorldization.AudioWorldizationGlobalSettings
// 0x0030 (0x0030 - 0x0000)
struct FAudioWorldizationGlobalSettings final
{
public:
	float                                         EffectCrossfadeTime;                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IgnoreTraceActorTag;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       EnclosureBus;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       WallDistanceBus;                                   // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       ListenerAzimuthBus;                                // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAudioWorldizationQuadrantSettings> Quadrants;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAudioWorldizationGlobalSettings) == 0x000008, "Wrong alignment on FAudioWorldizationGlobalSettings");
static_assert(sizeof(FAudioWorldizationGlobalSettings) == 0x000030, "Wrong size on FAudioWorldizationGlobalSettings");
static_assert(offsetof(FAudioWorldizationGlobalSettings, EffectCrossfadeTime) == 0x000000, "Member 'FAudioWorldizationGlobalSettings::EffectCrossfadeTime' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationGlobalSettings, IgnoreTraceActorTag) == 0x000004, "Member 'FAudioWorldizationGlobalSettings::IgnoreTraceActorTag' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationGlobalSettings, EnclosureBus) == 0x000008, "Member 'FAudioWorldizationGlobalSettings::EnclosureBus' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationGlobalSettings, WallDistanceBus) == 0x000010, "Member 'FAudioWorldizationGlobalSettings::WallDistanceBus' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationGlobalSettings, ListenerAzimuthBus) == 0x000018, "Member 'FAudioWorldizationGlobalSettings::ListenerAzimuthBus' has a wrong offset!");
static_assert(offsetof(FAudioWorldizationGlobalSettings, Quadrants) == 0x000020, "Member 'FAudioWorldizationGlobalSettings::Quadrants' has a wrong offset!");

// ScriptStruct AudioWorldization.AudioSphereTraceResult
// 0x000C (0x000C - 0x0000)
struct FAudioSphereTraceResult final
{
public:
	bool                                          bBlocking;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAudioSphereTraceResult) == 0x000004, "Wrong alignment on FAudioSphereTraceResult");
static_assert(sizeof(FAudioSphereTraceResult) == 0x00000C, "Wrong size on FAudioSphereTraceResult");
static_assert(offsetof(FAudioSphereTraceResult, bBlocking) == 0x000000, "Member 'FAudioSphereTraceResult::bBlocking' has a wrong offset!");
static_assert(offsetof(FAudioSphereTraceResult, Distance) == 0x000004, "Member 'FAudioSphereTraceResult::Distance' has a wrong offset!");

}

