#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioParameterQueryData

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct AudioParameterQueryData.AudioParameterQueryData
// 0x0068 (0x0068 - 0x0000)
struct FAudioParameterQueryData final
{
public:
	struct FGameplayTagQuery                      TagQuery_12_74B441D54446A49EB7F00AAC728B68F0;      // 0x0000(0x0048)(Edit, BlueprintVisible)
	class FName                                   ParameterName_2_0E82F2EF4DD09C9EB9E25D9AD7DB520D;  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundControlBus*                       ControlBus_5_0B33E9404596DE8D58698EA40F70C171;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ControlBusFadeTime_9_E9701E2E4995E4A3C8798FA35536B86E; // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAudioParameterQueryData) == 0x000008, "Wrong alignment on FAudioParameterQueryData");
static_assert(sizeof(FAudioParameterQueryData) == 0x000068, "Wrong size on FAudioParameterQueryData");
static_assert(offsetof(FAudioParameterQueryData, TagQuery_12_74B441D54446A49EB7F00AAC728B68F0) == 0x000000, "Member 'FAudioParameterQueryData::TagQuery_12_74B441D54446A49EB7F00AAC728B68F0' has a wrong offset!");
static_assert(offsetof(FAudioParameterQueryData, ParameterName_2_0E82F2EF4DD09C9EB9E25D9AD7DB520D) == 0x000048, "Member 'FAudioParameterQueryData::ParameterName_2_0E82F2EF4DD09C9EB9E25D9AD7DB520D' has a wrong offset!");
static_assert(offsetof(FAudioParameterQueryData, ControlBus_5_0B33E9404596DE8D58698EA40F70C171) == 0x000050, "Member 'FAudioParameterQueryData::ControlBus_5_0B33E9404596DE8D58698EA40F70C171' has a wrong offset!");
static_assert(offsetof(FAudioParameterQueryData, ControlBusFadeTime_9_E9701E2E4995E4A3C8798FA35536B86E) == 0x000058, "Member 'FAudioParameterQueryData::ControlBusFadeTime_9_E9701E2E4995E4A3C8798FA35536B86E' has a wrong offset!");

}

