#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioFadeOverrideComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AudioFadeOverrideComponent.AudioFadeOverrideComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct AudioFadeOverrideComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioFadeOverrideComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on AudioFadeOverrideComponent_C_ReceiveEndPlay");
static_assert(sizeof(AudioFadeOverrideComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on AudioFadeOverrideComponent_C_ReceiveEndPlay");
static_assert(offsetof(AudioFadeOverrideComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'AudioFadeOverrideComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function AudioFadeOverrideComponent.AudioFadeOverrideComponent_C.On Audio Fade Change Event
// 0x0008 (0x0008 - 0x0000)
struct AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event final
{
public:
	bool                                          bFadeOut;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event) == 0x000004, "Wrong alignment on AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event");
static_assert(sizeof(AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event) == 0x000008, "Wrong size on AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event");
static_assert(offsetof(AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event, bFadeOut) == 0x000000, "Member 'AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event::bFadeOut' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event, FadeTime) == 0x000004, "Member 'AudioFadeOverrideComponent_C_On_Audio_Fade_Change_Event::FadeTime' has a wrong offset!");

// Function AudioFadeOverrideComponent.AudioFadeOverrideComponent_C.ExecuteUbergraph_AudioFadeOverrideComponent
// 0x0030 (0x0030 - 0x0000)
struct AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bFadeOut, float FadeTime)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFadeOut;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_FadeTime;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent) == 0x000008, "Wrong alignment on AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent");
static_assert(sizeof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent) == 0x000030, "Wrong size on AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, EntryPoint) == 0x000000, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, K2Node_CustomEvent_bFadeOut) == 0x000020, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::K2Node_CustomEvent_bFadeOut' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, K2Node_CustomEvent_FadeTime) == 0x000024, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::K2Node_CustomEvent_FadeTime' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent, K2Node_Event_EndPlayReason) == 0x000029, "Member 'AudioFadeOverrideComponent_C_ExecuteUbergraph_AudioFadeOverrideComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

}

