#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoAimWeaponRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AutoAimWeaponRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class AutoAimWeaponRuntime.AutoAimWeaponKismetLibrary
// 0x0000 (0x0028 - 0x0028)
class UAutoAimWeaponKismetLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool DoesAutoAimWeaponHaveLineOfSight(class AFortPawn* SourcePawn, class AFortPawn* TargetPawn);
	static bool DoesAutoAimWeaponReticleIntersectTarget(float* OutReticleDistance, class AFortPawn* SourcePawn, class AFortPawn* TargetPawn, const float ReticleSize);
	static void FindBestAutoAimTarget(class AFortPawn** OutTargetPawn, float* OutReticleDistance, class AFortPlayerPawn* SourcePawn, const float ReticleSize, const float Range);
	static class UAutoAimWeaponPawnComponent* GetAutoAimWeaponPawnComponent(class AFortPawn* SourcePawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoAimWeaponKismetLibrary">();
	}
	static class UAutoAimWeaponKismetLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoAimWeaponKismetLibrary>();
	}
};
static_assert(alignof(UAutoAimWeaponKismetLibrary) == 0x000008, "Wrong alignment on UAutoAimWeaponKismetLibrary");
static_assert(sizeof(UAutoAimWeaponKismetLibrary) == 0x000028, "Wrong size on UAutoAimWeaponKismetLibrary");

// Class AutoAimWeaponRuntime.AutoAimWeaponPawnComponent
// 0x00E0 (0x0188 - 0x00A8)
class UAutoAimWeaponPawnComponent final : public UFortPawnComponent
{
public:
	struct FGameplayTagContainer                  UseSingleLocationTargetingPawnTags;                // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  LowPriorityTargetPawnTags;                         // 0x00C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FAutoAimWeaponBoneSegmentData>  MultiSocketTargetingBoneSegmentDatas;              // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         LockOnTimeReticleCenter;                           // 0x00F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         LockOnTimeReticleEdge;                             // 0x0120(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxLockOns;                                        // 0x0148(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         ProgressTowardNextLockOn;                          // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentLockOnCount;                                // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetToReticleDistanceNormalized;                 // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPawn>               LockOnTarget;                                      // 0x017C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetCurrentLockOnCount() const;
	float GetLockOnProgress() const;
	bool GetLockOnTargetLocation(struct FVector* OutLockTargetLocation) const;
	float GetTargetToReticleDistanceNormalized() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoAimWeaponPawnComponent">();
	}
	static class UAutoAimWeaponPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoAimWeaponPawnComponent>();
	}
};
static_assert(alignof(UAutoAimWeaponPawnComponent) == 0x000008, "Wrong alignment on UAutoAimWeaponPawnComponent");
static_assert(sizeof(UAutoAimWeaponPawnComponent) == 0x000188, "Wrong size on UAutoAimWeaponPawnComponent");
static_assert(offsetof(UAutoAimWeaponPawnComponent, UseSingleLocationTargetingPawnTags) == 0x0000A8, "Member 'UAutoAimWeaponPawnComponent::UseSingleLocationTargetingPawnTags' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, LowPriorityTargetPawnTags) == 0x0000C8, "Member 'UAutoAimWeaponPawnComponent::LowPriorityTargetPawnTags' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, MultiSocketTargetingBoneSegmentDatas) == 0x0000E8, "Member 'UAutoAimWeaponPawnComponent::MultiSocketTargetingBoneSegmentDatas' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, LockOnTimeReticleCenter) == 0x0000F8, "Member 'UAutoAimWeaponPawnComponent::LockOnTimeReticleCenter' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, LockOnTimeReticleEdge) == 0x000120, "Member 'UAutoAimWeaponPawnComponent::LockOnTimeReticleEdge' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, MaxLockOns) == 0x000148, "Member 'UAutoAimWeaponPawnComponent::MaxLockOns' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, ProgressTowardNextLockOn) == 0x000170, "Member 'UAutoAimWeaponPawnComponent::ProgressTowardNextLockOn' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, CurrentLockOnCount) == 0x000174, "Member 'UAutoAimWeaponPawnComponent::CurrentLockOnCount' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, TargetToReticleDistanceNormalized) == 0x000178, "Member 'UAutoAimWeaponPawnComponent::TargetToReticleDistanceNormalized' has a wrong offset!");
static_assert(offsetof(UAutoAimWeaponPawnComponent, LockOnTarget) == 0x00017C, "Member 'UAutoAimWeaponPawnComponent::LockOnTarget' has a wrong offset!");

}

