#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Zipline_Ascender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AscenderCodeRuntime_classes.hpp"
#include "AudioExtensions_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Zipline_Ascender.B_Athena_Zipline_Ascender_C
// 0x01A0 (0x1190 - 0x0FF0)
class AB_Athena_Zipline_Ascender_C final : public AFortAscenderZipline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioParameterComponent*               AudioParameter;                                    // 0x0FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x1000(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ascender_End_Cap;                                  // 0x1008(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PoleMotorSFX;                                      // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HandleVFX;                                         // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PoleMotorVFX;                                      // 0x1020(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HandleAscendingSFX;                                // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HandleDescendingSFX;                               // 0x1030(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       HandleInteractVolume;                              // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle;                                            // 0x1040(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Top;                                               // 0x1048(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Hotfix;                                            // 0x1050(0x0028)(Edit, BlueprintVisible)
	class USoundBase*                             StartHandleSound;                                  // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StopHandleSound;                                   // 0x1080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StopPoleMotorSoundSkid;                            // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SplineMeshMaterialOverride;                        // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         AscendingHandleVFX;                                // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DescendingHandleVFX;                               // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SplineThickenMeshMaterialOverride;                 // 0x10A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        MaxWobbleAnimationLength;                          // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastWobbleActivationTime;                          // 0x10B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TilingDivisor;                                     // 0x10C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HandleAnimOffset;                                  // 0x10C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SlideAnimOffset;                                   // 0x10E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PlayerGrabBeginDecentSound;                        // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HandleStart;                                       // 0x1100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndCapRelativeScale;                               // 0x1108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 StructureDamageGE;                                 // 0x1120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AudioVisualizerHandle;                             // 0x1128(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerPawn*>                PlayersOnAscender;                                 // 0x1130(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class USoundBase*                             TravelSound;                                       // 0x1140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPlayWhoosh;                                  // 0x1148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1149[0x7];                                     // 0x1149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             AscendWhooshSound;                                 // 0x1150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x1158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WhooshHandle;                                      // 0x1160(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LinkToDestroyedGC;                                 // 0x1168(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BeDestroy;                                         // 0x116C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116D[0x3];                                     // 0x116D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerStateUsingHandleComponent;                   // 0x1170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAudioParameter>                AudioParameters;                                   // 0x1178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioParameterComponent*               ParameterComponent;                                // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateCableWobble();
	void AttachCapToEndOfSplineMesh();
	void BP_HandlePlayerStartedUsingHandle(class AFortPlayerPawn* Player);
	void BP_HandlePlayerStoppedUsingHandle(class AFortPlayerPawn* Player);
	void BP_HandleStartedLoweringCable();
	void BP_HandleStartedLoweringHandle();
	void BP_HandleStoppedLoweringCable();
	void BP_HandleStoppedLoweringHandle();
	void BP_HandleUpdatedLoweringCable();
	void CalculateLaunchVelocity(class AActor* PlayerPawn_0, struct FVector* LaunchVelocity);
	void DeactivateCableWobble();
	void ExecuteUbergraph_B_Athena_Zipline_Ascender(int32 EntryPoint);
	void GetDynamicDestructionStaticMeshComponents(TArray<class UStaticMeshComponent*>* OutFullFXStaticMeshComponents, TArray<class UStaticMeshComponent*>* OutVisibilityOnlyStaticMeshComponents, TArray<class UStaticMeshComponent*>* OutShadowProxyStaticMeshComponents);
	int32 GetLastSplinePointIndex();
	void HandleLinkedActorDestroyed(class AActor* DamageCauser);
	void HotfixEnabled();
	void OnAscenderSetupComplete_Event();
	void OnReady_93837FC44A18F6AE57D3478CC43A98AB(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRep_BeDestroy();
	void OnZipliningStarted(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent);
	void OnZipliningStopped(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent, float ZiplineUsageDuration);
	void PlayerDescendingStarted(class AFortPlayerPawn* Sliding_Player);
	void ReceiveBeginPlay();
	void SetCableTilingBySplineLength();
	void ShouldPlayWhooshTimer();
	void UserConstructionScript();

	void ApplyStructureDamage(class ABuildingSMActor* BuildingActor, class AActor* DamageSource) const;
	bool AttemptOverrideZiplineSocketOffset(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent, const struct FVector& BaseSocketOffset, struct FVector* OutSocketOffset) const;
	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool CanBeginZiplining(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent) const;
	TArray<EFortTeamAffiliation> GetAffiliationsToShowFor() const;
	void GetBoundsComponents(const class AActor* SelfActor, TArray<class USceneComponent*>* OutComponents) const;
	EDynamicDestructionResourceType GetDynamicDestructionResourceType() const;
	class UPrimitiveComponent* GetHandleComponent() const;
	class UPrimitiveComponent* GetInteractComponentOverride(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent) const;
	class UPrimitiveComponent* GetTopComponent() const;
	void LocalOnFailedInteract(const class AFortPlayerPawn* InteractingPawn) const;
	bool PawnIsInHandleRange(class AFortPawn* Pawn) const;
	bool ShouldShowSoundIndicator(class AFortPlayerController* PlayerController) const;
	bool ShouldUseDynamicDestructionMaterial() const;
	bool ShouldUseDynamicDestructionNiagaraSystem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Zipline_Ascender_C">();
	}
	static class AB_Athena_Zipline_Ascender_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Zipline_Ascender_C>();
	}
};
static_assert(alignof(AB_Athena_Zipline_Ascender_C) == 0x000008, "Wrong alignment on AB_Athena_Zipline_Ascender_C");
static_assert(sizeof(AB_Athena_Zipline_Ascender_C) == 0x001190, "Wrong size on AB_Athena_Zipline_Ascender_C");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, UberGraphFrame) == 0x000FF0, "Member 'AB_Athena_Zipline_Ascender_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, AudioParameter) == 0x000FF8, "Member 'AB_Athena_Zipline_Ascender_C::AudioParameter' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, Capsule) == 0x001000, "Member 'AB_Athena_Zipline_Ascender_C::Capsule' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, Ascender_End_Cap) == 0x001008, "Member 'AB_Athena_Zipline_Ascender_C::Ascender_End_Cap' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, PoleMotorSFX) == 0x001010, "Member 'AB_Athena_Zipline_Ascender_C::PoleMotorSFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, HandleVFX) == 0x001018, "Member 'AB_Athena_Zipline_Ascender_C::HandleVFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, PoleMotorVFX) == 0x001020, "Member 'AB_Athena_Zipline_Ascender_C::PoleMotorVFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, HandleAscendingSFX) == 0x001028, "Member 'AB_Athena_Zipline_Ascender_C::HandleAscendingSFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, HandleDescendingSFX) == 0x001030, "Member 'AB_Athena_Zipline_Ascender_C::HandleDescendingSFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, HandleInteractVolume) == 0x001038, "Member 'AB_Athena_Zipline_Ascender_C::HandleInteractVolume' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, Handle) == 0x001040, "Member 'AB_Athena_Zipline_Ascender_C::Handle' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, Top) == 0x001048, "Member 'AB_Athena_Zipline_Ascender_C::Top' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, Hotfix) == 0x001050, "Member 'AB_Athena_Zipline_Ascender_C::Hotfix' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, StartHandleSound) == 0x001078, "Member 'AB_Athena_Zipline_Ascender_C::StartHandleSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, StopHandleSound) == 0x001080, "Member 'AB_Athena_Zipline_Ascender_C::StopHandleSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, StopPoleMotorSoundSkid) == 0x001088, "Member 'AB_Athena_Zipline_Ascender_C::StopPoleMotorSoundSkid' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, SplineMeshMaterialOverride) == 0x001090, "Member 'AB_Athena_Zipline_Ascender_C::SplineMeshMaterialOverride' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, AscendingHandleVFX) == 0x001098, "Member 'AB_Athena_Zipline_Ascender_C::AscendingHandleVFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, DescendingHandleVFX) == 0x0010A0, "Member 'AB_Athena_Zipline_Ascender_C::DescendingHandleVFX' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, SplineThickenMeshMaterialOverride) == 0x0010A8, "Member 'AB_Athena_Zipline_Ascender_C::SplineThickenMeshMaterialOverride' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, MaxWobbleAnimationLength) == 0x0010B0, "Member 'AB_Athena_Zipline_Ascender_C::MaxWobbleAnimationLength' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, LastWobbleActivationTime) == 0x0010B8, "Member 'AB_Athena_Zipline_Ascender_C::LastWobbleActivationTime' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, TilingDivisor) == 0x0010C0, "Member 'AB_Athena_Zipline_Ascender_C::TilingDivisor' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, HandleAnimOffset) == 0x0010C8, "Member 'AB_Athena_Zipline_Ascender_C::HandleAnimOffset' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, SlideAnimOffset) == 0x0010E0, "Member 'AB_Athena_Zipline_Ascender_C::SlideAnimOffset' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, PlayerGrabBeginDecentSound) == 0x0010F8, "Member 'AB_Athena_Zipline_Ascender_C::PlayerGrabBeginDecentSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, HandleStart) == 0x001100, "Member 'AB_Athena_Zipline_Ascender_C::HandleStart' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, EndCapRelativeScale) == 0x001108, "Member 'AB_Athena_Zipline_Ascender_C::EndCapRelativeScale' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, StructureDamageGE) == 0x001120, "Member 'AB_Athena_Zipline_Ascender_C::StructureDamageGE' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, AudioVisualizerHandle) == 0x001128, "Member 'AB_Athena_Zipline_Ascender_C::AudioVisualizerHandle' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, PlayersOnAscender) == 0x001130, "Member 'AB_Athena_Zipline_Ascender_C::PlayersOnAscender' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, TravelSound) == 0x001140, "Member 'AB_Athena_Zipline_Ascender_C::TravelSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, ShouldPlayWhoosh) == 0x001148, "Member 'AB_Athena_Zipline_Ascender_C::ShouldPlayWhoosh' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, AscendWhooshSound) == 0x001150, "Member 'AB_Athena_Zipline_Ascender_C::AscendWhooshSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, PlayerPawn) == 0x001158, "Member 'AB_Athena_Zipline_Ascender_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, WhooshHandle) == 0x001160, "Member 'AB_Athena_Zipline_Ascender_C::WhooshHandle' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, LinkToDestroyedGC) == 0x001168, "Member 'AB_Athena_Zipline_Ascender_C::LinkToDestroyedGC' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, BeDestroy) == 0x00116C, "Member 'AB_Athena_Zipline_Ascender_C::BeDestroy' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, PlayerStateUsingHandleComponent) == 0x001170, "Member 'AB_Athena_Zipline_Ascender_C::PlayerStateUsingHandleComponent' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, AudioParameters) == 0x001178, "Member 'AB_Athena_Zipline_Ascender_C::AudioParameters' has a wrong offset!");
static_assert(offsetof(AB_Athena_Zipline_Ascender_C, ParameterComponent) == 0x001188, "Member 'AB_Athena_Zipline_Ascender_C::ParameterComponent' has a wrong offset!");

}

