#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CreatureAnimSoundLibraryContext

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SoundLibrary_structs.hpp"


namespace SDK::Params
{

// Function B_CreatureAnimSoundLibraryContext.B_CreatureAnimSoundLibraryContext_C.Play
// 0x0138 (0x0138 - 0x0000)
struct B_CreatureAnimSoundLibraryContext_C_Play final
{
public:
	struct FSoundLibraryContextEventInput         InEventData;                                       // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UAudioComponent*>                OutComponents;                                     // 0x0038(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditor_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Wildlife_Parent_C*            K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue; // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetConverterPawn_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput;          // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput_1;        // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1;       // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreatureAnimSoundLibraryContext_C_Play) == 0x000008, "Wrong alignment on B_CreatureAnimSoundLibraryContext_C_Play");
static_assert(sizeof(B_CreatureAnimSoundLibraryContext_C_Play) == 0x000138, "Wrong size on B_CreatureAnimSoundLibraryContext_C_Play");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, InEventData) == 0x000000, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::InEventData' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, OutComponents) == 0x000038, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::OutComponents' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, ReturnValue) == 0x000048, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_InEditor_ReturnValue) == 0x000049, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_InEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_MatchesTag_ReturnValue) == 0x00004A, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, Temp_real_Variable) == 0x000058, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, Temp_real_Variable_1) == 0x000060, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, Temp_byte_Variable) == 0x000068, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent) == 0x000070, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue) == 0x000079, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_IsValid_ReturnValue) == 0x00007B, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_GetConverterPawn_ReturnValue) == 0x000080, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_GetConverterPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_IsLocallyControlled_ReturnValue) == 0x000089, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000090, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, K2Node_Select_Default) == 0x000098, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000A0, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, K2Node_MakeArray_Array) == 0x0000B0, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SetFloatParameter_self_CastInput) == 0x0000C0, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SetBoolParameter_self_CastInput) == 0x0000D0, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SetBoolParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SetBoolParameter_self_CastInput_1) == 0x0000E0, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SetBoolParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_GetMovementComponent_ReturnValue) == 0x0000F0, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000F8, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_VSize2D_ReturnValue) == 0x000108, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_MapRangeClamped_ReturnValue) == 0x000110, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000118, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast) == 0x000128, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x00012C, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_Play, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x000130, "Member 'B_CreatureAnimSoundLibraryContext_C_Play::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");

}

