#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_WilliePete

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_HidingProp_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HidingProp_WilliePete.B_HidingProp_WilliePete_C
// 0x0240 (0x13F0 - 0x11B0)
class AB_HidingProp_WilliePete_C final : public AB_HidingProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_HidingProp_WilliePete_C;          // 0x11B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   overlapCylinder;                                   // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        WilliePete_Ambient_Loop;                           // 0x11C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geyser;                                            // 0x11C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Whirlpool_01;                                    // 0x11D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_WilliePete_SurfaceVerticalSplash;                // 0x11D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       OverlappedFortProjectileMovementComponent;         // 0x11E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           OverlappedStandardProjectileMovementComponent;     // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TeleportingNonPawn;                                // 0x11F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             SphereOverlapResult;                               // 0x11F8(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        ProjectileSpeedCeiling;                            // 0x12E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ProjectileExitFVectorRotation;                     // 0x12E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         WaterLevel;                                        // 0x1300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Exit;                                           // 0x1304(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Enter;                                          // 0x1308(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_130C[0x4];                                     // 0x130C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnabledValue;                                      // 0x1310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchHeightValue;                                 // 0x1338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawnAthena*                  LaunchPawn;                                        // 0x1360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            LaunchGrantedEffectHandle;                         // 0x1368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_Quest;                                           // 0x1370(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SpawnedWaterBody;                                  // 0x1390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_ScreenFX;                                       // 0x1398(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          isOnTestMap;                                       // 0x139C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139D[0x3];                                     // 0x139D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Launch_Sound;                                      // 0x13A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustedLocation;                                  // 0x13A8(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          skipAnimForLaunch;                                 // 0x13C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C1[0x7];                                     // 0x13C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  ExitingPawn;                                       // 0x13C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMovementComponent*                     OverlappedMovementComponent;                       // 0x13D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ProjectileSpeedMult;                               // 0x13D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PickupSpeedMult;                                   // 0x13E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetSilentDie;                                     // 0x13E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetSpawnedWaterBody;                              // 0x13E9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Complete_Setup();
	void ExecuteUbergraph_B_HidingProp_WilliePete(int32 EntryPoint);
	void HelperLocationLogger(const class FString& InString);
	void Non_Pawn_Actor_Destroyed(class AActor* DestroyedActor);
	void Non_Pawn_Teleport(class AActor* TeleportingActor);
	void OnReady_74044DD44988556292500EB8F289359F(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRep_AdjustedLocation();
	void OnRep_bSetSilentDie();
	void OnRep_bSetSpawnedWaterBody();
	void ReceiveBeginPlay();
	void Remove_GE();
	void ResetGravity(const struct FHitResult& Hit);
	void StopHiding(const class AFortPawn* Pawn_0);
	void TeleportExitSpeed(const struct FVector& ExitFVector, double EnterSpeed, double OverrideSpeed, double MinimumSpeed, bool ForceSpeedOverride, struct FVector* TeleportExitVelocity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HidingProp_WilliePete_C">();
	}
	static class AB_HidingProp_WilliePete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HidingProp_WilliePete_C>();
	}
};
static_assert(alignof(AB_HidingProp_WilliePete_C) == 0x000008, "Wrong alignment on AB_HidingProp_WilliePete_C");
static_assert(sizeof(AB_HidingProp_WilliePete_C) == 0x0013F0, "Wrong size on AB_HidingProp_WilliePete_C");
static_assert(offsetof(AB_HidingProp_WilliePete_C, UberGraphFrame_B_HidingProp_WilliePete_C) == 0x0011B0, "Member 'AB_HidingProp_WilliePete_C::UberGraphFrame_B_HidingProp_WilliePete_C' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, overlapCylinder) == 0x0011B8, "Member 'AB_HidingProp_WilliePete_C::overlapCylinder' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, WilliePete_Ambient_Loop) == 0x0011C0, "Member 'AB_HidingProp_WilliePete_C::WilliePete_Ambient_Loop' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, Geyser) == 0x0011C8, "Member 'AB_HidingProp_WilliePete_C::Geyser' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, S_Whirlpool_01) == 0x0011D0, "Member 'AB_HidingProp_WilliePete_C::S_Whirlpool_01' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, P_WilliePete_SurfaceVerticalSplash) == 0x0011D8, "Member 'AB_HidingProp_WilliePete_C::P_WilliePete_SurfaceVerticalSplash' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, OverlappedFortProjectileMovementComponent) == 0x0011E0, "Member 'AB_HidingProp_WilliePete_C::OverlappedFortProjectileMovementComponent' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, OverlappedStandardProjectileMovementComponent) == 0x0011E8, "Member 'AB_HidingProp_WilliePete_C::OverlappedStandardProjectileMovementComponent' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, TeleportingNonPawn) == 0x0011F0, "Member 'AB_HidingProp_WilliePete_C::TeleportingNonPawn' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, SphereOverlapResult) == 0x0011F8, "Member 'AB_HidingProp_WilliePete_C::SphereOverlapResult' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, ProjectileSpeedCeiling) == 0x0012E0, "Member 'AB_HidingProp_WilliePete_C::ProjectileSpeedCeiling' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, ProjectileExitFVectorRotation) == 0x0012E8, "Member 'AB_HidingProp_WilliePete_C::ProjectileExitFVectorRotation' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, WaterLevel) == 0x001300, "Member 'AB_HidingProp_WilliePete_C::WaterLevel' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, GC_Exit) == 0x001304, "Member 'AB_HidingProp_WilliePete_C::GC_Exit' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, GC_Enter) == 0x001308, "Member 'AB_HidingProp_WilliePete_C::GC_Enter' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, EnabledValue) == 0x001310, "Member 'AB_HidingProp_WilliePete_C::EnabledValue' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, LaunchHeightValue) == 0x001338, "Member 'AB_HidingProp_WilliePete_C::LaunchHeightValue' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, LaunchPawn) == 0x001360, "Member 'AB_HidingProp_WilliePete_C::LaunchPawn' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, LaunchGrantedEffectHandle) == 0x001368, "Member 'AB_HidingProp_WilliePete_C::LaunchGrantedEffectHandle' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, T_Quest) == 0x001370, "Member 'AB_HidingProp_WilliePete_C::T_Quest' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, SpawnedWaterBody) == 0x001390, "Member 'AB_HidingProp_WilliePete_C::SpawnedWaterBody' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, GC_ScreenFX) == 0x001398, "Member 'AB_HidingProp_WilliePete_C::GC_ScreenFX' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, isOnTestMap) == 0x00139C, "Member 'AB_HidingProp_WilliePete_C::isOnTestMap' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, Launch_Sound) == 0x0013A0, "Member 'AB_HidingProp_WilliePete_C::Launch_Sound' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, AdjustedLocation) == 0x0013A8, "Member 'AB_HidingProp_WilliePete_C::AdjustedLocation' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, skipAnimForLaunch) == 0x0013C0, "Member 'AB_HidingProp_WilliePete_C::skipAnimForLaunch' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, ExitingPawn) == 0x0013C8, "Member 'AB_HidingProp_WilliePete_C::ExitingPawn' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, OverlappedMovementComponent) == 0x0013D0, "Member 'AB_HidingProp_WilliePete_C::OverlappedMovementComponent' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, ProjectileSpeedMult) == 0x0013D8, "Member 'AB_HidingProp_WilliePete_C::ProjectileSpeedMult' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, PickupSpeedMult) == 0x0013E0, "Member 'AB_HidingProp_WilliePete_C::PickupSpeedMult' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, bSetSilentDie) == 0x0013E8, "Member 'AB_HidingProp_WilliePete_C::bSetSilentDie' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_WilliePete_C, bSetSpawnedWaterBody) == 0x0013E9, "Member 'AB_HidingProp_WilliePete_C::bSetSpawnedWaterBody' has a wrong offset!");

}

