#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_WilliePete

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_HidingProp_WilliePete.B_HidingProp_WilliePete_C.BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_HidingProp_WilliePete.B_HidingProp_WilliePete_C.ExecuteUbergraph_B_HidingProp_WilliePete
// 0x0D40 (0x0D40 - 0x0000)
struct B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TeleportingActor;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> K2Node_DynamicCast_AsFort_Projectile_Movement_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortProjectileMovementComponent*       CallFunc_GetFortProjectileMovementComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMovementComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x01F8(0x00D0)(ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X_3;                          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0358(0x00D0)(ContainsInstancedReference)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0430(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x04F0(0x0020)()
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x0538(0x00D0)(ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_1;      // 0x0618(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A[0x2];                                      // 0x063A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x063C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0650(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0660(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66D[0x3];                                      // 0x066D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0670(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0758(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0769(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76A[0x6];                                      // 0x076A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x078A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78B[0x5];                                      // 0x078B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0790(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0798(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTethered_ReturnValue;                   // 0x07A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AA[0x6];                                      // 0x07AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x07C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_4;                          // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0800(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0838(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0850(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleForwardVector_ReturnValue;      // 0x0858(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0870(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x0888(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x08A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue;      // 0x08B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x08E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E8[0x8];                                      // 0x08E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x08F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPawn*                        K2Node_Event_Pawn;                                 // 0x0950(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0960(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_969[0x7];                                      // 0x0969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0970(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0978(0x00B0)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0A29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0A2A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2B[0x5];                                      // 0x0A2B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0A30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0A40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0A48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0A50(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A71[0x7];                                      // 0x0A71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0A78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0A80(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0A88(0x0020)(ConstParm)
	class UFortProjectileMovementComponent*       Temp_object_Variable_2;                            // 0x0AA8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0AB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0AB2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0AB3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB4[0x4];                                      // 0x0AB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0AB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0AD0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ADC[0x4];                                      // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0AE0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0BC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0BF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0C10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0C30(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0C48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0C58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0C60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0C68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C74[0x4];                                      // 0x0C74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0C78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0C90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0CA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0CC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanBaseHeight_ReturnValue;           // 0x0CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0CD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE1[0x7];                                      // 0x0CE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0CE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x0CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFC[0x4];                                      // 0x0CFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x0D00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0D08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete) == 0x000010, "Wrong alignment on B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete");
static_assert(sizeof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete) == 0x000D40, "Wrong size on B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, EntryPoint) == 0x000000, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CustomEvent_DestroyedActor) == 0x000018, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CustomEvent_TeleportingActor) == 0x000020, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CustomEvent_TeleportingActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_AsFort_Projectile_Movement_Interface) == 0x000028, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_AsFort_Projectile_Movement_Interface' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortProjectileMovementComponent_ReturnValue) == 0x000040, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortProjectileMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000050, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000059, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_2) == 0x00005A, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasAuthority_ReturnValue) == 0x00005B, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00005C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000078, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X) == 0x000160, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y) == 0x000168, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z) == 0x000170, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000178, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000180, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_1) == 0x000198, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_1) == 0x0001A0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_1) == 0x0001A8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetForwardVector_ReturnValue) == 0x0001B0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_2) == 0x0001C8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_2) == 0x0001D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_2) == 0x0001D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetForwardVector_ReturnValue_1) == 0x0001E0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0001F8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_3) == 0x0002C8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_3) == 0x0002D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_3) == 0x0002D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_3) == 0x0002E0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RowToBool_ReturnValue) == 0x0002E1, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002E8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetActorUpVector_ReturnValue) == 0x0002F0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasAuthority_ReturnValue_1) == 0x000308, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetValueAtLevel_ReturnValue) == 0x00030C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000310, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000318, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000330, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000338, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x000340, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue_2) == 0x000348, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000350, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000358, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetTransform_ReturnValue) == 0x000430, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Location) == 0x000490, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Rotation) == 0x0004A8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Scale) == 0x0004C0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0004D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x0004F0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000510, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetQuestManager_ReturnValue) == 0x000518, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000520, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue_2) == 0x000538, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000608, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000610, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetOwnedGameplayTags_TagContainer_1) == 0x000618, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetOwnedGameplayTags_TagContainer_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, Temp_bool_Variable) == 0x000638, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_4) == 0x000639, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CreateDelegate_OutputDelegate_1) == 0x00063C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_5) == 0x000648, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000650, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
