#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Default

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Pickups_Default.B_Pickups_Default_C.AddRareFX
// 0x0100 (0x0100 - 0x0000)
struct B_Pickups_Default_C_AddRareFX final
{
public:
	int32                                         CallFunc_GetViewDistanceQuality_ReturnValue;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x00F4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_AddRareFX) == 0x000010, "Wrong alignment on B_Pickups_Default_C_AddRareFX");
static_assert(sizeof(B_Pickups_Default_C_AddRareFX) == 0x000100, "Wrong size on B_Pickups_Default_C_AddRareFX");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_GetViewDistanceQuality_ReturnValue) == 0x000000, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_GetViewDistanceQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Fraction_ReturnValue) == 0x000010, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'B_Pickups_Default_C_AddRareFX::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, Temp_int_Array_Index_Variable) == 0x000044, "Member 'B_Pickups_Default_C_AddRareFX::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Array_Get_Item) == 0x000048, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, Temp_struct_Variable) == 0x000060, "Member 'B_Pickups_Default_C_AddRareFX::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000C0, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_AddComponent_ReturnValue) == 0x0000C8, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000D1, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_IsValid_ReturnValue) == 0x0000D2, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000D8, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000F0, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_AddRareFX, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x0000F4, "Member 'B_Pickups_Default_C_AddRareFX::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.ExecuteUbergraph_B_Pickups_Default
// 0x00E0 (0x00E0 - 0x0000)
struct B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPickupRarityMID_bNeedsToBeInitialized; // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetPickupRarityMID_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bg_5;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bgdark;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_gun;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bg_4;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bg_3;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bg_2;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bg_1;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_bg;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_1; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_2; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_3; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_4; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_5; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_6; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_7; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default) == 0x000008, "Wrong alignment on B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default");
static_assert(sizeof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default) == 0x0000E0, "Wrong size on B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, EntryPoint) == 0x000000, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000028, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000030, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000038, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000050, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000058, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_Event_PickupTarget) == 0x000060, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_Event_PickupTarget' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000069, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00006A, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_IsValid_ReturnValue_1) == 0x00006B, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_GetPickupRarityMID_bNeedsToBeInitialized) == 0x00006C, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_GetPickupRarityMID_bNeedsToBeInitialized' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_GetPickupRarityMID_ReturnValue) == 0x000070, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_GetPickupRarityMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bg_5) == 0x000078, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bg_5' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bgdark) == 0x000080, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bgdark' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_gun) == 0x000088, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_gun' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bg_4) == 0x000090, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bg_4' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bg_3) == 0x000098, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bg_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bg_2) == 0x0000A0, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bg_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bg_1) == 0x0000A8, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bg_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, K2Node_CustomEvent_bg) == 0x0000B0, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::K2Node_CustomEvent_bg' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_Not_PreBool_ReturnValue) == 0x0000B8, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast) == 0x0000BC, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_1) == 0x0000C0, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_2) == 0x0000C4, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_3) == 0x0000C8, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_4) == 0x0000CC, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_5) == 0x0000D0, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_6) == 0x0000D4, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_7) == 0x0000D8, "Member 'B_Pickups_Default_C_ExecuteUbergraph_B_Pickups_Default::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast_7' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.initializeSpotlightComponent
// 0x0090 (0x0090 - 0x0000)
struct B_Pickups_Default_C_initializeSpotlightComponent final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    CallFunc_AddComponent_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_initializeSpotlightComponent) == 0x000010, "Wrong alignment on B_Pickups_Default_C_initializeSpotlightComponent");
static_assert(sizeof(B_Pickups_Default_C_initializeSpotlightComponent) == 0x000090, "Wrong size on B_Pickups_Default_C_initializeSpotlightComponent");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, Temp_int_Variable) == 0x000000, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000004, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_InEditorOrPIE_ReturnValue) == 0x000009, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, Temp_struct_Variable) == 0x000010, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_GetGameUserSettings_ReturnValue) == 0x000070, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_AddComponent_ReturnValue) == 0x000078, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000080, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_IsMobilePlatform_ReturnValue) == 0x000084, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x000088, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_Not_PreBool_ReturnValue) == 0x00008C, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00008D, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_initializeSpotlightComponent, CallFunc_BooleanAND_ReturnValue) == 0x00008E, "Member 'B_Pickups_Default_C_initializeSpotlightComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.OnPickedUp
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Default_C_OnPickedUp final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_OnPickedUp) == 0x000008, "Wrong alignment on B_Pickups_Default_C_OnPickedUp");
static_assert(sizeof(B_Pickups_Default_C_OnPickedUp) == 0x000008, "Wrong size on B_Pickups_Default_C_OnPickedUp");
static_assert(offsetof(B_Pickups_Default_C_OnPickedUp, PickupTarget) == 0x000000, "Member 'B_Pickups_Default_C_OnPickedUp::PickupTarget' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.Set Initial BKGD Param
// 0x0038 (0x0038 - 0x0000)
struct B_Pickups_Default_C_Set_Initial_BKGD_Param final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_Set_Initial_BKGD_Param) == 0x000008, "Wrong alignment on B_Pickups_Default_C_Set_Initial_BKGD_Param");
static_assert(sizeof(B_Pickups_Default_C_Set_Initial_BKGD_Param) == 0x000038, "Wrong size on B_Pickups_Default_C_Set_Initial_BKGD_Param");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, Mid) == 0x000000, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::Mid' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000009, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000A, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00000B, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000030, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Set_Initial_BKGD_Param, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000034, "Member 'B_Pickups_Default_C_Set_Initial_BKGD_Param::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.setDrawDistances
// 0x0018 (0x0018 - 0x0000)
struct B_Pickups_Default_C_setDrawDistances final
{
public:
	double                                        BG_0;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        bgdark;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        gun;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_setDrawDistances) == 0x000008, "Wrong alignment on B_Pickups_Default_C_setDrawDistances");
static_assert(sizeof(B_Pickups_Default_C_setDrawDistances) == 0x000018, "Wrong size on B_Pickups_Default_C_setDrawDistances");
static_assert(offsetof(B_Pickups_Default_C_setDrawDistances, BG_0) == 0x000000, "Member 'B_Pickups_Default_C_setDrawDistances::BG_0' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_setDrawDistances, bgdark) == 0x000008, "Member 'B_Pickups_Default_C_setDrawDistances::bgdark' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_setDrawDistances, gun) == 0x000010, "Member 'B_Pickups_Default_C_setDrawDistances::gun' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.setMaxDraw_BG
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Default_C_setMaxDraw_BG final
{
public:
	double                                        BG_0;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_setMaxDraw_BG) == 0x000008, "Wrong alignment on B_Pickups_Default_C_setMaxDraw_BG");
static_assert(sizeof(B_Pickups_Default_C_setMaxDraw_BG) == 0x000008, "Wrong size on B_Pickups_Default_C_setMaxDraw_BG");
static_assert(offsetof(B_Pickups_Default_C_setMaxDraw_BG, BG_0) == 0x000000, "Member 'B_Pickups_Default_C_setMaxDraw_BG::BG_0' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.setMaxDraw_BGDark
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Default_C_setMaxDraw_BGDark final
{
public:
	double                                        BG_0;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_setMaxDraw_BGDark) == 0x000008, "Wrong alignment on B_Pickups_Default_C_setMaxDraw_BGDark");
static_assert(sizeof(B_Pickups_Default_C_setMaxDraw_BGDark) == 0x000008, "Wrong size on B_Pickups_Default_C_setMaxDraw_BGDark");
static_assert(offsetof(B_Pickups_Default_C_setMaxDraw_BGDark, BG_0) == 0x000000, "Member 'B_Pickups_Default_C_setMaxDraw_BGDark::BG_0' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.setMaxDraw_Gun
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Default_C_setMaxDraw_Gun final
{
public:
	double                                        BG_0;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_setMaxDraw_Gun) == 0x000008, "Wrong alignment on B_Pickups_Default_C_setMaxDraw_Gun");
static_assert(sizeof(B_Pickups_Default_C_setMaxDraw_Gun) == 0x000008, "Wrong size on B_Pickups_Default_C_setMaxDraw_Gun");
static_assert(offsetof(B_Pickups_Default_C_setMaxDraw_Gun, BG_0) == 0x000000, "Member 'B_Pickups_Default_C_setMaxDraw_Gun::BG_0' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.setMaxDraw_RareFX
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Default_C_setMaxDraw_RareFX final
{
public:
	double                                        BG_0;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_setMaxDraw_RareFX) == 0x000008, "Wrong alignment on B_Pickups_Default_C_setMaxDraw_RareFX");
static_assert(sizeof(B_Pickups_Default_C_setMaxDraw_RareFX) == 0x000008, "Wrong size on B_Pickups_Default_C_setMaxDraw_RareFX");
static_assert(offsetof(B_Pickups_Default_C_setMaxDraw_RareFX, BG_0) == 0x000000, "Member 'B_Pickups_Default_C_setMaxDraw_RareFX::BG_0' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.setMaxDraw_RareMesh
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Default_C_setMaxDraw_RareMesh final
{
public:
	double                                        BG_0;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_setMaxDraw_RareMesh) == 0x000008, "Wrong alignment on B_Pickups_Default_C_setMaxDraw_RareMesh");
static_assert(sizeof(B_Pickups_Default_C_setMaxDraw_RareMesh) == 0x000008, "Wrong size on B_Pickups_Default_C_setMaxDraw_RareMesh");
static_assert(offsetof(B_Pickups_Default_C_setMaxDraw_RareMesh, BG_0) == 0x000000, "Member 'B_Pickups_Default_C_setMaxDraw_RareMesh::BG_0' has a wrong offset!");

// Function B_Pickups_Default.B_Pickups_Default_C.Setup View Distances
// 0x0098 (0x0098 - 0x0000)
struct B_Pickups_Default_C_Setup_View_Distances final
{
public:
	int32                                         viewDistanceQuality;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         l_viewQuality;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_9;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_10;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_11;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_12;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_13;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_14;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Setup_View_Distances_viewDistanceQuality; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Default_C_Setup_View_Distances) == 0x000008, "Wrong alignment on B_Pickups_Default_C_Setup_View_Distances");
static_assert(sizeof(B_Pickups_Default_C_Setup_View_Distances) == 0x000098, "Wrong size on B_Pickups_Default_C_Setup_View_Distances");
static_assert(offsetof(B_Pickups_Default_C_Setup_View_Distances, viewDistanceQuality) == 0x000000, "Member 'B_Pickups_Default_C_Setup_View_Distances::viewDistanceQuality' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Setup_View_Distances, l_viewQuality) == 0x000004, "Member 'B_Pickups_Default_C_Setup_View_Distances::l_viewQuality' has a wrong offset!");
static_assert(offsetof(B_Pickups_Default_C_Setup_View_Distances, Temp_real_Variable) == 0x000008, "Member 'B_Pickups_Default_C_Setup_View_Distances::Temp_real_Variable' has a wrong offset!");
