#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SparksSong_PreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_SparksSong_PreviewDisplay.B_SparksSong_PreviewDisplay_C.ExecuteUbergraph_B_SparksSong_PreviewDisplay
// 0x0058 (0x0058 - 0x0000)
struct B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ActionName;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_Material_Instance_Dynamic; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_CoverArt;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingPreview_Is_Playing_Or_Pending;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingPreview_Is_Playing;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingPreview_Is_Pending;              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay) == 0x000008, "Wrong alignment on B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay");
static_assert(sizeof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay) == 0x000058, "Wrong size on B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, EntryPoint) == 0x000000, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, K2Node_Event_ActionName) == 0x000004, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::K2Node_Event_ActionName' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000038, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_GetDynamicMaterialInstance_Material_Instance_Dynamic) == 0x000040, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_GetDynamicMaterialInstance_Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, K2Node_Event_CoverArt) == 0x000048, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::K2Node_Event_CoverArt' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_IsPlayingPreview_Is_Playing_Or_Pending) == 0x000050, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_IsPlayingPreview_Is_Playing_Or_Pending' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_IsPlayingPreview_Is_Playing) == 0x000051, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_IsPlayingPreview_Is_Playing' has a wrong offset!");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay, CallFunc_IsPlayingPreview_Is_Pending) == 0x000052, "Member 'B_SparksSong_PreviewDisplay_C_ExecuteUbergraph_B_SparksSong_PreviewDisplay::CallFunc_IsPlayingPreview_Is_Pending' has a wrong offset!");

// Function B_SparksSong_PreviewDisplay.B_SparksSong_PreviewDisplay_C.OnSongTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded final
{
public:
	class UTexture2D*                             CoverArt;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded) == 0x000008, "Wrong alignment on B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded");
static_assert(sizeof(B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded) == 0x000008, "Wrong size on B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded, CoverArt) == 0x000000, "Member 'B_SparksSong_PreviewDisplay_C_OnSongTextureLoaded::CoverArt' has a wrong offset!");

// Function B_SparksSong_PreviewDisplay.B_SparksSong_PreviewDisplay_C.PerformSpecialAction
// 0x0004 (0x0004 - 0x0000)
struct B_SparksSong_PreviewDisplay_C_PerformSpecialAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksSong_PreviewDisplay_C_PerformSpecialAction) == 0x000004, "Wrong alignment on B_SparksSong_PreviewDisplay_C_PerformSpecialAction");
static_assert(sizeof(B_SparksSong_PreviewDisplay_C_PerformSpecialAction) == 0x000004, "Wrong size on B_SparksSong_PreviewDisplay_C_PerformSpecialAction");
static_assert(offsetof(B_SparksSong_PreviewDisplay_C_PerformSpecialAction, ActionName) == 0x000000, "Member 'B_SparksSong_PreviewDisplay_C_PerformSpecialAction::ActionName' has a wrong offset!");

}

