#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SparksOffActorPreview

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.ExecuteUbergraph_B_SparksOffActorPreview
// 0x0070 (0x0070 - 0x0000)
struct B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUseSecondaryTransitionEffects;       // 0x001C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowFloor;                           // 0x001D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview) == 0x000008, "Wrong alignment on B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview");
static_assert(sizeof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview) == 0x000070, "Wrong size on B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, EntryPoint) == 0x000000, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, Temp_int_Array_Index_Variable) == 0x000018, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, K2Node_Event_bUseSecondaryTransitionEffects) == 0x00001C, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::K2Node_Event_bUseSecondaryTransitionEffects' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, K2Node_Event_bShowFloor) == 0x00001D, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::K2Node_Event_bShowFloor' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_GetGameUserSettings_ReturnValue) == 0x000020, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000058, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_Array_Get_Item) == 0x000060, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'B_SparksOffActorPreview_C_ExecuteUbergraph_B_SparksOffActorPreview::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.GetInstrumentMeshComponents
// 0x0030 (0x0030 - 0x0000)
struct B_SparksOffActorPreview_C_GetInstrumentMeshComponents final
{
public:
	ESparksInstrumentType                         CallFunc_GetInstrumentType_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_SparksCosmeticPreviewDisplay_C*      K2Node_DynamicCast_AsB_Sparks_Cosmetic_Preview_Display; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents) == 0x000008, "Wrong alignment on B_SparksOffActorPreview_C_GetInstrumentMeshComponents");
static_assert(sizeof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents) == 0x000030, "Wrong size on B_SparksOffActorPreview_C_GetInstrumentMeshComponents");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_GetInstrumentType_ReturnValue) == 0x000000, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_GetInstrumentType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, K2Node_DynamicCast_AsB_Sparks_Cosmetic_Preview_Display) == 0x000008, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::K2Node_DynamicCast_AsB_Sparks_Cosmetic_Preview_Display' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_Array_Add_ReturnValue_2) == 0x00001C, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_Array_Add_ReturnValue_3) == 0x000020, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_Array_Add_ReturnValue_4) == 0x000024, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_GetInstrumentMeshComponents, CallFunc_Array_Add_ReturnValue_5) == 0x000028, "Member 'B_SparksOffActorPreview_C_GetInstrumentMeshComponents::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.HandleLightingSettingsChanged
// 0x0020 (0x0020 - 0x0000)
struct B_SparksOffActorPreview_C_HandleLightingSettingsChanged final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameUserSettings*                  CallFunc_GetFortGameUserSettings_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPerformanceMode_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged) == 0x000008, "Wrong alignment on B_SparksOffActorPreview_C_HandleLightingSettingsChanged");
static_assert(sizeof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged) == 0x000020, "Wrong size on B_SparksOffActorPreview_C_HandleLightingSettingsChanged");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_GetShadowQuality_ReturnValue) == 0x000008, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_GetFortGameUserSettings_ReturnValue) == 0x000010, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_GetFortGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_IsInPerformanceMode_ReturnValue) == 0x000019, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_IsInPerformanceMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_IsMobileGame_ReturnValue) == 0x00001A, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_HandleLightingSettingsChanged, CallFunc_BooleanOR_ReturnValue_2) == 0x00001D, "Member 'B_SparksOffActorPreview_C_HandleLightingSettingsChanged::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.Light Control
// 0x0028 (0x0028 - 0x0000)
struct B_SparksOffActorPreview_C_Light_Control final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Active;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameUserSettings*                  CallFunc_GetFortGameUserSettings_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPerformanceMode_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue_1;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_Light_Control) == 0x000008, "Wrong alignment on B_SparksOffActorPreview_C_Light_Control");
static_assert(sizeof(B_SparksOffActorPreview_C_Light_Control) == 0x000028, "Wrong size on B_SparksOffActorPreview_C_Light_Control");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, Active) == 0x000000, "Member 'B_SparksOffActorPreview_C_Light_Control::Active' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, Is_Active) == 0x000001, "Member 'B_SparksOffActorPreview_C_Light_Control::Is_Active' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_IsErebus_ReturnValue) == 0x000002, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_GetFortGameUserSettings_ReturnValue) == 0x000008, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_GetFortGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_IsInPerformanceMode_ReturnValue) == 0x000011, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_IsInPerformanceMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_IsErebus_ReturnValue_1) == 0x000012, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_IsErebus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_BooleanOR_ReturnValue_1) == 0x000014, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_GetShadowQuality_ReturnValue) == 0x000020, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_BooleanOR_ReturnValue_2) == 0x000025, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_Light_Control, CallFunc_BooleanOR_ReturnValue_3) == 0x000026, "Member 'B_SparksOffActorPreview_C_Light_Control::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.OnPreviewVisualsSpawned
// 0x0002 (0x0002 - 0x0000)
struct B_SparksOffActorPreview_C_OnPreviewVisualsSpawned final
{
public:
	bool                                          bUseSecondaryTransitionEffects;                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowFloor;                                        // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_OnPreviewVisualsSpawned) == 0x000001, "Wrong alignment on B_SparksOffActorPreview_C_OnPreviewVisualsSpawned");
static_assert(sizeof(B_SparksOffActorPreview_C_OnPreviewVisualsSpawned) == 0x000002, "Wrong size on B_SparksOffActorPreview_C_OnPreviewVisualsSpawned");
static_assert(offsetof(B_SparksOffActorPreview_C_OnPreviewVisualsSpawned, bUseSecondaryTransitionEffects) == 0x000000, "Member 'B_SparksOffActorPreview_C_OnPreviewVisualsSpawned::bUseSecondaryTransitionEffects' has a wrong offset!");
static_assert(offsetof(B_SparksOffActorPreview_C_OnPreviewVisualsSpawned, bShowFloor) == 0x000001, "Member 'B_SparksOffActorPreview_C_OnPreviewVisualsSpawned::bShowFloor' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.Switch Erebus Lighting
// 0x0001 (0x0001 - 0x0000)
struct B_SparksOffActorPreview_C_Switch_Erebus_Lighting final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_Switch_Erebus_Lighting) == 0x000001, "Wrong alignment on B_SparksOffActorPreview_C_Switch_Erebus_Lighting");
static_assert(sizeof(B_SparksOffActorPreview_C_Switch_Erebus_Lighting) == 0x000001, "Wrong size on B_SparksOffActorPreview_C_Switch_Erebus_Lighting");
static_assert(offsetof(B_SparksOffActorPreview_C_Switch_Erebus_Lighting, Visibility) == 0x000000, "Member 'B_SparksOffActorPreview_C_Switch_Erebus_Lighting::Visibility' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.Switch Mobile Lighting
// 0x0001 (0x0001 - 0x0000)
struct B_SparksOffActorPreview_C_Switch_Mobile_Lighting final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_Switch_Mobile_Lighting) == 0x000001, "Wrong alignment on B_SparksOffActorPreview_C_Switch_Mobile_Lighting");
static_assert(sizeof(B_SparksOffActorPreview_C_Switch_Mobile_Lighting) == 0x000001, "Wrong size on B_SparksOffActorPreview_C_Switch_Mobile_Lighting");
static_assert(offsetof(B_SparksOffActorPreview_C_Switch_Mobile_Lighting, NewParam) == 0x000000, "Member 'B_SparksOffActorPreview_C_Switch_Mobile_Lighting::NewParam' has a wrong offset!");

// Function B_SparksOffActorPreview.B_SparksOffActorPreview_C.Switch PC Lighting
// 0x0001 (0x0001 - 0x0000)
struct B_SparksOffActorPreview_C_Switch_PC_Lighting final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_SparksOffActorPreview_C_Switch_PC_Lighting) == 0x000001, "Wrong alignment on B_SparksOffActorPreview_C_Switch_PC_Lighting");
static_assert(sizeof(B_SparksOffActorPreview_C_Switch_PC_Lighting) == 0x000001, "Wrong size on B_SparksOffActorPreview_C_Switch_PC_Lighting");
static_assert(offsetof(B_SparksOffActorPreview_C_Switch_PC_Lighting, Visibility) == 0x000000, "Member 'B_SparksOffActorPreview_C_Switch_PC_Lighting::Visibility' has a wrong offset!");

}

