#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_WeaponSoundLibraryContext

#include "Basic.hpp"

#include "MetasoundEngine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SoundLibrary_structs.hpp"


namespace SDK::Params
{

// Function B_WeaponSoundLibraryContext.B_WeaponSoundLibraryContext_C.Play
// 0x00E0 (0x00E0 - 0x0000)
struct B_WeaponSoundLibraryContext_C_Play final
{
public:
	struct FSoundLibraryContextEventInput         InEventData;                                       // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UAudioComponent*>                OutComponents;                                     // 0x0038(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetRootComponent_RootComponent;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CleanFireAudioComponents_bParamRetriggered; // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName OutputName, struct FMetaSoundOutput& Output)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetaSoundOutputSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WatchOutput_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput;       // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponSoundLibraryContext_C_Play) == 0x000008, "Wrong alignment on B_WeaponSoundLibraryContext_C_Play");
static_assert(sizeof(B_WeaponSoundLibraryContext_C_Play) == 0x0000E0, "Wrong size on B_WeaponSoundLibraryContext_C_Play");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, InEventData) == 0x000000, "Member 'B_WeaponSoundLibraryContext_C_Play::InEventData' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, OutComponents) == 0x000038, "Member 'B_WeaponSoundLibraryContext_C_Play::OutComponents' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, ReturnValue) == 0x000048, "Member 'B_WeaponSoundLibraryContext_C_Play::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'B_WeaponSoundLibraryContext_C_Play::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_MatchesTag_ReturnValue) == 0x000054, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_GetRootComponent_RootComponent) == 0x000058, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_GetRootComponent_RootComponent' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000060, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000068, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, K2Node_MakeArray_Array) == 0x000070, "Member 'B_WeaponSoundLibraryContext_C_Play::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Greater_IntInt_ReturnValue) == 0x00008C, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_CleanFireAudioComponents_bParamRetriggered) == 0x00008D, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_CleanFireAudioComponents_bParamRetriggered' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'B_WeaponSoundLibraryContext_C_Play::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000A0, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_WatchOutput_ReturnValue) == 0x0000A8, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_WatchOutput_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Array_AddUnique_ReturnValue) == 0x0000AC, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'B_WeaponSoundLibraryContext_C_Play::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0000C0, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_SetTriggerParameter_self_CastInput) == 0x0000C8, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_Play, CallFunc_Array_AddUnique_ReturnValue_2) == 0x0000DC, "Member 'B_WeaponSoundLibraryContext_C_Play::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");

// Function B_WeaponSoundLibraryContext.B_WeaponSoundLibraryContext_C.OnAlmostFinished
// 0x0020 (0x0020 - 0x0000)
struct B_WeaponSoundLibraryContext_C_OnAlmostFinished final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundOutput                       Output;                                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_GetBool_Success;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBool_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponSoundLibraryContext_C_OnAlmostFinished) == 0x000008, "Wrong alignment on B_WeaponSoundLibraryContext_C_OnAlmostFinished");
static_assert(sizeof(B_WeaponSoundLibraryContext_C_OnAlmostFinished) == 0x000020, "Wrong size on B_WeaponSoundLibraryContext_C_OnAlmostFinished");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_OnAlmostFinished, OutputName) == 0x000000, "Member 'B_WeaponSoundLibraryContext_C_OnAlmostFinished::OutputName' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_OnAlmostFinished, Output) == 0x000008, "Member 'B_WeaponSoundLibraryContext_C_OnAlmostFinished::Output' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_OnAlmostFinished, CallFunc_GetBool_Success) == 0x000018, "Member 'B_WeaponSoundLibraryContext_C_OnAlmostFinished::CallFunc_GetBool_Success' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_OnAlmostFinished, CallFunc_GetBool_ReturnValue) == 0x000019, "Member 'B_WeaponSoundLibraryContext_C_OnAlmostFinished::CallFunc_GetBool_ReturnValue' has a wrong offset!");

// Function B_WeaponSoundLibraryContext.B_WeaponSoundLibraryContext_C.GetRootComponent
// 0x0058 (0x0058 - 0x0000)
struct B_WeaponSoundLibraryContext_C_GetRootComponent final
{
public:
	class AActor*                                 Actor_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RootComponent;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  EquipTags;                                         // 0x0018(0x0020)(Edit, BlueprintVisible)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponSoundLibraryContext_C_GetRootComponent) == 0x000008, "Wrong alignment on B_WeaponSoundLibraryContext_C_GetRootComponent");
static_assert(sizeof(B_WeaponSoundLibraryContext_C_GetRootComponent) == 0x000058, "Wrong size on B_WeaponSoundLibraryContext_C_GetRootComponent");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, Actor_0) == 0x000000, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::Actor_0' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, EventTag) == 0x000008, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::EventTag' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, RootComponent) == 0x000010, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::RootComponent' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, EquipTags) == 0x000018, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::EquipTags' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000038, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000048, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRootComponent, CallFunc_HasTag_ReturnValue) == 0x000051, "Member 'B_WeaponSoundLibraryContext_C_GetRootComponent::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function B_WeaponSoundLibraryContext.B_WeaponSoundLibraryContext_C.GetRetrievedSounds
// 0x0010 (0x0010 - 0x0000)
struct B_WeaponSoundLibraryContext_C_GetRetrievedSounds final
{
public:
	TArray<class USoundBase*>                     GatheredSounds_0;                                  // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(B_WeaponSoundLibraryContext_C_GetRetrievedSounds) == 0x000008, "Wrong alignment on B_WeaponSoundLibraryContext_C_GetRetrievedSounds");
static_assert(sizeof(B_WeaponSoundLibraryContext_C_GetRetrievedSounds) == 0x000010, "Wrong size on B_WeaponSoundLibraryContext_C_GetRetrievedSounds");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_GetRetrievedSounds, GatheredSounds_0) == 0x000000, "Member 'B_WeaponSoundLibraryContext_C_GetRetrievedSounds::GatheredSounds_0' has a wrong offset!");

// Function B_WeaponSoundLibraryContext.B_WeaponSoundLibraryContext_C.CleanFireAudioComponents
// 0x0028 (0x0028 - 0x0000)
struct B_WeaponSoundLibraryContext_C_CleanFireAudioComponents final
{
public:
	bool                                          bParamRetriggered;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents) == 0x000004, "Wrong alignment on B_WeaponSoundLibraryContext_C_CleanFireAudioComponents");
static_assert(sizeof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents) == 0x000028, "Wrong size on B_WeaponSoundLibraryContext_C_CleanFireAudioComponents");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, bParamRetriggered) == 0x000000, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::bParamRetriggered' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Array_Get_Item) == 0x000010, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Max_ReturnValue) == 0x000020, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponSoundLibraryContext_C_CleanFireAudioComponents, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000025, "Member 'B_WeaponSoundLibraryContext_C_CleanFireAudioComponents::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

