#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusShowdownScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BacchusShowdownScreen_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'BacchusShowdownScreen_C_BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.ExecuteUbergraph_BacchusShowdownScreen
// 0x0260 (0x0260 - 0x0000)
struct BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x0040(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x0070(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_X;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_Y;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_Z;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_W;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                K2Node_CustomEvent_CurrentWidget;                  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0100(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x013C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFrontIsSelected;                     // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEndIsSelected;                       // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0150(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0160(0x0010)(NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownTournamentTile_C*              K2Node_DynamicCast_AsShowdown_Tournament_Tile;     // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTournamentListEntryData*               CallFunc_GetTournamentListEntryData_ReturnValue;   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetEntryAtIndex_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UShowdownTournamentTile_C*              K2Node_DynamicCast_AsShowdown_Tournament_Tile_1;   // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownTournamentTile_C*              K2Node_DynamicCast_AsShowdown_Tournament_Tile_2;   // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue_1;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBacchusTabNavOnTop_ReturnValue;      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2;   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3;   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen) == 0x000010, "Wrong alignment on BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen");
static_assert(sizeof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen) == 0x000260, "Wrong size on BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, EntryPoint) == 0x000000, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, Temp_bool_Variable) == 0x000004, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, Temp_int_Variable) == 0x000008, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Event_bUsingGamepad) == 0x000030, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetSafeZonePadding_SafePadding) == 0x000040, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetSafeZonePadding_SafePadding' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetSafeZonePadding_SafePaddingScale) == 0x000060, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetSafeZonePadding_SafePaddingScale' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetSafeZonePadding_SpillOverPadding) == 0x000070, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetSafeZonePadding_SpillOverPadding' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_BreakVector4_X) == 0x000090, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_BreakVector4_X' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_BreakVector4_Y) == 0x000098, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_BreakVector4_Y' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_BreakVector4_Z) == 0x0000A0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_BreakVector4_Z' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_BreakVector4_W) == 0x0000A8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_BreakVector4_W' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000B0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Margin) == 0x0000B8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Margin_1) == 0x0000C8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_CustomEvent_CurrentWidget) == 0x0000D8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_CustomEvent_CurrentWidget' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000F0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000F8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Event_MyGeometry) == 0x000100, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Event_InDeltaTime) == 0x000138, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Margin_2) == 0x00013C, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Event_bFrontIsSelected) == 0x00014C, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Event_bFrontIsSelected' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Event_bEndIsSelected) == 0x00014D, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Event_bEndIsSelected' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_DataTableRowHandle) == 0x000150, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_DataTableRowHandle_1) == 0x000160, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_DataTableRowHandle_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, Temp_byte_Variable) == 0x000170, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_DynamicCast_AsShowdown_Tournament_Tile) == 0x000178, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_DynamicCast_AsShowdown_Tournament_Tile' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetTournamentListEntryData_ReturnValue) == 0x000188, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetTournamentListEntryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetContext_ReturnValue) == 0x000190, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetIndexForItem_ReturnValue) == 0x000198, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetNumItems_ReturnValue) == 0x00019C, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001A4, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001A9, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001AC, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0001B0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_BooleanOR_ReturnValue) == 0x0001B1, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetEntryAtIndex_ReturnValue) == 0x0001B8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetEntryAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_DynamicCast_AsShowdown_Tournament_Tile_1) == 0x0001C0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_DynamicCast_AsShowdown_Tournament_Tile_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_DynamicCast_AsShowdown_Tournament_Tile_2) == 0x0001D0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_DynamicCast_AsShowdown_Tournament_Tile_2' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_ComponentBoundEvent_Item) == 0x0001E0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_ComponentBoundEvent_bIsSelected) == 0x0001E8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetNumItems_ReturnValue_1) == 0x0001EC, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetNumItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, Temp_byte_Variable_1) == 0x0001F0, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001F1, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Select_Default) == 0x0001F8, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_BooleanAND_ReturnValue) == 0x000200, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000208, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000210, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_GetIsBacchusTabNavOnTop_ReturnValue) == 0x000218, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_GetIsBacchusTabNavOnTop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, Temp_bool_Variable_1) == 0x000219, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x000220, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_Select_Default_1) == 0x000228, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000230, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000238, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2) == 0x000240, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3) == 0x000248, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x000250, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Right_ImplicitCast) == 0x000254, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Top_ImplicitCast) == 0x000258, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen, K2Node_MakeStruct_Left_ImplicitCast) == 0x00025C, "Member 'BacchusShowdownScreen_C_ExecuteUbergraph_BacchusShowdownScreen::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct BacchusShowdownScreen_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_OnInputModeChanged) == 0x000001, "Wrong alignment on BacchusShowdownScreen_C_OnInputModeChanged");
static_assert(sizeof(BacchusShowdownScreen_C_OnInputModeChanged) == 0x000001, "Wrong size on BacchusShowdownScreen_C_OnInputModeChanged");
static_assert(offsetof(BacchusShowdownScreen_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'BacchusShowdownScreen_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BacchusShowdownScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_PreConstruct) == 0x000001, "Wrong alignment on BacchusShowdownScreen_C_PreConstruct");
static_assert(sizeof(BacchusShowdownScreen_C_PreConstruct) == 0x000001, "Wrong size on BacchusShowdownScreen_C_PreConstruct");
static_assert(offsetof(BacchusShowdownScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BacchusShowdownScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.SelectedEndTournament
// 0x0001 (0x0001 - 0x0000)
struct BacchusShowdownScreen_C_SelectedEndTournament final
{
public:
	bool                                          bEndIsSelected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_SelectedEndTournament) == 0x000001, "Wrong alignment on BacchusShowdownScreen_C_SelectedEndTournament");
static_assert(sizeof(BacchusShowdownScreen_C_SelectedEndTournament) == 0x000001, "Wrong size on BacchusShowdownScreen_C_SelectedEndTournament");
static_assert(offsetof(BacchusShowdownScreen_C_SelectedEndTournament, bEndIsSelected) == 0x000000, "Member 'BacchusShowdownScreen_C_SelectedEndTournament::bEndIsSelected' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.SelectedFrontTournament
// 0x0001 (0x0001 - 0x0000)
struct BacchusShowdownScreen_C_SelectedFrontTournament final
{
public:
	bool                                          bFrontIsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_SelectedFrontTournament) == 0x000001, "Wrong alignment on BacchusShowdownScreen_C_SelectedFrontTournament");
static_assert(sizeof(BacchusShowdownScreen_C_SelectedFrontTournament) == 0x000001, "Wrong size on BacchusShowdownScreen_C_SelectedFrontTournament");
static_assert(offsetof(BacchusShowdownScreen_C_SelectedFrontTournament, bFrontIsSelected) == 0x000000, "Member 'BacchusShowdownScreen_C_SelectedFrontTournament::bFrontIsSelected' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct BacchusShowdownScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_Tick) == 0x000004, "Wrong alignment on BacchusShowdownScreen_C_Tick");
static_assert(sizeof(BacchusShowdownScreen_C_Tick) == 0x00003C, "Wrong size on BacchusShowdownScreen_C_Tick");
static_assert(offsetof(BacchusShowdownScreen_C_Tick, MyGeometry) == 0x000000, "Member 'BacchusShowdownScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BacchusShowdownScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'BacchusShowdownScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function BacchusShowdownScreen.BacchusShowdownScreen_C.TournamentListSelect
// 0x0008 (0x0008 - 0x0000)
struct BacchusShowdownScreen_C_TournamentListSelect final
{
public:
	class UWidget*                                CurrentWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusShowdownScreen_C_TournamentListSelect) == 0x000008, "Wrong alignment on BacchusShowdownScreen_C_TournamentListSelect");
static_assert(sizeof(BacchusShowdownScreen_C_TournamentListSelect) == 0x000008, "Wrong size on BacchusShowdownScreen_C_TournamentListSelect");
static_assert(offsetof(BacchusShowdownScreen_C_TournamentListSelect, CurrentWidget) == 0x000000, "Member 'BacchusShowdownScreen_C_TournamentListSelect::CurrentWidget' has a wrong offset!");

}

