#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusShowdownScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusShowdownScreen.BacchusShowdownScreen_C
// 0x00B0 (0x06B8 - 0x0608)
class UBacchusShowdownScreen_C final : public UFortShowdownScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Left;                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Right;                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_ErrorSwitcher;                // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoTournamentsContent;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ChangeFlag;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoTournamentContent;                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_3;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Posters;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSwipePanel*                        SwipePanel;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TournamentsContent;                                // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_4;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            PrimaryColor;                                      // 0x0698(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                SelectedTile;                                      // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ListView_TournamentList_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_3_OnFortSwipeEvent__DelegateSignature();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_4_OnFortSwipeEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_BacchusShowdownScreen(int32 EntryPoint);
	void OnInputModeChanged(bool bUsingGamepad);
	void PreConstruct(bool IsDesignTime);
	void SelectedEndTournament(bool bEndIsSelected);
	void SelectedFrontTournament(bool bFrontIsSelected);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TournamentListSelect(class UWidget* CurrentWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusShowdownScreen_C">();
	}
	static class UBacchusShowdownScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusShowdownScreen_C>();
	}
};
static_assert(alignof(UBacchusShowdownScreen_C) == 0x000008, "Wrong alignment on UBacchusShowdownScreen_C");
static_assert(sizeof(UBacchusShowdownScreen_C) == 0x0006B8, "Wrong size on UBacchusShowdownScreen_C");
static_assert(offsetof(UBacchusShowdownScreen_C, UberGraphFrame) == 0x000608, "Member 'UBacchusShowdownScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, Outro) == 0x000610, "Member 'UBacchusShowdownScreen_C::Outro' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, Intro) == 0x000618, "Member 'UBacchusShowdownScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, CircleArrowButton_Left) == 0x000620, "Member 'UBacchusShowdownScreen_C::CircleArrowButton_Left' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, CircleArrowButton_Right) == 0x000628, "Member 'UBacchusShowdownScreen_C::CircleArrowButton_Right' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, CommonWidgetSwitcher_ErrorSwitcher) == 0x000630, "Member 'UBacchusShowdownScreen_C::CommonWidgetSwitcher_ErrorSwitcher' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, Image_BG) == 0x000638, "Member 'UBacchusShowdownScreen_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, NoTournamentsContent) == 0x000640, "Member 'UBacchusShowdownScreen_C::NoTournamentsContent' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, Overlay_ChangeFlag) == 0x000648, "Member 'UBacchusShowdownScreen_C::Overlay_ChangeFlag' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, Overlay_NoTournamentContent) == 0x000650, "Member 'UBacchusShowdownScreen_C::Overlay_NoTournamentContent' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SafeZone_0) == 0x000658, "Member 'UBacchusShowdownScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SafeZone_1) == 0x000660, "Member 'UBacchusShowdownScreen_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SafeZone_2) == 0x000668, "Member 'UBacchusShowdownScreen_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SafeZone_3) == 0x000670, "Member 'UBacchusShowdownScreen_C::SafeZone_3' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SizeBox_Posters) == 0x000678, "Member 'UBacchusShowdownScreen_C::SizeBox_Posters' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SwipePanel) == 0x000680, "Member 'UBacchusShowdownScreen_C::SwipePanel' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, TournamentsContent) == 0x000688, "Member 'UBacchusShowdownScreen_C::TournamentsContent' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, VerticalBox_4) == 0x000690, "Member 'UBacchusShowdownScreen_C::VerticalBox_4' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, PrimaryColor) == 0x000698, "Member 'UBacchusShowdownScreen_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UBacchusShowdownScreen_C, SelectedTile) == 0x0006B0, "Member 'UBacchusShowdownScreen_C::SelectedTile' has a wrong offset!");

}

