#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseScreen

#include "Basic.hpp"

#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassPurchaseScreen.BattlePassPurchaseScreen_C
// 0x0168 (0x06D0 - 0x0568)
class UBattlePassPurchaseScreen_C final : public UBattlePassPurchaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortSupervisedSettingsVM*              FortSupervisedSettingsVM;                          // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewTile;                                           // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PurchaseOptions;                                   // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionOut;                                     // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionIn;                                      // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_BottomButtons;                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ConfirmButtons;                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEpicCMSImage*                          Image_Background_TestBG;                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundBlur;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGDarken;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MobileCloseVisibilityWrapper;                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUpsell_TutorialTooltip_C*              NavButtonNotification;                             // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NavButtonNotificationWrapper;                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PurchaseOptions;                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PurchaseVisibilityWrapper;                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TopRight;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_169;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_purchase;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ToCrewVisibilityWrapper;                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PassDetails;                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PurchaseOptions;                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBarContainer_C*              WBP_ActionBarContainer;                            // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptureForPostBufferUpdate_C*      WBP_CaptureForPostBufferUpdate;                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StoreMain_PurchaseDisabledInfo_C*  WBP_StoreMain_PurchaseDisabledInfo;                // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                DesignTimeAsset;                                   // 0x0660(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPurchaseStateConfirm;                            // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPurchaseStatePurchase;                           // 0x0690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             OldBackground;                                     // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             UpsellScreenAppearSound;                           // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Notification;                                 // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Purchase_Button_Click_Sound;                       // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Back_To_Battlepass_Click_Sound;                    // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BP_ScreenAppearWhooshSound;                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void EventScreenTransitionIn();
	void ExecuteUbergraph_BattlePassPurchaseScreen(int32 EntryPoint);
	void Finished_606B179748E26374BE50B49D16BB56C8();
	void OnDownloadBackgroundComplete(class UTexture2D* NewBackground);
	void OnPurchaseConfirmed();
	void OnPurchaseStateChanged(EBattlePassPurchaseState InCurrentState);
	void OnSetNavButtonNotificationText(const class FText& NotificationText);
	void OnSetScreenInteractable(bool bInteractable);
	void OnShowNavButtonNotification(const bool bShowNotification);
	void OnStartingDownloadBackground();
	void PreConstruct(bool IsDesignTime);
	void SetDesignTimeImages();
	void SetMobileVisuals();

	ESlateVisibility __c4523620_44af_d218_7add_b3bcf9bc0731_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassPurchaseScreen_C">();
	}
	static class UBattlePassPurchaseScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPurchaseScreen_C>();
	}
};
static_assert(alignof(UBattlePassPurchaseScreen_C) == 0x000008, "Wrong alignment on UBattlePassPurchaseScreen_C");
static_assert(sizeof(UBattlePassPurchaseScreen_C) == 0x0006D0, "Wrong size on UBattlePassPurchaseScreen_C");
static_assert(offsetof(UBattlePassPurchaseScreen_C, UberGraphFrame) == 0x000568, "Member 'UBattlePassPurchaseScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, FortSupervisedSettingsVM) == 0x000570, "Member 'UBattlePassPurchaseScreen_C::FortSupervisedSettingsVM' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, NewTile) == 0x000578, "Member 'UBattlePassPurchaseScreen_C::NewTile' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, PurchaseOptions) == 0x000580, "Member 'UBattlePassPurchaseScreen_C::PurchaseOptions' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, TransitionOut) == 0x000588, "Member 'UBattlePassPurchaseScreen_C::TransitionOut' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, TransitionIn) == 0x000590, "Member 'UBattlePassPurchaseScreen_C::TransitionIn' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, HorizontalBox_BottomButtons) == 0x000598, "Member 'UBattlePassPurchaseScreen_C::HorizontalBox_BottomButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, HorizontalBox_ConfirmButtons) == 0x0005A0, "Member 'UBattlePassPurchaseScreen_C::HorizontalBox_ConfirmButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_Background_TestBG) == 0x0005A8, "Member 'UBattlePassPurchaseScreen_C::Image_Background_TestBG' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_BackgroundBlur) == 0x0005B0, "Member 'UBattlePassPurchaseScreen_C::Image_BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_BGDarken) == 0x0005B8, "Member 'UBattlePassPurchaseScreen_C::Image_BGDarken' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Image_Glow) == 0x0005C0, "Member 'UBattlePassPurchaseScreen_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, MobileCloseVisibilityWrapper) == 0x0005C8, "Member 'UBattlePassPurchaseScreen_C::MobileCloseVisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, NavButtonNotification) == 0x0005D0, "Member 'UBattlePassPurchaseScreen_C::NavButtonNotification' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, NavButtonNotificationWrapper) == 0x0005D8, "Member 'UBattlePassPurchaseScreen_C::NavButtonNotificationWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Overlay_1) == 0x0005E0, "Member 'UBattlePassPurchaseScreen_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Overlay_PurchaseOptions) == 0x0005E8, "Member 'UBattlePassPurchaseScreen_C::Overlay_PurchaseOptions' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, PurchaseVisibilityWrapper) == 0x0005F0, "Member 'UBattlePassPurchaseScreen_C::PurchaseVisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, SafeZone_0) == 0x0005F8, "Member 'UBattlePassPurchaseScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, SafeZone_1) == 0x000600, "Member 'UBattlePassPurchaseScreen_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, SafeZone_TopRight) == 0x000608, "Member 'UBattlePassPurchaseScreen_C::SafeZone_TopRight' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, SizeBox_Content) == 0x000610, "Member 'UBattlePassPurchaseScreen_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Spacer_169) == 0x000618, "Member 'UBattlePassPurchaseScreen_C::Spacer_169' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Spacer_purchase) == 0x000620, "Member 'UBattlePassPurchaseScreen_C::Spacer_purchase' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, ToCrewVisibilityWrapper) == 0x000628, "Member 'UBattlePassPurchaseScreen_C::ToCrewVisibilityWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, VerticalBox_PassDetails) == 0x000630, "Member 'UBattlePassPurchaseScreen_C::VerticalBox_PassDetails' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, VerticalBox_PurchaseOptions) == 0x000638, "Member 'UBattlePassPurchaseScreen_C::VerticalBox_PurchaseOptions' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, WBP_ActionBarContainer) == 0x000640, "Member 'UBattlePassPurchaseScreen_C::WBP_ActionBarContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, WBP_CaptureForPostBufferUpdate) == 0x000648, "Member 'UBattlePassPurchaseScreen_C::WBP_CaptureForPostBufferUpdate' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, WBP_StoreMain_PurchaseDisabledInfo) == 0x000650, "Member 'UBattlePassPurchaseScreen_C::WBP_StoreMain_PurchaseDisabledInfo' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, ImageMID) == 0x000658, "Member 'UBattlePassPurchaseScreen_C::ImageMID' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, DesignTimeAsset) == 0x000660, "Member 'UBattlePassPurchaseScreen_C::DesignTimeAsset' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, OnPurchaseStateConfirm) == 0x000680, "Member 'UBattlePassPurchaseScreen_C::OnPurchaseStateConfirm' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, OnPurchaseStatePurchase) == 0x000690, "Member 'UBattlePassPurchaseScreen_C::OnPurchaseStatePurchase' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, OldBackground) == 0x0006A0, "Member 'UBattlePassPurchaseScreen_C::OldBackground' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, UpsellScreenAppearSound) == 0x0006A8, "Member 'UBattlePassPurchaseScreen_C::UpsellScreenAppearSound' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Show_Notification) == 0x0006B0, "Member 'UBattlePassPurchaseScreen_C::Show_Notification' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Purchase_Button_Click_Sound) == 0x0006B8, "Member 'UBattlePassPurchaseScreen_C::Purchase_Button_Click_Sound' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, Back_To_Battlepass_Click_Sound) == 0x0006C0, "Member 'UBattlePassPurchaseScreen_C::Back_To_Battlepass_Click_Sound' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseScreen_C, BP_ScreenAppearWhooshSound) == 0x0006C8, "Member 'UBattlePassPurchaseScreen_C::BP_ScreenAppearWhooshSound' has a wrong offset!");

}

