#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassVaultWorld

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BattlePassVaultWorld_C_UserConstructionScript final
{
public:
	class AFortStaticMeshActor*                   K2Node_DynamicCast_AsFort_Static_Mesh_Actor;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_UserConstructionScript) == 0x000008, "Wrong alignment on BattlePassVaultWorld_C_UserConstructionScript");
static_assert(sizeof(BattlePassVaultWorld_C_UserConstructionScript) == 0x000010, "Wrong size on BattlePassVaultWorld_C_UserConstructionScript");
static_assert(offsetof(BattlePassVaultWorld_C_UserConstructionScript, K2Node_DynamicCast_AsFort_Static_Mesh_Actor) == 0x000000, "Member 'BattlePassVaultWorld_C_UserConstructionScript::K2Node_DynamicCast_AsFort_Static_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BattlePassVaultWorld_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.TransitionBackgroundBackward
// 0x0100 (0x0100 - 0x0000)
struct BattlePassVaultWorld_C_TransitionBackgroundBackward final
{
public:
	double                                        Backward;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fade;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FXTransitionFade;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast_1;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast_1;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_TransitionBackgroundBackward) == 0x000008, "Wrong alignment on BattlePassVaultWorld_C_TransitionBackgroundBackward");
static_assert(sizeof(BattlePassVaultWorld_C_TransitionBackgroundBackward) == 0x000100, "Wrong size on BattlePassVaultWorld_C_TransitionBackgroundBackward");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, Backward) == 0x000000, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::Backward' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, Fade) == 0x000008, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::Fade' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, FXTransitionFade) == 0x000010, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::FXTransitionFade' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, Mid) == 0x000018, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::Mid' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue) == 0x000040, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_1) == 0x000048, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_2) == 0x000050, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_3) == 0x000058, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_4) == 0x000060, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_5) == 0x000068, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000070, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x000080, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_A_ImplicitCast) == 0x000088, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_B_ImplicitCast) == 0x000098, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0000B0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_A_ImplicitCast_1) == 0x0000B8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0000C0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_B_ImplicitCast_1) == 0x0000C8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0000D0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000D8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000DC, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000E0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0000E4, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x0000E8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x0000EC, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x0000F0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x0000F4, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x0000F8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.SetupBackgroundMaterial
// 0x0100 (0x0100 - 0x0000)
struct BattlePassVaultWorld_C_SetupBackgroundMaterial final
{
public:
	class UTexture2D*                             TextureBackground;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FVaultWorldBackgroundData              BackgroundInfo;                                    // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_6;                              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_8;                              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_9;                              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_2;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_3;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_4;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default_5;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_PageA_X_Offset_ImplicitCast;    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_PageB_X_Offset_ImplicitCast;    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_SetupBackgroundMaterial) == 0x000008, "Wrong alignment on BattlePassVaultWorld_C_SetupBackgroundMaterial");
static_assert(sizeof(BattlePassVaultWorld_C_SetupBackgroundMaterial) == 0x000100, "Wrong size on BattlePassVaultWorld_C_SetupBackgroundMaterial");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, TextureBackground) == 0x000000, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::TextureBackground' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, BackgroundInfo) == 0x000008, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::BackgroundInfo' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Mid) == 0x000060, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Mid' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable) == 0x000068, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, CallFunc_BreakVector_X) == 0x000070, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, CallFunc_BreakVector_Y) == 0x000078, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, CallFunc_BreakVector_Z) == 0x000080, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_1) == 0x00008C, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable) == 0x000090, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_2) == 0x000094, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_3) == 0x000098, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_1) == 0x00009C, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_4) == 0x0000A0, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_5) == 0x0000A4, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_2) == 0x0000A8, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_6) == 0x0000AC, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_7) == 0x0000B0, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_3) == 0x0000B4, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_8) == 0x0000B8, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_8' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_9) == 0x0000BC, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_9' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_4) == 0x0000C0, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default) == 0x0000C4, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_1) == 0x0000C8, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_2) == 0x0000CC, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_3) == 0x0000D0, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_object_Variable) == 0x0000D8, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_4) == 0x0000E0, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_5) == 0x0000E4, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_5) == 0x0000E8, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000F0, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_VariableSet_PageA_X_Offset_ImplicitCast) == 0x0000F4, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_VariableSet_PageA_X_Offset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, K2Node_VariableSet_PageB_X_Offset_ImplicitCast) == 0x0000F8, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::K2Node_VariableSet_PageB_X_Offset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_SetupBackgroundMaterial, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000FC, "Member 'BattlePassVaultWorld_C_SetupBackgroundMaterial::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.Set Backgrounds Scalar Value
// 0x0018 (0x0018 - 0x0000)
struct BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value final
{
public:
	class FName                                   Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FloatValue;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value) == 0x000008, "Wrong alignment on BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value");
static_assert(sizeof(BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value) == 0x000018, "Wrong size on BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value");
static_assert(offsetof(BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value, Param) == 0x000000, "Member 'BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value::Param' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value, FloatValue) == 0x000008, "Member 'BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value::FloatValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'BattlePassVaultWorld_C_Set_Backgrounds_Scalar_Value::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.TransitionBackgroundForward
// 0x0108 (0x0108 - 0x0000)
struct BattlePassVaultWorld_C_TransitionBackgroundForward final
{
public:
	double                                        Forward;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fade;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FXTransitionFade;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast_1;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast_1;                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_TransitionBackgroundForward) == 0x000008, "Wrong alignment on BattlePassVaultWorld_C_TransitionBackgroundForward");
static_assert(sizeof(BattlePassVaultWorld_C_TransitionBackgroundForward) == 0x000108, "Wrong size on BattlePassVaultWorld_C_TransitionBackgroundForward");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, Forward) == 0x000000, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::Forward' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, Fade) == 0x000008, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::Fade' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, FXTransitionFade) == 0x000010, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::FXTransitionFade' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, Mid) == 0x000018, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::Mid' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_1) == 0x000030, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_2) == 0x000038, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_3) == 0x000048, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_4) == 0x000058, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000060, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_5) == 0x000070, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_A_ImplicitCast) == 0x000078, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000090, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000094, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000098, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_B_ImplicitCast) == 0x0000A8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_B_ImplicitCast_1) == 0x0000B8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0000C0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0000C8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x0000CC, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x0000D0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0000D8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0000E0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x0000E8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x0000EC, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_A_ImplicitCast_1) == 0x0000F0, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0000F8, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000100, "Member 'BattlePassVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.OnTransitionItemDetails
// 0x0001 (0x0001 - 0x0000)
struct BattlePassVaultWorld_C_OnTransitionItemDetails final
{
public:
	bool                                          bShowItemDetails;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_OnTransitionItemDetails) == 0x000001, "Wrong alignment on BattlePassVaultWorld_C_OnTransitionItemDetails");
static_assert(sizeof(BattlePassVaultWorld_C_OnTransitionItemDetails) == 0x000001, "Wrong size on BattlePassVaultWorld_C_OnTransitionItemDetails");
static_assert(offsetof(BattlePassVaultWorld_C_OnTransitionItemDetails, bShowItemDetails) == 0x000000, "Member 'BattlePassVaultWorld_C_OnTransitionItemDetails::bShowItemDetails' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.OnTransitionBackground
// 0x0002 (0x0002 - 0x0000)
struct BattlePassVaultWorld_C_OnTransitionBackground final
{
public:
	bool                                          bPlayForward;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBackgroundIntensityLevel                     IntensityTransition;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_OnTransitionBackground) == 0x000001, "Wrong alignment on BattlePassVaultWorld_C_OnTransitionBackground");
static_assert(sizeof(BattlePassVaultWorld_C_OnTransitionBackground) == 0x000002, "Wrong size on BattlePassVaultWorld_C_OnTransitionBackground");
static_assert(offsetof(BattlePassVaultWorld_C_OnTransitionBackground, bPlayForward) == 0x000000, "Member 'BattlePassVaultWorld_C_OnTransitionBackground::bPlayForward' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_OnTransitionBackground, IntensityTransition) == 0x000001, "Member 'BattlePassVaultWorld_C_OnTransitionBackground::IntensityTransition' has a wrong offset!");

// Function BattlePassVaultWorld.BattlePassVaultWorld_C.PageTransitionIntensityUpdate
// 0x0048 (0x0048 - 0x0000)
struct BattlePassVaultWorld_C_PageTransitionIntensityUpdate final
{
public:
	class UMaterialInstanceDynamic*               MID_Background;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Floor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBackgroundIntensityLevel                     Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBackgroundIntensityLevel                     Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Option_0_ImplicitCast;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_1_ImplicitCast;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_0_ImplicitCast_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_1_ImplicitCast_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_LowIntensity_ImplicitCast;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_HighIntensity_ImplicitCast;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassVaultWorld_C_PageTransitionIntensityUpdate) == 0x000008, "Wrong alignment on BattlePassVaultWorld_C_PageTransitionIntensityUpdate");
static_assert(sizeof(BattlePassVaultWorld_C_PageTransitionIntensityUpdate) == 0x000048, "Wrong size on BattlePassVaultWorld_C_PageTransitionIntensityUpdate");
static_assert(offsetof(BattlePassVaultWorld_C_PageTransitionIntensityUpdate, MID_Background) == 0x000000, "Member 'BattlePassVaultWorld_C_PageTransitionIntensityUpdate::MID_Background' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_PageTransitionIntensityUpdate, MID_Floor) == 0x000008, "Member 'BattlePassVaultWorld_C_PageTransitionIntensityUpdate::MID_Floor' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_PageTransitionIntensityUpdate, Temp_byte_Variable) == 0x000010, "Member 'BattlePassVaultWorld_C_PageTransitionIntensityUpdate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassVaultWorld_C_PageTransitionIntensityUpdate, Temp_bool_Variable) == 0x000011, "Member 'BattlePassVaultWorld_C_PageTransitionIntensityUpdate::Temp_bool_Variable' has a wrong offset!");
