#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blueprint_Paper_VIM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x14B0 (0x1A10 - 0x0560)
class UBlueprint_Paper_VIM_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0568(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0570(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0578(0x0020)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0598(0x0010)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05A8(0x0020)()
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x05D0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x0AE0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0FF0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1500(0x0510)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_3AF159404BD341EBBF1D83916A014149();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_9E5EF2534AF35AEF656F7798016DF75B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_ADC4973B4FF994FAB62509B5C600BF73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Blueprint_Paper_VIM_AnimGraphNode_AnimDynamics_BCA43E284168E0AB05BB9E98D217441B();
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blueprint_Paper_VIM_C">();
	}
	static class UBlueprint_Paper_VIM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprint_Paper_VIM_C>();
	}
};
static_assert(alignof(UBlueprint_Paper_VIM_C) == 0x000010, "Wrong alignment on UBlueprint_Paper_VIM_C");
static_assert(sizeof(UBlueprint_Paper_VIM_C) == 0x001A10, "Wrong size on UBlueprint_Paper_VIM_C");
static_assert(offsetof(UBlueprint_Paper_VIM_C, UberGraphFrame) == 0x000560, "Member 'UBlueprint_Paper_VIM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimBlueprintExtension_PropertyAccess) == 0x000568, "Member 'UBlueprint_Paper_VIM_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimBlueprintExtension_Base) == 0x000570, "Member 'UBlueprint_Paper_VIM_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_Root) == 0x000578, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_MeshRefPose) == 0x000598, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005A8, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_AnimDynamics_3) == 0x0005D0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_AnimDynamics_2) == 0x000AE0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_AnimDynamics_1) == 0x000FF0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_AnimDynamics) == 0x001500, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

