#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.BP_OnShowTabsSet
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet final
{
public:
	bool                                          bShowTabs;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet, bShowTabs) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet::bShowTabs' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.ExecuteUbergraph_BP_AthenaMapScreenContainer
// 0x0140 (0x0140 - 0x0000)
struct BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowTabs;                            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowCreativeScoreboard;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestsTabActive_ReturnValue;            // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay_2; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkewedTabButton_C*                  CallFunc_Create_ReturnValue;                       // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowActionBarForCurrentTab_ReturnValue; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer) == 0x000140, "Wrong size on BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, EntryPoint) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_bool_Variable) == 0x000004, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_real_Variable) == 0x000008, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_real_Variable_1) == 0x000010, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_bool_Variable_1) == 0x000018, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable) == 0x000028, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_1) == 0x000029, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_IsDesignTime) == 0x00002A, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_bShowTabs) == 0x00002B, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_bShowTabs' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_bShowCreativeScoreboard) == 0x00002C, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_bShowCreativeScoreboard' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_2) == 0x000040, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_3) == 0x000042, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_int_Variable) == 0x000044, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_bool_Variable_2) == 0x00004D, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_IsQuestsTabActive_ReturnValue) == 0x00004E, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_IsQuestsTabActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_IsMobileGame_ReturnValue) == 0x00004F, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_bool_Variable_3) == 0x000050, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Select_Default) == 0x000058, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Select_Default_1) == 0x000070, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_AsFort_Player_Controller_Gameplay) == 0x000090, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_AsFort_Player_Controller_Gameplay' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000A0, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_AsFort_Player_Controller_Gameplay_1) == 0x0000B8, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_AsFort_Player_Controller_Gameplay_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0000C8, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_AsFort_Player_Controller_Gameplay_2) == 0x0000E0, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_AsFort_Player_Controller_Gameplay_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_Create_ReturnValue) == 0x0000F0, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_AddChild_ReturnValue) == 0x0000F8, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000100, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_4) == 0x000108, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000110, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_CustomEvent_bNewInputType) == 0x000118, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x000120, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_ShouldShowActionBarForCurrentTab_ReturnValue) == 0x000128, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_ShouldShowActionBarForCurrentTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1) == 0x000130, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_5) == 0x000138, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_GetCurrentInputType_ReturnValue) == 0x000139, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00013A, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Select_Default_2) == 0x00013B, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_BooleanOR_ReturnValue) == 0x00013C, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Select_Default_3) == 0x00013D, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Select_Default_3' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.HandleCreativePhotoModeActivated
// 0x0028 (0x0028 - 0x0000)
struct BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated) == 0x000028, "Wrong size on BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated, K2Node_DynamicCast_AsFort_Player_Controller_Gameplay) == 0x000018, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated::K2Node_DynamicCast_AsFort_Player_Controller_Gameplay' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.HandleCreativePhotoModeDeactivated
// 0x0038 (0x0038 - 0x0000)
struct BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_Minimap*       CallFunc_GetMiniMapComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated) == 0x000038, "Wrong size on BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated, K2Node_DynamicCast_AsFort_Player_Controller_Gameplay) == 0x000018, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated::K2Node_DynamicCast_AsFort_Player_Controller_Gameplay' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated, CallFunc_GetMiniMapComponent_ReturnValue) == 0x000028, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated::CallFunc_GetMiniMapComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AthenaMapScreenContainer_C_HandleCreativePhotoModeDeactivated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.OnInputMethodChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event, bNewInputType) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_OnInputMethodChanged_Event::bNewInputType' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.OnShowOrHideCreativeScoreboard
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard final
{
public:
	bool                                          bShowCreativeScoreboard;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard, bShowCreativeScoreboard) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard::bShowCreativeScoreboard' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_PreConstruct");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_PreConstruct) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_PreConstruct");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.ShowOrHideScoreboardUI
// 0x0028 (0x0028 - 0x0000)
struct BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI final
{
public:
	class UObject*                                ScoreboardWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bShow;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortHideShowInterface> K2Node_DynamicCast_AsFort_Hide_Show_Interface;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI) == 0x000028, "Wrong size on BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, ScoreboardWidget) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::ScoreboardWidget' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, bShow) == 0x000008, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::bShow' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, K2Node_DynamicCast_AsFort_Hide_Show_Interface) == 0x000010, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::K2Node_DynamicCast_AsFort_Hide_Show_Interface' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.UpdateTabBackgroundSize
// 0x0028 (0x0028 - 0x0000)
struct BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize) == 0x000028, "Wrong size on BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize, Temp_bool_Variable) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize, Temp_byte_Variable) == 0x000001, "Member 'BP_AthenaMapScreenContainer_C_UpdateTabBackgroundSize::Temp_byte_Variable' has a wrong offset!");
