#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioParameterComponent_Pawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AudioParameterQueryData_structs.hpp"
#include "PlayerWaterDepthEnum_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AudioParameterComponent_Pawn.BP_AudioParameterComponent_Pawn_C
// 0x0040 (0x0130 - 0x00F0)
class UBP_AudioParameterComponent_Pawn_C final : public UFortAudioParameterComponent_Pawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 LocalViewTarget;                                   // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAudioParameterQueryData>       QueryAudioParams;                                  // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bDebugEnabled;                                     // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInWater;                                         // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        LocalPlayerPawnTarget;                             // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WaterDepthValue;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerWaterDepthEnum                         PlayerWaterDepth;                                  // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerWaterDepthEnum                         CurrentWaterDepth;                                 // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaterDepthChanged;                                 // 0x012A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void PrintParameter(const struct FAudioParameterQueryData& Parameter, bool Condition);
	void OnWaterUpdate();
	void OnWaterDepthSwitch();
	void OnViewTargetSet(class AActor* Actor);
	void OnExitWater(class AFortPlayerPawn* FortPlayerPawn, const bool bPawnIsOutsideOfAllWaterBodies);
	void OnEnterWater(class AFortPlayerPawn* FortPlayerPawn);
	void Movement_Mode_Change(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	float GetWaterDepthValue();
	void ExecuteUbergraph_BP_AudioParameterComponent_Pawn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AudioParameterComponent_Pawn_C">();
	}
	static class UBP_AudioParameterComponent_Pawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AudioParameterComponent_Pawn_C>();
	}
};
static_assert(alignof(UBP_AudioParameterComponent_Pawn_C) == 0x000008, "Wrong alignment on UBP_AudioParameterComponent_Pawn_C");
static_assert(sizeof(UBP_AudioParameterComponent_Pawn_C) == 0x000130, "Wrong size on UBP_AudioParameterComponent_Pawn_C");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_AudioParameterComponent_Pawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, LocalViewTarget) == 0x0000F8, "Member 'UBP_AudioParameterComponent_Pawn_C::LocalViewTarget' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, QueryAudioParams) == 0x000100, "Member 'UBP_AudioParameterComponent_Pawn_C::QueryAudioParams' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, bDebugEnabled) == 0x000110, "Member 'UBP_AudioParameterComponent_Pawn_C::bDebugEnabled' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, IsInWater) == 0x000111, "Member 'UBP_AudioParameterComponent_Pawn_C::IsInWater' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, LocalPlayerPawnTarget) == 0x000118, "Member 'UBP_AudioParameterComponent_Pawn_C::LocalPlayerPawnTarget' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, WaterDepthValue) == 0x000120, "Member 'UBP_AudioParameterComponent_Pawn_C::WaterDepthValue' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, PlayerWaterDepth) == 0x000128, "Member 'UBP_AudioParameterComponent_Pawn_C::PlayerWaterDepth' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, CurrentWaterDepth) == 0x000129, "Member 'UBP_AudioParameterComponent_Pawn_C::CurrentWaterDepth' has a wrong offset!");
static_assert(offsetof(UBP_AudioParameterComponent_Pawn_C, WaterDepthChanged) == 0x00012A, "Member 'UBP_AudioParameterComponent_Pawn_C::WaterDepthChanged' has a wrong offset!");

}

