#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C
// 0x0088 (0x0828 - 0x07A0)
class UBP_AthenaMapScreenContainer_C final : public UAthenaMapScreenContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DamageTaken;                                       // 0x07A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_AthenaBottomBarWidget_C*           AthenaHUDBottomBar;                                // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OnlineStatusIndicator;                             // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PlayerProfile;                             // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US18_PlayerBattlePassXpAndReward_C*     S18_PlayerBattlePassXpAndReward_310;               // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_RightSideWidgets;                         // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TabButtons;                               // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Mobile;                                    // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_TopBar;                                    // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabBackground;                                     // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DesignTimeTabCount;                                // 0x0820(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowTabs;                                          // 0x0824(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnShowTabsSet(bool bShowTabs);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BP_AthenaMapScreenContainer(int32 EntryPoint);
	void HandleCreativePhotoModeActivated();
	void HandleCreativePhotoModeDeactivated();
	void OnDamageReceived();
	void OnInputMethodChanged_Event(ECommonInputType bNewInputType);
	void OnShowOrHideCreativeScoreboard(bool bShowCreativeScoreboard);
	void OnUpdateActionBar();
	void PreConstruct(bool IsDesignTime);
	void ShowOrHideScoreboardUI(class UObject* ScoreboardWidget, bool bShow);
	void UpdateTabBackgroundSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaMapScreenContainer_C">();
	}
	static class UBP_AthenaMapScreenContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaMapScreenContainer_C>();
	}
};
static_assert(alignof(UBP_AthenaMapScreenContainer_C) == 0x000008, "Wrong alignment on UBP_AthenaMapScreenContainer_C");
static_assert(sizeof(UBP_AthenaMapScreenContainer_C) == 0x000828, "Wrong size on UBP_AthenaMapScreenContainer_C");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, UberGraphFrame) == 0x0007A0, "Member 'UBP_AthenaMapScreenContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, DamageTaken) == 0x0007A8, "Member 'UBP_AthenaMapScreenContainer_C::DamageTaken' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, AthenaHUDBottomBar) == 0x0007B0, "Member 'UBP_AthenaMapScreenContainer_C::AthenaHUDBottomBar' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, BackgroundBlur_0) == 0x0007B8, "Member 'UBP_AthenaMapScreenContainer_C::BackgroundBlur_0' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, HBox_Tabs) == 0x0007C0, "Member 'UBP_AthenaMapScreenContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, NextTabAction) == 0x0007C8, "Member 'UBP_AthenaMapScreenContainer_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, OnlineStatusIndicator) == 0x0007D0, "Member 'UBP_AthenaMapScreenContainer_C::OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, Overlay_2) == 0x0007D8, "Member 'UBP_AthenaMapScreenContainer_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, Overlay_PlayerProfile) == 0x0007E0, "Member 'UBP_AthenaMapScreenContainer_C::Overlay_PlayerProfile' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, PreviousTabAction) == 0x0007E8, "Member 'UBP_AthenaMapScreenContainer_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, S18_PlayerBattlePassXpAndReward_310) == 0x0007F0, "Member 'UBP_AthenaMapScreenContainer_C::S18_PlayerBattlePassXpAndReward_310' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SafeZone_RightSideWidgets) == 0x0007F8, "Member 'UBP_AthenaMapScreenContainer_C::SafeZone_RightSideWidgets' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SafeZone_TabButtons) == 0x000800, "Member 'UBP_AthenaMapScreenContainer_C::SafeZone_TabButtons' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SizeBox_Mobile) == 0x000808, "Member 'UBP_AthenaMapScreenContainer_C::SizeBox_Mobile' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SizeBox_TopBar) == 0x000810, "Member 'UBP_AthenaMapScreenContainer_C::SizeBox_TopBar' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, TabBackground) == 0x000818, "Member 'UBP_AthenaMapScreenContainer_C::TabBackground' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, DesignTimeTabCount) == 0x000820, "Member 'UBP_AthenaMapScreenContainer_C::DesignTimeTabCount' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, ShowTabs) == 0x000824, "Member 'UBP_AthenaMapScreenContainer_C::ShowTabs' has a wrong offset!");

}

