#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Background_Raytracing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Background_Raytracing.BP_Background_Raytracing_C
// 0x0040 (0x02D0 - 0x0290)
class ABP_Background_Raytracing_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_InvertedSphere_BackPlate_Half;                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FullSphere;                                        // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCubemap;                                        // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Brightness;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               TwodTexture;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Cubemap;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FadeColor;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Background_Raytracing_C">();
	}
	static class ABP_Background_Raytracing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Background_Raytracing_C>();
	}
};
static_assert(alignof(ABP_Background_Raytracing_C) == 0x000008, "Wrong alignment on ABP_Background_Raytracing_C");
static_assert(sizeof(ABP_Background_Raytracing_C) == 0x0002D0, "Wrong size on ABP_Background_Raytracing_C");
static_assert(offsetof(ABP_Background_Raytracing_C, SM_InvertedSphere_BackPlate_Half) == 0x000290, "Member 'ABP_Background_Raytracing_C::SM_InvertedSphere_BackPlate_Half' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_Background_Raytracing_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, FullSphere) == 0x0002A0, "Member 'ABP_Background_Raytracing_C::FullSphere' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, UseCubemap) == 0x0002A1, "Member 'ABP_Background_Raytracing_C::UseCubemap' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, Brightness) == 0x0002A8, "Member 'ABP_Background_Raytracing_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, TwodTexture) == 0x0002B0, "Member 'ABP_Background_Raytracing_C::TwodTexture' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, Cubemap) == 0x0002B8, "Member 'ABP_Background_Raytracing_C::Cubemap' has a wrong offset!");
static_assert(offsetof(ABP_Background_Raytracing_C, FadeColor) == 0x0002C0, "Member 'ABP_Background_Raytracing_C::FadeColor' has a wrong offset!");

}

