#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuyResourcesBundleCheckBox

#include "Basic.hpp"

#include "BattlePassBase_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BuyResourcesBundleCheckBox.BP_BuyResourcesBundleCheckBox_C
// 0x0060 (0x1500 - 0x14A0)
class UBP_BuyResourcesBundleCheckBox_C final : public UFortBattlePassCheckBoxButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Check;                                             // 0x14B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       burst;                                             // 0x14B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_BundleText;                                     // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_burst;                                       // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Check;                                       // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Checkbox;                                    // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Default;                                      // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_OneTime;                                      // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_2;                                  // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_BP_BuyResourcesBundleCheckBox(int32 EntryPoint);
	void OnStateChanged(const bool bNewIsChecked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BuyResourcesBundleCheckBox_C">();
	}
	static class UBP_BuyResourcesBundleCheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BuyResourcesBundleCheckBox_C>();
	}
};
static_assert(alignof(UBP_BuyResourcesBundleCheckBox_C) == 0x000010, "Wrong alignment on UBP_BuyResourcesBundleCheckBox_C");
static_assert(sizeof(UBP_BuyResourcesBundleCheckBox_C) == 0x001500, "Wrong size on UBP_BuyResourcesBundleCheckBox_C");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, UberGraphFrame) == 0x0014A0, "Member 'UBP_BuyResourcesBundleCheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Hover) == 0x0014A8, "Member 'UBP_BuyResourcesBundleCheckBox_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Check) == 0x0014B0, "Member 'UBP_BuyResourcesBundleCheckBox_C::Check' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, burst) == 0x0014B8, "Member 'UBP_BuyResourcesBundleCheckBox_C::burst' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, HB_BundleText) == 0x0014C0, "Member 'UBP_BuyResourcesBundleCheckBox_C::HB_BundleText' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Image_burst) == 0x0014C8, "Member 'UBP_BuyResourcesBundleCheckBox_C::Image_burst' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Image_Check) == 0x0014D0, "Member 'UBP_BuyResourcesBundleCheckBox_C::Image_Check' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Image_Checkbox) == 0x0014D8, "Member 'UBP_BuyResourcesBundleCheckBox_C::Image_Checkbox' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Text_Default) == 0x0014E0, "Member 'UBP_BuyResourcesBundleCheckBox_C::Text_Default' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, Text_OneTime) == 0x0014E8, "Member 'UBP_BuyResourcesBundleCheckBox_C::Text_OneTime' has a wrong offset!");
static_assert(offsetof(UBP_BuyResourcesBundleCheckBox_C, WidgetSwitcher_2) == 0x0014F0, "Member 'UBP_BuyResourcesBundleCheckBox_C::WidgetSwitcher_2' has a wrong offset!");

}

