#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleStarModal

#include "Basic.hpp"

#include "BattlePassBase_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BattleStarModal.BP_BattleStarModal_C
// 0x0150 (0x0610 - 0x04C0)
class UBP_BattleStarModal_C final : public UFortBattlePassPurchaseResourcesWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PageEnough;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattlerStarHeader;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattleStarIcon;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattleStarIcon_1;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DividerLine;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderIcon;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_121;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_178;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_209;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_231;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_240;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_241;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bigstar;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DarkBackground;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Left;                                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OriginalCostContainer;                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_UnlockPage;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_26;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StrikeThrough;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Tooltip;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SZ_Currency;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SZ_Legal;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SZ_MainHeader;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BundleWarning;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CurrentBattleStar;                            // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DisclaimerLegal;                              // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FinalCoin;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FutureBattleStar_1;                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_HeaderTitle;                                  // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LevelReminder;                                // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LevelsAmount;                                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LevelsLeft;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_OriginalCost;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuck;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         BattleStarAmount;                                  // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rebate_Amount;                                     // 0x05F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Last_Page_to_unlock;                               // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         New_Page_to_unlock;                                // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TooltipHideDelay;                                  // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ScreenAppearSound;                                 // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_BP_BattleStarModal(int32 EntryPoint);
	void OnAmountChangeButtonClicked();
	void OnOfferUnavailable();
	void OnPurchaseAmountChanged(const int32 NewAmount, const int32 LevelsLeft);
	void OnTotalPriceChanged(const int32 NewPrice);
	void OnUpdatePageUnlockText(const class FText& PageUnlockText);
	void PreConstruct(bool IsDesignTime);
	void Randomize_stars_hovering();
	void Update_Disclaimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleStarModal_C">();
	}
	static class UBP_BattleStarModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BattleStarModal_C>();
	}
};
static_assert(alignof(UBP_BattleStarModal_C) == 0x000008, "Wrong alignment on UBP_BattleStarModal_C");
static_assert(sizeof(UBP_BattleStarModal_C) == 0x000610, "Wrong size on UBP_BattleStarModal_C");
static_assert(offsetof(UBP_BattleStarModal_C, UberGraphFrame) == 0x0004C0, "Member 'UBP_BattleStarModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, PageEnough) == 0x0004C8, "Member 'UBP_BattleStarModal_C::PageEnough' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Intro) == 0x0004D0, "Member 'UBP_BattleStarModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, BattlerStarHeader) == 0x0004D8, "Member 'UBP_BattleStarModal_C::BattlerStarHeader' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, BattleStarIcon) == 0x0004E0, "Member 'UBP_BattleStarModal_C::BattleStarIcon' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, BattleStarIcon_1) == 0x0004E8, "Member 'UBP_BattleStarModal_C::BattleStarIcon_1' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, DividerLine) == 0x0004F0, "Member 'UBP_BattleStarModal_C::DividerLine' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, HeaderIcon) == 0x0004F8, "Member 'UBP_BattleStarModal_C::HeaderIcon' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_121) == 0x000500, "Member 'UBP_BattleStarModal_C::Image_121' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_178) == 0x000508, "Member 'UBP_BattleStarModal_C::Image_178' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_209) == 0x000510, "Member 'UBP_BattleStarModal_C::Image_209' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_231) == 0x000518, "Member 'UBP_BattleStarModal_C::Image_231' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_240) == 0x000520, "Member 'UBP_BattleStarModal_C::Image_240' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_241) == 0x000528, "Member 'UBP_BattleStarModal_C::Image_241' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_bigstar) == 0x000530, "Member 'UBP_BattleStarModal_C::Image_bigstar' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_DarkBackground) == 0x000538, "Member 'UBP_BattleStarModal_C::Image_DarkBackground' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_Left) == 0x000540, "Member 'UBP_BattleStarModal_C::Image_Left' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Image_Right) == 0x000548, "Member 'UBP_BattleStarModal_C::Image_Right' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, MTXButton) == 0x000550, "Member 'UBP_BattleStarModal_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, OriginalCostContainer) == 0x000558, "Member 'UBP_BattleStarModal_C::OriginalCostContainer' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, RichText_UnlockPage) == 0x000560, "Member 'UBP_BattleStarModal_C::RichText_UnlockPage' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, SafeZone_26) == 0x000568, "Member 'UBP_BattleStarModal_C::SafeZone_26' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, StrikeThrough) == 0x000570, "Member 'UBP_BattleStarModal_C::StrikeThrough' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Switcher_Tooltip) == 0x000578, "Member 'UBP_BattleStarModal_C::Switcher_Tooltip' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, SZ_Currency) == 0x000580, "Member 'UBP_BattleStarModal_C::SZ_Currency' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, SZ_Legal) == 0x000588, "Member 'UBP_BattleStarModal_C::SZ_Legal' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, SZ_MainHeader) == 0x000590, "Member 'UBP_BattleStarModal_C::SZ_MainHeader' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_BundleWarning) == 0x000598, "Member 'UBP_BattleStarModal_C::Text_BundleWarning' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_CurrentBattleStar) == 0x0005A0, "Member 'UBP_BattleStarModal_C::Text_CurrentBattleStar' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_DisclaimerLegal) == 0x0005A8, "Member 'UBP_BattleStarModal_C::Text_DisclaimerLegal' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_FinalCoin) == 0x0005B0, "Member 'UBP_BattleStarModal_C::Text_FinalCoin' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_FutureBattleStar_1) == 0x0005B8, "Member 'UBP_BattleStarModal_C::Text_FutureBattleStar_1' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_HeaderTitle) == 0x0005C0, "Member 'UBP_BattleStarModal_C::Text_HeaderTitle' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_LevelReminder) == 0x0005C8, "Member 'UBP_BattleStarModal_C::Text_LevelReminder' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_LevelsAmount) == 0x0005D0, "Member 'UBP_BattleStarModal_C::Text_LevelsAmount' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_LevelsLeft) == 0x0005D8, "Member 'UBP_BattleStarModal_C::Text_LevelsLeft' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Text_OriginalCost) == 0x0005E0, "Member 'UBP_BattleStarModal_C::Text_OriginalCost' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, VBuck) == 0x0005E8, "Member 'UBP_BattleStarModal_C::VBuck' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, BattleStarAmount) == 0x0005F0, "Member 'UBP_BattleStarModal_C::BattleStarAmount' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Rebate_Amount) == 0x0005F4, "Member 'UBP_BattleStarModal_C::Rebate_Amount' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, Last_Page_to_unlock) == 0x0005F8, "Member 'UBP_BattleStarModal_C::Last_Page_to_unlock' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, New_Page_to_unlock) == 0x0005FC, "Member 'UBP_BattleStarModal_C::New_Page_to_unlock' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, TooltipHideDelay) == 0x000600, "Member 'UBP_BattleStarModal_C::TooltipHideDelay' has a wrong offset!");
static_assert(offsetof(UBP_BattleStarModal_C, ScreenAppearSound) == 0x000608, "Member 'UBP_BattleStarModal_C::ScreenAppearSound' has a wrong offset!");

}

