#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DetailLevelMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DetailLevelMesh.BP_DetailLevelMesh_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_DetailLevelMesh_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysVisible;                                     // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotVisibleOnSwitch;                                // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DetailLevelMesh(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DetailLevelMesh_C">();
	}
	static class ABP_DetailLevelMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DetailLevelMesh_C>();
	}
};
static_assert(alignof(ABP_DetailLevelMesh_C) == 0x000008, "Wrong alignment on ABP_DetailLevelMesh_C");
static_assert(sizeof(ABP_DetailLevelMesh_C) == 0x0002B0, "Wrong size on ABP_DetailLevelMesh_C");
static_assert(offsetof(ABP_DetailLevelMesh_C, UberGraphFrame) == 0x000290, "Member 'ABP_DetailLevelMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DetailLevelMesh_C, StaticMesh) == 0x000298, "Member 'ABP_DetailLevelMesh_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_DetailLevelMesh_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_DetailLevelMesh_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DetailLevelMesh_C, AlwaysVisible) == 0x0002A8, "Member 'ABP_DetailLevelMesh_C::AlwaysVisible' has a wrong offset!");
static_assert(offsetof(ABP_DetailLevelMesh_C, NotVisibleOnSwitch) == 0x0002A9, "Member 'ABP_DetailLevelMesh_C::NotVisibleOnSwitch' has a wrong offset!");

}

