#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FrontendQuestPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FrontendQuestPanel.BP_FrontendQuestPanel_C.ExecuteUbergraph_BP_FrontendQuestPanel
// 0x0030 (0x0030 - 0x0000)
struct BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel) == 0x000008, "Wrong alignment on BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel");
static_assert(sizeof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel) == 0x000030, "Wrong size on BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, EntryPoint) == 0x000000, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, Temp_bool_Variable) == 0x000004, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, Temp_real_Variable) == 0x000008, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, Temp_real_Variable_1) == 0x00000C, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000018, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, CallFunc_SpawnSound2D_ReturnValue) == 0x000020, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue) == 0x000028, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel, K2Node_Select_Default) == 0x00002C, "Member 'BP_FrontendQuestPanel_C_ExecuteUbergraph_BP_FrontendQuestPanel::K2Node_Select_Default' has a wrong offset!");

}

