#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_TimerManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.CheckStage
// 0x0030 (0x0030 - 0x0000)
struct BP_Generic_TimerManager_C_CheckStage final
{
public:
	int32                                         SecondsRemaining_0;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStage;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondsUntilEnd;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewState;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_CheckStage) == 0x000004, "Wrong alignment on BP_Generic_TimerManager_C_CheckStage");
static_assert(sizeof(BP_Generic_TimerManager_C_CheckStage) == 0x000030, "Wrong size on BP_Generic_TimerManager_C_CheckStage");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, SecondsRemaining_0) == 0x000000, "Member 'BP_Generic_TimerManager_C_CheckStage::SecondsRemaining_0' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CurrentStage) == 0x000004, "Member 'BP_Generic_TimerManager_C_CheckStage::CurrentStage' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, SecondsUntilEnd) == 0x000008, "Member 'BP_Generic_TimerManager_C_CheckStage::SecondsUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, NewState) == 0x00000C, "Member 'BP_Generic_TimerManager_C_CheckStage::NewState' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Generic_TimerManager_C_CheckStage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_Generic_TimerManager_C_CheckStage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_CheckStage, CallFunc_Less_IntInt_ReturnValue_1) == 0x00002D, "Member 'BP_Generic_TimerManager_C_CheckStage::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.DebugCountdown
// 0x0008 (0x0008 - 0x0000)
struct BP_Generic_TimerManager_C_DebugCountdown final
{
public:
	double                                        Server_Seconds;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_DebugCountdown) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_DebugCountdown");
static_assert(sizeof(BP_Generic_TimerManager_C_DebugCountdown) == 0x000008, "Wrong size on BP_Generic_TimerManager_C_DebugCountdown");
static_assert(offsetof(BP_Generic_TimerManager_C_DebugCountdown, Server_Seconds) == 0x000000, "Member 'BP_Generic_TimerManager_C_DebugCountdown::Server_Seconds' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.ExecuteUbergraph_BP_Generic_TimerManager
// 0x0440 (0x0440 - 0x0000)
struct BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Temp_struct_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00C8(0x0020)(ConstParm)
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x00E8(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0124(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0148(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0168(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue_2;  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeconds_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue;                      // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_1;                    // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_2;               // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_3;               // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_2;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_3;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHours_ReturnValue;                     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_2;                    // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_3;                    // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_4;               // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_5;               // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_4;        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_5;        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_6;               // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_7;               // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_6;        // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_7;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue_3;  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x039C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x03B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Server_Seconds;                 // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_4;               // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateFrontEnd*                 K2Node_DynamicCast_AsFort_Game_State_Front_End;    // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4; // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5; // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_6; // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_7; // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager");
static_assert(sizeof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager) == 0x000440, "Wrong size on BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, EntryPoint) == 0x000000, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName_1) == 0x000008, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000018, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000020, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000028, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName) == 0x000038, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd) == 0x000048, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin) == 0x000050, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio) == 0x000058, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_real_Variable) == 0x000068, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable) == 0x000070, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable_1) == 0x000078, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_string_Variable) == 0x000080, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_MatchReadyAsync_ReturnValue) == 0x0000A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_GameState) == 0x0000B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_Playlist) == 0x0000C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_PlaylistContextTags) == 0x0000C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable_2) == 0x0000E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_object_Variable) == 0x000108, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_object_Variable_1) == 0x000110, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000118, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000121, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000124, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_HasAuthority_ReturnValue) == 0x000130, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue) == 0x000138, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000140, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x000148, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000158, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FTrunc_ReturnValue) == 0x000160, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_6) == 0x000168, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Max_ReturnValue) == 0x000174, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000178, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x000180, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000188, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FClamp_ReturnValue) == 0x000190, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000198, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_1) == 0x0001A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_1) == 0x0001A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetTotalSeconds_ReturnValue) == 0x0001B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_2) == 0x0001C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_2) == 0x0001C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_2) == 0x0001D0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0001D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_Has_Been_Initd_Variable) == 0x0001E0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FTrunc_ReturnValue_1) == 0x0001E4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Max_ReturnValue_1) == 0x0001EC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_MakeTimespan_ReturnValue) == 0x0001F0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSeconds_ReturnValue) == 0x0001F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetMinutes_ReturnValue) == 0x0001FC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue) == 0x000200, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000210, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue) == 0x000220, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_1) == 0x000230, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue) == 0x000240, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_1) == 0x000250, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000260, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_1) == 0x000268, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_2) == 0x000270, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_3) == 0x000280, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_2) == 0x000290, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_3) == 0x000298, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetHours_ReturnValue) == 0x0002A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetDays_ReturnValue) == 0x0002A4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0002A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0002B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_2) == 0x0002C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_3) == 0x0002D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_4) == 0x0002E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_5) == 0x0002F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_4) == 0x000308, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_5) == 0x000310, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_6) == 0x000318, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_7) == 0x000328, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_6) == 0x000338, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToDouble_ReturnValue_7) == 0x000340, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_IsClosed_Variable) == 0x000348, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_Has_Been_Initd_Variable_1) == 0x000349, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_3) == 0x000350, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000358, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000360, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000368, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000370, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_3) == 0x000378, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x000380, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000388, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_WatchCalendarEvent_ReturnValue) == 0x000390, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_3) == 0x000398, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_7) == 0x00039C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_IsClosed_Variable_1) == 0x0003A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0003B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
