#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PriceChangeAcknowledgeCheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PriceChangeAcknowledgeCheckBox.BP_PriceChangeAcknowledgeCheckBox_C
// 0x0040 (0x14D0 - 0x1490)
class UBP_PriceChangeAcknowledgeCheckBox_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Check;                                             // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       burst;                                             // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_BundleText;                                     // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Check;                                       // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Checkbox;                                    // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BP_PriceChangeAcknowledgeCheckBox(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PriceChangeAcknowledgeCheckBox_C">();
	}
	static class UBP_PriceChangeAcknowledgeCheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PriceChangeAcknowledgeCheckBox_C>();
	}
};
static_assert(alignof(UBP_PriceChangeAcknowledgeCheckBox_C) == 0x000010, "Wrong alignment on UBP_PriceChangeAcknowledgeCheckBox_C");
static_assert(sizeof(UBP_PriceChangeAcknowledgeCheckBox_C) == 0x0014D0, "Wrong size on UBP_PriceChangeAcknowledgeCheckBox_C");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, UberGraphFrame) == 0x001490, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, Hover) == 0x001498, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, Check) == 0x0014A0, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::Check' has a wrong offset!");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, burst) == 0x0014A8, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::burst' has a wrong offset!");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, HB_BundleText) == 0x0014B0, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::HB_BundleText' has a wrong offset!");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, Image_Check) == 0x0014B8, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::Image_Check' has a wrong offset!");
static_assert(offsetof(UBP_PriceChangeAcknowledgeCheckBox_C, Image_Checkbox) == 0x0014C0, "Member 'UBP_PriceChangeAcknowledgeCheckBox_C::Image_Checkbox' has a wrong offset!");

}

