#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SidebarCollectionScreenContainerTabButtonEditTags

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SidebarCollectionScreenContainerTabButtonEditTags.BP_SidebarCollectionScreenContainerTabButtonEditTags_C
// 0x00B0 (0x1600 - 0x1550)
class UBP_SidebarCollectionScreenContainerTabButtonEditTags_C final : public UFortSidebarCollectionScreenContainerTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected_Touch;                                    // 0x1558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselected_Touch;                                  // 0x1560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_DisabledUnhover;                               // 0x1568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_DisabledHover;                                 // 0x1570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_DisabledUnhovered;                             // 0x1578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_DisabledHovered;                               // 0x1580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_Enabled;                                       // 0x1588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_Unhovered;                                     // 0x1590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_Hovered;                                       // 0x1598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tag_Reset;                                         // 0x15A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhovered;                                         // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselected;                                        // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Mobile_Spacer;                                     // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewBang;                                           // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_MobileMultiplier;                         // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isTab;                                             // 0x15F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnTagCategoryChange(const ESocialTagCategory InTagCategory);
	void BP_OnUnhovered();
	void BP_ShowBang(bool bShow);
	void Construct();
	void ExecuteUbergraph_BP_SidebarCollectionScreenContainerTabButtonEditTags(int32 EntryPoint);
	void Finished_D3AB39584598BB6DA7EE7C98805576AC();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SidebarCollectionScreenContainerTabButtonEditTags_C">();
	}
	static class UBP_SidebarCollectionScreenContainerTabButtonEditTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SidebarCollectionScreenContainerTabButtonEditTags_C>();
	}
};
static_assert(alignof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C) == 0x000010, "Wrong alignment on UBP_SidebarCollectionScreenContainerTabButtonEditTags_C");
static_assert(sizeof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C) == 0x001600, "Wrong size on UBP_SidebarCollectionScreenContainerTabButtonEditTags_C");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, UberGraphFrame) == 0x001550, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Selected_Touch) == 0x001558, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Selected_Touch' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Unselected_Touch) == 0x001560, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Unselected_Touch' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_DisabledUnhover) == 0x001568, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_DisabledUnhover' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_DisabledHover) == 0x001570, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_DisabledHover' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_DisabledUnhovered) == 0x001578, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_DisabledUnhovered' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_DisabledHovered) == 0x001580, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_DisabledHovered' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_Enabled) == 0x001588, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_Enabled' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_Unhovered) == 0x001590, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_Unhovered' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_Hovered) == 0x001598, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_Hovered' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Tag_Reset) == 0x0015A0, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Tag_Reset' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Reset) == 0x0015A8, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Reset' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Unhovered) == 0x0015B0, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Unhovered' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Hovered) == 0x0015B8, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Hovered' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Unselected) == 0x0015C0, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Unselected' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Selected) == 0x0015C8, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Selected' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, HorizontalBox_0) == 0x0015D0, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Mobile_Spacer) == 0x0015D8, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Mobile_Spacer' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, NewBang) == 0x0015E0, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::NewBang' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, Overlay_0) == 0x0015E8, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, ScaleBox_MobileMultiplier) == 0x0015F0, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::ScaleBox_MobileMultiplier' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerTabButtonEditTags_C, isTab) == 0x0015F8, "Member 'UBP_SidebarCollectionScreenContainerTabButtonEditTags_C::isTab' has a wrong offset!");

}

