#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SparksCosmeticComponent

#include "Basic.hpp"

#include "SparksCosmeticsRuntime_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SparksCosmeticComponent.BP_SparksCosmeticComponent_C
// 0x0018 (0x0478 - 0x0460)
class UBP_SparksCosmeticComponent_C final : public USparksCosmeticComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGameplayEventRouterComponent*          Event_Router;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Sparks_Dbg_CosmeticPicker_C*       DebugWidget;                                       // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Debug_BP_ShowCosmeticPicker(bool bShow);
	void ExecuteUbergraph_BP_SparksCosmeticComponent(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SparksCosmeticComponent_C">();
	}
	static class UBP_SparksCosmeticComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SparksCosmeticComponent_C>();
	}
};
static_assert(alignof(UBP_SparksCosmeticComponent_C) == 0x000008, "Wrong alignment on UBP_SparksCosmeticComponent_C");
static_assert(sizeof(UBP_SparksCosmeticComponent_C) == 0x000478, "Wrong size on UBP_SparksCosmeticComponent_C");
static_assert(offsetof(UBP_SparksCosmeticComponent_C, UberGraphFrame) == 0x000460, "Member 'UBP_SparksCosmeticComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SparksCosmeticComponent_C, Event_Router) == 0x000468, "Member 'UBP_SparksCosmeticComponent_C::Event_Router' has a wrong offset!");
static_assert(offsetof(UBP_SparksCosmeticComponent_C, DebugWidget) == 0x000470, "Member 'UBP_SparksCosmeticComponent_C::DebugWidget' has a wrong offset!");

}

