#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleCosmeticsAMUC

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_VehicleCosmeticsAMUC.BP_VehicleCosmeticsAMUC_C.ExecuteUbergraph_BP_VehicleCosmeticsAMUC
// 0x0150 (0x0150 - 0x0000)
struct BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeModePlaylist_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0018(0x00D0)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleTags_self_CastInput;            // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetVehicleTags_ReturnValue;               // 0x0110(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0140(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC) == 0x000008, "Wrong alignment on BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC");
static_assert(sizeof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC) == 0x000150, "Wrong size on BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, EntryPoint) == 0x000000, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_GetGameStateAthena_ReturnValue) == 0x000008, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_IsCreativeModePlaylist_ReturnValue) == 0x000010, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_IsCreativeModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000018, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x0000F0, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_GetVehicleTags_self_CastInput) == 0x000100, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_GetVehicleTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_GetVehicleTags_ReturnValue) == 0x000110, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_GetVehicleTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_HasTag_ReturnValue) == 0x000130, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_HasTag_ReturnValue_1) == 0x000131, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_BooleanAND_ReturnValue) == 0x000132, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, CallFunc_BooleanOR_ReturnValue) == 0x000133, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC, K2Node_CreateDelegate_OutputDelegate_1) == 0x000140, "Member 'BP_VehicleCosmeticsAMUC_C_ExecuteUbergraph_BP_VehicleCosmeticsAMUC::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

