#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendAISpawner_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VendAISpawner_Base.BP_VendAISpawner_Base_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_VendAISpawner_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpawnDelay;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    EventRowHandle;                                    // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_VendAISpawner_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VendAISpawner_Base_C">();
	}
	static class ABP_VendAISpawner_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VendAISpawner_Base_C>();
	}
};
static_assert(alignof(ABP_VendAISpawner_Base_C) == 0x000008, "Wrong alignment on ABP_VendAISpawner_Base_C");
static_assert(sizeof(ABP_VendAISpawner_Base_C) == 0x0002B8, "Wrong size on ABP_VendAISpawner_Base_C");
static_assert(offsetof(ABP_VendAISpawner_Base_C, UberGraphFrame) == 0x000290, "Member 'ABP_VendAISpawner_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VendAISpawner_Base_C, Niagara) == 0x000298, "Member 'ABP_VendAISpawner_Base_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_VendAISpawner_Base_C, SpawnDelay) == 0x0002A0, "Member 'ABP_VendAISpawner_Base_C::SpawnDelay' has a wrong offset!");
static_assert(offsetof(ABP_VendAISpawner_Base_C, EventRowHandle) == 0x0002A8, "Member 'ABP_VendAISpawner_Base_C::EventRowHandle' has a wrong offset!");

}

