#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VictoryDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VictoryDrone.BP_VictoryDrone_C
// 0x0070 (0x0388 - 0x0318)
class ABP_VictoryDrone_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponentBudgeted*         SkeletalMeshComponentBudgeted;                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class ABP_VictoryDrone_C* Drone)> SpawnOutAnimEndedDispatcher;                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        AnimPlayRate;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               StaticMeshMID;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TeleportIn;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsAthena;                                          // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              TargetPlayer;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UParticleSystemComponent*               CharacterAttached;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InLobby;                                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsNPC;                                             // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachPoint;                                       // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isDecoy;                                           // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Mesh_for_Attachment;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnNPCDeath;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_Death_Audio(class USoundBase* Sound_to_Spawn);
	void Decoy_FX_Parameters(TArray<struct FParticleSysParam>* Instance_Parameters);
	void ExecuteUbergraph_BP_VictoryDrone(int32 EntryPoint);
	void InitDrone();
	void NotifyTeleportFinishedTriggered();
	void NPC_FX_Parameters(TArray<struct FParticleSysParam>* Instance_Parameters);
	void OnSpawnOutAnimEnded(class UAnimMontage* Montage, bool bInterrupted);
	void PlaySpawnAnim();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VictoryDrone_C">();
	}
	static class ABP_VictoryDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VictoryDrone_C>();
	}
};
static_assert(alignof(ABP_VictoryDrone_C) == 0x000008, "Wrong alignment on ABP_VictoryDrone_C");
static_assert(sizeof(ABP_VictoryDrone_C) == 0x000388, "Wrong size on ABP_VictoryDrone_C");
static_assert(offsetof(ABP_VictoryDrone_C, UberGraphFrame) == 0x000318, "Member 'ABP_VictoryDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SkeletalMeshComponentBudgeted) == 0x000320, "Member 'ABP_VictoryDrone_C::SkeletalMeshComponentBudgeted' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, Scene) == 0x000328, "Member 'ABP_VictoryDrone_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SpawnOutAnimEndedDispatcher) == 0x000330, "Member 'ABP_VictoryDrone_C::SpawnOutAnimEndedDispatcher' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, AnimPlayRate) == 0x000340, "Member 'ABP_VictoryDrone_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, StaticMeshMID) == 0x000348, "Member 'ABP_VictoryDrone_C::StaticMeshMID' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, TeleportIn) == 0x000350, "Member 'ABP_VictoryDrone_C::TeleportIn' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, IsAthena) == 0x000351, "Member 'ABP_VictoryDrone_C::IsAthena' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, TargetPlayer) == 0x000358, "Member 'ABP_VictoryDrone_C::TargetPlayer' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, CharacterAttached) == 0x000360, "Member 'ABP_VictoryDrone_C::CharacterAttached' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, InLobby) == 0x000368, "Member 'ABP_VictoryDrone_C::InLobby' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, IsNPC) == 0x000369, "Member 'ABP_VictoryDrone_C::IsNPC' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, AttachPoint) == 0x00036C, "Member 'ABP_VictoryDrone_C::AttachPoint' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, isDecoy) == 0x000370, "Member 'ABP_VictoryDrone_C::isDecoy' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, Mesh_for_Attachment) == 0x000378, "Member 'ABP_VictoryDrone_C::Mesh_for_Attachment' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SoundOnNPCDeath) == 0x000380, "Member 'ABP_VictoryDrone_C::SoundOnNPCDeath' has a wrong offset!");

}

