#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleCosmeticsAMUC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "VehicleCosmeticsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleCosmeticsAMUC.BP_VehicleCosmeticsAMUC_C
// 0x0018 (0x0690 - 0x0678)
class UBP_VehicleCosmeticsAMUC_C final : public UVehicleCosmeticsAssembledMeshUserComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortAthenaVehicle*                     VehiclePawn;                                       // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_LoopingApplication;                             // 0x0688(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyInitialGC();
	void ExecuteUbergraph_BP_VehicleCosmeticsAMUC(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RemoveInitialGC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleCosmeticsAMUC_C">();
	}
	static class UBP_VehicleCosmeticsAMUC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VehicleCosmeticsAMUC_C>();
	}
};
static_assert(alignof(UBP_VehicleCosmeticsAMUC_C) == 0x000008, "Wrong alignment on UBP_VehicleCosmeticsAMUC_C");
static_assert(sizeof(UBP_VehicleCosmeticsAMUC_C) == 0x000690, "Wrong size on UBP_VehicleCosmeticsAMUC_C");
static_assert(offsetof(UBP_VehicleCosmeticsAMUC_C, UberGraphFrame) == 0x000678, "Member 'UBP_VehicleCosmeticsAMUC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_VehicleCosmeticsAMUC_C, VehiclePawn) == 0x000680, "Member 'UBP_VehicleCosmeticsAMUC_C::VehiclePawn' has a wrong offset!");
static_assert(offsetof(UBP_VehicleCosmeticsAMUC_C, GC_LoopingApplication) == 0x000688, "Member 'UBP_VehicleCosmeticsAMUC_C::GC_LoopingApplication' has a wrong offset!");

}

