#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_BattlePassRewardPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePassS28UI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS28_BattlePassRewardPage.BPS28_BattlePassRewardPage_C
// 0x00D8 (0x0690 - 0x05B8)
class UBPS28_BattlePassRewardPage_C final : public UBattlePassRewardPageS28
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowTextSupportGradient;                           // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowPrevClicked;                                  // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowPrevHover;                                    // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowNextClicked;                                  // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowNextHover;                                    // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Next;                                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Prev;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS28_BattlePassRewardTrack_C*         BPS23_BattlePassRewardTrack;                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_PageSwitcher;                                   // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget_Left;                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget_Right;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NextPage;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Previous;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PageSelection;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextSupportGradient;                               // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, Interp, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NextButtonSound;                                   // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PrevButtonSound;                                   // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoverButtonSound;                                  // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentGradientColor;                              // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NextGradientColor;                                 // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevPageNumber;                                    // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnInit;                                           // 0x068C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BPS23_BattlePassRewardPage_Button_NextPage_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__BPS23_BattlePassRewardPage_Button_NextPage_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__BPS23_BattlePassRewardPage_Button_NextPage_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__BPS23_BattlePassRewardPage_Button_PreviousPage_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__BPS23_BattlePassRewardPage_Button_PreviousPage_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__BPS23_BattlePassRewardPage_Button_PreviousPage_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnActivated();
	void ExecuteUbergraph_BPS28_BattlePassRewardPage(int32 EntryPoint);
	void HandleSupportGradient();
	void On_Input_Method_Change(ECommonInputType bNewInputType);
	void OnInitForPageType(const ERewardPageType InRewardPageType);
	void OnInitialized();
	void OnInputMethodChanged(const ECommonInputType InputType);
	void OnLoadingScreenSelectedChanged(bool bIsSelected);
	void OnPageChanged(const int32 PageNumber, const int32 RewardPageTotal);
	void PageNavigator_Event_0(class UPageNavigator_C* PageNavigator);
	void SequenceEvent__ENTRYPOINTBPS28_BattlePassRewardPage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS28_BattlePassRewardPage_C">();
	}
	static class UBPS28_BattlePassRewardPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS28_BattlePassRewardPage_C>();
	}
};
static_assert(alignof(UBPS28_BattlePassRewardPage_C) == 0x000008, "Wrong alignment on UBPS28_BattlePassRewardPage_C");
static_assert(sizeof(UBPS28_BattlePassRewardPage_C) == 0x000690, "Wrong size on UBPS28_BattlePassRewardPage_C");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, UberGraphFrame) == 0x0005B8, "Member 'UBPS28_BattlePassRewardPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, ShowTextSupportGradient) == 0x0005C0, "Member 'UBPS28_BattlePassRewardPage_C::ShowTextSupportGradient' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, ArrowPrevClicked) == 0x0005C8, "Member 'UBPS28_BattlePassRewardPage_C::ArrowPrevClicked' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, ArrowPrevHover) == 0x0005D0, "Member 'UBPS28_BattlePassRewardPage_C::ArrowPrevHover' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, ArrowNextClicked) == 0x0005D8, "Member 'UBPS28_BattlePassRewardPage_C::ArrowNextClicked' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, ArrowNextHover) == 0x0005E0, "Member 'UBPS28_BattlePassRewardPage_C::ArrowNextHover' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, Intro) == 0x0005E8, "Member 'UBPS28_BattlePassRewardPage_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, Arrow_Next) == 0x0005F0, "Member 'UBPS28_BattlePassRewardPage_C::Arrow_Next' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, Arrow_Prev) == 0x0005F8, "Member 'UBPS28_BattlePassRewardPage_C::Arrow_Prev' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, BPS23_BattlePassRewardTrack) == 0x000600, "Member 'UBPS28_BattlePassRewardPage_C::BPS23_BattlePassRewardTrack' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, HB_PageSwitcher) == 0x000608, "Member 'UBPS28_BattlePassRewardPage_C::HB_PageSwitcher' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, InputActionWidget_Left) == 0x000610, "Member 'UBPS28_BattlePassRewardPage_C::InputActionWidget_Left' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, InputActionWidget_Right) == 0x000618, "Member 'UBPS28_BattlePassRewardPage_C::InputActionWidget_Right' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, Overlay_NextPage) == 0x000620, "Member 'UBPS28_BattlePassRewardPage_C::Overlay_NextPage' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, Overlay_Previous) == 0x000628, "Member 'UBPS28_BattlePassRewardPage_C::Overlay_Previous' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, SizeBox_0) == 0x000630, "Member 'UBPS28_BattlePassRewardPage_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, SizeBox_1) == 0x000638, "Member 'UBPS28_BattlePassRewardPage_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, Text_PageSelection) == 0x000640, "Member 'UBPS28_BattlePassRewardPage_C::Text_PageSelection' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, TextSupportGradient) == 0x000648, "Member 'UBPS28_BattlePassRewardPage_C::TextSupportGradient' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, NextButtonSound) == 0x000650, "Member 'UBPS28_BattlePassRewardPage_C::NextButtonSound' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, PrevButtonSound) == 0x000658, "Member 'UBPS28_BattlePassRewardPage_C::PrevButtonSound' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, HoverButtonSound) == 0x000660, "Member 'UBPS28_BattlePassRewardPage_C::HoverButtonSound' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, CurrentGradientColor) == 0x000668, "Member 'UBPS28_BattlePassRewardPage_C::CurrentGradientColor' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, NextGradientColor) == 0x000678, "Member 'UBPS28_BattlePassRewardPage_C::NextGradientColor' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, PrevPageNumber) == 0x000688, "Member 'UBPS28_BattlePassRewardPage_C::PrevPageNumber' has a wrong offset!");
static_assert(offsetof(UBPS28_BattlePassRewardPage_C, bOnInit) == 0x00068C, "Member 'UBPS28_BattlePassRewardPage_C::bOnInit' has a wrong offset!");

}

