#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_WarningTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "BattlePassS28UI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS28_WarningTooltip.BPS28_WarningTooltip_C
// 0x0028 (0x02E8 - 0x02C0)
class UBPS28_WarningTooltip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         CustomText;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_Description;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              VisibilitySwitcher_Description;                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS28_WarningTooltip(int32 EntryPoint);
	void PrepareWidget(ERewardWarningTooltipType28 EWarningPopup, const class FText& CustomText_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS28_WarningTooltip_C">();
	}
	static class UBPS28_WarningTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS28_WarningTooltip_C>();
	}
};
static_assert(alignof(UBPS28_WarningTooltip_C) == 0x000008, "Wrong alignment on UBPS28_WarningTooltip_C");
static_assert(sizeof(UBPS28_WarningTooltip_C) == 0x0002E8, "Wrong size on UBPS28_WarningTooltip_C");
static_assert(offsetof(UBPS28_WarningTooltip_C, UberGraphFrame) == 0x0002C0, "Member 'UBPS28_WarningTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS28_WarningTooltip_C, CustomText) == 0x0002C8, "Member 'UBPS28_WarningTooltip_C::CustomText' has a wrong offset!");
static_assert(offsetof(UBPS28_WarningTooltip_C, Icon) == 0x0002D0, "Member 'UBPS28_WarningTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UBPS28_WarningTooltip_C, Text_Description) == 0x0002D8, "Member 'UBPS28_WarningTooltip_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UBPS28_WarningTooltip_C, VisibilitySwitcher_Description) == 0x0002E0, "Member 'UBPS28_WarningTooltip_C::VisibilitySwitcher_Description' has a wrong offset!");

}

