#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_HoldableCloseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C
// 0x0090 (0x15C0 - 0x1530)
class UBPS28_HoldableCloseButton_C final : public UFortHoldableButton
{
public:
	uint8                                         Pad_1528[0x8];                                     // 0x1528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x1540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GamepadProgress;                             // 0x1558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input;                                     // 0x1560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_50;                                    // 0x1568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_KBM;                                       // 0x1578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextButton_Text;                                   // 0x1580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x1588(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        In_Min_Desired_Width;                              // 0x15A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        In_Min_Desired_Height;                             // 0x15A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hold_Completed;                                    // 0x15B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BPS28_HoldableCloseButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_style(bool Using_Gamepad);
	void UpdateTextAndStyle(ECommonInputType Input_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS28_HoldableCloseButton_C">();
	}
	static class UBPS28_HoldableCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS28_HoldableCloseButton_C>();
	}
};
static_assert(alignof(UBPS28_HoldableCloseButton_C) == 0x000010, "Wrong alignment on UBPS28_HoldableCloseButton_C");
static_assert(sizeof(UBPS28_HoldableCloseButton_C) == 0x0015C0, "Wrong size on UBPS28_HoldableCloseButton_C");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, UberGraphFrame) == 0x001530, "Member 'UBPS28_HoldableCloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, Hover) == 0x001538, "Member 'UBPS28_HoldableCloseButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, HoldCompleted) == 0x001540, "Member 'UBPS28_HoldableCloseButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, HoldProgress) == 0x001548, "Member 'UBPS28_HoldableCloseButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, Image_Background) == 0x001550, "Member 'UBPS28_HoldableCloseButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, Image_GamepadProgress) == 0x001558, "Member 'UBPS28_HoldableCloseButton_C::Image_GamepadProgress' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, Overlay_Input) == 0x001560, "Member 'UBPS28_HoldableCloseButton_C::Overlay_Input' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, ProgressBar_50) == 0x001568, "Member 'UBPS28_HoldableCloseButton_C::ProgressBar_50' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, SizeBox_Height) == 0x001570, "Member 'UBPS28_HoldableCloseButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, SizeBox_KBM) == 0x001578, "Member 'UBPS28_HoldableCloseButton_C::SizeBox_KBM' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, TextButton_Text) == 0x001580, "Member 'UBPS28_HoldableCloseButton_C::TextButton_Text' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, In_Text) == 0x001588, "Member 'UBPS28_HoldableCloseButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, In_Min_Desired_Width) == 0x0015A0, "Member 'UBPS28_HoldableCloseButton_C::In_Min_Desired_Width' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, In_Min_Desired_Height) == 0x0015A8, "Member 'UBPS28_HoldableCloseButton_C::In_Min_Desired_Height' has a wrong offset!");
static_assert(offsetof(UBPS28_HoldableCloseButton_C, Hold_Completed) == 0x0015B0, "Member 'UBPS28_HoldableCloseButton_C::Hold_Completed' has a wrong offset!");

}

