#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_BattlePassRewardTrack

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS28_BattlePassRewardTrack.BPS28_BattlePassRewardTrack_C.ExecuteUbergraph_BPS28_BattlePassRewardTrack
// 0x0070 (0x0070 - 0x0000)
struct BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridPanel*                             K2Node_DynamicCast_AsGrid_Panel;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS28_BattlePassPrerequisiteHeader_C*  K2Node_DynamicCast_AsBPS28_Battle_Pass_Prerequisite_Header; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack) == 0x000008, "Wrong alignment on BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack");
static_assert(sizeof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack) == 0x000070, "Wrong size on BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, EntryPoint) == 0x000000, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, Temp_byte_Variable) == 0x000004, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, Temp_byte_Variable_1) == 0x000005, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, Temp_bool_True_if_break_was_hit_Variable) == 0x000006, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, Temp_bool_Variable) == 0x000020, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, K2Node_DynamicCast_AsGrid_Panel) == 0x000028, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::K2Node_DynamicCast_AsGrid_Panel' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, K2Node_Select_Default) == 0x000048, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_Array_Get_Item) == 0x000050, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, K2Node_DynamicCast_AsBPS28_Battle_Pass_Prerequisite_Header) == 0x000060, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::K2Node_DynamicCast_AsBPS28_Battle_Pass_Prerequisite_Header' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'BPS28_BattlePassRewardTrack_C_ExecuteUbergraph_BPS28_BattlePassRewardTrack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

