#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_HoldableCloseButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.BP_OnHoldDecreased
// 0x0004 (0x0004 - 0x0000)
struct BPS28_HoldableCloseButton_C_BP_OnHoldDecreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_BP_OnHoldDecreased) == 0x000004, "Wrong alignment on BPS28_HoldableCloseButton_C_BP_OnHoldDecreased");
static_assert(sizeof(BPS28_HoldableCloseButton_C_BP_OnHoldDecreased) == 0x000004, "Wrong size on BPS28_HoldableCloseButton_C_BP_OnHoldDecreased");
static_assert(offsetof(BPS28_HoldableCloseButton_C_BP_OnHoldDecreased, HoldPercentage) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_BP_OnHoldDecreased::HoldPercentage' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.BP_OnHoldEnded
// 0x0008 (0x0008 - 0x0000)
struct BPS28_HoldableCloseButton_C_BP_OnHoldEnded final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_BP_OnHoldEnded) == 0x000004, "Wrong alignment on BPS28_HoldableCloseButton_C_BP_OnHoldEnded");
static_assert(sizeof(BPS28_HoldableCloseButton_C_BP_OnHoldEnded) == 0x000008, "Wrong size on BPS28_HoldableCloseButton_C_BP_OnHoldEnded");
static_assert(offsetof(BPS28_HoldableCloseButton_C_BP_OnHoldEnded, HoldPercentage) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_BP_OnHoldEnded::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_BP_OnHoldEnded, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BPS28_HoldableCloseButton_C_BP_OnHoldEnded::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.BP_OnHoldIncreased
// 0x0004 (0x0004 - 0x0000)
struct BPS28_HoldableCloseButton_C_BP_OnHoldIncreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_BP_OnHoldIncreased) == 0x000004, "Wrong alignment on BPS28_HoldableCloseButton_C_BP_OnHoldIncreased");
static_assert(sizeof(BPS28_HoldableCloseButton_C_BP_OnHoldIncreased) == 0x000004, "Wrong size on BPS28_HoldableCloseButton_C_BP_OnHoldIncreased");
static_assert(offsetof(BPS28_HoldableCloseButton_C_BP_OnHoldIncreased, HoldPercentage) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_BP_OnHoldIncreased::HoldPercentage' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.BP_OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BPS28_HoldableCloseButton_C_BP_OnHoldStarted final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_BP_OnHoldStarted) == 0x000004, "Wrong alignment on BPS28_HoldableCloseButton_C_BP_OnHoldStarted");
static_assert(sizeof(BPS28_HoldableCloseButton_C_BP_OnHoldStarted) == 0x000008, "Wrong size on BPS28_HoldableCloseButton_C_BP_OnHoldStarted");
static_assert(offsetof(BPS28_HoldableCloseButton_C_BP_OnHoldStarted, HoldPercentage) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_BP_OnHoldStarted::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_BP_OnHoldStarted, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BPS28_HoldableCloseButton_C_BP_OnHoldStarted::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.ExecuteUbergraph_BPS28_HoldableCloseButton
// 0x00E0 (0x00E0 - 0x0000)
struct BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage_3;                     // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation_1;       // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_2;                     // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation;         // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_1;                     // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage;                       // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton) == 0x000008, "Wrong alignment on BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton");
static_assert(sizeof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton) == 0x0000E0, "Wrong size on BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, EntryPoint) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_HoldPercentage_3) == 0x000004, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_HoldPercentage_3' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_bInUseSecondaryHoldAnimation_1) == 0x000008, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_bInUseSecondaryHoldAnimation_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_HoldPercentage_2) == 0x00000C, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_HoldPercentage_2' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_bInUseSecondaryHoldAnimation) == 0x000010, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_bInUseSecondaryHoldAnimation' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_HoldPercentage_1) == 0x000014, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_HoldPercentage_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_HoldPercentage) == 0x000018, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_HoldPercentage' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_GetEndTime_ReturnValue) == 0x00001C, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_GetEndTime_ReturnValue_1) == 0x000020, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_Event_IsDesignTime) == 0x000050, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000060, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000068, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_GetContext_ReturnValue) == 0x000070, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_GetContext_ReturnValue_1) == 0x000078, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000090, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x0000A8, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000B8, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x0000C0, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x0000C8, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast) == 0x0000CC, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x0000D0, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x0000D4, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton, CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast) == 0x0000D8, "Member 'BPS28_HoldableCloseButton_C_ExecuteUbergraph_BPS28_HoldableCloseButton::CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPS28_HoldableCloseButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_PreConstruct) == 0x000001, "Wrong alignment on BPS28_HoldableCloseButton_C_PreConstruct");
static_assert(sizeof(BPS28_HoldableCloseButton_C_PreConstruct) == 0x000001, "Wrong size on BPS28_HoldableCloseButton_C_PreConstruct");
static_assert(offsetof(BPS28_HoldableCloseButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.Update style
// 0x0001 (0x0001 - 0x0000)
struct BPS28_HoldableCloseButton_C_Update_style final
{
public:
	bool                                          Using_Gamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_Update_style) == 0x000001, "Wrong alignment on BPS28_HoldableCloseButton_C_Update_style");
static_assert(sizeof(BPS28_HoldableCloseButton_C_Update_style) == 0x000001, "Wrong size on BPS28_HoldableCloseButton_C_Update_style");
static_assert(offsetof(BPS28_HoldableCloseButton_C_Update_style, Using_Gamepad) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_Update_style::Using_Gamepad' has a wrong offset!");

// Function BPS28_HoldableCloseButton.BPS28_HoldableCloseButton_C.UpdateTextAndStyle
// 0x0002 (0x0002 - 0x0000)
struct BPS28_HoldableCloseButton_C_UpdateTextAndStyle final
{
public:
	ECommonInputType                              Input_Type;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_HoldableCloseButton_C_UpdateTextAndStyle) == 0x000001, "Wrong alignment on BPS28_HoldableCloseButton_C_UpdateTextAndStyle");
static_assert(sizeof(BPS28_HoldableCloseButton_C_UpdateTextAndStyle) == 0x000002, "Wrong size on BPS28_HoldableCloseButton_C_UpdateTextAndStyle");
static_assert(offsetof(BPS28_HoldableCloseButton_C_UpdateTextAndStyle, Input_Type) == 0x000000, "Member 'BPS28_HoldableCloseButton_C_UpdateTextAndStyle::Input_Type' has a wrong offset!");
static_assert(offsetof(BPS28_HoldableCloseButton_C_UpdateTextAndStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BPS28_HoldableCloseButton_C_UpdateTextAndStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

