#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_SeasonalDataWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS28_SeasonalDataWidget.BPS28_SeasonalDataWidget_C
// 0x0058 (0x0340 - 0x02E8)
class UBPS28_SeasonalDataWidget_C final : public UFortSeasonDataWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_392;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RaceTrack;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CurrentLevel;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Level;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_5stars;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     Bp_Material;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_Bp_Owned;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          OwnsBattlePass;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBPLevelForRewards;                              // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS28_SeasonalDataWidget(int32 EntryPoint);
	void OnBattlePassOwned();
	void OnLevelChanged();
	void OnProgressUpdated();
	void OnSuperCharged();
	void PreConstruct(bool IsDesignTime);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS28_SeasonalDataWidget_C">();
	}
	static class UBPS28_SeasonalDataWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS28_SeasonalDataWidget_C>();
	}
};
static_assert(alignof(UBPS28_SeasonalDataWidget_C) == 0x000008, "Wrong alignment on UBPS28_SeasonalDataWidget_C");
static_assert(sizeof(UBPS28_SeasonalDataWidget_C) == 0x000340, "Wrong size on UBPS28_SeasonalDataWidget_C");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UBPS28_SeasonalDataWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, Image_392) == 0x0002F0, "Member 'UBPS28_SeasonalDataWidget_C::Image_392' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, Image_RaceTrack) == 0x0002F8, "Member 'UBPS28_SeasonalDataWidget_C::Image_RaceTrack' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, RichText_CurrentLevel) == 0x000300, "Member 'UBPS28_SeasonalDataWidget_C::RichText_CurrentLevel' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, RichText_Level) == 0x000308, "Member 'UBPS28_SeasonalDataWidget_C::RichText_Level' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, VerticalBox_5stars) == 0x000310, "Member 'UBPS28_SeasonalDataWidget_C::VerticalBox_5stars' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, Bp_Material) == 0x000318, "Member 'UBPS28_SeasonalDataWidget_C::Bp_Material' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, On_Bp_Owned) == 0x000320, "Member 'UBPS28_SeasonalDataWidget_C::On_Bp_Owned' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, OwnsBattlePass) == 0x000330, "Member 'UBPS28_SeasonalDataWidget_C::OwnsBattlePass' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, MaxBPLevelForRewards) == 0x000334, "Member 'UBPS28_SeasonalDataWidget_C::MaxBPLevelForRewards' has a wrong offset!");
static_assert(offsetof(UBPS28_SeasonalDataWidget_C, Value) == 0x000338, "Member 'UBPS28_SeasonalDataWidget_C::Value' has a wrong offset!");

}

