#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_LandingPages

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BattlePassBase_structs.hpp"


namespace SDK::Params
{

// Function BPS28_LandingPages.BPS28_LandingPages_C.BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonId;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature");
static_assert(sizeof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature) == 0x000080, "Wrong size on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature, DisplayInfo) == 0x000000, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature::DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature, ButtonId) == 0x000070, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature::ButtonId' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonId;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature");
static_assert(sizeof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature) == 0x000080, "Wrong size on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature, DisplayInfo) == 0x000000, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature::DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature, ButtonId) == 0x000070, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature::ButtonId' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonId;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature");
static_assert(sizeof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature) == 0x000080, "Wrong size on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature, DisplayInfo) == 0x000000, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature::DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature, ButtonId) == 0x000070, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature::ButtonId' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonId;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature");
static_assert(sizeof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature) == 0x000080, "Wrong size on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature, DisplayInfo) == 0x000000, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature::DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature, ButtonId) == 0x000070, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature::ButtonId' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonId;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature");
static_assert(sizeof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature) == 0x000080, "Wrong size on BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature, DisplayInfo) == 0x000000, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature::DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature, ButtonId) == 0x000070, "Member 'BPS28_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature::ButtonId' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonId;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature");
static_assert(sizeof(BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature) == 0x000080, "Wrong size on BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature, DisplayInfo) == 0x000000, "Member 'BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature::DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature, ButtonId) == 0x000070, "Member 'BPS28_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature::ButtonId' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.Button_BonusRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_Button_BonusRewards_Event_0 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_Button_BonusRewards_Event_0) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_Button_BonusRewards_Event_0");
static_assert(sizeof(BPS28_LandingPages_C_Button_BonusRewards_Event_0) == 0x000008, "Wrong size on BPS28_LandingPages_C_Button_BonusRewards_Event_0");
static_assert(offsetof(BPS28_LandingPages_C_Button_BonusRewards_Event_0, Button_BonusRewards_0) == 0x000000, "Member 'BPS28_LandingPages_C_Button_BonusRewards_Event_0::Button_BonusRewards_0' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.Button_CharacterCustomizer_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0");
static_assert(sizeof(BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0) == 0x000008, "Wrong size on BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0");
static_assert(offsetof(BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0, Button_CharacterCustomizer_0) == 0x000000, "Member 'BPS28_LandingPages_C_Button_CharacterCustomizer_Event_0::Button_CharacterCustomizer_0' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.Button_JoinSubscription_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_Button_JoinSubscription_Event_0 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_Button_JoinSubscription_Event_0) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_Button_JoinSubscription_Event_0");
static_assert(sizeof(BPS28_LandingPages_C_Button_JoinSubscription_Event_0) == 0x000008, "Wrong size on BPS28_LandingPages_C_Button_JoinSubscription_Event_0");
static_assert(offsetof(BPS28_LandingPages_C_Button_JoinSubscription_Event_0, Button_JoinSubscription_0) == 0x000000, "Member 'BPS28_LandingPages_C_Button_JoinSubscription_Event_0::Button_JoinSubscription_0' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.Button_MysteryRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_Button_MysteryRewards_Event_0 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_Button_MysteryRewards_Event_0) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_Button_MysteryRewards_Event_0");
static_assert(sizeof(BPS28_LandingPages_C_Button_MysteryRewards_Event_0) == 0x000008, "Wrong size on BPS28_LandingPages_C_Button_MysteryRewards_Event_0");
static_assert(offsetof(BPS28_LandingPages_C_Button_MysteryRewards_Event_0, Button_MysteryRewards) == 0x000000, "Member 'BPS28_LandingPages_C_Button_MysteryRewards_Event_0::Button_MysteryRewards' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.Button_RewardOverview_Event_2
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_Button_RewardOverview_Event_2 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_Button_RewardOverview_Event_2) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_Button_RewardOverview_Event_2");
static_assert(sizeof(BPS28_LandingPages_C_Button_RewardOverview_Event_2) == 0x000008, "Wrong size on BPS28_LandingPages_C_Button_RewardOverview_Event_2");
static_assert(offsetof(BPS28_LandingPages_C_Button_RewardOverview_Event_2, Button_RewardOverview) == 0x000000, "Member 'BPS28_LandingPages_C_Button_RewardOverview_Event_2::Button_RewardOverview' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.ExecuteUbergraph_BPS28_LandingPages
// 0x0420 (0x0420 - 0x0000)
struct BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS28_LandingPageButton_C*             K2Node_CustomEvent_Button_RewardOverview;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS28_LandingPageButton_C*             K2Node_CustomEvent_Button_CharacterCustomizer;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS28_LandingPageButton_C*             K2Node_CustomEvent_Button_MysteryRewards;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS28_LandingPageButton_C*             K2Node_CustomEvent_Button_BonusRewards;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS28_LandingPageButton_C*             K2Node_CustomEvent_Button_JoinSubscription;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BPComplete;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS28_LandingPageButton_C*             K2Node_DynamicCast_AsBPS28_Landing_Page_Button;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSubscriptionAllowed;                 // 0x0049(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_5;          // 0x0050(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_5;             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_4;          // 0x00D0(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_4;             // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_3;          // 0x0150(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_3;             // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_2;          // 0x01D0(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_2;             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_1;          // 0x0250(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_1;             // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBPS28_LandingPageButton_C*             K2Node_DynamicCast_AsBPS28_Landing_Page_Button_1;  // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo;            // 0x02E0(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID;               // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0360(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS28_LandingPageButton_C*             K2Node_DynamicCast_AsBPS28_Landing_Page_Button_2;  // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBacchusTabNavOnTop_ReturnValue;      // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2;      // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast_1;           // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages");
static_assert(sizeof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages) == 0x000420, "Wrong size on BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, EntryPoint) == 0x000000, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, Temp_bool_Variable) == 0x000004, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, Temp_byte_Variable) == 0x000005, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_CustomEvent_Button_RewardOverview) == 0x000010, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_CustomEvent_Button_RewardOverview' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_CustomEvent_Button_CharacterCustomizer) == 0x000018, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_CustomEvent_Button_CharacterCustomizer' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_CustomEvent_Button_MysteryRewards) == 0x000020, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_CustomEvent_Button_MysteryRewards' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_CustomEvent_Button_BonusRewards) == 0x000028, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_CustomEvent_Button_BonusRewards' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_CustomEvent_Button_JoinSubscription) == 0x000030, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_CustomEvent_Button_JoinSubscription' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_CustomEvent_BPComplete) == 0x000038, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_CustomEvent_BPComplete' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_DynamicCast_AsBPS28_Landing_Page_Button) == 0x000040, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_DynamicCast_AsBPS28_Landing_Page_Button' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_Event_bSubscriptionAllowed) == 0x000049, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_Event_bSubscriptionAllowed' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_DisplayInfo_5) == 0x000050, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_DisplayInfo_5' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_ButtonID_5) == 0x0000C0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_ButtonID_5' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_DisplayInfo_4) == 0x0000D0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_DisplayInfo_4' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_ButtonID_4) == 0x000140, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_ButtonID_4' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_DisplayInfo_3) == 0x000150, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_DisplayInfo_3' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_ButtonID_3) == 0x0001C0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_ButtonID_3' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_DisplayInfo_2) == 0x0001D0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_DisplayInfo_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_ButtonID_2) == 0x000240, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_ButtonID_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_DisplayInfo_1) == 0x000250, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_DisplayInfo_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_ButtonID_1) == 0x0002C0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_ButtonID_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_DynamicCast_AsBPS28_Landing_Page_Button_1) == 0x0002D0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_DynamicCast_AsBPS28_Landing_Page_Button_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_DynamicCast_bSuccess_1) == 0x0002D8, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_DisplayInfo) == 0x0002E0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_DisplayInfo' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_ComponentBoundEvent_ButtonID) == 0x000350, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_ComponentBoundEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_GetAllChildren_ReturnValue) == 0x000360, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_Array_Get_Item) == 0x000370, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000378, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_DynamicCast_AsBPS28_Landing_Page_Button_2) == 0x000380, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_DynamicCast_AsBPS28_Landing_Page_Button_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_DynamicCast_bSuccess_2) == 0x000388, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_Array_Length_ReturnValue) == 0x00038C, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_IsMobileGame_ReturnValue) == 0x000390, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, Temp_byte_Variable_1) == 0x000391, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_SelectFloat_ReturnValue) == 0x000398, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_MakeStruct_Margin) == 0x0003A0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_Select_Default) == 0x0003B0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_SelectFloat_ReturnValue_1) == 0x0003B8, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_SelectFloat_ReturnValue_2) == 0x0003C0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_MakeStruct_Margin_1) == 0x0003C8, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_MakeStruct_Margin_2) == 0x0003D8, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x0003E8, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_GetRuntimeOptions_ReturnValue) == 0x0003F0, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_GetIsBacchusTabNavOnTop_ReturnValue) == 0x0003F8, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_GetIsBacchusTabNavOnTop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2) == 0x000400, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, Temp_int_Loop_Counter_Variable) == 0x000408, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_Less_IntInt_ReturnValue) == 0x00040C, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, CallFunc_Add_IntInt_ReturnValue) == 0x000410, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x000414, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_MakeStruct_Bottom_ImplicitCast_1) == 0x000418, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_MakeStruct_Bottom_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages, K2Node_MakeStruct_Top_ImplicitCast) == 0x00041C, "Member 'BPS28_LandingPages_C_ExecuteUbergraph_BPS28_LandingPages::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.On BattlePass completed
// 0x0001 (0x0001 - 0x0000)
struct BPS28_LandingPages_C_On_BattlePass_completed final
{
public:
	bool                                          BPComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_On_BattlePass_completed) == 0x000001, "Wrong alignment on BPS28_LandingPages_C_On_BattlePass_completed");
static_assert(sizeof(BPS28_LandingPages_C_On_BattlePass_completed) == 0x000001, "Wrong size on BPS28_LandingPages_C_On_BattlePass_completed");
static_assert(offsetof(BPS28_LandingPages_C_On_BattlePass_completed, BPComplete) == 0x000000, "Member 'BPS28_LandingPages_C_On_BattlePass_completed::BPComplete' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.OnBattlePassSubscriptionAllowed
// 0x0001 (0x0001 - 0x0000)
struct BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed final
{
public:
	bool                                          bSubscriptionAllowed;                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed) == 0x000001, "Wrong alignment on BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed");
static_assert(sizeof(BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed) == 0x000001, "Wrong size on BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed");
static_assert(offsetof(BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed, bSubscriptionAllowed) == 0x000000, "Member 'BPS28_LandingPages_C_OnBattlePassSubscriptionAllowed::bSubscriptionAllowed' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.Play intro
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_Play_intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_Play_intro) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_Play_intro");
static_assert(sizeof(BPS28_LandingPages_C_Play_intro) == 0x000008, "Wrong size on BPS28_LandingPages_C_Play_intro");
static_assert(offsetof(BPS28_LandingPages_C_Play_intro, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'BPS28_LandingPages_C_Play_intro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SequenceEvent__ENTRYPOINTBPS28_LandingPages
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages final
{
public:
	class UBPS28_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages");
static_assert(sizeof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages) == 0x000008, "Wrong size on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages");
static_assert(offsetof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages, Button_RewardOverview) == 0x000000, "Member 'BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages::Button_RewardOverview' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SequenceEvent__ENTRYPOINTBPS28_LandingPages_0
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0");
static_assert(sizeof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0) == 0x000008, "Wrong size on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0");
static_assert(offsetof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0, Button_CharacterCustomizer_0) == 0x000000, "Member 'BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_0::Button_CharacterCustomizer_0' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SequenceEvent__ENTRYPOINTBPS28_LandingPages_1
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1");
static_assert(sizeof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1) == 0x000008, "Wrong size on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1");
static_assert(offsetof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1, Button_MysteryRewards) == 0x000000, "Member 'BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_1::Button_MysteryRewards' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SequenceEvent__ENTRYPOINTBPS28_LandingPages_2
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2");
static_assert(sizeof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2) == 0x000008, "Wrong size on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2");
static_assert(offsetof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2, Button_BonusRewards_0) == 0x000000, "Member 'BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_2::Button_BonusRewards_0' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SequenceEvent__ENTRYPOINTBPS28_LandingPages_3
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3");
static_assert(sizeof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3) == 0x000008, "Wrong size on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3");
static_assert(offsetof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3, Button_JoinSubscription_0) == 0x000000, "Member 'BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_3::Button_JoinSubscription_0' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SequenceEvent__ENTRYPOINTBPS28_LandingPages_4
// 0x0008 (0x0008 - 0x0000)
struct BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4 final
{
public:
	class UBPS28_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4) == 0x000008, "Wrong alignment on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4");
static_assert(sizeof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4) == 0x000008, "Wrong size on BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4");
static_assert(offsetof(BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4, Button_RewardOverview) == 0x000000, "Member 'BPS28_LandingPages_C_SequenceEvent__ENTRYPOINTBPS28_LandingPages_4::Button_RewardOverview' has a wrong offset!");

// Function BPS28_LandingPages.BPS28_LandingPages_C.SetBattlePassOwned
// 0x0044 (0x0044 - 0x0000)
struct BPS28_LandingPages_C_SetBattlePassOwned final
{
public:
	bool                                          bOwned;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            UnownedSeasonColor;                                // 0x0004(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            OwnedSeasonColor;                                  // 0x0018(0x0014)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0014)()
};
static_assert(alignof(BPS28_LandingPages_C_SetBattlePassOwned) == 0x000004, "Wrong alignment on BPS28_LandingPages_C_SetBattlePassOwned");
static_assert(sizeof(BPS28_LandingPages_C_SetBattlePassOwned) == 0x000044, "Wrong size on BPS28_LandingPages_C_SetBattlePassOwned");
static_assert(offsetof(BPS28_LandingPages_C_SetBattlePassOwned, bOwned) == 0x000000, "Member 'BPS28_LandingPages_C_SetBattlePassOwned::bOwned' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_SetBattlePassOwned, UnownedSeasonColor) == 0x000004, "Member 'BPS28_LandingPages_C_SetBattlePassOwned::UnownedSeasonColor' has a wrong offset!");
static_assert(offsetof(BPS28_LandingPages_C_SetBattlePassOwned, OwnedSeasonColor) == 0x000018, "Member 'BPS28_LandingPages_C_SetBattlePassOwned::OwnedSeasonColor' has a wrong offset!");
