#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS28_BulkClaimRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPS28_BulkClaimRewards.BPS28_BulkClaimRewards_C.ExecuteUbergraph_BPS28_BulkClaimRewards
// 0x0270 (0x0270 - 0x0000)
struct BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_FromPage;                             // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ToPage;                               // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0058(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Cost;                                 // 0x005C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0150(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0180(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x01D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01E8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0248(0x0018)()
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards) == 0x000008, "Wrong alignment on BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards");
static_assert(sizeof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards) == 0x000270, "Wrong size on BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, EntryPoint) == 0x000000, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, Temp_bool_Variable) == 0x000005, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, Temp_text_Variable) == 0x000010, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, Temp_text_Variable_1) == 0x000028, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, Temp_bool_Variable_1) == 0x000040, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_Event_FromPage) == 0x000044, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_Event_FromPage' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_Event_ToPage) == 0x000048, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_Event_ToPage' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_Event_Count) == 0x000058, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_Event_Cost) == 0x00005C, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_Event_Cost' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000060, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Conv_IntToString_ReturnValue) == 0x0000C0, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E0, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000100, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000110, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Concat_StrStr_ReturnValue) == 0x000118, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000128, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_Select_Default) == 0x000150, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Conv_IntToText_ReturnValue) == 0x000168, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_MakeStruct_FormatArgumentData_1) == 0x000180, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_Select_Default_1) == 0x0001D0, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001E8, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, K2Node_MakeArray_Array_1) == 0x000238, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_Format_ReturnValue_1) == 0x000248, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000260, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000264, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x000268, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1) == 0x00026C, "Member 'BPS28_BulkClaimRewards_C_ExecuteUbergraph_BPS28_BulkClaimRewards::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1' has a wrong offset!");

// Function BPS28_BulkClaimRewards.BPS28_BulkClaimRewards_C.OnCostChanged
// 0x0004 (0x0004 - 0x0000)
struct BPS28_BulkClaimRewards_C_OnCostChanged final
{
public:
	int32                                         Cost;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_BulkClaimRewards_C_OnCostChanged) == 0x000004, "Wrong alignment on BPS28_BulkClaimRewards_C_OnCostChanged");
static_assert(sizeof(BPS28_BulkClaimRewards_C_OnCostChanged) == 0x000004, "Wrong size on BPS28_BulkClaimRewards_C_OnCostChanged");
static_assert(offsetof(BPS28_BulkClaimRewards_C_OnCostChanged, Cost) == 0x000000, "Member 'BPS28_BulkClaimRewards_C_OnCostChanged::Cost' has a wrong offset!");

// Function BPS28_BulkClaimRewards.BPS28_BulkClaimRewards_C.OnPageRangeChanged
// 0x0008 (0x0008 - 0x0000)
struct BPS28_BulkClaimRewards_C_OnPageRangeChanged final
{
public:
	int32                                         FromPage;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ToPage;                                            // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_BulkClaimRewards_C_OnPageRangeChanged) == 0x000004, "Wrong alignment on BPS28_BulkClaimRewards_C_OnPageRangeChanged");
static_assert(sizeof(BPS28_BulkClaimRewards_C_OnPageRangeChanged) == 0x000008, "Wrong size on BPS28_BulkClaimRewards_C_OnPageRangeChanged");
static_assert(offsetof(BPS28_BulkClaimRewards_C_OnPageRangeChanged, FromPage) == 0x000000, "Member 'BPS28_BulkClaimRewards_C_OnPageRangeChanged::FromPage' has a wrong offset!");
static_assert(offsetof(BPS28_BulkClaimRewards_C_OnPageRangeChanged, ToPage) == 0x000004, "Member 'BPS28_BulkClaimRewards_C_OnPageRangeChanged::ToPage' has a wrong offset!");

// Function BPS28_BulkClaimRewards.BPS28_BulkClaimRewards_C.OnRewardCountChanged
// 0x0004 (0x0004 - 0x0000)
struct BPS28_BulkClaimRewards_C_OnRewardCountChanged final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS28_BulkClaimRewards_C_OnRewardCountChanged) == 0x000004, "Wrong alignment on BPS28_BulkClaimRewards_C_OnRewardCountChanged");
static_assert(sizeof(BPS28_BulkClaimRewards_C_OnRewardCountChanged) == 0x000004, "Wrong size on BPS28_BulkClaimRewards_C_OnRewardCountChanged");
static_assert(offsetof(BPS28_BulkClaimRewards_C_OnRewardCountChanged, Count) == 0x000000, "Member 'BPS28_BulkClaimRewards_C_OnRewardCountChanged::Count' has a wrong offset!");

}

