#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS_StatsOptionsModalButtonData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BPS_StatsOptionsModalButtonData.BPS_StatsOptionsModalButtonData
// 0x0040 (0x0040 - 0x0000)
struct FBPS_StatsOptionsModalButtonData final
{
public:
	class FText                                   ModalButtonText_8_A6275EF24BBE802EE0A686B4CA3AEA7D; // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   OverrideTextForDisplayRow_11_AA7E220546D7A543A147918C0D004C91; // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FString                                 Id_6_815B2BDA444C78E8BFD92294901755C4;             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FBPS_StatsOptionsModalButtonData) == 0x000008, "Wrong alignment on FBPS_StatsOptionsModalButtonData");
static_assert(sizeof(FBPS_StatsOptionsModalButtonData) == 0x000040, "Wrong size on FBPS_StatsOptionsModalButtonData");
static_assert(offsetof(FBPS_StatsOptionsModalButtonData, ModalButtonText_8_A6275EF24BBE802EE0A686B4CA3AEA7D) == 0x000000, "Member 'FBPS_StatsOptionsModalButtonData::ModalButtonText_8_A6275EF24BBE802EE0A686B4CA3AEA7D' has a wrong offset!");
static_assert(offsetof(FBPS_StatsOptionsModalButtonData, OverrideTextForDisplayRow_11_AA7E220546D7A543A147918C0D004C91) == 0x000018, "Member 'FBPS_StatsOptionsModalButtonData::OverrideTextForDisplayRow_11_AA7E220546D7A543A147918C0D004C91' has a wrong offset!");
static_assert(offsetof(FBPS_StatsOptionsModalButtonData, Id_6_815B2BDA444C78E8BFD92294901755C4) == 0x000030, "Member 'FBPS_StatsOptionsModalButtonData::Id_6_815B2BDA444C78E8BFD92294901755C4' has a wrong offset!");

}

