#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraAnimationTransition

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraAnimationTransition.CameraAnimationTransition_C.ExecuteUbergraph_CameraAnimationTransition
// 0x0028 (0x0028 - 0x0000)
struct CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeCamera_CanChangeCamera;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams;      // 0x0010(0x0010)(NoDestructor)
	bool                                          CallFunc_CanChangeCamera_CanChangeCamera_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition) == 0x000008, "Wrong alignment on CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition");
static_assert(sizeof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition) == 0x000028, "Wrong size on CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, EntryPoint) == 0x000000, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_CanChangeCamera_CanChangeCamera) == 0x000004, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_CanChangeCamera_CanChangeCamera' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, K2Node_MakeStruct_ViewTargetTransitionParams) == 0x000010, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::K2Node_MakeStruct_ViewTargetTransitionParams' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition, CallFunc_CanChangeCamera_CanChangeCamera_1) == 0x000020, "Member 'CameraAnimationTransition_C_ExecuteUbergraph_CameraAnimationTransition::CallFunc_CanChangeCamera_CanChangeCamera_1' has a wrong offset!");

// Function CameraAnimationTransition.CameraAnimationTransition_C.CanChangeCamera
// 0x0018 (0x0018 - 0x0000)
struct CameraAnimationTransition_C_CanChangeCamera final
{
public:
	EFrontEndCamera                               FromCamera;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               ToCamera;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanChangeCamera_0;                                 // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               CallFunc_GetFrontEndCamera_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraAnimationTransition_C_CanChangeCamera) == 0x000008, "Wrong alignment on CameraAnimationTransition_C_CanChangeCamera");
static_assert(sizeof(CameraAnimationTransition_C_CanChangeCamera) == 0x000018, "Wrong size on CameraAnimationTransition_C_CanChangeCamera");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, FromCamera) == 0x000000, "Member 'CameraAnimationTransition_C_CanChangeCamera::FromCamera' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, ToCamera) == 0x000001, "Member 'CameraAnimationTransition_C_CanChangeCamera::ToCamera' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CanChangeCamera_0) == 0x000002, "Member 'CameraAnimationTransition_C_CanChangeCamera::CanChangeCamera_0' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_GetFrontEndCamera_ReturnValue) == 0x000010, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_GetFrontEndCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000013, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_BooleanAND_ReturnValue_1) == 0x000016, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraAnimationTransition_C_CanChangeCamera, CallFunc_BooleanAND_ReturnValue_2) == 0x000017, "Member 'CameraAnimationTransition_C_CanChangeCamera::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

}

