#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraDebugDisplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraDebugDisplay.CameraDebugDisplay_C.ExecuteUbergraph_CameraDebugDisplay
// 0x0380 (0x0380 - 0x0000)
struct CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_InitObject;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UJunoCameraMode_OrbitCam_C*             K2Node_DynamicCast_AsJuno_Camera_Mode_Orbit_Cam;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0064(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetVerticalProbeWeight_Weight;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetForwardAngledProbeWeight_Weight;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00E8(0x0014)()
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0118(0x0018)()
	double                                        CallFunc_GetConfinedSpaceWeight_Weight;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0138(0x0018)()
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x0178(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0210(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0298(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterpOffsetData                      CallFunc_Array_Get_Item;                           // 0x02B8(0x0038)(NoDestructor)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0300(0x0014)()
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_4;          // 0x0330(0x0018)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0348(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_5;          // 0x0360(0x0018)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay) == 0x000008, "Wrong alignment on CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay");
static_assert(sizeof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay) == 0x000380, "Wrong size on CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, EntryPoint) == 0x000000, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_bool_Variable) == 0x000004, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_byte_Variable) == 0x000005, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_byte_Variable_1) == 0x000006, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_bool_Variable_1) == 0x000007, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_byte_Variable_2) == 0x000008, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_byte_Variable_3) == 0x000009, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_bool_Variable_2) == 0x00000A, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_struct_Variable) == 0x00000C, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_struct_Variable_1) == 0x00001C, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_bool_Variable_3) == 0x00002C, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_struct_Variable_2) == 0x000030, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_struct_Variable_3) == 0x000040, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Event_InitObject) == 0x000050, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Event_InitObject' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_DynamicCast_AsJuno_Camera_Mode_Orbit_Cam) == 0x000058, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_DynamicCast_AsJuno_Camera_Mode_Orbit_Cam' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Event_MyGeometry) == 0x000064, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Event_InDeltaTime) == 0x00009C, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_GetVerticalProbeWeight_Weight) == 0x0000A0, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_GetVerticalProbeWeight_Weight' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_GetForwardAngledProbeWeight_Weight) == 0x0000A8, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_GetForwardAngledProbeWeight_Weight' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000B1, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Select_Default) == 0x0000B4, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Select_Default_1) == 0x0000C4, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeStruct_SlateColor) == 0x0000D4, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeStruct_SlateColor_1) == 0x0000E8, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000100, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000118, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_GetConfinedSpaceWeight_Weight) == 0x000130, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_GetConfinedSpaceWeight_Weight' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000138, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_struct_Variable_4) == 0x000150, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_struct_Variable_5) == 0x000160, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, Temp_bool_Variable_4) == 0x000170, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_IsValid_ReturnValue) == 0x000171, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_ReturnValue_3) == 0x000178, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_StringToText_ReturnValue) == 0x000190, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeStruct_FormatArgumentData) == 0x0001C0, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeStruct_FormatArgumentData_1) == 0x000210, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeArray_Array) == 0x000260, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeArray_Array_1) == 0x000270, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Format_ReturnValue) == 0x000280, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Format_ReturnValue_1) == 0x000298, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_IsEmpty_ReturnValue) == 0x0002B0, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_IsEmpty_ReturnValue_1) == 0x0002B1, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Select_Default_2) == 0x0002B2, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Select_Default_3) == 0x0002B3, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Array_Get_Item) == 0x0002B8, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_Select_Default_4) == 0x0002F0, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, K2Node_MakeStruct_SlateColor_2) == 0x000300, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_BreakVector_X) == 0x000318, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_BreakVector_Y) == 0x000320, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_BreakVector_Z) == 0x000328, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_ReturnValue_4) == 0x000330, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_BoolToText_ReturnValue) == 0x000348, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_ReturnValue_5) == 0x000360, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000378, "Member 'CameraDebugDisplay_C_ExecuteUbergraph_CameraDebugDisplay::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function CameraDebugDisplay.CameraDebugDisplay_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct CameraDebugDisplay_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDebugDisplay_C_InitFromObject) == 0x000008, "Wrong alignment on CameraDebugDisplay_C_InitFromObject");
static_assert(sizeof(CameraDebugDisplay_C_InitFromObject) == 0x000008, "Wrong size on CameraDebugDisplay_C_InitFromObject");
static_assert(offsetof(CameraDebugDisplay_C_InitFromObject, InitObject) == 0x000000, "Member 'CameraDebugDisplay_C_InitFromObject::InitObject' has a wrong offset!");

// Function CameraDebugDisplay.CameraDebugDisplay_C.Tick
// 0x003C (0x003C - 0x0000)
struct CameraDebugDisplay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraDebugDisplay_C_Tick) == 0x000004, "Wrong alignment on CameraDebugDisplay_C_Tick");
static_assert(sizeof(CameraDebugDisplay_C_Tick) == 0x00003C, "Wrong size on CameraDebugDisplay_C_Tick");
static_assert(offsetof(CameraDebugDisplay_C_Tick, MyGeometry) == 0x000000, "Member 'CameraDebugDisplay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CameraDebugDisplay_C_Tick, InDeltaTime) == 0x000038, "Member 'CameraDebugDisplay_C_Tick::InDeltaTime' has a wrong offset!");

}

