#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraDebugDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CameraDebugDisplay.CameraDebugDisplay_C
// 0x0058 (0x0318 - 0x02C0)
class UCameraDebugDisplay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CamForwardText;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConfinedSpaceText;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FAActor;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FAText;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FOVText;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       InteriorCheckText;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VActor;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VertProbeText;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ZOffsetText;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJunoCameraMode_OrbitCam_C*             As_Juno_Camera_Mode_Orbit_Cam;                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CameraDebugDisplay(int32 EntryPoint);
	void InitFromObject(class UObject* InitObject);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraDebugDisplay_C">();
	}
	static class UCameraDebugDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDebugDisplay_C>();
	}
};
static_assert(alignof(UCameraDebugDisplay_C) == 0x000008, "Wrong alignment on UCameraDebugDisplay_C");
static_assert(sizeof(UCameraDebugDisplay_C) == 0x000318, "Wrong size on UCameraDebugDisplay_C");
static_assert(offsetof(UCameraDebugDisplay_C, UberGraphFrame) == 0x0002C0, "Member 'UCameraDebugDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, CamForwardText) == 0x0002C8, "Member 'UCameraDebugDisplay_C::CamForwardText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, ConfinedSpaceText) == 0x0002D0, "Member 'UCameraDebugDisplay_C::ConfinedSpaceText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, FAActor) == 0x0002D8, "Member 'UCameraDebugDisplay_C::FAActor' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, FAText) == 0x0002E0, "Member 'UCameraDebugDisplay_C::FAText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, FOVText) == 0x0002E8, "Member 'UCameraDebugDisplay_C::FOVText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, InteriorCheckText) == 0x0002F0, "Member 'UCameraDebugDisplay_C::InteriorCheckText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, VActor) == 0x0002F8, "Member 'UCameraDebugDisplay_C::VActor' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, VertProbeText) == 0x000300, "Member 'UCameraDebugDisplay_C::VertProbeText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, ZOffsetText) == 0x000308, "Member 'UCameraDebugDisplay_C::ZOffsetText' has a wrong offset!");
static_assert(offsetof(UCameraDebugDisplay_C, As_Juno_Camera_Mode_Orbit_Cam) == 0x000310, "Member 'UCameraDebugDisplay_C::As_Juno_Camera_Mode_Orbit_Cam' has a wrong offset!");

}

