#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentralPicnicNativeRuntime

#include "Basic.hpp"

#include "MeshNetwork_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge
// 0x0060 (0x02F0 - 0x0290)
class ACentralPicnicMeshNetworkBridge final : public AInfo
{
public:
	class UMeshNetworkComponent*                  MeshNetworkComponent;                              // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentHealth;                                     // 0x0298(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         DefaultHealth;                                     // 0x02A0(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DamageModifier;                                    // 0x02A8(0x0004)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AC[0x44];                                     // 0x02AC(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMeshNetworkTypeSet(EMeshNetworkNodeType NodeType);
	void WaitForMeshNetwork();

	void BroadcastEvent_ChainsDamaged(const int64 DamageDealt) const;
	void BroadcastEvent_DamageModifierUpdated(const float NewValue) const;
	void BroadcastEvent_DefaultHealthUpdated(const int64 NewValue) const;
	void BroadcastEvent_HealthUpdated(const int64 NewValue) const;
	void OnRep_CurrentHealth(const int64 OldValue) const;
	void OnRep_DamageModifier(const float OldValue) const;
	void OnRep_DefaultHealth(const int64 OldValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CentralPicnicMeshNetworkBridge">();
	}
	static class ACentralPicnicMeshNetworkBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACentralPicnicMeshNetworkBridge>();
	}
};
static_assert(alignof(ACentralPicnicMeshNetworkBridge) == 0x000008, "Wrong alignment on ACentralPicnicMeshNetworkBridge");
static_assert(sizeof(ACentralPicnicMeshNetworkBridge) == 0x0002F0, "Wrong size on ACentralPicnicMeshNetworkBridge");
static_assert(offsetof(ACentralPicnicMeshNetworkBridge, MeshNetworkComponent) == 0x000290, "Member 'ACentralPicnicMeshNetworkBridge::MeshNetworkComponent' has a wrong offset!");
static_assert(offsetof(ACentralPicnicMeshNetworkBridge, CurrentHealth) == 0x000298, "Member 'ACentralPicnicMeshNetworkBridge::CurrentHealth' has a wrong offset!");
static_assert(offsetof(ACentralPicnicMeshNetworkBridge, DefaultHealth) == 0x0002A0, "Member 'ACentralPicnicMeshNetworkBridge::DefaultHealth' has a wrong offset!");
static_assert(offsetof(ACentralPicnicMeshNetworkBridge, DamageModifier) == 0x0002A8, "Member 'ACentralPicnicMeshNetworkBridge::DamageModifier' has a wrong offset!");

}

