#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentralPicnicNativeRuntime

#include "Basic.hpp"

#include "MeshNetwork_structs.hpp"


namespace SDK::Params
{

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.HandleMeshNetworkTypeSet
// 0x0001 (0x0001 - 0x0000)
struct CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet) == 0x000001, "Wrong alignment on CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet) == 0x000001, "Wrong size on CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet, NodeType) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_HandleMeshNetworkTypeSet::NodeType' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_ChainsDamaged
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged final
{
public:
	int64                                         DamageDealt;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged) == 0x000008, "Wrong alignment on CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged) == 0x000008, "Wrong size on CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged, DamageDealt) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_BroadcastEvent_ChainsDamaged::DamageDealt' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_DamageModifierUpdated
// 0x0004 (0x0004 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated) == 0x000004, "Wrong alignment on CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated) == 0x000004, "Wrong size on CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated, NewValue) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_BroadcastEvent_DamageModifierUpdated::NewValue' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_DefaultHealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated final
{
public:
	int64                                         NewValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated) == 0x000008, "Wrong alignment on CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated) == 0x000008, "Wrong size on CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated, NewValue) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_BroadcastEvent_DefaultHealthUpdated::NewValue' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.BroadcastEvent_HealthUpdated
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated final
{
public:
	int64                                         NewValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated) == 0x000008, "Wrong alignment on CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated) == 0x000008, "Wrong size on CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated, NewValue) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_BroadcastEvent_HealthUpdated::NewValue' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.OnRep_CurrentHealth
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth final
{
public:
	int64                                         OldValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth) == 0x000008, "Wrong alignment on CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth) == 0x000008, "Wrong size on CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth, OldValue) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_OnRep_CurrentHealth::OldValue' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.OnRep_DamageModifier
// 0x0004 (0x0004 - 0x0000)
struct CentralPicnicMeshNetworkBridge_OnRep_DamageModifier final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_OnRep_DamageModifier) == 0x000004, "Wrong alignment on CentralPicnicMeshNetworkBridge_OnRep_DamageModifier");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_OnRep_DamageModifier) == 0x000004, "Wrong size on CentralPicnicMeshNetworkBridge_OnRep_DamageModifier");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_OnRep_DamageModifier, OldValue) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_OnRep_DamageModifier::OldValue' has a wrong offset!");

// Function CentralPicnicNativeRuntime.CentralPicnicMeshNetworkBridge.OnRep_DefaultHealth
// 0x0008 (0x0008 - 0x0000)
struct CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth final
{
public:
	int64                                         OldValue;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth) == 0x000008, "Wrong alignment on CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth");
static_assert(sizeof(CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth) == 0x000008, "Wrong size on CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth");
static_assert(offsetof(CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth, OldValue) == 0x000000, "Member 'CentralPicnicMeshNetworkBridge_OnRep_DefaultHealth::OldValue' has a wrong offset!");

}

