#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chameleon_PostProcess_AnimBP

#include "Basic.hpp"

#include "Chameleon_PostProcess_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Chameleon_PostProcess_AnimBP.Chameleon_PostProcess_AnimBP_C
// 0x1FB0 (0x2590 - 0x05E0)
class UChameleon_PostProcess_AnimBP_C final : public UFortPetAnimInstance_AnimDynamics
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Chameleon_PostProcess_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x05E8(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_5EB[0x5];                                      // 0x05EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05F0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05F8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0600(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x0620(0x0510)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B30(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0BA8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0BD0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0BF0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0C18(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0C38(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0C80(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0CC8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0CE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0D08(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0D30(0x00B0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x0DE0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x12F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1800(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x1D10(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1E18(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x1E38(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x1F40(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2048(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2150(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x2170(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2278(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2380(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2488(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Chameleon_PostProcess_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Chameleon_PostProcess_AnimBP_C">();
	}
	static class UChameleon_PostProcess_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChameleon_PostProcess_AnimBP_C>();
	}
};
static_assert(alignof(UChameleon_PostProcess_AnimBP_C) == 0x000010, "Wrong alignment on UChameleon_PostProcess_AnimBP_C");
static_assert(sizeof(UChameleon_PostProcess_AnimBP_C) == 0x002590, "Wrong size on UChameleon_PostProcess_AnimBP_C");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, UberGraphFrame) == 0x0005E0, "Member 'UChameleon_PostProcess_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, __AnimBlueprintMutables) == 0x0005E8, "Member 'UChameleon_PostProcess_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0005F0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimBlueprintExtension_Base) == 0x0005F8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Root) == 0x000600, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x000620, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000B30, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x000BA8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000BD0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000BF0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000C18, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000C38, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000C80, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000CC8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000CE8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000D08, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_SubInput) == 0x000D30, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x000DE0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0012F0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x001800, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_7) == 0x001D10, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001E18, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_6) == 0x001E38, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_5) == 0x001F40, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_4) == 0x002048, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002150, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_3) == 0x002170, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_2) == 0x002278, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_1) == 0x002380, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint) == 0x002488, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");

}

