#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosBlueprintLibrary

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChaosBlueprintLibrary.ChaosBlueprintLibraryBPLibrary.ClothControllerWriteToSimulation
// 0x0188 (0x0188 - 0x0000)
struct ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation final
{
public:
	const class UCustomCharacterPartAnimInstance* CharacterPartAnimInstance;                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClothingAssetName;                                 // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClothCoreSettings                     ClothCoreSettings;                                 // 0x0018(0x0080)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FClothParameters                       ClothSettings;                                     // 0x0098(0x0060)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                WindVelocity;                                      // 0x00F8(0x0018)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClothParameters                       OutWorldSpaceClothSettings;                        // 0x0110(0x0060)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OutWorldSpaceWindVelocity;                         // 0x0170(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation) == 0x000008, "Wrong alignment on ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation");
static_assert(sizeof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation) == 0x000188, "Wrong size on ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, CharacterPartAnimInstance) == 0x000000, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::CharacterPartAnimInstance' has a wrong offset!");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, ClothingAssetName) == 0x000008, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::ClothingAssetName' has a wrong offset!");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, ClothCoreSettings) == 0x000018, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::ClothCoreSettings' has a wrong offset!");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, ClothSettings) == 0x000098, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::ClothSettings' has a wrong offset!");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, WindVelocity) == 0x0000F8, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::WindVelocity' has a wrong offset!");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, OutWorldSpaceClothSettings) == 0x000110, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::OutWorldSpaceClothSettings' has a wrong offset!");
static_assert(offsetof(ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation, OutWorldSpaceWindVelocity) == 0x000170, "Member 'ChaosBlueprintLibraryBPLibrary_ClothControllerWriteToSimulation::OutWorldSpaceWindVelocity' has a wrong offset!");

}

