#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatMessageEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatMessageEntry.ChatMessageEntry_C
// 0x0030 (0x0450 - 0x0420)
class UChatMessageEntry_C final : public UFortChatMessageEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          MessageBackground;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MessageWrapper;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle_0;                                    // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SelfStyle;                                         // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OtherUserStyle;                                    // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_FocusTarget_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_ChatMessageEntry(int32 EntryPoint);
	void HandleSelectionStatusChanged(bool bIsSelected);
	void OnEntryUpdated_1();
	void OnFocusedChanged(bool bIsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatMessageEntry_C">();
	}
	static class UChatMessageEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatMessageEntry_C>();
	}
};
static_assert(alignof(UChatMessageEntry_C) == 0x000008, "Wrong alignment on UChatMessageEntry_C");
static_assert(sizeof(UChatMessageEntry_C) == 0x000450, "Wrong size on UChatMessageEntry_C");
static_assert(offsetof(UChatMessageEntry_C, UberGraphFrame) == 0x000420, "Member 'UChatMessageEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, MessageBackground) == 0x000428, "Member 'UChatMessageEntry_C::MessageBackground' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, MessageWrapper) == 0x000430, "Member 'UChatMessageEntry_C::MessageWrapper' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, DefaultStyle_0) == 0x000438, "Member 'UChatMessageEntry_C::DefaultStyle_0' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, SelfStyle) == 0x000440, "Member 'UChatMessageEntry_C::SelfStyle' has a wrong offset!");
static_assert(offsetof(UChatMessageEntry_C, OtherUserStyle) == 0x000448, "Member 'UChatMessageEntry_C::OtherUserStyle' has a wrong offset!");

}

