#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatContainer

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatContainer.ChatContainer_C
// 0x00E8 (0x0458 - 0x0370)
class UChatContainer_C final : public UFortChatContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SizeAnimation;                                     // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeAnimation;                                     // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_BottomBarDecoyButton_C*            Button_Close_HackForBottomBar;                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_SendMessage_RiftStyle;                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderBackground;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              ConsoleChatShortcut;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CursorModeSwitcher;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusOutline;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusOutline_Glow;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Messages;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HBox_Tabs;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HudContentHBox;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ChatBorderBackground;                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InputTextField;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ChatSize;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ConsoleButtonSpaceProvider;                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SendButton;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SendButton_Style;                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Disabled;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUMGSequencePlayMode                          NewVar_0;                                          // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentlyUsingGamepad;                             // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimationClosing;                                  // 0x042A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B[0x5];                                      // 0x042B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             WindowCloseSound;                                  // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             WindowOpenSound;                                   // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoverSound_Bar_;                                   // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NotifySound;                                       // 0x0448(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChatOpen;                                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPlayLocal;                                   // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DiscoverInLobby;                                   // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ChatContainer_Button_Close_HackForBottomBar_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__ChatContainer_Button_SendMessage_RiftStyle_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__ChatContainer_ChatList_Messages_K2Node_ComponentBoundEvent_3_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__ChatContainer_ConsoleChatShortcut_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ChatContainer(int32 EntryPoint);
	void FocusChat();
	void HandleChatOpenChanged(bool bChatShouldBeOpen);
	void HandleCursorModeChanged(bool bEnabled, class FName ActionName, class UUserWidget* Widget);
	void Is_in_STW_Frontend(bool* IsInSTWFrontend);
	void OnChatOpenChanged(bool bShouldBeOpen);
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnSendButtonDisplayChanged(bool bShowSendButton);
	void OnSizeAnimationComplete();
	void SetChatBoxStyle();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TransitionState(class UWidgetAnimation* TransitionAnimation, double TransitionTime, bool PlayForward);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatContainer_C">();
	}
	static class UChatContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatContainer_C>();
	}
};
static_assert(alignof(UChatContainer_C) == 0x000008, "Wrong alignment on UChatContainer_C");
static_assert(sizeof(UChatContainer_C) == 0x000458, "Wrong size on UChatContainer_C");
static_assert(offsetof(UChatContainer_C, UberGraphFrame) == 0x000370, "Member 'UChatContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Hover) == 0x000378, "Member 'UChatContainer_C::Hover' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeAnimation) == 0x000380, "Member 'UChatContainer_C::SizeAnimation' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, FadeAnimation) == 0x000388, "Member 'UChatContainer_C::FadeAnimation' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Button_Close_HackForBottomBar) == 0x000390, "Member 'UChatContainer_C::Button_Close_HackForBottomBar' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Button_SendMessage_RiftStyle) == 0x000398, "Member 'UChatContainer_C::Button_SendMessage_RiftStyle' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CommonBorderBackground) == 0x0003A0, "Member 'UChatContainer_C::CommonBorderBackground' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, ConsoleChatShortcut) == 0x0003A8, "Member 'UChatContainer_C::ConsoleChatShortcut' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CursorModeSwitcher) == 0x0003B0, "Member 'UChatContainer_C::CursorModeSwitcher' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, FocusOutline) == 0x0003B8, "Member 'UChatContainer_C::FocusOutline' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, FocusOutline_Glow) == 0x0003C0, "Member 'UChatContainer_C::FocusOutline_Glow' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Glow) == 0x0003C8, "Member 'UChatContainer_C::Glow' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HBox_Messages) == 0x0003D0, "Member 'UChatContainer_C::HBox_Messages' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HBox_Tabs) == 0x0003D8, "Member 'UChatContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HudContentHBox) == 0x0003E0, "Member 'UChatContainer_C::HudContentHBox' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Image_ChatBorderBackground) == 0x0003E8, "Member 'UChatContainer_C::Image_ChatBorderBackground' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, InputTextField) == 0x0003F0, "Member 'UChatContainer_C::InputTextField' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, KeybindWidget) == 0x0003F8, "Member 'UChatContainer_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeBox_ChatSize) == 0x000400, "Member 'UChatContainer_C::SizeBox_ChatSize' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeBox_ConsoleButtonSpaceProvider) == 0x000408, "Member 'UChatContainer_C::SizeBox_ConsoleButtonSpaceProvider' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Switcher_SendButton) == 0x000410, "Member 'UChatContainer_C::Switcher_SendButton' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Switcher_SendButton_Style) == 0x000418, "Member 'UChatContainer_C::Switcher_SendButton_Style' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Text_Disabled) == 0x000420, "Member 'UChatContainer_C::Text_Disabled' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, NewVar_0) == 0x000428, "Member 'UChatContainer_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CurrentlyUsingGamepad) == 0x000429, "Member 'UChatContainer_C::CurrentlyUsingGamepad' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, AnimationClosing) == 0x00042A, "Member 'UChatContainer_C::AnimationClosing' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, WindowCloseSound) == 0x000430, "Member 'UChatContainer_C::WindowCloseSound' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, WindowOpenSound) == 0x000438, "Member 'UChatContainer_C::WindowOpenSound' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HoverSound_Bar_) == 0x000440, "Member 'UChatContainer_C::HoverSound_Bar_' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, NotifySound) == 0x000448, "Member 'UChatContainer_C::NotifySound' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, IsChatOpen) == 0x000450, "Member 'UChatContainer_C::IsChatOpen' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, ShouldPlayLocal) == 0x000451, "Member 'UChatContainer_C::ShouldPlayLocal' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, DiscoverInLobby) == 0x000452, "Member 'UChatContainer_C::DiscoverInLobby' has a wrong offset!");

}

