#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chooser

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Chooser_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class Chooser.ChooserParameterBool_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterBool_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterBool_ContextProperty">();
	}
	static class UChooserParameterBool_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterBool_ContextProperty>();
	}
};
static_assert(alignof(UChooserParameterBool_ContextProperty) == 0x000008, "Wrong alignment on UChooserParameterBool_ContextProperty");
static_assert(sizeof(UChooserParameterBool_ContextProperty) == 0x000040, "Wrong size on UChooserParameterBool_ContextProperty");
static_assert(offsetof(UChooserParameterBool_ContextProperty, PropertyBindingChain) == 0x000030, "Member 'UChooserParameterBool_ContextProperty::PropertyBindingChain' has a wrong offset!");

// Class Chooser.ChooserColumnBool
// 0x0028 (0x0050 - 0x0028)
class UChooserColumnBool final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterBool> InputValue;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  RowValues;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnBool">();
	}
	static class UChooserColumnBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnBool>();
	}
};
static_assert(alignof(UChooserColumnBool) == 0x000008, "Wrong alignment on UChooserColumnBool");
static_assert(sizeof(UChooserColumnBool) == 0x000050, "Wrong size on UChooserColumnBool");
static_assert(offsetof(UChooserColumnBool, InputValue) == 0x000030, "Member 'UChooserColumnBool::InputValue' has a wrong offset!");
static_assert(offsetof(UChooserColumnBool, RowValues) == 0x000040, "Member 'UChooserColumnBool::RowValues' has a wrong offset!");

// Class Chooser.ChooserParameterEnum_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterEnum_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterEnum_ContextProperty">();
	}
	static class UChooserParameterEnum_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterEnum_ContextProperty>();
	}
};
static_assert(alignof(UChooserParameterEnum_ContextProperty) == 0x000008, "Wrong alignment on UChooserParameterEnum_ContextProperty");
static_assert(sizeof(UChooserParameterEnum_ContextProperty) == 0x000040, "Wrong size on UChooserParameterEnum_ContextProperty");
static_assert(offsetof(UChooserParameterEnum_ContextProperty, PropertyBindingChain) == 0x000030, "Member 'UChooserParameterEnum_ContextProperty::PropertyBindingChain' has a wrong offset!");

// Class Chooser.ChooserColumnEnum
// 0x0028 (0x0050 - 0x0028)
class UChooserColumnEnum final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterEnum> InputValue;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserEnumRowData>            RowValues;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnEnum">();
	}
	static class UChooserColumnEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnEnum>();
	}
};
static_assert(alignof(UChooserColumnEnum) == 0x000008, "Wrong alignment on UChooserColumnEnum");
static_assert(sizeof(UChooserColumnEnum) == 0x000050, "Wrong size on UChooserColumnEnum");
static_assert(offsetof(UChooserColumnEnum, InputValue) == 0x000030, "Member 'UChooserColumnEnum::InputValue' has a wrong offset!");
static_assert(offsetof(UChooserColumnEnum, RowValues) == 0x000040, "Member 'UChooserColumnEnum::RowValues' has a wrong offset!");

// Class Chooser.ChooserParameterFloat_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterFloat_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterFloat_ContextProperty">();
	}
	static class UChooserParameterFloat_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterFloat_ContextProperty>();
	}
};
static_assert(alignof(UChooserParameterFloat_ContextProperty) == 0x000008, "Wrong alignment on UChooserParameterFloat_ContextProperty");
static_assert(sizeof(UChooserParameterFloat_ContextProperty) == 0x000040, "Wrong size on UChooserParameterFloat_ContextProperty");
static_assert(offsetof(UChooserParameterFloat_ContextProperty, PropertyBindingChain) == 0x000030, "Member 'UChooserParameterFloat_ContextProperty::PropertyBindingChain' has a wrong offset!");

// Class Chooser.ChooserColumnFloatRange
// 0x0028 (0x0050 - 0x0028)
class UChooserColumnFloatRange final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterFloat> InputValue;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserFloatRangeRowData>      RowValues;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnFloatRange">();
	}
	static class UChooserColumnFloatRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnFloatRange>();
	}
};
static_assert(alignof(UChooserColumnFloatRange) == 0x000008, "Wrong alignment on UChooserColumnFloatRange");
static_assert(sizeof(UChooserColumnFloatRange) == 0x000050, "Wrong size on UChooserColumnFloatRange");
static_assert(offsetof(UChooserColumnFloatRange, InputValue) == 0x000030, "Member 'UChooserColumnFloatRange::InputValue' has a wrong offset!");
static_assert(offsetof(UChooserColumnFloatRange, RowValues) == 0x000040, "Member 'UChooserColumnFloatRange::RowValues' has a wrong offset!");

// Class Chooser.ChooserParameterGameplayTag_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterGameplayTag_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterGameplayTag_ContextProperty">();
	}
	static class UChooserParameterGameplayTag_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterGameplayTag_ContextProperty>();
	}
};
static_assert(alignof(UChooserParameterGameplayTag_ContextProperty) == 0x000008, "Wrong alignment on UChooserParameterGameplayTag_ContextProperty");
static_assert(sizeof(UChooserParameterGameplayTag_ContextProperty) == 0x000040, "Wrong size on UChooserParameterGameplayTag_ContextProperty");
static_assert(offsetof(UChooserParameterGameplayTag_ContextProperty, PropertyBindingChain) == 0x000030, "Member 'UChooserParameterGameplayTag_ContextProperty::PropertyBindingChain' has a wrong offset!");

// Class Chooser.ChooserColumnGameplayTag
// 0x0030 (0x0058 - 0x0028)
class UChooserColumnGameplayTag final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterGameplayTag> InputValue;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   TagMatchType;                                      // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTagContainer>          RowValues;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnGameplayTag">();
	}
	static class UChooserColumnGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnGameplayTag>();
	}
};
static_assert(alignof(UChooserColumnGameplayTag) == 0x000008, "Wrong alignment on UChooserColumnGameplayTag");
static_assert(sizeof(UChooserColumnGameplayTag) == 0x000058, "Wrong size on UChooserColumnGameplayTag");
static_assert(offsetof(UChooserColumnGameplayTag, InputValue) == 0x000030, "Member 'UChooserColumnGameplayTag::InputValue' has a wrong offset!");
static_assert(offsetof(UChooserColumnGameplayTag, TagMatchType) == 0x000040, "Member 'UChooserColumnGameplayTag::TagMatchType' has a wrong offset!");
static_assert(offsetof(UChooserColumnGameplayTag, RowValues) == 0x000048, "Member 'UChooserColumnGameplayTag::RowValues' has a wrong offset!");

// Class Chooser.ChooserColumn
// 0x0000 (0x0028 - 0x0028)
class IChooserColumn final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumn">();
	}
	static class IChooserColumn* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserColumn>();
	}
};
static_assert(alignof(IChooserColumn) == 0x000008, "Wrong alignment on IChooserColumn");
static_assert(sizeof(IChooserColumn) == 0x000028, "Wrong size on IChooserColumn");

// Class Chooser.ChooserParameterBool
// 0x0000 (0x0028 - 0x0028)
class IChooserParameterBool final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterBool">();
	}
	static class IChooserParameterBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterBool>();
	}
};
static_assert(alignof(IChooserParameterBool) == 0x000008, "Wrong alignment on IChooserParameterBool");
static_assert(sizeof(IChooserParameterBool) == 0x000028, "Wrong size on IChooserParameterBool");

// Class Chooser.ChooserParameterEnum
// 0x0000 (0x0028 - 0x0028)
class IChooserParameterEnum final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterEnum">();
	}
	static class IChooserParameterEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterEnum>();
	}
};
static_assert(alignof(IChooserParameterEnum) == 0x000008, "Wrong alignment on IChooserParameterEnum");
static_assert(sizeof(IChooserParameterEnum) == 0x000028, "Wrong size on IChooserParameterEnum");

// Class Chooser.ChooserParameterFloat
// 0x0000 (0x0028 - 0x0028)
class IChooserParameterFloat final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterFloat">();
	}
	static class IChooserParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterFloat>();
	}
};
static_assert(alignof(IChooserParameterFloat) == 0x000008, "Wrong alignment on IChooserParameterFloat");
static_assert(sizeof(IChooserParameterFloat) == 0x000028, "Wrong size on IChooserParameterFloat");

// Class Chooser.ChooserParameterGameplayTag
// 0x0000 (0x0028 - 0x0028)
class IChooserParameterGameplayTag final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterGameplayTag">();
	}
	static class IChooserParameterGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterGameplayTag>();
	}
};
static_assert(alignof(IChooserParameterGameplayTag) == 0x000008, "Wrong alignment on IChooserParameterGameplayTag");
static_assert(sizeof(IChooserParameterGameplayTag) == 0x000028, "Wrong size on IChooserParameterGameplayTag");

// Class Chooser.HasContextClass
// 0x0000 (0x0028 - 0x0028)
class IHasContextClass final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HasContextClass">();
	}
	static class IHasContextClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasContextClass>();
	}
};
static_assert(alignof(IHasContextClass) == 0x000008, "Wrong alignment on IHasContextClass");
static_assert(sizeof(IHasContextClass) == 0x000028, "Wrong size on IHasContextClass");

// Class Chooser.ObjectChooser
// 0x0000 (0x0028 - 0x0028)
class IObjectChooser final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectChooser">();
	}
	static class IObjectChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectChooser>();
	}
};
static_assert(alignof(IObjectChooser) == 0x000008, "Wrong alignment on IObjectChooser");
static_assert(sizeof(IObjectChooser) == 0x000028, "Wrong size on IObjectChooser");

// Class Chooser.ObjectChooser_Asset
// 0x0010 (0x0038 - 0x0028)
class UObjectChooser_Asset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Asset;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectChooser_Asset">();
	}
	static class UObjectChooser_Asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectChooser_Asset>();
	}
};
static_assert(alignof(UObjectChooser_Asset) == 0x000008, "Wrong alignment on UObjectChooser_Asset");
static_assert(sizeof(UObjectChooser_Asset) == 0x000038, "Wrong size on UObjectChooser_Asset");
static_assert(offsetof(UObjectChooser_Asset, Asset) == 0x000030, "Member 'UObjectChooser_Asset::Asset' has a wrong offset!");

// Class Chooser.ChooserTable
// 0x0078 (0x00A0 - 0x0028)
class UChooserTable final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          ParentTable;                                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       FallbackResult;                                    // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ResultsStructs;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ColumnsStructs;                                    // 0x0070(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ContextData;                                       // 0x0080(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    OutputObjectType;                                  // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectChooserResultType                      ResultType;                                        // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserTable">();
	}
	static class UChooserTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserTable>();
	}
};
static_assert(alignof(UChooserTable) == 0x000008, "Wrong alignment on UChooserTable");
static_assert(sizeof(UChooserTable) == 0x0000A0, "Wrong size on UChooserTable");
static_assert(offsetof(UChooserTable, ParentTable) == 0x000048, "Member 'UChooserTable::ParentTable' has a wrong offset!");
static_assert(offsetof(UChooserTable, FallbackResult) == 0x000050, "Member 'UChooserTable::FallbackResult' has a wrong offset!");
static_assert(offsetof(UChooserTable, ResultsStructs) == 0x000060, "Member 'UChooserTable::ResultsStructs' has a wrong offset!");
static_assert(offsetof(UChooserTable, ColumnsStructs) == 0x000070, "Member 'UChooserTable::ColumnsStructs' has a wrong offset!");
static_assert(offsetof(UChooserTable, ContextData) == 0x000080, "Member 'UChooserTable::ContextData' has a wrong offset!");
static_assert(offsetof(UChooserTable, OutputObjectType) == 0x000090, "Member 'UChooserTable::OutputObjectType' has a wrong offset!");
static_assert(offsetof(UChooserTable, ResultType) == 0x000098, "Member 'UChooserTable::ResultType' has a wrong offset!");

// Class Chooser.ObjectChooser_EvaluateChooser
// 0x0010 (0x0038 - 0x0028)
class UObjectChooser_EvaluateChooser final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          Chooser;                                           // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectChooser_EvaluateChooser">();
	}
	static class UObjectChooser_EvaluateChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectChooser_EvaluateChooser>();
	}
};
static_assert(alignof(UObjectChooser_EvaluateChooser) == 0x000008, "Wrong alignment on UObjectChooser_EvaluateChooser");
static_assert(sizeof(UObjectChooser_EvaluateChooser) == 0x000038, "Wrong size on UObjectChooser_EvaluateChooser");
static_assert(offsetof(UObjectChooser_EvaluateChooser, Chooser) == 0x000030, "Member 'UObjectChooser_EvaluateChooser::Chooser' has a wrong offset!");

// Class Chooser.ChooserColumnMenuContext
// 0x0018 (0x0040 - 0x0028)
class UChooserColumnMenuContext final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnMenuContext">();
	}
	static class UChooserColumnMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnMenuContext>();
	}
};
static_assert(alignof(UChooserColumnMenuContext) == 0x000008, "Wrong alignment on UChooserColumnMenuContext");
static_assert(sizeof(UChooserColumnMenuContext) == 0x000040, "Wrong size on UChooserColumnMenuContext");

// Class Chooser.ChooserFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UChooserFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddChooserObjectInput(struct FChooserEvaluationContext& Context, class UObject* Object);
	static void AddChooserStructInput(struct FChooserEvaluationContext& Context, int32 Value);
	static class UObject* EvaluateChooser(const class UObject* ContextObject, const class UChooserTable* ChooserTable, TSubclassOf<class UObject> ObjectClass);
	static TArray<class UObject*> EvaluateChooserMulti(const class UObject* ContextObject, const class UChooserTable* ChooserTable, TSubclassOf<class UObject> ObjectClass);
	static class UObject* EvaluateObjectChooserBase(struct FChooserEvaluationContext& Context, const struct FInstancedStruct& ObjectChooser, TSubclassOf<class UObject> ObjectClass, bool bResultIsClass);
	static TArray<class UObject*> EvaluateObjectChooserBaseMulti(struct FChooserEvaluationContext& Context, const struct FInstancedStruct& ObjectChooser, TSubclassOf<class UObject> ObjectClass, bool bResultIsClass);
	static void GetChooserStructOutput(struct FChooserEvaluationContext& Context, int32 Index_0, int32* Value);
	static struct FChooserEvaluationContext MakeChooserEvaluationContext();
	static struct FInstancedStruct MakeEvaluateChooser(class UChooserTable* Chooser);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserFunctionLibrary">();
	}
	static class UChooserFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserFunctionLibrary>();
	}
};
static_assert(alignof(UChooserFunctionLibrary) == 0x000008, "Wrong alignment on UChooserFunctionLibrary");
static_assert(sizeof(UChooserFunctionLibrary) == 0x000028, "Wrong size on UChooserFunctionLibrary");

}

