#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CircleArrowButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CircleArrowButton.CircleArrowButton_C.ExecuteUbergraph_CircleArrowButton
// 0x00A0 (0x00A0 - 0x0000)
struct CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_4;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_5;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_6;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_2;                           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_3;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            K2Node_Select_Default_4;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton) == 0x000008, "Wrong alignment on CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton");
static_assert(sizeof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton) == 0x0000A0, "Wrong size on CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, EntryPoint) == 0x000000, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable) == 0x000004, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_struct_Variable) == 0x000008, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_1) == 0x000018, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable) == 0x000019, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_1) == 0x00001A, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_2) == 0x00001B, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_2) == 0x00001C, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_3) == 0x00001D, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_3) == 0x00001E, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_4) == 0x00001F, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_bool_Variable_4) == 0x000020, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_5) == 0x000021, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_byte_Variable_6) == 0x000022, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Event_IsDesignTime) == 0x000023, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000048, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, Temp_struct_Variable_1) == 0x000050, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default) == 0x000060, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_1) == 0x000070, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_2) == 0x000071, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000078, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_3) == 0x000080, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000088, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, K2Node_Select_Default_4) == 0x000090, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000094, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000098, "Member 'CircleArrowButton_C_ExecuteUbergraph_CircleArrowButton::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function CircleArrowButton.CircleArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CircleArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircleArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on CircleArrowButton_C_PreConstruct");
static_assert(sizeof(CircleArrowButton_C_PreConstruct) == 0x000001, "Wrong size on CircleArrowButton_C_PreConstruct");
static_assert(offsetof(CircleArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CircleArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CircleArrowButton.CircleArrowButton_C.UpdateArrowColor
// 0x0028 (0x0028 - 0x0000)
struct CircleArrowButton_C_UpdateArrowColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor_0;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CircleArrowButton_C_UpdateArrowColor) == 0x000008, "Wrong alignment on CircleArrowButton_C_UpdateArrowColor");
static_assert(sizeof(CircleArrowButton_C_UpdateArrowColor) == 0x000028, "Wrong size on CircleArrowButton_C_UpdateArrowColor");
static_assert(offsetof(CircleArrowButton_C_UpdateArrowColor, Color) == 0x000000, "Member 'CircleArrowButton_C_UpdateArrowColor::Color' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_UpdateArrowColor, HoverColor_0) == 0x000010, "Member 'CircleArrowButton_C_UpdateArrowColor::HoverColor_0' has a wrong offset!");
static_assert(offsetof(CircleArrowButton_C_UpdateArrowColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'CircleArrowButton_C_UpdateArrowColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

