#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothParamsStruct

#include "Basic.hpp"

#include "ClothSettingStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct ClothParamsStruct.ClothParamsStruct
// 0x0780 (0x0780 - 0x0000)
struct FClothParamsStruct final
{
public:
	struct FClothSettingStruct                    Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F; // 0x0060(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457; // 0x00C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F; // 0x0120(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x0180(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254; // 0x01E0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x0240(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572;  // 0x02A0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Swimming_3_33CE87CE4D4F712B1384E29115845962;       // 0x0300(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490;     // 0x0360(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    DBNO_30_2D70D4004D0E9B117F6CE9A09C362B74;          // 0x03C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    DBNO_Carried_32_99829B99495FCFE3488A9A86B549ECE5;  // 0x0420(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    OnGround_Falling_36_CDAA0F4D476157E4137548BDCE8776F2; // 0x0480(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Ziplining_39_BCCDB7E1431A4C174F1040ABC81FD8A8;     // 0x04E0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Skydive_Surfing_42_408E65FF484AA54111E1ED8A69D8240D; // 0x0540(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Riding_Standing_46_952A2A43408C37C44E4CBFAE3F3001B0; // 0x05A0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Riding_Moving_47_EE7A01794460B9753E5076A5A3B3080A; // 0x0600(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Riding_Moving_Targeting_52_2F57FD9E477C515D70B3DA9D75453357; // 0x0660(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Tactical_Sprint_51_5B2273A1499D34BDEC52E6A8E3F274D4; // 0x06C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Rail_Grinding_55_DEEB00A04DB992DF5EEB40BD6518EA4E; // 0x0720(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClothParamsStruct) == 0x000008, "Wrong alignment on FClothParamsStruct");
static_assert(sizeof(FClothParamsStruct) == 0x000780, "Wrong size on FClothParamsStruct");
static_assert(offsetof(FClothParamsStruct, Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B) == 0x000000, "Member 'FClothParamsStruct::Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F) == 0x000060, "Member 'FClothParamsStruct::Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457) == 0x0000C0, "Member 'FClothParamsStruct::Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F) == 0x000120, "Member 'FClothParamsStruct::Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC) == 0x000180, "Member 'FClothParamsStruct::OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254) == 0x0001E0, "Member 'FClothParamsStruct::OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735) == 0x000240, "Member 'FClothParamsStruct::OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572) == 0x0002A0, "Member 'FClothParamsStruct::EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Swimming_3_33CE87CE4D4F712B1384E29115845962) == 0x000300, "Member 'FClothParamsStruct::Swimming_3_33CE87CE4D4F712B1384E29115845962' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490) == 0x000360, "Member 'FClothParamsStruct::Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, DBNO_30_2D70D4004D0E9B117F6CE9A09C362B74) == 0x0003C0, "Member 'FClothParamsStruct::DBNO_30_2D70D4004D0E9B117F6CE9A09C362B74' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, DBNO_Carried_32_99829B99495FCFE3488A9A86B549ECE5) == 0x000420, "Member 'FClothParamsStruct::DBNO_Carried_32_99829B99495FCFE3488A9A86B549ECE5' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, OnGround_Falling_36_CDAA0F4D476157E4137548BDCE8776F2) == 0x000480, "Member 'FClothParamsStruct::OnGround_Falling_36_CDAA0F4D476157E4137548BDCE8776F2' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Ziplining_39_BCCDB7E1431A4C174F1040ABC81FD8A8) == 0x0004E0, "Member 'FClothParamsStruct::Ziplining_39_BCCDB7E1431A4C174F1040ABC81FD8A8' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Skydive_Surfing_42_408E65FF484AA54111E1ED8A69D8240D) == 0x000540, "Member 'FClothParamsStruct::Skydive_Surfing_42_408E65FF484AA54111E1ED8A69D8240D' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Riding_Standing_46_952A2A43408C37C44E4CBFAE3F3001B0) == 0x0005A0, "Member 'FClothParamsStruct::Riding_Standing_46_952A2A43408C37C44E4CBFAE3F3001B0' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Riding_Moving_47_EE7A01794460B9753E5076A5A3B3080A) == 0x000600, "Member 'FClothParamsStruct::Riding_Moving_47_EE7A01794460B9753E5076A5A3B3080A' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Riding_Moving_Targeting_52_2F57FD9E477C515D70B3DA9D75453357) == 0x000660, "Member 'FClothParamsStruct::Riding_Moving_Targeting_52_2F57FD9E477C515D70B3DA9D75453357' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Tactical_Sprint_51_5B2273A1499D34BDEC52E6A8E3F274D4) == 0x0006C0, "Member 'FClothParamsStruct::Tactical_Sprint_51_5B2273A1499D34BDEC52E6A8E3F274D4' has a wrong offset!");
static_assert(offsetof(FClothParamsStruct, Rail_Grinding_55_DEEB00A04DB992DF5EEB40BD6518EA4E) == 0x000720, "Member 'FClothParamsStruct::Rail_Grinding_55_DEEB00A04DB992DF5EEB40BD6518EA4E' has a wrong offset!");

}

