#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompanionAI_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "CompanionAI_0_structs.hpp"
#include "VerseNPC_0_classes.hpp"
#include "VerseColors_structs.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VerseFortnite_0_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseConcurrency_classes.hpp"
#include "VerseCreature_0_classes.hpp"
#include "CompanionAI_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "VerseFortniteGameplayAbilities_0_structs.hpp"


namespace SDK
{

// VerseClass CompanionAI.task_CompanionAI_companion_creature_runtime$PatrolAround
// 0x0D30 (0x0E80 - 0x0150)
class Utask_CompanionAI_companion_creature_runtime_PatrolAround final : public Utask
{
public:
	class UCompanionAI_companion_creature_runtime* _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   __verse_0xFE3AE8F0_OriginalPosition_1;             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_0;                                     // 0x0180(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__2;                             // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x01E8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_2;                                     // 0x01F8(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__4;                             // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_3;                                      // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_4;                                 // 0x0210(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_5;                                     // 0x0220(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_7;                                // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0250(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_9;                                // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0278(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_11;                                    // 0x0288(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_12;                                    // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x02D0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0330(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x0340(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_17;                                    // 0x0350(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_18;                                    // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_19;                                    // 0x0368(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_20;                                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_21;                                // 0x0378(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__5;                             // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_22;                                // 0x0390(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_23;                                    // 0x03A0(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_25;                               // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x03D0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_27;                               // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x03F8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_29;                                    // 0x0408(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_30;                                    // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_31;                               // 0x0450(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_32;                                    // 0x04A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x04B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_34;                                    // 0x04C0(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_35;                                    // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_36;                                    // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_37;                                    // 0x04E8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _AsyncTaskClass_38;                                // 0x04F0(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__6;                             // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_39;                                // 0x0508(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_40;                                    // 0x0518(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_42;                               // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_43;                                        // 0x0548(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_44;                               // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_45;                                        // 0x0570(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_46;                                    // 0x0580(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_47;                                    // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_48;                               // 0x05C8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_49;                                    // 0x0618(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_50;                                    // 0x0628(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0638(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_52;                                    // 0x0648(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_53;                                    // 0x0650(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_54;                                    // 0x0660(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662[0x6];                                      // 0x0662(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _AsyncTaskClass_55;                                // 0x0668(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__7;                             // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_56;                                // 0x0680(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_57;                                    // 0x0690(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_59;                               // 0x06B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_60;                                        // 0x06C0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_61;                               // 0x06D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_62;                                        // 0x06E8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_63;                                    // 0x06F8(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_64;                                    // 0x0728(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_65;                               // 0x0740(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_66;                                    // 0x0790(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_67;                                    // 0x07A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_68;                                    // 0x07B0(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_69;                                    // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_70;                                    // 0x07C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_71;                                    // 0x07D8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DA[0x6];                                      // 0x07DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _AsyncTaskClass_72;                                // 0x07E0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xFE3AE8F0_OriginalPosition_8;             // 0x07F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_808[0x8];                                      // 0x0808(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_73;                                    // 0x0810(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__9;                             // 0x0870(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_74;                                        // 0x0878(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_75;                                    // 0x0888(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_889[0x7];                                      // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__11;                            // 0x0890(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_76;                                     // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_77;                                // 0x08A0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_78;                                    // 0x08B0(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_80;                               // 0x08D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_81;                                        // 0x08E0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_82;                               // 0x08F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_83;                                        // 0x0908(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_84;                                    // 0x0918(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_85;                                    // 0x0948(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_86;                               // 0x0960(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_87;                                    // 0x09B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_88;                                    // 0x09C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_89;                                    // 0x09D0(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_90;                                    // 0x09E0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_91;                                    // 0x09E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_92;                                    // 0x09F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9FA[0x6];                                      // 0x09FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_93;                                   // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_94;                                // 0x0A08(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__12;                            // 0x0A18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_95;                                // 0x0A20(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_96;                                    // 0x0A30(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_98;                               // 0x0A58(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_99;                                        // 0x0A60(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_100;                              // 0x0A70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_101;                                       // 0x0A88(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_102;                                   // 0x0A98(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_103;                                   // 0x0AC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_104;                              // 0x0AE0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_105;                                   // 0x0B30(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_106;                                   // 0x0B40(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_107;                                   // 0x0B50(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_108;                                   // 0x0B60(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_109;                                   // 0x0B68(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_110;                                   // 0x0B78(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7A[0x6];                                      // 0x0B7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _AsyncTaskClass_111;                               // 0x0B80(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__13;                            // 0x0B90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_112;                               // 0x0B98(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_113;                                   // 0x0BA8(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_115;                              // 0x0BD0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_116;                                       // 0x0BD8(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_117;                              // 0x0BE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_118;                                       // 0x0C00(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_119;                                   // 0x0C10(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_120;                                   // 0x0C40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_121;                              // 0x0C58(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_122;                                   // 0x0CA8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_123;                                   // 0x0CB8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_124;                                   // 0x0CC8(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_125;                                   // 0x0CD8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_126;                                   // 0x0CE0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_127;                                   // 0x0CF0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF2[0x6];                                      // 0x0CF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _AsyncTaskClass_128;                               // 0x0CF8(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__14;                            // 0x0D08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_129;                               // 0x0D10(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R _ExprResult_130;                                   // 0x0D20(0x0028)(HasGetValueTypeHash)
	class UAI_navigation_target*                  _ExprResultStack_132;                              // 0x0D48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_133;                                       // 0x0D50(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_134;                              // 0x0D60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_135;                                       // 0x0D78(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_136;                                   // 0x0D88(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_137;                                   // 0x0DB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_138;                              // 0x0DD0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_139;                                   // 0x0E20(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_140;                                   // 0x0E30(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_141;                                   // 0x0E40(0x0010)(HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     _ExprResult_142;                                   // 0x0E50(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             _ExprResult_143;                                   // 0x0E58(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_144;                                   // 0x0E68(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6A[0x6];                                      // 0x0E6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _AsyncTaskClass_145;                               // 0x0E70(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_creature_runtime$PatrolAround">();
	}
	static class Utask_CompanionAI_companion_creature_runtime_PatrolAround* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_creature_runtime_PatrolAround>();
	}
};
static_assert(alignof(Utask_CompanionAI_companion_creature_runtime_PatrolAround) == 0x000010, "Wrong alignment on Utask_CompanionAI_companion_creature_runtime_PatrolAround");
static_assert(sizeof(Utask_CompanionAI_companion_creature_runtime_PatrolAround) == 0x000E80, "Wrong size on Utask_CompanionAI_companion_creature_runtime_PatrolAround");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Self) == 0x000150, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Self' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0xFE3AE8F0_OriginalPosition_1) == 0x000160, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0xFE3AE8F0_OriginalPosition_1' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_0) == 0x000180, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__2) == 0x0001E0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__2' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_1) == 0x0001E8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_1' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_2) == 0x0001F8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__4) == 0x000200, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__4' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTask_3) == 0x000208, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTask_3' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_4) == 0x000210, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_4' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_5) == 0x000220, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_5' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_7) == 0x000248, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_7' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_8) == 0x000250, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_8' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_9) == 0x000260, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_9' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_10) == 0x000278, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_10' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_11) == 0x000288, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_11' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_12) == 0x0002B8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_12' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_13) == 0x0002D0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_13' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_14) == 0x000320, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_14' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_15) == 0x000330, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_15' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_16) == 0x000340, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_16' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_17) == 0x000350, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_17' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_18) == 0x000358, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_18' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_19) == 0x000368, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_19' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncResult_20) == 0x000370, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncResult_20' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_21) == 0x000378, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_21' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__5) == 0x000388, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__5' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_22) == 0x000390, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_22' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_23) == 0x0003A0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_23' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_25) == 0x0003C8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_25' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_26) == 0x0003D0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_26' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_27) == 0x0003E0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_27' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_28) == 0x0003F8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_28' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_29) == 0x000408, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_29' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_30) == 0x000438, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_30' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_31) == 0x000450, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_31' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_32) == 0x0004A0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_32' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_33) == 0x0004B0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_33' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_34) == 0x0004C0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_34' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_35) == 0x0004D0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_35' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_36) == 0x0004D8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_36' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_37) == 0x0004E8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_37' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_38) == 0x0004F0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_38' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__6) == 0x000500, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__6' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_39) == 0x000508, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_39' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_40) == 0x000518, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_40' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_42) == 0x000540, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_42' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_43) == 0x000548, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_43' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_44) == 0x000558, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_44' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_45) == 0x000570, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_45' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_46) == 0x000580, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_46' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_47) == 0x0005B0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_47' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_48) == 0x0005C8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_48' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_49) == 0x000618, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_49' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_50) == 0x000628, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_50' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_51) == 0x000638, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_51' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_52) == 0x000648, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_52' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_53) == 0x000650, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_53' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_54) == 0x000660, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_54' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_55) == 0x000668, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_55' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__7) == 0x000678, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__7' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_56) == 0x000680, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_56' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_57) == 0x000690, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_57' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_59) == 0x0006B8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_59' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_60) == 0x0006C0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_60' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_61) == 0x0006D0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_61' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_62) == 0x0006E8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_62' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_63) == 0x0006F8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_63' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_64) == 0x000728, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_64' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_65) == 0x000740, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_65' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_66) == 0x000790, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_66' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_67) == 0x0007A0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_67' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_68) == 0x0007B0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_68' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_69) == 0x0007C0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_69' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_70) == 0x0007C8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_70' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_71) == 0x0007D8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_71' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_72) == 0x0007E0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_72' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0xFE3AE8F0_OriginalPosition_8) == 0x0007F0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0xFE3AE8F0_OriginalPosition_8' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_73) == 0x000810, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_73' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__9) == 0x000870, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__9' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_74) == 0x000878, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_74' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_75) == 0x000888, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_75' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__11) == 0x000890, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__11' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTask_76) == 0x000898, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTask_76' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_77) == 0x0008A0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_77' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_78) == 0x0008B0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_78' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_80) == 0x0008D8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_80' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_81) == 0x0008E0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_81' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_82) == 0x0008F0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_82' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_83) == 0x000908, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_83' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_84) == 0x000918, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_84' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_85) == 0x000948, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_85' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_86) == 0x000960, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_86' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_87) == 0x0009B0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_87' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_88) == 0x0009C0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_88' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_89) == 0x0009D0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_89' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_90) == 0x0009E0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_90' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_91) == 0x0009E8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_91' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_92) == 0x0009F8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_92' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncResult_93) == 0x000A00, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncResult_93' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_94) == 0x000A08, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_94' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__12) == 0x000A18, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__12' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_95) == 0x000A20, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_95' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_96) == 0x000A30, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_96' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_98) == 0x000A58, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_98' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_99) == 0x000A60, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_99' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_100) == 0x000A70, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_100' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_101) == 0x000A88, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_101' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_102) == 0x000A98, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_102' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_103) == 0x000AC8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_103' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_104) == 0x000AE0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_104' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_105) == 0x000B30, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_105' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_106) == 0x000B40, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_106' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_107) == 0x000B50, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_107' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_108) == 0x000B60, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_108' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_109) == 0x000B68, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_109' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_110) == 0x000B78, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_110' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_111) == 0x000B80, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_111' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__13) == 0x000B90, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__13' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_112) == 0x000B98, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_112' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_113) == 0x000BA8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_113' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_115) == 0x000BD0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_115' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_116) == 0x000BD8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_116' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_117) == 0x000BE8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_117' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _Callee_118) == 0x000C00, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_Callee_118' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_119) == 0x000C10, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_119' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_120) == 0x000C40, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_120' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_121) == 0x000C58, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_121' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_122) == 0x000CA8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_122' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_123) == 0x000CB8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_123' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_124) == 0x000CC8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_124' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_125) == 0x000CD8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_125' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_126) == 0x000CE0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_126' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_127) == 0x000CF0, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_127' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_128) == 0x000CF8, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_128' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, __verse_0x00000000__14) == 0x000D08, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::__verse_0x00000000__14' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _AsyncTaskClass_129) == 0x000D10, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_AsyncTaskClass_129' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResult_130) == 0x000D20, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResult_130' has a wrong offset!");
static_assert(offsetof(Utask_CompanionAI_companion_creature_runtime_PatrolAround, _ExprResultStack_132) == 0x000D48, "Member 'Utask_CompanionAI_companion_creature_runtime_PatrolAround::_ExprResultStack_132' has a wrong offset!");
