#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompatibilityTags

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "S_UI_GameCompatibility_structs.hpp"


namespace SDK::Params
{

// Function CompatibilityTags.CompatibilityTags_C.ExecuteUbergraph_CompatibilityTags
// 0x0078 (0x0078 - 0x0000)
struct CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECosmeticCompatibleMode>               K2Node_Event_CompatibleModes;                      // 0x0018(0x0010)(ConstParm, ReferenceParm)
	ECosmeticCompatibleMode                       CallFunc_Array_Get_Item;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECosmeticCompatibleMode                       Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Tag_Base_C*                  CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_GameCompatibility                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags) == 0x000008, "Wrong alignment on CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags");
static_assert(sizeof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags) == 0x000078, "Wrong size on CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, EntryPoint) == 0x000000, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::EntryPoint' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_name_Variable) == 0x000004, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_name_Variable_1) == 0x000008, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_name_Variable_2) == 0x00000C, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_int_Array_Index_Variable) == 0x000010, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, K2Node_Event_CompatibleModes) == 0x000018, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::K2Node_Event_CompatibleModes' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_Array_Get_Item) == 0x000028, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_name_Variable_3) == 0x000034, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, Temp_byte_Variable) == 0x000040, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000048, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, K2Node_Select_Default) == 0x000050, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'CompatibilityTags_C_ExecuteUbergraph_CompatibilityTags::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function CompatibilityTags.CompatibilityTags_C.OnRefreshTags
// 0x0010 (0x0010 - 0x0000)
struct CompatibilityTags_C_OnRefreshTags final
{
public:
	TArray<ECosmeticCompatibleMode>               CompatibleModes;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CompatibilityTags_C_OnRefreshTags) == 0x000008, "Wrong alignment on CompatibilityTags_C_OnRefreshTags");
static_assert(sizeof(CompatibilityTags_C_OnRefreshTags) == 0x000010, "Wrong size on CompatibilityTags_C_OnRefreshTags");
static_assert(offsetof(CompatibilityTags_C_OnRefreshTags, CompatibleModes) == 0x000000, "Member 'CompatibilityTags_C_OnRefreshTags::CompatibleModes' has a wrong offset!");

}

