#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkItems

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CosmeticsFrameworkItems_structs.hpp"


namespace SDK::Params
{

// Function CosmeticsFrameworkItems.CosmeticDataComponent.BP_AddOrOverrideProperty
// 0x000C (0x000C - 0x0000)
struct CosmeticDataComponent_BP_AddOrOverrideProperty final
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmeticPropertyBase                  Property;                                          // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CosmeticDataComponent_BP_AddOrOverrideProperty) == 0x000004, "Wrong alignment on CosmeticDataComponent_BP_AddOrOverrideProperty");
static_assert(sizeof(CosmeticDataComponent_BP_AddOrOverrideProperty) == 0x00000C, "Wrong size on CosmeticDataComponent_BP_AddOrOverrideProperty");
static_assert(offsetof(CosmeticDataComponent_BP_AddOrOverrideProperty, SlotTag) == 0x000000, "Member 'CosmeticDataComponent_BP_AddOrOverrideProperty::SlotTag' has a wrong offset!");
static_assert(offsetof(CosmeticDataComponent_BP_AddOrOverrideProperty, Property) == 0x000004, "Member 'CosmeticDataComponent_BP_AddOrOverrideProperty::Property' has a wrong offset!");
static_assert(offsetof(CosmeticDataComponent_BP_AddOrOverrideProperty, ReturnValue) == 0x000008, "Member 'CosmeticDataComponent_BP_AddOrOverrideProperty::ReturnValue' has a wrong offset!");

// Function CosmeticsFrameworkItems.CosmeticDataComponent.BP_FindProperty
// 0x0010 (0x0010 - 0x0000)
struct CosmeticDataComponent_BP_FindProperty final
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PropertyTag;                                       // 0x0004(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCosmeticPropertyBase                  OutProperty;                                       // 0x0008(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CosmeticDataComponent_BP_FindProperty) == 0x000004, "Wrong alignment on CosmeticDataComponent_BP_FindProperty");
static_assert(sizeof(CosmeticDataComponent_BP_FindProperty) == 0x000010, "Wrong size on CosmeticDataComponent_BP_FindProperty");
static_assert(offsetof(CosmeticDataComponent_BP_FindProperty, SlotTag) == 0x000000, "Member 'CosmeticDataComponent_BP_FindProperty::SlotTag' has a wrong offset!");
static_assert(offsetof(CosmeticDataComponent_BP_FindProperty, PropertyTag) == 0x000004, "Member 'CosmeticDataComponent_BP_FindProperty::PropertyTag' has a wrong offset!");
static_assert(offsetof(CosmeticDataComponent_BP_FindProperty, OutProperty) == 0x000008, "Member 'CosmeticDataComponent_BP_FindProperty::OutProperty' has a wrong offset!");
static_assert(offsetof(CosmeticDataComponent_BP_FindProperty, ReturnValue) == 0x00000C, "Member 'CosmeticDataComponent_BP_FindProperty::ReturnValue' has a wrong offset!");

}

