#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkItems

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct CosmeticsFrameworkItems.CosmeticPropertyBase
// 0x0004 (0x0004 - 0x0000)
struct FCosmeticPropertyBase
{
public:
	struct FGameplayTag                           PropertyTag;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmeticPropertyBase) == 0x000004, "Wrong alignment on FCosmeticPropertyBase");
static_assert(sizeof(FCosmeticPropertyBase) == 0x000004, "Wrong size on FCosmeticPropertyBase");
static_assert(offsetof(FCosmeticPropertyBase, PropertyTag) == 0x000000, "Member 'FCosmeticPropertyBase::PropertyTag' has a wrong offset!");

// ScriptStruct CosmeticsFrameworkItems.CosmeticProperty_Vector
// 0x001C (0x0020 - 0x0004)
struct FCosmeticProperty_Vector final : public FCosmeticPropertyBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Value;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmeticProperty_Vector) == 0x000008, "Wrong alignment on FCosmeticProperty_Vector");
static_assert(sizeof(FCosmeticProperty_Vector) == 0x000020, "Wrong size on FCosmeticProperty_Vector");
static_assert(offsetof(FCosmeticProperty_Vector, Value) == 0x000008, "Member 'FCosmeticProperty_Vector::Value' has a wrong offset!");

// ScriptStruct CosmeticsFrameworkItems.CosmeticProperty_TableRow
// 0x0014 (0x0018 - 0x0004)
struct FCosmeticProperty_TableRow final : public FCosmeticPropertyBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    TableRow;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCosmeticProperty_TableRow) == 0x000008, "Wrong alignment on FCosmeticProperty_TableRow");
static_assert(sizeof(FCosmeticProperty_TableRow) == 0x000018, "Wrong size on FCosmeticProperty_TableRow");
static_assert(offsetof(FCosmeticProperty_TableRow, TableRow) == 0x000008, "Member 'FCosmeticProperty_TableRow::TableRow' has a wrong offset!");

}

