#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticNotification

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CosmeticNotification.CosmeticNotification_C.ExecuteUbergraph_CosmeticNotification
// 0x0088 (0x0088 - 0x0000)
struct CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UItemDefinitionBase*              K2Node_Event_RewardItem_1;                         // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   K2Node_Event_QuestRarity;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              K2Node_Event_RewardItem;                           // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification) == 0x000008, "Wrong alignment on CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification");
static_assert(sizeof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification) == 0x000088, "Wrong size on CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, EntryPoint) == 0x000000, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, Temp_bool_Variable) == 0x000005, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, Temp_real_Variable) == 0x000008, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, Temp_real_Variable_1) == 0x00000C, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_RewardItem_1) == 0x000020, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_RewardItem_1' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_QuestRarity) == 0x000028, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_QuestRarity' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_RewardItem) == 0x000030, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_RewardItem' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000040, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Event_IsDesignTime) == 0x000054, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, Temp_bool_IsClosed_Variable) == 0x000068, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_GetObjectClass_ReturnValue) == 0x000070, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_SpawnSound2D_ReturnValue) == 0x000078, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, CallFunc_ClassIsChildOf_ReturnValue) == 0x000080, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification, K2Node_Select_Default) == 0x000084, "Member 'CosmeticNotification_C_ExecuteUbergraph_CosmeticNotification::K2Node_Select_Default' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CosmeticNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_PreConstruct) == 0x000001, "Wrong alignment on CosmeticNotification_C_PreConstruct");
static_assert(sizeof(CosmeticNotification_C_PreConstruct) == 0x000001, "Wrong size on CosmeticNotification_C_PreConstruct");
static_assert(offsetof(CosmeticNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CosmeticNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.SetStyle_LevelUp
// 0x0008 (0x0008 - 0x0000)
struct CosmeticNotification_C_SetStyle_LevelUp final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_SetStyle_LevelUp) == 0x000008, "Wrong alignment on CosmeticNotification_C_SetStyle_LevelUp");
static_assert(sizeof(CosmeticNotification_C_SetStyle_LevelUp) == 0x000008, "Wrong size on CosmeticNotification_C_SetStyle_LevelUp");
static_assert(offsetof(CosmeticNotification_C_SetStyle_LevelUp, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'CosmeticNotification_C_SetStyle_LevelUp::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.SetStyle_QuestCosmetic
// 0x0010 (0x0010 - 0x0000)
struct CosmeticNotification_C_SetStyle_QuestCosmetic final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_SetStyle_QuestCosmetic) == 0x000008, "Wrong alignment on CosmeticNotification_C_SetStyle_QuestCosmetic");
static_assert(sizeof(CosmeticNotification_C_SetStyle_QuestCosmetic) == 0x000010, "Wrong size on CosmeticNotification_C_SetStyle_QuestCosmetic");
static_assert(offsetof(CosmeticNotification_C_SetStyle_QuestCosmetic, Rarity) == 0x000000, "Member 'CosmeticNotification_C_SetStyle_QuestCosmetic::Rarity' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_SetStyle_QuestCosmetic, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'CosmeticNotification_C_SetStyle_QuestCosmetic::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.UpdateLevelUpVisuals
// 0x0008 (0x0008 - 0x0000)
struct CosmeticNotification_C_UpdateLevelUpVisuals final
{
public:
	const class UFortItemDefinition*              RewardItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_UpdateLevelUpVisuals) == 0x000008, "Wrong alignment on CosmeticNotification_C_UpdateLevelUpVisuals");
static_assert(sizeof(CosmeticNotification_C_UpdateLevelUpVisuals) == 0x000008, "Wrong size on CosmeticNotification_C_UpdateLevelUpVisuals");
static_assert(offsetof(CosmeticNotification_C_UpdateLevelUpVisuals, RewardItem) == 0x000000, "Member 'CosmeticNotification_C_UpdateLevelUpVisuals::RewardItem' has a wrong offset!");

// Function CosmeticNotification.CosmeticNotification_C.UpdateQuestRewardVisuals
// 0x0010 (0x0010 - 0x0000)
struct CosmeticNotification_C_UpdateQuestRewardVisuals final
{
public:
	const class UItemDefinitionBase*              RewardItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   QuestRarity;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticNotification_C_UpdateQuestRewardVisuals) == 0x000008, "Wrong alignment on CosmeticNotification_C_UpdateQuestRewardVisuals");
static_assert(sizeof(CosmeticNotification_C_UpdateQuestRewardVisuals) == 0x000010, "Wrong size on CosmeticNotification_C_UpdateQuestRewardVisuals");
static_assert(offsetof(CosmeticNotification_C_UpdateQuestRewardVisuals, RewardItem) == 0x000000, "Member 'CosmeticNotification_C_UpdateQuestRewardVisuals::RewardItem' has a wrong offset!");
static_assert(offsetof(CosmeticNotification_C_UpdateQuestRewardVisuals, QuestRarity) == 0x000008, "Member 'CosmeticNotification_C_UpdateQuestRewardVisuals::QuestRarity' has a wrong offset!");

}

