#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkLoadouts

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CosmeticsFrameworkLoadouts.BasicCosmeticLoadoutContext
// 0x0008 (0x0030 - 0x0028)
class UBasicCosmeticLoadoutContext : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicCosmeticLoadoutContext">();
	}
	static class UBasicCosmeticLoadoutContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicCosmeticLoadoutContext>();
	}
};
static_assert(alignof(UBasicCosmeticLoadoutContext) == 0x000008, "Wrong alignment on UBasicCosmeticLoadoutContext");
static_assert(sizeof(UBasicCosmeticLoadoutContext) == 0x000030, "Wrong size on UBasicCosmeticLoadoutContext");

// Class CosmeticsFrameworkLoadouts.CosmeticCustomizableItemDefinition
// 0x0000 (0x0028 - 0x0028)
class ICosmeticCustomizableItemDefinition final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticCustomizableItemDefinition">();
	}
	static class ICosmeticCustomizableItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticCustomizableItemDefinition>();
	}
};
static_assert(alignof(ICosmeticCustomizableItemDefinition) == 0x000008, "Wrong alignment on ICosmeticCustomizableItemDefinition");
static_assert(sizeof(ICosmeticCustomizableItemDefinition) == 0x000028, "Wrong size on ICosmeticCustomizableItemDefinition");

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutContext
// 0x0000 (0x0028 - 0x0028)
class ICosmeticLoadoutContext final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutContext">();
	}
	static class ICosmeticLoadoutContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutContext>();
	}
};
static_assert(alignof(ICosmeticLoadoutContext) == 0x000008, "Wrong alignment on ICosmeticLoadoutContext");
static_assert(sizeof(ICosmeticLoadoutContext) == 0x000028, "Wrong size on ICosmeticLoadoutContext");

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutItemDefinition
// 0x0000 (0x0028 - 0x0028)
class ICosmeticLoadoutItemDefinition final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutItemDefinition">();
	}
	static class ICosmeticLoadoutItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutItemDefinition>();
	}
};
static_assert(alignof(ICosmeticLoadoutItemDefinition) == 0x000008, "Wrong alignment on ICosmeticLoadoutItemDefinition");
static_assert(sizeof(ICosmeticLoadoutItemDefinition) == 0x000028, "Wrong size on ICosmeticLoadoutItemDefinition");

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSchema
// 0x0010 (0x0040 - 0x0030)
class UCosmeticLoadoutSchema final : public UPrimaryDataAsset
{
public:
	TArray<class UCosmeticLoadoutSlotTemplate*>   Slots;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class FString GetTemplateId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSchema">();
	}
	static class UCosmeticLoadoutSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSchema>();
	}
};
static_assert(alignof(UCosmeticLoadoutSchema) == 0x000008, "Wrong alignment on UCosmeticLoadoutSchema");
static_assert(sizeof(UCosmeticLoadoutSchema) == 0x000040, "Wrong size on UCosmeticLoadoutSchema");
static_assert(offsetof(UCosmeticLoadoutSchema, Slots) == 0x000030, "Member 'UCosmeticLoadoutSchema::Slots' has a wrong offset!");

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate
// 0x0098 (0x00C8 - 0x0030)
class UCosmeticLoadoutSlotTemplate final : public UPrimaryDataAsset
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MetaTags;                                          // 0x0038(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FCosmeticLoadoutSlotRequirements       Requirements;                                      // 0x0058(0x0050)(Edit, NativeAccessSpecifierPrivate)
	class FString                                 ShortName;                                         // 0x00A8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryAssetId                        DefaultCosmeticItemId;                             // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAlwaysUseDefaultCosmeticItemId;                   // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetAlwaysUseDefaultCosmeticItemId() const;
	struct FPrimaryAssetId GetDefaultCosmeticItemId() const;
	const struct FGameplayTagContainer GetMetaTags() const;
	const struct FCosmeticLoadoutSlotRequirements GetRequirements() const;
	class FString GetShortName() const;
	struct FGameplayTag GetSlotTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSlotTemplate">();
	}
	static class UCosmeticLoadoutSlotTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSlotTemplate>();
	}
};
static_assert(alignof(UCosmeticLoadoutSlotTemplate) == 0x000008, "Wrong alignment on UCosmeticLoadoutSlotTemplate");
static_assert(sizeof(UCosmeticLoadoutSlotTemplate) == 0x0000C8, "Wrong size on UCosmeticLoadoutSlotTemplate");
static_assert(offsetof(UCosmeticLoadoutSlotTemplate, SlotTag) == 0x000030, "Member 'UCosmeticLoadoutSlotTemplate::SlotTag' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutSlotTemplate, MetaTags) == 0x000038, "Member 'UCosmeticLoadoutSlotTemplate::MetaTags' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutSlotTemplate, Requirements) == 0x000058, "Member 'UCosmeticLoadoutSlotTemplate::Requirements' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutSlotTemplate, ShortName) == 0x0000A8, "Member 'UCosmeticLoadoutSlotTemplate::ShortName' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutSlotTemplate, DefaultCosmeticItemId) == 0x0000B8, "Member 'UCosmeticLoadoutSlotTemplate::DefaultCosmeticItemId' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutSlotTemplate, bAlwaysUseDefaultCosmeticItemId) == 0x0000C0, "Member 'UCosmeticLoadoutSlotTemplate::bAlwaysUseDefaultCosmeticItemId' has a wrong offset!");

}

