#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CraftingRuntime.CraftingObjectBGA.HandleInteractionRangeBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct CraftingObjectBGA_HandleInteractionRangeBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap) == 0x000008, "Wrong alignment on CraftingObjectBGA_HandleInteractionRangeBeginOverlap");
static_assert(sizeof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap) == 0x000108, "Wrong size on CraftingObjectBGA_HandleInteractionRangeBeginOverlap");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap, OverlappedComponent) == 0x000000, "Member 'CraftingObjectBGA_HandleInteractionRangeBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap, OtherActor) == 0x000008, "Member 'CraftingObjectBGA_HandleInteractionRangeBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap, OtherComp) == 0x000010, "Member 'CraftingObjectBGA_HandleInteractionRangeBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'CraftingObjectBGA_HandleInteractionRangeBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap, bFromSweep) == 0x00001C, "Member 'CraftingObjectBGA_HandleInteractionRangeBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeBeginOverlap, SweepResult) == 0x000020, "Member 'CraftingObjectBGA_HandleInteractionRangeBeginOverlap::SweepResult' has a wrong offset!");

// Function CraftingRuntime.CraftingObjectBGA.HandleInteractionRangeEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct CraftingObjectBGA_HandleInteractionRangeEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CraftingObjectBGA_HandleInteractionRangeEndOverlap) == 0x000008, "Wrong alignment on CraftingObjectBGA_HandleInteractionRangeEndOverlap");
static_assert(sizeof(CraftingObjectBGA_HandleInteractionRangeEndOverlap) == 0x000020, "Wrong size on CraftingObjectBGA_HandleInteractionRangeEndOverlap");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeEndOverlap, OverlappedComponent) == 0x000000, "Member 'CraftingObjectBGA_HandleInteractionRangeEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeEndOverlap, OtherActor) == 0x000008, "Member 'CraftingObjectBGA_HandleInteractionRangeEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeEndOverlap, OtherComp) == 0x000010, "Member 'CraftingObjectBGA_HandleInteractionRangeEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(CraftingObjectBGA_HandleInteractionRangeEndOverlap, OtherBodyIndex) == 0x000018, "Member 'CraftingObjectBGA_HandleInteractionRangeEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function CraftingRuntime.CraftingCheatManager.StartSelfCrafting
// 0x0004 (0x0004 - 0x0000)
struct CraftingCheatManager_StartSelfCrafting final
{
public:
	class FName                                   FormulaName;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingCheatManager_StartSelfCrafting) == 0x000004, "Wrong alignment on CraftingCheatManager_StartSelfCrafting");
static_assert(sizeof(CraftingCheatManager_StartSelfCrafting) == 0x000004, "Wrong size on CraftingCheatManager_StartSelfCrafting");
static_assert(offsetof(CraftingCheatManager_StartSelfCrafting, FormulaName) == 0x000000, "Member 'CraftingCheatManager_StartSelfCrafting::FormulaName' has a wrong offset!");

// Function CraftingRuntime.CraftingObjectComponent.HandlePickupCraftingItemPickedUp
// 0x0030 (0x0030 - 0x0000)
struct CraftingObjectComponent_HandlePickupCraftingItemPickedUp final
{
public:
	class AFortPickup*                            Pickup;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              InteractingPawn;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortWorldItemDefinition*         WorldItemDefinition;                               // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PickupLocation;                                    // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingObjectComponent_HandlePickupCraftingItemPickedUp) == 0x000008, "Wrong alignment on CraftingObjectComponent_HandlePickupCraftingItemPickedUp");
static_assert(sizeof(CraftingObjectComponent_HandlePickupCraftingItemPickedUp) == 0x000030, "Wrong size on CraftingObjectComponent_HandlePickupCraftingItemPickedUp");
static_assert(offsetof(CraftingObjectComponent_HandlePickupCraftingItemPickedUp, Pickup) == 0x000000, "Member 'CraftingObjectComponent_HandlePickupCraftingItemPickedUp::Pickup' has a wrong offset!");
static_assert(offsetof(CraftingObjectComponent_HandlePickupCraftingItemPickedUp, InteractingPawn) == 0x000008, "Member 'CraftingObjectComponent_HandlePickupCraftingItemPickedUp::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CraftingObjectComponent_HandlePickupCraftingItemPickedUp, WorldItemDefinition) == 0x000010, "Member 'CraftingObjectComponent_HandlePickupCraftingItemPickedUp::WorldItemDefinition' has a wrong offset!");
static_assert(offsetof(CraftingObjectComponent_HandlePickupCraftingItemPickedUp, PickupLocation) == 0x000018, "Member 'CraftingObjectComponent_HandlePickupCraftingItemPickedUp::PickupLocation' has a wrong offset!");

// Function CraftingRuntime.CraftingObjectComponent.OnRep_CraftingObjectRepStateData
// 0x0010 (0x0010 - 0x0000)
struct CraftingObjectComponent_OnRep_CraftingObjectRepStateData final
{
public:
	TArray<struct FCraftingObjectRepStateData>    OldValue;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingObjectComponent_OnRep_CraftingObjectRepStateData) == 0x000008, "Wrong alignment on CraftingObjectComponent_OnRep_CraftingObjectRepStateData");
static_assert(sizeof(CraftingObjectComponent_OnRep_CraftingObjectRepStateData) == 0x000010, "Wrong size on CraftingObjectComponent_OnRep_CraftingObjectRepStateData");
static_assert(offsetof(CraftingObjectComponent_OnRep_CraftingObjectRepStateData, OldValue) == 0x000000, "Member 'CraftingObjectComponent_OnRep_CraftingObjectRepStateData::OldValue' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ClientNotifyCraftingFailed
// 0x0030 (0x0030 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0008(0x0020)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed) == 0x000030, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed, FailedReason) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed::FailedReason' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed, Key) == 0x000028, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingFailed::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ClientNotifyCraftingSuccess
// 0x0028 (0x0028 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FormulaRowName;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemEntry>                 ConsumedIngredients;                               // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess) == 0x000028, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess, FormulaRowName) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess::FormulaRowName' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess, ConsumedIngredients) == 0x000010, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess::ConsumedIngredients' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess, Key) == 0x000020, "Member 'FortControllerComponent_CraftingNetworkEvents_ClientNotifyCraftingSuccess::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.NotifyCraftingSuccess
// 0x0028 (0x0028 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FormulaRowName;                                    // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemEntry>                 ConsumedIngredients;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess) == 0x000028, "Wrong size on FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess, FormulaRowName) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess::FormulaRowName' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess, ConsumedIngredients) == 0x000010, "Member 'FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess::ConsumedIngredients' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess, Key) == 0x000020, "Member 'FortControllerComponent_CraftingNetworkEvents_NotifyCraftingSuccess::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerCancelCrafting
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting) == 0x000010, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting, Key) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerCancelCrafting::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerClaimCraftingResults
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults) == 0x000010, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults, Key) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerClaimCraftingResults::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerEjectItems
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerEjectItems final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerEjectItems) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerEjectItems");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerEjectItems) == 0x000008, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerEjectItems");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerEjectItems, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerEjectItems::CraftingObject' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerPauseCrafting
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDecayPausedTime;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftingMultiKey                      Key;                                               // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting) == 0x000018, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting, bDecayPausedTime) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting::bDecayPausedTime' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting, Key) == 0x000010, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPauseCrafting::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerPickupItemAndStartCrafting
// 0x0020 (0x0020 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPickup*                            Pickup;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CraftingFormulaName;                               // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftingMultiKey                      Key;                                               // 0x0018(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting) == 0x000020, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting, Pickup) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting::Pickup' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting, CraftingFormulaName) == 0x000010, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting::CraftingFormulaName' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting, Key) == 0x000018, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerPickupItemAndStartCrafting::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerReportCraftingSuccess
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess) == 0x000010, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess, Key) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerReportCraftingSuccess::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerResumeCrafting
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting) == 0x000010, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting, Key) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerResumeCrafting::Key' has a wrong offset!");

// Function CraftingRuntime.FortControllerComponent_CraftingNetworkEvents.ServerStartCrafting
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CraftingFormulaName;                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberToCraft;                                     // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting) == 0x000008, "Wrong alignment on FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting");
static_assert(sizeof(FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting) == 0x000018, "Wrong size on FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting, CraftingObject) == 0x000000, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting::CraftingObject' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting, CraftingFormulaName) == 0x000008, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting::CraftingFormulaName' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting, NumberToCraft) == 0x00000C, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting::NumberToCraft' has a wrong offset!");
static_assert(offsetof(FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting, Key) == 0x000010, "Member 'FortControllerComponent_CraftingNetworkEvents_ServerStartCrafting::Key' has a wrong offset!");

// Function CraftingRuntime.FortGameStateComponent_Crafting.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortGameStateComponent_Crafting_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGameStateComponent_Crafting_OnPlaylistDataReady) == 0x000008, "Wrong alignment on FortGameStateComponent_Crafting_OnPlaylistDataReady");
static_assert(sizeof(FortGameStateComponent_Crafting_OnPlaylistDataReady) == 0x000030, "Wrong size on FortGameStateComponent_Crafting_OnPlaylistDataReady");
static_assert(offsetof(FortGameStateComponent_Crafting_OnPlaylistDataReady, GameState) == 0x000000, "Member 'FortGameStateComponent_Crafting_OnPlaylistDataReady::GameState' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_Crafting_OnPlaylistDataReady, Playlist) == 0x000008, "Member 'FortGameStateComponent_Crafting_OnPlaylistDataReady::Playlist' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_Crafting_OnPlaylistDataReady, PlaylistContextTags) == 0x000010, "Member 'FortGameStateComponent_Crafting_OnPlaylistDataReady::PlaylistContextTags' has a wrong offset!");

// Function CraftingRuntime.FortContextualTutorial_CraftingComplete.OnCraftingSuccess
// 0x0030 (0x0030 - 0x0000)
struct FortContextualTutorial_CraftingComplete_OnCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortContextualTutorial_CraftingComplete_OnCraftingSuccess) == 0x000008, "Wrong alignment on FortContextualTutorial_CraftingComplete_OnCraftingSuccess");
static_assert(sizeof(FortContextualTutorial_CraftingComplete_OnCraftingSuccess) == 0x000030, "Wrong size on FortContextualTutorial_CraftingComplete_OnCraftingSuccess");
static_assert(offsetof(FortContextualTutorial_CraftingComplete_OnCraftingSuccess, Event) == 0x000000, "Member 'FortContextualTutorial_CraftingComplete_OnCraftingSuccess::Event' has a wrong offset!");

// Function CraftingRuntime.FortContextualTutorial_CraftingReady.HandleFormulaCraftableChanged
// 0x0008 (0x0008 - 0x0000)
struct FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged final
{
public:
	class FName                                   FormulaRowName;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCraftable;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged) == 0x000004, "Wrong alignment on FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged");
static_assert(sizeof(FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged) == 0x000008, "Wrong size on FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged");
static_assert(offsetof(FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged, FormulaRowName) == 0x000000, "Member 'FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged::FormulaRowName' has a wrong offset!");
static_assert(offsetof(FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged, bIsCraftable) == 0x000004, "Member 'FortContextualTutorial_CraftingReady_HandleFormulaCraftableChanged::bIsCraftable' has a wrong offset!");

// Function CraftingRuntime.FortContextualTutorial_CraftingTabOpen.HandleFormulaCraftableChanged
// 0x0008 (0x0008 - 0x0000)
struct FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged final
{
public:
	class FName                                   FormulaRowName;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCraftable;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged) == 0x000004, "Wrong alignment on FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged");
static_assert(sizeof(FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged) == 0x000008, "Wrong size on FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged");
static_assert(offsetof(FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged, FormulaRowName) == 0x000000, "Member 'FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged::FormulaRowName' has a wrong offset!");
static_assert(offsetof(FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged, bIsCraftable) == 0x000004, "Member 'FortContextualTutorial_CraftingTabOpen_HandleFormulaCraftableChanged::bIsCraftable' has a wrong offset!");

// Function CraftingRuntime.FortContextualTutorial_CraftingTabOpen.HandleInventoryTabChanged
// 0x0004 (0x0004 - 0x0000)
struct FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged final
{
public:
	class FName                                   InventoryTabNameId;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged) == 0x000004, "Wrong alignment on FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged");
static_assert(sizeof(FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged) == 0x000004, "Wrong size on FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged");
static_assert(offsetof(FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged, InventoryTabNameId) == 0x000000, "Member 'FortContextualTutorial_CraftingTabOpen_HandleInventoryTabChanged::InventoryTabNameId' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.CancelAllCrafting
// 0x0008 (0x0008 - 0x0000)
struct CraftingLibrary_CancelAllCrafting final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_CancelAllCrafting) == 0x000008, "Wrong alignment on CraftingLibrary_CancelAllCrafting");
static_assert(sizeof(CraftingLibrary_CancelAllCrafting) == 0x000008, "Wrong size on CraftingLibrary_CancelAllCrafting");
static_assert(offsetof(CraftingLibrary_CancelAllCrafting, CraftingObject) == 0x000000, "Member 'CraftingLibrary_CancelAllCrafting::CraftingObject' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.CancelCrafting
// 0x0018 (0x0018 - 0x0000)
struct CraftingLibrary_CancelCrafting final
{
public:
	class AFortPlayerController*                  Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 CraftingObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_CancelCrafting) == 0x000008, "Wrong alignment on CraftingLibrary_CancelCrafting");
static_assert(sizeof(CraftingLibrary_CancelCrafting) == 0x000018, "Wrong size on CraftingLibrary_CancelCrafting");
static_assert(offsetof(CraftingLibrary_CancelCrafting, Instigator) == 0x000000, "Member 'CraftingLibrary_CancelCrafting::Instigator' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CancelCrafting, CraftingObject) == 0x000008, "Member 'CraftingLibrary_CancelCrafting::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CancelCrafting, Key) == 0x000010, "Member 'CraftingLibrary_CancelCrafting::Key' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.CanCraftFormula
// 0x0030 (0x0030 - 0x0000)
struct CraftingLibrary_CanCraftFormula final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           CraftingObject;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CraftingFormulaRow;                                // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCraftingIngredientQueryState>  OutIngredientStates;                               // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumberToCraft;                                     // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CraftingLibrary_CanCraftFormula) == 0x000008, "Wrong alignment on CraftingLibrary_CanCraftFormula");
static_assert(sizeof(CraftingLibrary_CanCraftFormula) == 0x000030, "Wrong size on CraftingLibrary_CanCraftFormula");
static_assert(offsetof(CraftingLibrary_CanCraftFormula, FortPC) == 0x000000, "Member 'CraftingLibrary_CanCraftFormula::FortPC' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormula, CraftingObject) == 0x000008, "Member 'CraftingLibrary_CanCraftFormula::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormula, CraftingFormulaRow) == 0x000010, "Member 'CraftingLibrary_CanCraftFormula::CraftingFormulaRow' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormula, OutIngredientStates) == 0x000018, "Member 'CraftingLibrary_CanCraftFormula::OutIngredientStates' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormula, NumberToCraft) == 0x000028, "Member 'CraftingLibrary_CanCraftFormula::NumberToCraft' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormula, ReturnValue) == 0x00002C, "Member 'CraftingLibrary_CanCraftFormula::ReturnValue' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.CanCraftFormulaWithAdditionalItems
// 0x0040 (0x0040 - 0x0000)
struct CraftingLibrary_CanCraftFormulaWithAdditionalItems final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           CraftingObject;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CraftingFormulaRow;                                // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FItemAndCount>                  AdditionalItems;                                   // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FCraftingIngredientQueryState>  OutIngredientStates;                               // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumberToCraft;                                     // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x003C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CraftingLibrary_CanCraftFormulaWithAdditionalItems) == 0x000008, "Wrong alignment on CraftingLibrary_CanCraftFormulaWithAdditionalItems");
static_assert(sizeof(CraftingLibrary_CanCraftFormulaWithAdditionalItems) == 0x000040, "Wrong size on CraftingLibrary_CanCraftFormulaWithAdditionalItems");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, FortPC) == 0x000000, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::FortPC' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, CraftingObject) == 0x000008, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, CraftingFormulaRow) == 0x000010, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::CraftingFormulaRow' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, AdditionalItems) == 0x000018, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::AdditionalItems' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, OutIngredientStates) == 0x000028, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::OutIngredientStates' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, NumberToCraft) == 0x000038, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::NumberToCraft' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_CanCraftFormulaWithAdditionalItems, ReturnValue) == 0x00003C, "Member 'CraftingLibrary_CanCraftFormulaWithAdditionalItems::ReturnValue' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.ClaimCraftingResults
// 0x0018 (0x0018 - 0x0000)
struct CraftingLibrary_ClaimCraftingResults final
{
public:
	class AFortPlayerController*                  Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 CraftingObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_ClaimCraftingResults) == 0x000008, "Wrong alignment on CraftingLibrary_ClaimCraftingResults");
static_assert(sizeof(CraftingLibrary_ClaimCraftingResults) == 0x000018, "Wrong size on CraftingLibrary_ClaimCraftingResults");
static_assert(offsetof(CraftingLibrary_ClaimCraftingResults, Instigator) == 0x000000, "Member 'CraftingLibrary_ClaimCraftingResults::Instigator' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_ClaimCraftingResults, CraftingObject) == 0x000008, "Member 'CraftingLibrary_ClaimCraftingResults::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_ClaimCraftingResults, Key) == 0x000010, "Member 'CraftingLibrary_ClaimCraftingResults::Key' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.EjectItems
// 0x0010 (0x0010 - 0x0000)
struct CraftingLibrary_EjectItems final
{
public:
	class AFortPlayerController*                  Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 CraftingObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_EjectItems) == 0x000008, "Wrong alignment on CraftingLibrary_EjectItems");
static_assert(sizeof(CraftingLibrary_EjectItems) == 0x000010, "Wrong size on CraftingLibrary_EjectItems");
static_assert(offsetof(CraftingLibrary_EjectItems, Instigator) == 0x000000, "Member 'CraftingLibrary_EjectItems::Instigator' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_EjectItems, CraftingObject) == 0x000008, "Member 'CraftingLibrary_EjectItems::CraftingObject' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.GetAllCraftableFormulas
// 0x0020 (0x0020 - 0x0000)
struct CraftingLibrary_GetAllCraftableFormulas final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           CraftingObject;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutFormulas;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_GetAllCraftableFormulas) == 0x000008, "Wrong alignment on CraftingLibrary_GetAllCraftableFormulas");
static_assert(sizeof(CraftingLibrary_GetAllCraftableFormulas) == 0x000020, "Wrong size on CraftingLibrary_GetAllCraftableFormulas");
static_assert(offsetof(CraftingLibrary_GetAllCraftableFormulas, FortPC) == 0x000000, "Member 'CraftingLibrary_GetAllCraftableFormulas::FortPC' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetAllCraftableFormulas, CraftingObject) == 0x000008, "Member 'CraftingLibrary_GetAllCraftableFormulas::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetAllCraftableFormulas, OutFormulas) == 0x000010, "Member 'CraftingLibrary_GetAllCraftableFormulas::OutFormulas' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.GetAllCraftingFormulas
// 0x0020 (0x0020 - 0x0000)
struct CraftingLibrary_GetAllCraftingFormulas final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           CraftingObject;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutFormulas;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_GetAllCraftingFormulas) == 0x000008, "Wrong alignment on CraftingLibrary_GetAllCraftingFormulas");
static_assert(sizeof(CraftingLibrary_GetAllCraftingFormulas) == 0x000020, "Wrong size on CraftingLibrary_GetAllCraftingFormulas");
static_assert(offsetof(CraftingLibrary_GetAllCraftingFormulas, FortPC) == 0x000000, "Member 'CraftingLibrary_GetAllCraftingFormulas::FortPC' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetAllCraftingFormulas, CraftingObject) == 0x000008, "Member 'CraftingLibrary_GetAllCraftingFormulas::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetAllCraftingFormulas, OutFormulas) == 0x000010, "Member 'CraftingLibrary_GetAllCraftingFormulas::OutFormulas' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.GetAllValidIngredients
// 0x0020 (0x0020 - 0x0000)
struct CraftingLibrary_GetAllValidIngredients final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           CraftingObject;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTagContainer>          OutIngredients;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_GetAllValidIngredients) == 0x000008, "Wrong alignment on CraftingLibrary_GetAllValidIngredients");
static_assert(sizeof(CraftingLibrary_GetAllValidIngredients) == 0x000020, "Wrong size on CraftingLibrary_GetAllValidIngredients");
static_assert(offsetof(CraftingLibrary_GetAllValidIngredients, FortPC) == 0x000000, "Member 'CraftingLibrary_GetAllValidIngredients::FortPC' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetAllValidIngredients, CraftingObject) == 0x000008, "Member 'CraftingLibrary_GetAllValidIngredients::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetAllValidIngredients, OutIngredients) == 0x000010, "Member 'CraftingLibrary_GetAllValidIngredients::OutIngredients' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.GetCraftedResults_TempItems
// 0x0020 (0x0020 - 0x0000)
struct CraftingLibrary_GetCraftedResults_TempItems final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortWorldItem*>                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CraftingLibrary_GetCraftedResults_TempItems) == 0x000008, "Wrong alignment on CraftingLibrary_GetCraftedResults_TempItems");
static_assert(sizeof(CraftingLibrary_GetCraftedResults_TempItems) == 0x000020, "Wrong size on CraftingLibrary_GetCraftedResults_TempItems");
static_assert(offsetof(CraftingLibrary_GetCraftedResults_TempItems, CraftingObject) == 0x000000, "Member 'CraftingLibrary_GetCraftedResults_TempItems::CraftingObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetCraftedResults_TempItems, Key) == 0x000008, "Member 'CraftingLibrary_GetCraftedResults_TempItems::Key' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetCraftedResults_TempItems, ReturnValue) == 0x000010, "Member 'CraftingLibrary_GetCraftedResults_TempItems::ReturnValue' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.GetCraftingFormulaIngredientRequirements
// 0x0028 (0x0028 - 0x0000)
struct CraftingLibrary_GetCraftingFormulaIngredientRequirements final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CraftingFormulaRow;                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCraftingIngredientRequirement> OutIngredientRequirements;                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CraftingLibrary_GetCraftingFormulaIngredientRequirements) == 0x000008, "Wrong alignment on CraftingLibrary_GetCraftingFormulaIngredientRequirements");
static_assert(sizeof(CraftingLibrary_GetCraftingFormulaIngredientRequirements) == 0x000028, "Wrong size on CraftingLibrary_GetCraftingFormulaIngredientRequirements");
static_assert(offsetof(CraftingLibrary_GetCraftingFormulaIngredientRequirements, WorldContextObject) == 0x000000, "Member 'CraftingLibrary_GetCraftingFormulaIngredientRequirements::WorldContextObject' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetCraftingFormulaIngredientRequirements, CraftingFormulaRow) == 0x000008, "Member 'CraftingLibrary_GetCraftingFormulaIngredientRequirements::CraftingFormulaRow' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetCraftingFormulaIngredientRequirements, OutIngredientRequirements) == 0x000010, "Member 'CraftingLibrary_GetCraftingFormulaIngredientRequirements::OutIngredientRequirements' has a wrong offset!");
static_assert(offsetof(CraftingLibrary_GetCraftingFormulaIngredientRequirements, ReturnValue) == 0x000020, "Member 'CraftingLibrary_GetCraftingFormulaIngredientRequirements::ReturnValue' has a wrong offset!");

// Function CraftingRuntime.CraftingLibrary.GetCraftingFormulaNameBeingCrafted
// 0x0018 (0x0018 - 0x0000)
struct CraftingLibrary_GetCraftingFormulaNameBeingCrafted final
{
public:
	class AActor*                                 CraftingObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingMultiKey                      Key;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CraftingLibrary_GetCraftingFormulaNameBeingCrafted) == 0x000008, "Wrong alignment on CraftingLibrary_GetCraftingFormulaNameBeingCrafted");
static_assert(sizeof(CraftingLibrary_GetCraftingFormulaNameBeingCrafted) == 0x000018, "Wrong size on CraftingLibrary_GetCraftingFormulaNameBeingCrafted");
