#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_VideoSchedule

#include "Basic.hpp"

#include "CRD_VideoSchedule_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CRD_VideoSchedule.VideoScheduleDeviceBase
// 0x0108 (0x0CD0 - 0x0BC8)
class AVideoScheduleDeviceBase final : public ABuildingProp
{
public:
	uint8                                         Pad_BC8[0x48];                                     // 0x0BC8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	EVideoScheduleDeviceRepeat                    RepeatSchedule;                                    // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C11[0x7];                                      // 0x0C11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVideoScheduleDeviceEntryAbsolute> AbsoluteSchedule;                                  // 0x0C18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVideoScheduleDeviceEntryDaily> DailySchedule;                                     // 0x0C28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVideoScheduleDeviceEntryHourly> HourlySchedule;                                    // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	bool                                          bFillSchedule;                                     // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C49[0x3];                                      // 0x0C49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FillScheduleGap;                                   // 0x0C4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FillScheduleAlign;                                 // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C54[0x4];                                      // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SimpleSchedule;                                    // 0x0C58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C68[0x68];                                     // 0x0C68(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnControlVideoPlayer(const class FString& VUID, const struct FDateTime& StartTime, const TArray<class AController*>& Players, const class ULevelSequence* Sequence);
	void StartSchedule(class AController* InPlayer);
	void StopSchedule(class AController* InPlayer);
	void TestControlVideoPlayer(const class FString& VUID, const struct FDateTime& StartTime, const TArray<class AController*>& Players);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VideoScheduleDeviceBase">();
	}
	static class AVideoScheduleDeviceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVideoScheduleDeviceBase>();
	}
};
static_assert(alignof(AVideoScheduleDeviceBase) == 0x000008, "Wrong alignment on AVideoScheduleDeviceBase");
static_assert(sizeof(AVideoScheduleDeviceBase) == 0x000CD0, "Wrong size on AVideoScheduleDeviceBase");
static_assert(offsetof(AVideoScheduleDeviceBase, RepeatSchedule) == 0x000C10, "Member 'AVideoScheduleDeviceBase::RepeatSchedule' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, AbsoluteSchedule) == 0x000C18, "Member 'AVideoScheduleDeviceBase::AbsoluteSchedule' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, DailySchedule) == 0x000C28, "Member 'AVideoScheduleDeviceBase::DailySchedule' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, HourlySchedule) == 0x000C38, "Member 'AVideoScheduleDeviceBase::HourlySchedule' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, bFillSchedule) == 0x000C48, "Member 'AVideoScheduleDeviceBase::bFillSchedule' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, FillScheduleGap) == 0x000C4C, "Member 'AVideoScheduleDeviceBase::FillScheduleGap' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, FillScheduleAlign) == 0x000C50, "Member 'AVideoScheduleDeviceBase::FillScheduleAlign' has a wrong offset!");
static_assert(offsetof(AVideoScheduleDeviceBase, SimpleSchedule) == 0x000C58, "Member 'AVideoScheduleDeviceBase::SimpleSchedule' has a wrong offset!");

}

