#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRDPlayerTracker

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class CRDPlayerTracker.CRDPlayerTrackerComponent
// 0x0000 (0x00A0 - 0x00A0)
class UCRDPlayerTrackerComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CRDPlayerTrackerComponent">();
	}
	static class UCRDPlayerTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCRDPlayerTrackerComponent>();
	}
};
static_assert(alignof(UCRDPlayerTrackerComponent) == 0x000008, "Wrong alignment on UCRDPlayerTrackerComponent");
static_assert(sizeof(UCRDPlayerTrackerComponent) == 0x0000A0, "Wrong size on UCRDPlayerTrackerComponent");

// Class CRDPlayerTracker.CRDPlayerTrackerMarker
// 0x0010 (0x02A0 - 0x0290)
class ACRDPlayerTrackerMarker final : public AActor
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        PlayerTrackerUIActorComponent;                     // 0x0298(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UUserWidget* CreatePlayerTrackerWidget(class AFortPlayerControllerGameplay* InFortPlayerControllerGameplay, class AFortPlayerStateAthena* AssociatedPSA);
	bool DestroyPlayerTrackerWidget(class AFortPlayerControllerGameplay* InFortPlayerControllerGameplay);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CRDPlayerTrackerMarker">();
	}
	static class ACRDPlayerTrackerMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACRDPlayerTrackerMarker>();
	}
};
static_assert(alignof(ACRDPlayerTrackerMarker) == 0x000008, "Wrong alignment on ACRDPlayerTrackerMarker");
static_assert(sizeof(ACRDPlayerTrackerMarker) == 0x0002A0, "Wrong size on ACRDPlayerTrackerMarker");
static_assert(offsetof(ACRDPlayerTrackerMarker, WidgetClass) == 0x000290, "Member 'ACRDPlayerTrackerMarker::WidgetClass' has a wrong offset!");
static_assert(offsetof(ACRDPlayerTrackerMarker, PlayerTrackerUIActorComponent) == 0x000298, "Member 'ACRDPlayerTrackerMarker::PlayerTrackerUIActorComponent' has a wrong offset!");

}

