#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeDebugMenuRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CreativeDebugMenuRuntime.FortControllerComponent_CreativeDebugger
// 0x0138 (0x01E0 - 0x00A8)
class UFortControllerComponent_CreativeDebugger final : public UFortControllerComponent
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DebuggerEnabledByDataRegistry;                     // 0x00B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VerseDebugDrawEnabledByDataRegistry;               // 0x00D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NavigationMeshEnabledByDataRegistry;               // 0x0100(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NavigationPathsEnabledByDataRegistry;              // 0x0128(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         GhostModeEnabledByDataRegistry;                    // 0x0150(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InvincibilityEnabledByDataRegistry;                // 0x0178(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FastIterationEnabledByDataRegistry;                // 0x01A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortControllerComponent_AIDebugger> AIDebuggerClass;                                   // 0x01C8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x10];                                     // 0x01D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void OnMutatorUpdated();
	void OnPlayerSpawned(class AFortPlayerController* PC);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CreativeDebugger">();
	}
	static class UFortControllerComponent_CreativeDebugger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CreativeDebugger>();
	}
};
static_assert(alignof(UFortControllerComponent_CreativeDebugger) == 0x000008, "Wrong alignment on UFortControllerComponent_CreativeDebugger");
static_assert(sizeof(UFortControllerComponent_CreativeDebugger) == 0x0001E0, "Wrong size on UFortControllerComponent_CreativeDebugger");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, DebuggerEnabledByDataRegistry) == 0x0000B0, "Member 'UFortControllerComponent_CreativeDebugger::DebuggerEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, VerseDebugDrawEnabledByDataRegistry) == 0x0000D8, "Member 'UFortControllerComponent_CreativeDebugger::VerseDebugDrawEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, NavigationMeshEnabledByDataRegistry) == 0x000100, "Member 'UFortControllerComponent_CreativeDebugger::NavigationMeshEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, NavigationPathsEnabledByDataRegistry) == 0x000128, "Member 'UFortControllerComponent_CreativeDebugger::NavigationPathsEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, GhostModeEnabledByDataRegistry) == 0x000150, "Member 'UFortControllerComponent_CreativeDebugger::GhostModeEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, InvincibilityEnabledByDataRegistry) == 0x000178, "Member 'UFortControllerComponent_CreativeDebugger::InvincibilityEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, FastIterationEnabledByDataRegistry) == 0x0001A0, "Member 'UFortControllerComponent_CreativeDebugger::FastIterationEnabledByDataRegistry' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_CreativeDebugger, AIDebuggerClass) == 0x0001C8, "Member 'UFortControllerComponent_CreativeDebugger::AIDebuggerClass' has a wrong offset!");

}

