#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeDynamicUIClient

#include "Basic.hpp"

#include "CreativeDynamicUIRuntime_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CreativeDynamicUIClient.CreativeDynamicUILibrary.GetHorizontalAlignment
// 0x0002 (0x0002 - 0x0000)
struct CreativeDynamicUILibrary_GetHorizontalAlignment final
{
public:
	ECreativeDynamicUIAlignment                   Alignment;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CreativeDynamicUILibrary_GetHorizontalAlignment) == 0x000001, "Wrong alignment on CreativeDynamicUILibrary_GetHorizontalAlignment");
static_assert(sizeof(CreativeDynamicUILibrary_GetHorizontalAlignment) == 0x000002, "Wrong size on CreativeDynamicUILibrary_GetHorizontalAlignment");
static_assert(offsetof(CreativeDynamicUILibrary_GetHorizontalAlignment, Alignment) == 0x000000, "Member 'CreativeDynamicUILibrary_GetHorizontalAlignment::Alignment' has a wrong offset!");
static_assert(offsetof(CreativeDynamicUILibrary_GetHorizontalAlignment, ReturnValue) == 0x000001, "Member 'CreativeDynamicUILibrary_GetHorizontalAlignment::ReturnValue' has a wrong offset!");

// Function CreativeDynamicUIClient.CreativeDynamicUILibrary.GetVerticalAlignment
// 0x0002 (0x0002 - 0x0000)
struct CreativeDynamicUILibrary_GetVerticalAlignment final
{
public:
	ECreativeDynamicUIAlignment                   Alignment;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CreativeDynamicUILibrary_GetVerticalAlignment) == 0x000001, "Wrong alignment on CreativeDynamicUILibrary_GetVerticalAlignment");
static_assert(sizeof(CreativeDynamicUILibrary_GetVerticalAlignment) == 0x000002, "Wrong size on CreativeDynamicUILibrary_GetVerticalAlignment");
static_assert(offsetof(CreativeDynamicUILibrary_GetVerticalAlignment, Alignment) == 0x000000, "Member 'CreativeDynamicUILibrary_GetVerticalAlignment::Alignment' has a wrong offset!");
static_assert(offsetof(CreativeDynamicUILibrary_GetVerticalAlignment, ReturnValue) == 0x000001, "Member 'CreativeDynamicUILibrary_GetVerticalAlignment::ReturnValue' has a wrong offset!");

}

