#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeLowMemoryFallbackRuntime

#include "Basic.hpp"

#include "CreativeLowMemoryFallbackRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CreativeLowMemoryFallbackRuntime.CreativeLowMemoryFallbackSettings
// 0x0108 (0x0138 - 0x0030)
class UCreativeLowMemoryFallbackSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UObject>                 WarningToastIcon;                                  // 0x0030(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreativeLowMemoryFallbackUserFacingText DefaultText;                                       // 0x0050(0x0048)(Edit, Config, NativeAccessSpecifierPrivate)
	TMap<TSoftObjectPtr<class UFortPlaylist>, struct FCreativeLowMemoryFallbackFreeMemoryThresholds> PlaylistOverrideThresholds;                        // 0x0098(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<TSoftObjectPtr<class UFortPlaylist>, struct FCreativeLowMemoryFallbackUserFacingText> PlaylistOverrideText;                              // 0x00E8(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeLowMemoryFallbackSettings">();
	}
	static class UCreativeLowMemoryFallbackSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeLowMemoryFallbackSettings>();
	}
};
static_assert(alignof(UCreativeLowMemoryFallbackSettings) == 0x000008, "Wrong alignment on UCreativeLowMemoryFallbackSettings");
static_assert(sizeof(UCreativeLowMemoryFallbackSettings) == 0x000138, "Wrong size on UCreativeLowMemoryFallbackSettings");
static_assert(offsetof(UCreativeLowMemoryFallbackSettings, WarningToastIcon) == 0x000030, "Member 'UCreativeLowMemoryFallbackSettings::WarningToastIcon' has a wrong offset!");
static_assert(offsetof(UCreativeLowMemoryFallbackSettings, DefaultText) == 0x000050, "Member 'UCreativeLowMemoryFallbackSettings::DefaultText' has a wrong offset!");
static_assert(offsetof(UCreativeLowMemoryFallbackSettings, PlaylistOverrideThresholds) == 0x000098, "Member 'UCreativeLowMemoryFallbackSettings::PlaylistOverrideThresholds' has a wrong offset!");
static_assert(offsetof(UCreativeLowMemoryFallbackSettings, PlaylistOverrideText) == 0x0000E8, "Member 'UCreativeLowMemoryFallbackSettings::PlaylistOverrideText' has a wrong offset!");

// Class CreativeLowMemoryFallbackRuntime.CreativeLowMemoryFallbackWorldSubsystem
// 0x0038 (0x0068 - 0x0030)
class UCreativeLowMemoryFallbackWorldSubsystem final : public UWorldSubsystem
{
public:
	struct FCreativeLowMemoryFallbackFreeMemoryThresholds CurrentThresholds;                                 // 0x0030(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x2C];                                      // 0x003C(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlaylistDataChanged(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeLowMemoryFallbackWorldSubsystem">();
	}
	static class UCreativeLowMemoryFallbackWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeLowMemoryFallbackWorldSubsystem>();
	}
};
static_assert(alignof(UCreativeLowMemoryFallbackWorldSubsystem) == 0x000008, "Wrong alignment on UCreativeLowMemoryFallbackWorldSubsystem");
static_assert(sizeof(UCreativeLowMemoryFallbackWorldSubsystem) == 0x000068, "Wrong size on UCreativeLowMemoryFallbackWorldSubsystem");
static_assert(offsetof(UCreativeLowMemoryFallbackWorldSubsystem, CurrentThresholds) == 0x000030, "Member 'UCreativeLowMemoryFallbackWorldSubsystem::CurrentThresholds' has a wrong offset!");

}

