#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchase_RewardTile

#include "Basic.hpp"

#include "CrewUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewPurchase_RewardTile.CrewPurchase_RewardTile_C
// 0x0050 (0x1540 - 0x14F0)
class UCrewPurchase_RewardTile_C final : public UCrewRewardTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverScale;                                        // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Calendar;                                    // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Check;                                       // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EdgeSlant;                                   // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Frame;                                       // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pulse;                                       // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_OwnIcon;                                  // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_CrewPurchase_RewardTile(int32 EntryPoint);
	void OnDownloadTileImageComplete(class UTexture2D* Texture);
	void OnStartingDownloadTileImage();
	void OnUpdateOwnedState(bool bOwned);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewPurchase_RewardTile_C">();
	}
	static class UCrewPurchase_RewardTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPurchase_RewardTile_C>();
	}
};
static_assert(alignof(UCrewPurchase_RewardTile_C) == 0x000010, "Wrong alignment on UCrewPurchase_RewardTile_C");
static_assert(sizeof(UCrewPurchase_RewardTile_C) == 0x001540, "Wrong size on UCrewPurchase_RewardTile_C");
static_assert(offsetof(UCrewPurchase_RewardTile_C, UberGraphFrame) == 0x0014F0, "Member 'UCrewPurchase_RewardTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, HoverScale) == 0x0014F8, "Member 'UCrewPurchase_RewardTile_C::HoverScale' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Hover) == 0x001500, "Member 'UCrewPurchase_RewardTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Calendar) == 0x001508, "Member 'UCrewPurchase_RewardTile_C::Image_Calendar' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Check) == 0x001510, "Member 'UCrewPurchase_RewardTile_C::Image_Check' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_EdgeSlant) == 0x001518, "Member 'UCrewPurchase_RewardTile_C::Image_EdgeSlant' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Frame) == 0x001520, "Member 'UCrewPurchase_RewardTile_C::Image_Frame' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Pulse) == 0x001528, "Member 'UCrewPurchase_RewardTile_C::Image_Pulse' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Image_Shadow) == 0x001530, "Member 'UCrewPurchase_RewardTile_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_RewardTile_C, Switcher_OwnIcon) == 0x001538, "Member 'UCrewPurchase_RewardTile_C::Switcher_OwnIcon' has a wrong offset!");

}

