#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewSubscriptionErrorModal

#include "Basic.hpp"

#include "CrewUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C
// 0x0060 (0x0470 - 0x0410)
class UCrewSubscriptionErrorModal_C final : public UCrewSubscriptionErrorModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowUp;                                            // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Badge;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Containment;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ContentSZ;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundBottomBar;                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightbox_HitTestBlocker;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PrimaryScrollBox;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TouchClose;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_PlatformSpecific;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wordmark;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_CrewSubscriptionErrorModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewSubscriptionErrorModal_C">();
	}
	static class UCrewSubscriptionErrorModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewSubscriptionErrorModal_C>();
	}
};
static_assert(alignof(UCrewSubscriptionErrorModal_C) == 0x000008, "Wrong alignment on UCrewSubscriptionErrorModal_C");
static_assert(sizeof(UCrewSubscriptionErrorModal_C) == 0x000470, "Wrong size on UCrewSubscriptionErrorModal_C");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, UberGraphFrame) == 0x000410, "Member 'UCrewSubscriptionErrorModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, ShowUp) == 0x000418, "Member 'UCrewSubscriptionErrorModal_C::ShowUp' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Badge) == 0x000420, "Member 'UCrewSubscriptionErrorModal_C::Badge' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Containment) == 0x000428, "Member 'UCrewSubscriptionErrorModal_C::Containment' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, ContentSZ) == 0x000430, "Member 'UCrewSubscriptionErrorModal_C::ContentSZ' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Glow) == 0x000438, "Member 'UCrewSubscriptionErrorModal_C::Glow' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Image_BackgroundBottomBar) == 0x000440, "Member 'UCrewSubscriptionErrorModal_C::Image_BackgroundBottomBar' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Lightbox_HitTestBlocker) == 0x000448, "Member 'UCrewSubscriptionErrorModal_C::Lightbox_HitTestBlocker' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, PrimaryScrollBox) == 0x000450, "Member 'UCrewSubscriptionErrorModal_C::PrimaryScrollBox' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, SafeZone_TouchClose) == 0x000458, "Member 'UCrewSubscriptionErrorModal_C::SafeZone_TouchClose' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, VBox_PlatformSpecific) == 0x000460, "Member 'UCrewSubscriptionErrorModal_C::VBox_PlatformSpecific' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Wordmark) == 0x000468, "Member 'UCrewSubscriptionErrorModal_C::Wordmark' has a wrong offset!");

}

