#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurrencyListView

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CurrencyListView.CurrencyListView_C.ExecuteUbergraph_CurrencyListView
// 0x0004 (0x0004 - 0x0000)
struct CurrencyListView_C_ExecuteUbergraph_CurrencyListView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CurrencyListView_C_ExecuteUbergraph_CurrencyListView) == 0x000004, "Wrong alignment on CurrencyListView_C_ExecuteUbergraph_CurrencyListView");
static_assert(sizeof(CurrencyListView_C_ExecuteUbergraph_CurrencyListView) == 0x000004, "Wrong size on CurrencyListView_C_ExecuteUbergraph_CurrencyListView");
static_assert(offsetof(CurrencyListView_C_ExecuteUbergraph_CurrencyListView, EntryPoint) == 0x000000, "Member 'CurrencyListView_C_ExecuteUbergraph_CurrencyListView::EntryPoint' has a wrong offset!");

// Function CurrencyListView.CurrencyListView_C.AddDataToList
// 0x0058 (0x0058 - 0x0000)
struct CurrencyListView_C_AddDataToList final
{
public:
	struct FCurrencyData                          CurrencyData;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCurrencyListObject_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CurrencyListView_C_AddDataToList) == 0x000008, "Wrong alignment on CurrencyListView_C_AddDataToList");
static_assert(sizeof(CurrencyListView_C_AddDataToList) == 0x000058, "Wrong size on CurrencyListView_C_AddDataToList");
static_assert(offsetof(CurrencyListView_C_AddDataToList, CurrencyData) == 0x000000, "Member 'CurrencyListView_C_AddDataToList::CurrencyData' has a wrong offset!");
static_assert(offsetof(CurrencyListView_C_AddDataToList, CallFunc_SpawnObject_ReturnValue) == 0x000050, "Member 'CurrencyListView_C_AddDataToList::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

