#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurrencyListViewItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CurrencyListViewItem.CurrencyListViewItem_C
// 0x0028 (0x02E8 - 0x02C0)
class UCurrencyListViewItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   CurrencyMessage;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayMessage;                                    // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetQuantityAndType(int32 inInt, const class FText& To);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_CurrencyListViewItem(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurrencyListViewItem_C">();
	}
	static class UCurrencyListViewItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurrencyListViewItem_C>();
	}
};
static_assert(alignof(UCurrencyListViewItem_C) == 0x000008, "Wrong alignment on UCurrencyListViewItem_C");
static_assert(sizeof(UCurrencyListViewItem_C) == 0x0002E8, "Wrong size on UCurrencyListViewItem_C");
static_assert(offsetof(UCurrencyListViewItem_C, UberGraphFrame) == 0x0002C0, "Member 'UCurrencyListViewItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCurrencyListViewItem_C, CurrencyMessage) == 0x0002C8, "Member 'UCurrencyListViewItem_C::CurrencyMessage' has a wrong offset!");
static_assert(offsetof(UCurrencyListViewItem_C, DisplayMessage) == 0x0002D0, "Member 'UCurrencyListViewItem_C::DisplayMessage' has a wrong offset!");

}

