#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurveExpression

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum CurveExpression.ERemapCurvesExpressionSource
// NumValues: 0x0003
enum class ERemapCurvesExpressionSource : uint8
{
	ExpressionList                           = 0,
	DataAsset                                = 1,
	ExpressionMap                            = 2,
};

// ScriptStruct CurveExpression.CurveExpressionList
// 0x0010 (0x0010 - 0x0000)
struct FCurveExpressionList final
{
public:
	class FString                                 AssignmentExpressions;                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCurveExpressionList) == 0x000008, "Wrong alignment on FCurveExpressionList");
static_assert(sizeof(FCurveExpressionList) == 0x000010, "Wrong size on FCurveExpressionList");
static_assert(offsetof(FCurveExpressionList, AssignmentExpressions) == 0x000000, "Member 'FCurveExpressionList::AssignmentExpressions' has a wrong offset!");

// ScriptStruct CurveExpression.AnimNode_RemapCurvesBase
// 0x0100 (0x0110 - 0x0010)
struct FAnimNode_RemapCurvesBase : public FAnimNode_Base
{
public:
	struct FPoseLink                              SourcePose;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, EditFixedSize, NoDestructor, NativeAccessSpecifierPublic)
	ERemapCurvesExpressionSource                  ExpressionSource;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurveExpressionList                   ExpressionList;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UCurveExpressionsDataAsset*             CurveExpressionsDataAsset;                         // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              CurveExpressions;                                  // 0x0040(0x0050)(BlueprintVisible, EditFixedSize, NativeAccessSpecifierPublic)
	bool                                          bExpressionsImmutable;                             // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CachedConstantNames;                               // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x68];                                      // 0x00A8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_RemapCurvesBase) == 0x000008, "Wrong alignment on FAnimNode_RemapCurvesBase");
static_assert(sizeof(FAnimNode_RemapCurvesBase) == 0x000110, "Wrong size on FAnimNode_RemapCurvesBase");
static_assert(offsetof(FAnimNode_RemapCurvesBase, SourcePose) == 0x000010, "Member 'FAnimNode_RemapCurvesBase::SourcePose' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesBase, ExpressionSource) == 0x000020, "Member 'FAnimNode_RemapCurvesBase::ExpressionSource' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesBase, ExpressionList) == 0x000028, "Member 'FAnimNode_RemapCurvesBase::ExpressionList' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesBase, CurveExpressionsDataAsset) == 0x000038, "Member 'FAnimNode_RemapCurvesBase::CurveExpressionsDataAsset' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesBase, CurveExpressions) == 0x000040, "Member 'FAnimNode_RemapCurvesBase::CurveExpressions' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesBase, bExpressionsImmutable) == 0x000090, "Member 'FAnimNode_RemapCurvesBase::bExpressionsImmutable' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesBase, CachedConstantNames) == 0x000098, "Member 'FAnimNode_RemapCurvesBase::CachedConstantNames' has a wrong offset!");

// ScriptStruct CurveExpression.AnimNode_RemapCurves
// 0x0000 (0x0110 - 0x0110)
struct FAnimNode_RemapCurves final : public FAnimNode_RemapCurvesBase
{
};
static_assert(alignof(FAnimNode_RemapCurves) == 0x000008, "Wrong alignment on FAnimNode_RemapCurves");
static_assert(sizeof(FAnimNode_RemapCurves) == 0x000110, "Wrong size on FAnimNode_RemapCurves");

// ScriptStruct CurveExpression.AnimNode_RemapCurvesFromMesh
// 0x0078 (0x0188 - 0x0110)
struct FAnimNode_RemapCurvesFromMesh final : public FAnimNode_RemapCurvesBase
{
public:
	TWeakObjectPtr<class USkeletalMeshComponent>  SourceMeshComponent;                               // 0x0110(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAttachedParent;                                // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x6F];                                     // 0x0119(0x006F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_RemapCurvesFromMesh) == 0x000008, "Wrong alignment on FAnimNode_RemapCurvesFromMesh");
static_assert(sizeof(FAnimNode_RemapCurvesFromMesh) == 0x000188, "Wrong size on FAnimNode_RemapCurvesFromMesh");
static_assert(offsetof(FAnimNode_RemapCurvesFromMesh, SourceMeshComponent) == 0x000110, "Member 'FAnimNode_RemapCurvesFromMesh::SourceMeshComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_RemapCurvesFromMesh, bUseAttachedParent) == 0x000118, "Member 'FAnimNode_RemapCurvesFromMesh::bUseAttachedParent' has a wrong offset!");

}

