#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObject

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "CustomizableObject_structs.hpp"


namespace SDK
{

// Class CustomizableObject.CustomizableObjectExtension
// 0x0000 (0x0028 - 0x0028)
class UCustomizableObjectExtension final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectExtension">();
	}
	static class UCustomizableObjectExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectExtension>();
	}
};
static_assert(alignof(UCustomizableObjectExtension) == 0x000008, "Wrong alignment on UCustomizableObjectExtension");
static_assert(sizeof(UCustomizableObjectExtension) == 0x000028, "Wrong size on UCustomizableObjectExtension");

// Class CustomizableObject.CustomizableObjectInstanceUserData
// 0x0020 (0x0048 - 0x0028)
class UCustomizableObjectInstanceUserData final : public UAssetUserData
{
public:
	struct FGameplayTagContainer                  AnimBPGameplayTags;                                // 0x0028(0x0020)(NativeAccessSpecifierPrivate)

public:
	void SetAnimationGameplayTags(const struct FGameplayTagContainer& InstanceTags);

	const struct FGameplayTagContainer GetAnimationGameplayTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstanceUserData">();
	}
	static class UCustomizableObjectInstanceUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstanceUserData>();
	}
};
static_assert(alignof(UCustomizableObjectInstanceUserData) == 0x000008, "Wrong alignment on UCustomizableObjectInstanceUserData");
static_assert(sizeof(UCustomizableObjectInstanceUserData) == 0x000048, "Wrong size on UCustomizableObjectInstanceUserData");
static_assert(offsetof(UCustomizableObjectInstanceUserData, AnimBPGameplayTags) == 0x000028, "Member 'UCustomizableObjectInstanceUserData::AnimBPGameplayTags' has a wrong offset!");

// Class CustomizableObject.CustomizableInstancePrivate
// 0x0340 (0x0368 - 0x0028)
class UCustomizableInstancePrivate final : public UObject
{
public:
	TArray<class USkeletalMesh*>                  SkeletalMeshes;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedMaterial>             GeneratedMaterials;                                // 0x0038(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedTexture>              GeneratedTextures;                                 // 0x0048(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, TWeakObjectPtr<class UTexture2D>> TextureReuseCache;                                 // 0x0068(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomizableInstanceComponentData> ComponentsData;                                    // 0x00E0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             ReferencedMaterials;                               // 0x00F0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x60];                                     // 0x0100(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsAsset*>                  ClothingPhysicsAssets;                             // 0x0160(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UAnimInstance>>      GatheredAnimBPs;                                   // 0x0170(0x0010)(Edit, EditFixedSize, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AnimBPGameplayTags;                                // 0x0180(0x0020)(Edit, EditFixedSize, Transient, EditConst, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UAnimInstance>, struct FAnimBpGeneratedPhysicsAssets> AnimBpPhysicsAssets;                               // 0x01A0(0x0050)(Edit, EditFixedSize, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F0[0x10];                                     // 0x01F0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       LoadedPassThroughTexturesPendingSetMaterial;       // 0x0200(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x8];                                      // 0x0210(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizableObjectInstanceDescriptor  CommittedDescriptor;                               // 0x0218(0x0128)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_340[0x28];                                     // 0x0340(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstancePrivate">();
	}
	static class UCustomizableInstancePrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstancePrivate>();
	}
};
static_assert(alignof(UCustomizableInstancePrivate) == 0x000008, "Wrong alignment on UCustomizableInstancePrivate");
static_assert(sizeof(UCustomizableInstancePrivate) == 0x000368, "Wrong size on UCustomizableInstancePrivate");
static_assert(offsetof(UCustomizableInstancePrivate, SkeletalMeshes) == 0x000028, "Member 'UCustomizableInstancePrivate::SkeletalMeshes' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, GeneratedMaterials) == 0x000038, "Member 'UCustomizableInstancePrivate::GeneratedMaterials' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, GeneratedTextures) == 0x000048, "Member 'UCustomizableInstancePrivate::GeneratedTextures' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, TextureReuseCache) == 0x000068, "Member 'UCustomizableInstancePrivate::TextureReuseCache' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, ComponentsData) == 0x0000E0, "Member 'UCustomizableInstancePrivate::ComponentsData' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, ReferencedMaterials) == 0x0000F0, "Member 'UCustomizableInstancePrivate::ReferencedMaterials' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, ClothingPhysicsAssets) == 0x000160, "Member 'UCustomizableInstancePrivate::ClothingPhysicsAssets' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, GatheredAnimBPs) == 0x000170, "Member 'UCustomizableInstancePrivate::GatheredAnimBPs' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, AnimBPGameplayTags) == 0x000180, "Member 'UCustomizableInstancePrivate::AnimBPGameplayTags' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, AnimBpPhysicsAssets) == 0x0001A0, "Member 'UCustomizableInstancePrivate::AnimBpPhysicsAssets' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, LoadedPassThroughTexturesPendingSetMaterial) == 0x000200, "Member 'UCustomizableInstancePrivate::LoadedPassThroughTexturesPendingSetMaterial' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivate, CommittedDescriptor) == 0x000218, "Member 'UCustomizableInstancePrivate::CommittedDescriptor' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectInstanceUsage
// 0x0040 (0x0068 - 0x0028)
class UCustomizableObjectInstanceUsage final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkippedLastRenderTime;                             // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x14];                                      // 0x0034(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableSkeletalComponent*         CustomizableSkeletalComponent;                     // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkeletalMeshComponent>  UsedSkeletalMeshComponent;                         // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObjectInstance*            UsedCustomizableObjectInstance;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         UsedComponentIndex;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateSkeletalMeshAsync(bool bNeverSkipUpdate);
	void UpdateSkeletalMeshAsyncResult(TDelegate<void(struct FUpdateContext& Result)> Callback, bool bIgnoreCloseDist, bool bForceHighPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstanceUsage">();
	}
	static class UCustomizableObjectInstanceUsage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstanceUsage>();
	}
};
static_assert(alignof(UCustomizableObjectInstanceUsage) == 0x000008, "Wrong alignment on UCustomizableObjectInstanceUsage");
static_assert(sizeof(UCustomizableObjectInstanceUsage) == 0x000068, "Wrong size on UCustomizableObjectInstanceUsage");
static_assert(offsetof(UCustomizableObjectInstanceUsage, SkippedLastRenderTime) == 0x000030, "Member 'UCustomizableObjectInstanceUsage::SkippedLastRenderTime' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstanceUsage, CustomizableSkeletalComponent) == 0x000048, "Member 'UCustomizableObjectInstanceUsage::CustomizableSkeletalComponent' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstanceUsage, UsedSkeletalMeshComponent) == 0x000050, "Member 'UCustomizableObjectInstanceUsage::UsedSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstanceUsage, UsedCustomizableObjectInstance) == 0x000058, "Member 'UCustomizableObjectInstanceUsage::UsedCustomizableObjectInstance' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstanceUsage, UsedComponentIndex) == 0x000060, "Member 'UCustomizableObjectInstanceUsage::UsedComponentIndex' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectPrivate
// 0x0358 (0x0380 - 0x0028)
class UCustomizableObjectPrivate final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModelResources                        ModelResources;                                    // 0x0038(0x0160)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0xC8];                                     // 0x0198(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CustomizableObjectPathMap;                         // 0x0260(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<class FString, struct FCustomizableObjectIdPair> GroupNodeMap;                                      // 0x02B0(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x18];                                     // 0x0300(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMutableModelParameterProperties> ParameterProperties;                               // 0x0318(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x58];                                     // 0x0328(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectPrivate">();
	}
	static class UCustomizableObjectPrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectPrivate>();
	}
};
static_assert(alignof(UCustomizableObjectPrivate) == 0x000008, "Wrong alignment on UCustomizableObjectPrivate");
static_assert(sizeof(UCustomizableObjectPrivate) == 0x000380, "Wrong size on UCustomizableObjectPrivate");
static_assert(offsetof(UCustomizableObjectPrivate, ModelResources) == 0x000038, "Member 'UCustomizableObjectPrivate::ModelResources' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPrivate, CustomizableObjectPathMap) == 0x000260, "Member 'UCustomizableObjectPrivate::CustomizableObjectPathMap' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPrivate, GroupNodeMap) == 0x0002B0, "Member 'UCustomizableObjectPrivate::GroupNodeMap' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPrivate, ParameterProperties) == 0x000318, "Member 'UCustomizableObjectPrivate::ParameterProperties' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectResourceDataContainer
// 0x0018 (0x0040 - 0x0028)
class UCustomizableObjectResourceDataContainer final : public UObject
{
public:
	struct FCustomizableObjectResourceData        Data;                                              // 0x0028(0x0018)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectResourceDataContainer">();
	}
	static class UCustomizableObjectResourceDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectResourceDataContainer>();
	}
};
static_assert(alignof(UCustomizableObjectResourceDataContainer) == 0x000008, "Wrong alignment on UCustomizableObjectResourceDataContainer");
static_assert(sizeof(UCustomizableObjectResourceDataContainer) == 0x000040, "Wrong size on UCustomizableObjectResourceDataContainer");
static_assert(offsetof(UCustomizableObjectResourceDataContainer, Data) == 0x000028, "Member 'UCustomizableObjectResourceDataContainer::Data' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectSystemPrivate
// 0x0598 (0x05C0 - 0x0028)
class alignas(0x10) UCustomizableObjectSystemPrivate final : public UObject
{
public:
	uint8                                         Pad_28[0x1D0];                                     // 0x0028(0x01D0)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableObjectInstance*            CurrentInstanceBeingUpdated;                       // 0x01F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x2A0];                                    // 0x0200(0x02A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPendingReleaseSkeletalMeshInfo> PendingReleaseSkeletalMesh;                        // 0x04A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UCustomizableInstanceLODManagementBase* DefaultInstanceLODManagement;                      // 0x04B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableInstanceLODManagementBase* CurrentInstanceLODManagement;                      // 0x04B8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     ProtectedCachedTextures;                           // 0x04C0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D0[0xF0];                                     // 0x04D0(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSystemPrivate">();
	}
	static class UCustomizableObjectSystemPrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSystemPrivate>();
	}
};
static_assert(alignof(UCustomizableObjectSystemPrivate) == 0x000010, "Wrong alignment on UCustomizableObjectSystemPrivate");
static_assert(sizeof(UCustomizableObjectSystemPrivate) == 0x0005C0, "Wrong size on UCustomizableObjectSystemPrivate");
static_assert(offsetof(UCustomizableObjectSystemPrivate, CurrentInstanceBeingUpdated) == 0x0001F8, "Member 'UCustomizableObjectSystemPrivate::CurrentInstanceBeingUpdated' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectSystemPrivate, PendingReleaseSkeletalMesh) == 0x0004A0, "Member 'UCustomizableObjectSystemPrivate::PendingReleaseSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectSystemPrivate, DefaultInstanceLODManagement) == 0x0004B0, "Member 'UCustomizableObjectSystemPrivate::DefaultInstanceLODManagement' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectSystemPrivate, CurrentInstanceLODManagement) == 0x0004B8, "Member 'UCustomizableObjectSystemPrivate::CurrentInstanceLODManagement' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectSystemPrivate, ProtectedCachedTextures) == 0x0004C0, "Member 'UCustomizableObjectSystemPrivate::ProtectedCachedTextures' has a wrong offset!");

// Class CustomizableObject.CustomizableSkeletalComponent
// 0x0030 (0x0250 - 0x0220)
class UCustomizableSkeletalComponent final : public USceneComponent
{
public:
	class UCustomizableObjectInstance*            CustomizableObjectInstance;                        // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentIndex;                                    // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x14];                                     // 0x022C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableObjectInstanceUsage*       CustomizableObjectInstanceUsage;                   // 0x0240(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateSkeletalMeshAsync(bool bNeverSkipUpdate);
	void UpdateSkeletalMeshAsyncResult(TDelegate<void(struct FUpdateContext& Result)> Callback, bool bIgnoreCloseDist, bool bForceHighPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSkeletalComponent">();
	}
	static class UCustomizableSkeletalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableSkeletalComponent>();
	}
};
static_assert(alignof(UCustomizableSkeletalComponent) == 0x000010, "Wrong alignment on UCustomizableSkeletalComponent");
static_assert(sizeof(UCustomizableSkeletalComponent) == 0x000250, "Wrong size on UCustomizableSkeletalComponent");
static_assert(offsetof(UCustomizableSkeletalComponent, CustomizableObjectInstance) == 0x000220, "Member 'UCustomizableSkeletalComponent::CustomizableObjectInstance' has a wrong offset!");
static_assert(offsetof(UCustomizableSkeletalComponent, ComponentIndex) == 0x000228, "Member 'UCustomizableSkeletalComponent::ComponentIndex' has a wrong offset!");
static_assert(offsetof(UCustomizableSkeletalComponent, CustomizableObjectInstanceUsage) == 0x000240, "Member 'UCustomizableSkeletalComponent::CustomizableObjectInstanceUsage' has a wrong offset!");

// Class CustomizableObject.CustomizableSystemImageProvider
// 0x0000 (0x0028 - 0x0028)
class UCustomizableSystemImageProvider : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSystemImageProvider">();
	}
	static class UCustomizableSystemImageProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableSystemImageProvider>();
	}
};
static_assert(alignof(UCustomizableSystemImageProvider) == 0x000008, "Wrong alignment on UCustomizableSystemImageProvider");
static_assert(sizeof(UCustomizableSystemImageProvider) == 0x000028, "Wrong size on UCustomizableSystemImageProvider");

// Class CustomizableObject.EditorImageProvider
// 0x0000 (0x0028 - 0x0028)
class UEditorImageProvider final : public UCustomizableSystemImageProvider
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorImageProvider">();
	}
	static class UEditorImageProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorImageProvider>();
	}
};
static_assert(alignof(UEditorImageProvider) == 0x000008, "Wrong alignment on UEditorImageProvider");
static_assert(sizeof(UEditorImageProvider) == 0x000028, "Wrong size on UEditorImageProvider");

// Class CustomizableObject.CustomizableInstanceLODManagementBase
// 0x0000 (0x0028 - 0x0028)
class UCustomizableInstanceLODManagementBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstanceLODManagementBase">();
	}
	static class UCustomizableInstanceLODManagementBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstanceLODManagementBase>();
	}
};
static_assert(alignof(UCustomizableInstanceLODManagementBase) == 0x000008, "Wrong alignment on UCustomizableInstanceLODManagementBase");
static_assert(sizeof(UCustomizableInstanceLODManagementBase) == 0x000028, "Wrong size on UCustomizableInstanceLODManagementBase");

// Class CustomizableObject.CustomizableInstanceLODManagement
// 0x0058 (0x0080 - 0x0028)
class UCustomizableInstanceLODManagement final : public UCustomizableInstanceLODManagementBase
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstanceLODManagement">();
	}
	static class UCustomizableInstanceLODManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstanceLODManagement>();
	}
};
static_assert(alignof(UCustomizableInstanceLODManagement) == 0x000008, "Wrong alignment on UCustomizableInstanceLODManagement");
static_assert(sizeof(UCustomizableInstanceLODManagement) == 0x000080, "Wrong size on UCustomizableInstanceLODManagement");

// Class CustomizableObject.CustomizableObjectBulk
// 0x0010 (0x0038 - 0x0028)
class UCustomizableObjectBulk final : public UObject
{
public:
	TArray<class FString>                         BulkDataFileNames;                                 // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectBulk">();
	}
	static class UCustomizableObjectBulk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectBulk>();
	}
};
static_assert(alignof(UCustomizableObjectBulk) == 0x000008, "Wrong alignment on UCustomizableObjectBulk");
static_assert(sizeof(UCustomizableObjectBulk) == 0x000038, "Wrong size on UCustomizableObjectBulk");
static_assert(offsetof(UCustomizableObjectBulk, BulkDataFileNames) == 0x000028, "Member 'UCustomizableObjectBulk::BulkDataFileNames' has a wrong offset!");

// Class CustomizableObject.CustomizableObject
// 0x01E8 (0x0210 - 0x0028)
class UCustomizableObject final : public UObject
{
public:
	struct FMutableLODSettings                    LODSettings;                                       // 0x0028(0x0080)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FMorphTargetInfo>               ContributingMorphTargetsInfo;                      // 0x00A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FMorphTargetVertexData>         MorphTargetReconstructionData;                     // 0x00B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectClothConfigData> ClothSharedConfigsData;                            // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectClothingAssetData> ContributingClothingAssetsData;                    // 0x00D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectMeshToMeshVertData> ClothMeshToMeshVertData;                           // 0x00E8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectResourceData> AlwaysLoadedExtensionData;                         // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectStreamedResourceData> StreamedExtensionData;                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectStreamedResourceData> StreamedResourceData;                              // 0x0118(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableUseRefSkeletalMeshAsPlaceholder;            // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreserveUserLODsOnFirstGeneration;                // 0x0129(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableMeshCache;                                  // 0x012A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumMeshComponentsInRoot;                           // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           LowPriorityTextures;                               // 0x0130(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<uint64, struct FMutableStreamableBlock>  HashToStreamableBlock;                             // 0x0140(0x0050)(NativeAccessSpecifierPublic)
	TArray<class FString>                         CustomizableObjectClassTags;                       // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         PopulationClassTags;                               // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FParameterTags>    CustomizableObjectParametersTags;                  // 0x01B0(0x0050)(NativeAccessSpecifierPublic)
	class UCustomizableObjectBulk*                BulkData;                                          // 0x0200(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObjectPrivate*             Private;                                           // 0x0208(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UCustomizableObjectInstance* CreateInstance();

	int32 FindParameter(const class FString& Name_0) const;
	bool GetBoolParameterDefaultValue(const class FString& InParameterName) const;
	struct FLinearColor GetColorParameterDefaultValue(const class FString& InParameterName) const;
	int32 GetComponentCount() const;
	float GetFloatParameterDefaultValue(const class FString& InParameterName) const;
	class FString GetIntParameterAvailableOption(int32 ParamIndex, int32 K) const;
	int32 GetIntParameterDefaultValue(const class FString& InParameterName) const;
	int32 GetIntParameterNumOptions(int32 ParamIndex) const;
	int32 GetParameterCount() const;
	int32 GetParameterDescriptionCount(const class FString& ParamName) const;
	class FString GetParameterName(int32 ParamIndex) const;
	EMutableParameterType GetParameterType(int32 ParamIndex) const;
	EMutableParameterType GetParameterTypeByName(const class FString& Name_0) const;
	struct FParameterUIData GetParameterUIMetadata(const class FString& ParamName) const;
	struct FParameterUIData GetParameterUIMetadataFromIndex(int32 ParamIndex) const;
	void GetProjectorParameterDefaultValue(const class FString& InParameterName, struct FVector3f* OutPos, struct FVector3f* OutDirection, struct FVector3f* OutUp, struct FVector3f* OutScale, float* OutAngle, ECustomizableObjectProjectorType* OutType) const;
	int32 GetStateCount() const;
	class FString GetStateName(int32 StateIndex) const;
	int32 GetStateParameterCount(const class FString& StateName) const;
	class FString GetStateParameterName(const class FString& StateName, int32 ParameterIndex) const;
	struct FParameterUIData GetStateUIMetadata(const class FString& StateName) const;
	struct FParameterUIData GetStateUIMetadataFromIndex(int32 StateIndex) const;
	bool IsCompiled() const;
	bool IsParameterMultidimensional(const class FString& InParameterName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObject">();
	}
	static class UCustomizableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObject>();
	}
};
static_assert(alignof(UCustomizableObject) == 0x000008, "Wrong alignment on UCustomizableObject");
static_assert(sizeof(UCustomizableObject) == 0x000210, "Wrong size on UCustomizableObject");
static_assert(offsetof(UCustomizableObject, LODSettings) == 0x000028, "Member 'UCustomizableObject::LODSettings' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ContributingMorphTargetsInfo) == 0x0000A8, "Member 'UCustomizableObject::ContributingMorphTargetsInfo' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, MorphTargetReconstructionData) == 0x0000B8, "Member 'UCustomizableObject::MorphTargetReconstructionData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ClothSharedConfigsData) == 0x0000C8, "Member 'UCustomizableObject::ClothSharedConfigsData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ContributingClothingAssetsData) == 0x0000D8, "Member 'UCustomizableObject::ContributingClothingAssetsData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ClothMeshToMeshVertData) == 0x0000E8, "Member 'UCustomizableObject::ClothMeshToMeshVertData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, AlwaysLoadedExtensionData) == 0x0000F8, "Member 'UCustomizableObject::AlwaysLoadedExtensionData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, StreamedExtensionData) == 0x000108, "Member 'UCustomizableObject::StreamedExtensionData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, StreamedResourceData) == 0x000118, "Member 'UCustomizableObject::StreamedResourceData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, bEnableUseRefSkeletalMeshAsPlaceholder) == 0x000128, "Member 'UCustomizableObject::bEnableUseRefSkeletalMeshAsPlaceholder' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, bPreserveUserLODsOnFirstGeneration) == 0x000129, "Member 'UCustomizableObject::bPreserveUserLODsOnFirstGeneration' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, bEnableMeshCache) == 0x00012A, "Member 'UCustomizableObject::bEnableMeshCache' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, NumMeshComponentsInRoot) == 0x00012C, "Member 'UCustomizableObject::NumMeshComponentsInRoot' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, LowPriorityTextures) == 0x000130, "Member 'UCustomizableObject::LowPriorityTextures' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, HashToStreamableBlock) == 0x000140, "Member 'UCustomizableObject::HashToStreamableBlock' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, CustomizableObjectClassTags) == 0x000190, "Member 'UCustomizableObject::CustomizableObjectClassTags' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, PopulationClassTags) == 0x0001A0, "Member 'UCustomizableObject::PopulationClassTags' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, CustomizableObjectParametersTags) == 0x0001B0, "Member 'UCustomizableObject::CustomizableObjectParametersTags' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, BulkData) == 0x000200, "Member 'UCustomizableObject::BulkData' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, Private) == 0x000208, "Member 'UCustomizableObject::Private' has a wrong offset!");

// Class CustomizableObject.DGGUI
// 0x0000 (0x02C0 - 0x02C0)
class UDGGUI final : public UUserWidget
{
public:
	class UCustomizableObjectInstanceUsage* GetCustomizableObjectInstanceUsage();
	void SetCustomizableObjectInstanceUsage(class UCustomizableObjectInstanceUsage* CustomizableObjectInstanceUsage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DGGUI">();
	}
	static class UDGGUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDGGUI>();
	}
};
static_assert(alignof(UDGGUI) == 0x000008, "Wrong alignment on UDGGUI");
static_assert(sizeof(UDGGUI) == 0x0002C0, "Wrong size on UDGGUI");

// Class CustomizableObject.CustomizableObjectInstance
// 0x02A8 (0x02D0 - 0x0028)
class UCustomizableObjectInstance final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UCustomizableObjectInstance* Instance)> UpdatedDelegate;                                   // 0x0028(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCustomizableObjectInstance* Instance)> BeginDestroyDelegate;                              // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x80];                                      // 0x0060(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizableObjectInstanceDescriptor  Descriptor;                                        // 0x00E0(0x0128)(NativeAccessSpecifierPrivate)
	class UCustomizableInstancePrivate*           PrivateData;                                       // 0x0208(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObject*                    CustomizableObject;                                // 0x0210(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectBoolParameterValue> BoolParameters;                                    // 0x0218(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectIntParameterValue> IntParameters;                                     // 0x0228(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectFloatParameterValue> FloatParameters;                                   // 0x0238(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectTextureParameterValue> TextureParameters;                                 // 0x0248(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectVectorParameterValue> VectorParameters;                                  // 0x0258(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectProjectorParameterValue> ProjectorParameters;                               // 0x0268(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMultilayerProjector> MultilayerProjectors;                              // 0x0278(0x0050)(Deprecated, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddValueToFloatRange(const class FString& ParamName);
	int32 AddValueToIntRange(const class FString& ParamName);
	int32 AddValueToProjectorRange(const class FString& ParamName);
	class UCustomizableObjectInstance* Clone();
	class UCustomizableObjectInstance* CloneStatic(class UObject* Outer_0);
	bool CreateMultiLayerProjector(const class FName& ProjectorParamName);
	TArray<struct FCustomizableObjectBoolParameterValue> GetBoolParameters();
	TArray<struct FCustomizableObjectFloatParameterValue> GetFloatParameters();
	TArray<struct FCustomizableObjectIntParameterValue> GetIntParameters();
	class UTexture2D* GetParameterDescription(const class FString& ParamName, int32 DescIndex);
	TArray<struct FCustomizableObjectProjectorParameterValue> GetProjectorParameters();
	TArray<struct FCustomizableObjectTextureParameterValue> GetTextureParameters();
	TArray<struct FCustomizableObjectVectorParameterValue> GetVectorParameters();
	void MultilayerProjectorCreateLayer(const class FName& ProjectorParamName, int32 Index_0);
	void MultilayerProjectorCreateVirtualLayer(const class FName& ProjectorParamName, const class FName& ID);
	struct FMultilayerProjectorVirtualLayer MultilayerProjectorFindOrCreateVirtualLayer(const class FName& ProjectorParamName, const class FName& ID);
	void MultilayerProjectorRemoveLayerAt(const class FName& ProjectorParamName, int32 Index_0);
	void MultilayerProjectorRemoveVirtualLayer(const class FName& ProjectorParamName, const class FName& ID);
	void MultilayerProjectorUpdateLayer(const class FName& ProjectorParamName, int32 Index_0, const struct FMultilayerProjectorLayer& Layer);
	void MultilayerProjectorUpdateVirtualLayer(const class FName& ProjectorParamName, const class FName& ID, const struct FMultilayerProjectorVirtualLayer& Layer);
	void RemoveMultilayerProjector(const class FName& ProjectorParamName);
	int32 RemoveValueFromFloatRange(const class FString& ParamName);
	int32 RemoveValueFromIntRange(const class FString& ParamName);
	int32 RemoveValueFromProjectorRange(const class FString& ParamName);
	void SetBoolParameterSelectedOption(const class FString& BoolParamName, bool BoolValue);
	void SetBuildParameterDecorations(bool Value);
	void SetBuildParameterRelevancy(bool Value);
	void SetColorParameterSelectedOption(const class FString& ColorParamName, const struct FLinearColor& ColorValue);
	void SetCurrentState(const class FString& StateName);
	void SetFloatParameterSelectedOption(const class FString& FloatParamName, float FloatValue, int32 RangeIndex);
	void SetIntParameterSelectedOption(const class FString& ParamName, const class FString& SelectedOptionName, int32 RangeIndex);
	void SetObject(class UCustomizableObject* InObject);
	void SetProjectorAngle(const class FString& ProjectorParamName, float Angle, int32 RangeIndex);
	void SetProjectorDirection(const class FString& ProjectorParamName, const struct FVector& Direction, int32 RangeIndex);
	void SetProjectorPosition(const class FString& ProjectorParamName, const struct FVector3f& Pos, int32 RangeIndex);
	void SetProjectorScale(const class FString& ProjectorParamName, const struct FVector& Scale, int32 RangeIndex);
	void SetProjectorUp(const class FString& ProjectorParamName, const struct FVector& Up, int32 RangeIndex);
	void SetProjectorValue(const class FString& ProjectorParamName, const struct FVector& OutPos, const struct FVector& OutDirection, const struct FVector& OutUp, const struct FVector& OutScale, float OutAngle, int32 RangeIndex);
	void SetRandomValues();
	void SetRandomValuesFromStream(const struct FRandomStream& InStream);
	void SetReplacePhysicsAssets(bool bReplaceEnabled);
	void SetTextureParameterSelectedOption(const class FString& TextureParamName, const class FString& TextureValue, int32 RangeIndex);
	void SetVectorParameterSelectedOption(const class FString& VectorParamName, const struct FLinearColor& VectorValue);
	void UpdateSkeletalMeshAsync(bool bIgnoreCloseDist, bool bForceHighPriority);
	void UpdateSkeletalMeshAsyncResult(TDelegate<void(struct FUpdateContext& Result)> Callback, bool bIgnoreCloseDist, bool bForceHighPriority);

	int32 FindBoolParameterNameIndex(const class FString& ParamName) const;
	int32 FindFloatParameterNameIndex(const class FString& ParamName) const;
	int32 FindIntParameterNameIndex(const class FString& ParamName) const;
	int32 FindProjectorParameterNameIndex(const class FString& ParamName) const;
	int32 FindVectorParameterNameIndex(const class FString& ParamName) const;
	void ForEachAnimInstance(int32 ComponentIndex, TDelegate<void(class FName SlotIndex, TSubclassOf<class UAnimInstance> AnimInstClass)> Delegate) const;
	const struct FGameplayTagContainer GetAnimationGameplayTags() const;
	TSubclassOf<class UAnimInstance> GetAnimBP(int32 ComponentIndex, const class FName& Slot) const;
	bool GetBoolParameterSelectedOption(const class FString& BoolParamName) const;
	bool GetBuildParameterDecorations() const;
	bool GetBuildParameterRelevancy() const;
	struct FLinearColor GetColorParameterSelectedOption(const class FString& ColorParamName) const;
	class FString GetCurrentState() const;
	class UCustomizableObject* GetCustomizableObject() const;
	float GetFloatParameterSelectedOption(const class FString& FloatParamName, int32 RangeIndex) const;
	int32 GetFloatValueRange(const class FString& ParamName) const;
	class FString GetIntParameterSelectedOption(const class FString& ParamName, int32 RangeIndex) const;
	int32 GetIntValueRange(const class FString& ParamName) const;
	TSet<class UAssetUserData*> GetMergedAssetUserData(int32 ComponentIndex) const;
	int32 GetNumComponents() const;
	float GetProjectorAngle(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorDirection(const class FString& ParamName, int32 RangeIndex) const;
	ECustomizableObjectProjectorType GetProjectorParameterType(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorPosition(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorScale(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorUp(const class FString& ParamName, int32 RangeIndex) const;
	void GetProjectorValue(const class FString& ProjectorParamName, struct FVector* OutPos, struct FVector* OutDirection, struct FVector* OutUp, struct FVector* OutScale, float* OutAngle, ECustomizableObjectProjectorType* OutType, int32 RangeIndex) const;
	int32 GetProjectorValueRange(const class FString& ParamName) const;
	class USkeletalMesh* GetSkeletalMesh(int32 ComponentIndex) const;
	class FName GetTextureParameterSelectedOption(const class FString& TextureParamName, int32 RangeIndex) const;
	int32 GetTextureValueRange(const class FString& ParamName) const;
	bool HasAnyParameters() const;
	bool HasAnySkeletalMesh() const;
	bool IsParameterRelevant(const class FString& ParamName) const;
	bool IsParamMultidimensional(const class FString& ParamName) const;
	struct FMultilayerProjectorLayer MultilayerProjectorGetLayer(const class FName& ProjectorParamName, int32 Index_0) const;
	struct FMultilayerProjectorVirtualLayer MultilayerProjectorGetVirtualLayer(const class FName& ProjectorParamName, const class FName& ID) const;
	TArray<class FName> MultilayerProjectorGetVirtualLayers(const class FName& ProjectorParamName) const;
	int32 MultilayerProjectorNumLayers(const class FName& ProjectorParamName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstance">();
	}
	static class UCustomizableObjectInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstance>();
	}
};
static_assert(alignof(UCustomizableObjectInstance) == 0x000008, "Wrong alignment on UCustomizableObjectInstance");
static_assert(sizeof(UCustomizableObjectInstance) == 0x0002D0, "Wrong size on UCustomizableObjectInstance");
static_assert(offsetof(UCustomizableObjectInstance, UpdatedDelegate) == 0x000028, "Member 'UCustomizableObjectInstance::UpdatedDelegate' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, BeginDestroyDelegate) == 0x000050, "Member 'UCustomizableObjectInstance::BeginDestroyDelegate' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, Descriptor) == 0x0000E0, "Member 'UCustomizableObjectInstance::Descriptor' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, PrivateData) == 0x000208, "Member 'UCustomizableObjectInstance::PrivateData' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, CustomizableObject) == 0x000210, "Member 'UCustomizableObjectInstance::CustomizableObject' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, BoolParameters) == 0x000218, "Member 'UCustomizableObjectInstance::BoolParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, IntParameters) == 0x000228, "Member 'UCustomizableObjectInstance::IntParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, FloatParameters) == 0x000238, "Member 'UCustomizableObjectInstance::FloatParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, TextureParameters) == 0x000248, "Member 'UCustomizableObjectInstance::TextureParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, VectorParameters) == 0x000258, "Member 'UCustomizableObjectInstance::VectorParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, ProjectorParameters) == 0x000268, "Member 'UCustomizableObjectInstance::ProjectorParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, MultilayerProjectors) == 0x000278, "Member 'UCustomizableObjectInstance::MultilayerProjectors' has a wrong offset!");

// Class CustomizableObject.MutableTextureMipDataProviderFactory
// 0x0028 (0x0050 - 0x0028)
class UMutableTextureMipDataProviderFactory final : public UTextureMipDataProviderFactory
{
public:
	class UCustomizableObjectInstance*            CustomizableObjectInstance;                        // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MutableTextureMipDataProviderFactory">();
	}
	static class UMutableTextureMipDataProviderFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMutableTextureMipDataProviderFactory>();
	}
};
static_assert(alignof(UMutableTextureMipDataProviderFactory) == 0x000008, "Wrong alignment on UMutableTextureMipDataProviderFactory");
static_assert(sizeof(UMutableTextureMipDataProviderFactory) == 0x000050, "Wrong size on UMutableTextureMipDataProviderFactory");
static_assert(offsetof(UMutableTextureMipDataProviderFactory, CustomizableObjectInstance) == 0x000028, "Member 'UMutableTextureMipDataProviderFactory::CustomizableObjectInstance' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectSystem
// 0x0008 (0x0030 - 0x0028)
class UCustomizableObjectSystem final : public UObject
{
public:
	class UCustomizableObjectSystemPrivate*       Private;                                           // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UCustomizableObjectSystem* GetInstance();
	static class UCustomizableObjectSystem* GetInstanceChecked();
	static bool IsUpdateResultValid(const EUpdateResult UpdateResult);

	void SetReleaseMutableTexturesImmediately(bool bReleaseTextures);

	int32 GetAverageBuildTime() const;
	int32 GetNumInstances() const;
	int32 GetNumPendingInstances() const;
	class FString GetPluginVersion() const;
	int64 GetTextureMemoryUsed() const;
	int32 GetTotalInstances() const;
	bool IsUpdating(const class UCustomizableObjectInstance* Instance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSystem">();
	}
	static class UCustomizableObjectSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSystem>();
	}
};
static_assert(alignof(UCustomizableObjectSystem) == 0x000008, "Wrong alignment on UCustomizableObjectSystem");
static_assert(sizeof(UCustomizableObjectSystem) == 0x000030, "Wrong size on UCustomizableObjectSystem");
static_assert(offsetof(UCustomizableObjectSystem, Private) == 0x000028, "Member 'UCustomizableObjectSystem::Private' has a wrong offset!");

// Class CustomizableObject.CustomizableSkeletalMeshActor
// 0x0028 (0x0338 - 0x0310)
class ACustomizableSkeletalMeshActor final : public ASkeletalMeshActor
{
public:
	TArray<class UCustomizableSkeletalComponent*> CustomizableSkeletalComponents;                    // 0x0310(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USkeletalMeshComponent*>         SkeletalMeshComponents;                            // 0x0320(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UCustomizableSkeletalComponent*         CustomizableSkeletalComponent;                     // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSkeletalMeshActor">();
	}
	static class ACustomizableSkeletalMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACustomizableSkeletalMeshActor>();
	}
};
static_assert(alignof(ACustomizableSkeletalMeshActor) == 0x000008, "Wrong alignment on ACustomizableSkeletalMeshActor");
static_assert(sizeof(ACustomizableSkeletalMeshActor) == 0x000338, "Wrong size on ACustomizableSkeletalMeshActor");
static_assert(offsetof(ACustomizableSkeletalMeshActor, CustomizableSkeletalComponents) == 0x000310, "Member 'ACustomizableSkeletalMeshActor::CustomizableSkeletalComponents' has a wrong offset!");
static_assert(offsetof(ACustomizableSkeletalMeshActor, SkeletalMeshComponents) == 0x000320, "Member 'ACustomizableSkeletalMeshActor::SkeletalMeshComponents' has a wrong offset!");
static_assert(offsetof(ACustomizableSkeletalMeshActor, CustomizableSkeletalComponent) == 0x000330, "Member 'ACustomizableSkeletalMeshActor::CustomizableSkeletalComponent' has a wrong offset!");

// Class CustomizableObject.DefaultImageProvider
// 0x0050 (0x0078 - 0x0028)
class UDefaultImageProvider final : public UCustomizableSystemImageProvider
{
public:
	TMap<class FName, class UTexture2D*>          Textures;                                          // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultImageProvider">();
	}
	static class UDefaultImageProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultImageProvider>();
	}
};
static_assert(alignof(UDefaultImageProvider) == 0x000008, "Wrong alignment on UDefaultImageProvider");
static_assert(sizeof(UDefaultImageProvider) == 0x000078, "Wrong size on UDefaultImageProvider");
static_assert(offsetof(UDefaultImageProvider, Textures) == 0x000028, "Member 'UDefaultImageProvider::Textures' has a wrong offset!");

}

