#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataflowCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class DataflowCore.DataflowSettings
// 0x00A8 (0x00D8 - 0x0030)
class UDataflowSettings final : public UDeveloperSettings
{
public:
	struct FLinearColor                           ArrayPinTypeColor;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ManagedArrayCollectionPinTypeColor;                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BoxPinTypeColor;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SpherePinTypeColor;                                // 0x0060(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FNodeColors>         NodeColorsMap;                                     // 0x0070(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x18];                                      // 0x00C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowSettings">();
	}
	static class UDataflowSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSettings>();
	}
};
static_assert(alignof(UDataflowSettings) == 0x000008, "Wrong alignment on UDataflowSettings");
static_assert(sizeof(UDataflowSettings) == 0x0000D8, "Wrong size on UDataflowSettings");
static_assert(offsetof(UDataflowSettings, ArrayPinTypeColor) == 0x000030, "Member 'UDataflowSettings::ArrayPinTypeColor' has a wrong offset!");
static_assert(offsetof(UDataflowSettings, ManagedArrayCollectionPinTypeColor) == 0x000040, "Member 'UDataflowSettings::ManagedArrayCollectionPinTypeColor' has a wrong offset!");
static_assert(offsetof(UDataflowSettings, BoxPinTypeColor) == 0x000050, "Member 'UDataflowSettings::BoxPinTypeColor' has a wrong offset!");
static_assert(offsetof(UDataflowSettings, SpherePinTypeColor) == 0x000060, "Member 'UDataflowSettings::SpherePinTypeColor' has a wrong offset!");
static_assert(offsetof(UDataflowSettings, NodeColorsMap) == 0x000070, "Member 'UDataflowSettings::NodeColorsMap' has a wrong offset!");

}

