#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaySequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DaySequence.EDayNightCycleMode
// NumValues: 0x0005
enum class EDayNightCycleMode : uint8
{
	Default                                  = 0,
	FixedTime                                = 1,
	StartAtSpecifiedTime                     = 2,
	RandomFixedTime                          = 3,
	RandomStartTime                          = 4,
};

// Enum DaySequence.EDaySequenceModifierBlendMode
// NumValues: 0x0002
enum class EDaySequenceModifierBlendMode : uint8
{
	None                                     = 0,
	Distance                                 = 1,
};

// ScriptStruct DaySequence.DaySequenceBindingReference
// 0x0030 (0x0030 - 0x0000)
struct FDaySequenceBindingReference final
{
public:
	TSoftObjectPtr<class UObject>                 ExternalObjectPath;                                // 0x0000(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ObjectPath;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDaySequenceBindingReference) == 0x000008, "Wrong alignment on FDaySequenceBindingReference");
static_assert(sizeof(FDaySequenceBindingReference) == 0x000030, "Wrong size on FDaySequenceBindingReference");
static_assert(offsetof(FDaySequenceBindingReference, ExternalObjectPath) == 0x000000, "Member 'FDaySequenceBindingReference::ExternalObjectPath' has a wrong offset!");
static_assert(offsetof(FDaySequenceBindingReference, ObjectPath) == 0x000020, "Member 'FDaySequenceBindingReference::ObjectPath' has a wrong offset!");

// ScriptStruct DaySequence.DaySequenceConditionSet
// 0x0050 (0x0050 - 0x0000)
struct FDaySequenceConditionSet final
{
public:
	TMap<TSubclassOf<class UDaySequenceConditionTag>, bool> Conditions;                                        // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDaySequenceConditionSet) == 0x000008, "Wrong alignment on FDaySequenceConditionSet");
static_assert(sizeof(FDaySequenceConditionSet) == 0x000050, "Wrong size on FDaySequenceConditionSet");
static_assert(offsetof(FDaySequenceConditionSet, Conditions) == 0x000000, "Member 'FDaySequenceConditionSet::Conditions' has a wrong offset!");

// ScriptStruct DaySequence.DaySequenceAssetData
// 0x0060 (0x0060 - 0x0000)
struct FDaySequenceAssetData final
{
public:
	class UDaySequence*                           Sequence;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bias;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMuted;                                            // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDaySequenceConditionSet               Conditions;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDaySequenceAssetData) == 0x000008, "Wrong alignment on FDaySequenceAssetData");
static_assert(sizeof(FDaySequenceAssetData) == 0x000060, "Wrong size on FDaySequenceAssetData");
static_assert(offsetof(FDaySequenceAssetData, Sequence) == 0x000000, "Member 'FDaySequenceAssetData::Sequence' has a wrong offset!");
static_assert(offsetof(FDaySequenceAssetData, Bias) == 0x000008, "Member 'FDaySequenceAssetData::Bias' has a wrong offset!");
static_assert(offsetof(FDaySequenceAssetData, bMuted) == 0x00000C, "Member 'FDaySequenceAssetData::bMuted' has a wrong offset!");
static_assert(offsetof(FDaySequenceAssetData, Conditions) == 0x000010, "Member 'FDaySequenceAssetData::Conditions' has a wrong offset!");

// ScriptStruct DaySequence.DaySequenceModifierNamedSequence
// 0x0060 (0x0060 - 0x0000)
struct FDaySequenceModifierNamedSequence final
{
public:
	class UDaySequence*                           Sequence;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BiasOffset;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDaySequenceConditionSet               Conditions;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDaySequenceModifierNamedSequence) == 0x000008, "Wrong alignment on FDaySequenceModifierNamedSequence");
static_assert(sizeof(FDaySequenceModifierNamedSequence) == 0x000060, "Wrong size on FDaySequenceModifierNamedSequence");
static_assert(offsetof(FDaySequenceModifierNamedSequence, Sequence) == 0x000000, "Member 'FDaySequenceModifierNamedSequence::Sequence' has a wrong offset!");
static_assert(offsetof(FDaySequenceModifierNamedSequence, BiasOffset) == 0x000008, "Member 'FDaySequenceModifierNamedSequence::BiasOffset' has a wrong offset!");
static_assert(offsetof(FDaySequenceModifierNamedSequence, Conditions) == 0x000010, "Member 'FDaySequenceModifierNamedSequence::Conditions' has a wrong offset!");

// ScriptStruct DaySequence.DaySequenceBindingReferenceArray
// 0x0010 (0x0010 - 0x0000)
struct FDaySequenceBindingReferenceArray final
{
public:
	TArray<struct FDaySequenceBindingReference>   References;                                        // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDaySequenceBindingReferenceArray) == 0x000008, "Wrong alignment on FDaySequenceBindingReferenceArray");
static_assert(sizeof(FDaySequenceBindingReferenceArray) == 0x000010, "Wrong size on FDaySequenceBindingReferenceArray");
static_assert(offsetof(FDaySequenceBindingReferenceArray, References) == 0x000000, "Member 'FDaySequenceBindingReferenceArray::References' has a wrong offset!");

// ScriptStruct DaySequence.DaySequenceBindingReferences
// 0x00A0 (0x00A0 - 0x0000)
struct FDaySequenceBindingReferences final
{
public:
	TMap<struct FGuid, struct FDaySequenceBindingReferenceArray> BindingIdToReferences;                             // 0x0000(0x0050)(NativeAccessSpecifierPrivate)
	TSet<struct FGuid>                            AnimSequenceInstances;                             // 0x0050(0x0050)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDaySequenceBindingReferences) == 0x000008, "Wrong alignment on FDaySequenceBindingReferences");
static_assert(sizeof(FDaySequenceBindingReferences) == 0x0000A0, "Wrong size on FDaySequenceBindingReferences");
static_assert(offsetof(FDaySequenceBindingReferences, BindingIdToReferences) == 0x000000, "Member 'FDaySequenceBindingReferences::BindingIdToReferences' has a wrong offset!");
static_assert(offsetof(FDaySequenceBindingReferences, AnimSequenceInstances) == 0x000050, "Member 'FDaySequenceBindingReferences::AnimSequenceInstances' has a wrong offset!");

// ScriptStruct DaySequence.DaySequenceCollectionEntry
// 0x0060 (0x0060 - 0x0000)
struct FDaySequenceCollectionEntry final
{
public:
	class UDaySequence*                           Sequence;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BiasOffset;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDaySequenceConditionSet               Conditions;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDaySequenceCollectionEntry) == 0x000008, "Wrong alignment on FDaySequenceCollectionEntry");
static_assert(sizeof(FDaySequenceCollectionEntry) == 0x000060, "Wrong size on FDaySequenceCollectionEntry");
static_assert(offsetof(FDaySequenceCollectionEntry, Sequence) == 0x000000, "Member 'FDaySequenceCollectionEntry::Sequence' has a wrong offset!");
static_assert(offsetof(FDaySequenceCollectionEntry, BiasOffset) == 0x000008, "Member 'FDaySequenceCollectionEntry::BiasOffset' has a wrong offset!");
static_assert(offsetof(FDaySequenceCollectionEntry, Conditions) == 0x000010, "Member 'FDaySequenceCollectionEntry::Conditions' has a wrong offset!");

}

