#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarTrackRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DelMarTrackRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DelMarTrackRuntime.DelMarTrackBase.GetAllTrackSegmentActors
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetAllTrackSegmentActors final
{
public:
	TArray<class ADelMarTrackSegmentBase*>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetAllTrackSegmentActors) == 0x000008, "Wrong alignment on DelMarTrackBase_GetAllTrackSegmentActors");
static_assert(sizeof(DelMarTrackBase_GetAllTrackSegmentActors) == 0x000010, "Wrong size on DelMarTrackBase_GetAllTrackSegmentActors");
static_assert(offsetof(DelMarTrackBase_GetAllTrackSegmentActors, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_GetAllTrackSegmentActors::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.OnMetadataChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnMetadataChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_OnMetadataChanged) == 0x000008, "Wrong alignment on DelMarTrackBase_OnMetadataChanged");
static_assert(sizeof(DelMarTrackBase_OnMetadataChanged) == 0x000010, "Wrong size on DelMarTrackBase_OnMetadataChanged");
static_assert(offsetof(DelMarTrackBase_OnMetadataChanged, InSpline) == 0x000000, "Member 'DelMarTrackBase_OnMetadataChanged::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_OnMetadataChanged, SplineIndex) == 0x000008, "Member 'DelMarTrackBase_OnMetadataChanged::SplineIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplineClosedLoopChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplineClosedLoopChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_OnSplineClosedLoopChanged) == 0x000008, "Wrong alignment on DelMarTrackBase_OnSplineClosedLoopChanged");
static_assert(sizeof(DelMarTrackBase_OnSplineClosedLoopChanged) == 0x000010, "Wrong size on DelMarTrackBase_OnSplineClosedLoopChanged");
static_assert(offsetof(DelMarTrackBase_OnSplineClosedLoopChanged, InSpline) == 0x000000, "Member 'DelMarTrackBase_OnSplineClosedLoopChanged::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_OnSplineClosedLoopChanged, SplineIndex) == 0x000008, "Member 'DelMarTrackBase_OnSplineClosedLoopChanged::SplineIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplinePointAdded
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplinePointAdded final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_OnSplinePointAdded) == 0x000008, "Wrong alignment on DelMarTrackBase_OnSplinePointAdded");
static_assert(sizeof(DelMarTrackBase_OnSplinePointAdded) == 0x000010, "Wrong size on DelMarTrackBase_OnSplinePointAdded");
static_assert(offsetof(DelMarTrackBase_OnSplinePointAdded, InSpline) == 0x000000, "Member 'DelMarTrackBase_OnSplinePointAdded::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_OnSplinePointAdded, SplineIndex) == 0x000008, "Member 'DelMarTrackBase_OnSplinePointAdded::SplineIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplinePointChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplinePointChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_OnSplinePointChanged) == 0x000008, "Wrong alignment on DelMarTrackBase_OnSplinePointChanged");
static_assert(sizeof(DelMarTrackBase_OnSplinePointChanged) == 0x000010, "Wrong size on DelMarTrackBase_OnSplinePointChanged");
static_assert(offsetof(DelMarTrackBase_OnSplinePointChanged, InSpline) == 0x000000, "Member 'DelMarTrackBase_OnSplinePointChanged::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_OnSplinePointChanged, SplineIndex) == 0x000008, "Member 'DelMarTrackBase_OnSplinePointChanged::SplineIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.OnSplinePointRemoved
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_OnSplinePointRemoved final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplineIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_OnSplinePointRemoved) == 0x000008, "Wrong alignment on DelMarTrackBase_OnSplinePointRemoved");
static_assert(sizeof(DelMarTrackBase_OnSplinePointRemoved) == 0x000010, "Wrong size on DelMarTrackBase_OnSplinePointRemoved");
static_assert(offsetof(DelMarTrackBase_OnSplinePointRemoved, InSpline) == 0x000000, "Member 'DelMarTrackBase_OnSplinePointRemoved::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_OnSplinePointRemoved, SplineIndex) == 0x000008, "Member 'DelMarTrackBase_OnSplinePointRemoved::SplineIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.PostSplineSegmentGenerated
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_PostSplineSegmentGenerated final
{
public:
	class UDelMarTrackSplineComponent*            SplineComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_PostSplineSegmentGenerated) == 0x000008, "Wrong alignment on DelMarTrackBase_PostSplineSegmentGenerated");
static_assert(sizeof(DelMarTrackBase_PostSplineSegmentGenerated) == 0x000010, "Wrong size on DelMarTrackBase_PostSplineSegmentGenerated");
static_assert(offsetof(DelMarTrackBase_PostSplineSegmentGenerated, SplineComp) == 0x000000, "Member 'DelMarTrackBase_PostSplineSegmentGenerated::SplineComp' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_PostSplineSegmentGenerated, PointIndex) == 0x000008, "Member 'DelMarTrackBase_PostSplineSegmentGenerated::PointIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.PreSplineSegmentGenerated
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_PreSplineSegmentGenerated final
{
public:
	class UDelMarTrackSplineComponent*            SplineComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_PreSplineSegmentGenerated) == 0x000008, "Wrong alignment on DelMarTrackBase_PreSplineSegmentGenerated");
static_assert(sizeof(DelMarTrackBase_PreSplineSegmentGenerated) == 0x000010, "Wrong size on DelMarTrackBase_PreSplineSegmentGenerated");
static_assert(offsetof(DelMarTrackBase_PreSplineSegmentGenerated, SplineComp) == 0x000000, "Member 'DelMarTrackBase_PreSplineSegmentGenerated::SplineComp' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_PreSplineSegmentGenerated, PointIndex) == 0x000008, "Member 'DelMarTrackBase_PreSplineSegmentGenerated::PointIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.SetTrackTypeTagAtIndex
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_SetTrackTypeTagAtIndex final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_SetTrackTypeTagAtIndex) == 0x000004, "Wrong alignment on DelMarTrackBase_SetTrackTypeTagAtIndex");
static_assert(sizeof(DelMarTrackBase_SetTrackTypeTagAtIndex) == 0x000008, "Wrong size on DelMarTrackBase_SetTrackTypeTagAtIndex");
static_assert(offsetof(DelMarTrackBase_SetTrackTypeTagAtIndex, SplineIndex) == 0x000000, "Member 'DelMarTrackBase_SetTrackTypeTagAtIndex::SplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_SetTrackTypeTagAtIndex, tag) == 0x000004, "Member 'DelMarTrackBase_SetTrackTypeTagAtIndex::tag' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.ForceValidOOBTube
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_ForceValidOOBTube final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_ForceValidOOBTube) == 0x000001, "Wrong alignment on DelMarTrackBase_ForceValidOOBTube");
static_assert(sizeof(DelMarTrackBase_ForceValidOOBTube) == 0x000001, "Wrong size on DelMarTrackBase_ForceValidOOBTube");
static_assert(offsetof(DelMarTrackBase_ForceValidOOBTube, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_ForceValidOOBTube::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.ForceValidTrack
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_ForceValidTrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_ForceValidTrack) == 0x000001, "Wrong alignment on DelMarTrackBase_ForceValidTrack");
static_assert(sizeof(DelMarTrackBase_ForceValidTrack) == 0x000001, "Wrong size on DelMarTrackBase_ForceValidTrack");
static_assert(offsetof(DelMarTrackBase_ForceValidTrack, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_ForceValidTrack::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetDistanceRangeFromPointRange
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetDistanceRangeFromPointRange final
{
public:
	struct FDelMarTrackPointIndexRange            InRange;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarTrackPointDistanceRange         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetDistanceRangeFromPointRange) == 0x000004, "Wrong alignment on DelMarTrackBase_GetDistanceRangeFromPointRange");
static_assert(sizeof(DelMarTrackBase_GetDistanceRangeFromPointRange) == 0x000010, "Wrong size on DelMarTrackBase_GetDistanceRangeFromPointRange");
static_assert(offsetof(DelMarTrackBase_GetDistanceRangeFromPointRange, InRange) == 0x000000, "Member 'DelMarTrackBase_GetDistanceRangeFromPointRange::InRange' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetDistanceRangeFromPointRange, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetDistanceRangeFromPointRange::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetEndCapClass
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetEndCapClass final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetEndCapClass) == 0x000008, "Wrong alignment on DelMarTrackBase_GetEndCapClass");
static_assert(sizeof(DelMarTrackBase_GetEndCapClass) == 0x000010, "Wrong size on DelMarTrackBase_GetEndCapClass");
static_assert(offsetof(DelMarTrackBase_GetEndCapClass, SplineIndex) == 0x000000, "Member 'DelMarTrackBase_GetEndCapClass::SplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetEndCapClass, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetEndCapClass::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetForwardDistance
// 0x000C (0x000C - 0x0000)
struct DelMarTrackBase_GetForwardDistance final
{
public:
	float                                         Start;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         End;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetForwardDistance) == 0x000004, "Wrong alignment on DelMarTrackBase_GetForwardDistance");
static_assert(sizeof(DelMarTrackBase_GetForwardDistance) == 0x00000C, "Wrong size on DelMarTrackBase_GetForwardDistance");
static_assert(offsetof(DelMarTrackBase_GetForwardDistance, Start) == 0x000000, "Member 'DelMarTrackBase_GetForwardDistance::Start' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetForwardDistance, End) == 0x000004, "Member 'DelMarTrackBase_GetForwardDistance::End' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetForwardDistance, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetForwardDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetLoopDistance
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetLoopDistance final
{
public:
	float                                         InTotalDistance;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetLoopDistance) == 0x000004, "Wrong alignment on DelMarTrackBase_GetLoopDistance");
static_assert(sizeof(DelMarTrackBase_GetLoopDistance) == 0x000008, "Wrong size on DelMarTrackBase_GetLoopDistance");
static_assert(offsetof(DelMarTrackBase_GetLoopDistance, InTotalDistance) == 0x000000, "Member 'DelMarTrackBase_GetLoopDistance::InTotalDistance' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetLoopDistance, ReturnValue) == 0x000004, "Member 'DelMarTrackBase_GetLoopDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetMetaDataAtSplinePoint
// 0x0088 (0x0088 - 0x0000)
struct DelMarTrackBase_GetMetaDataAtSplinePoint final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarSplinePointMetaData             ReturnValue;                                       // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetMetaDataAtSplinePoint) == 0x000008, "Wrong alignment on DelMarTrackBase_GetMetaDataAtSplinePoint");
static_assert(sizeof(DelMarTrackBase_GetMetaDataAtSplinePoint) == 0x000088, "Wrong size on DelMarTrackBase_GetMetaDataAtSplinePoint");
static_assert(offsetof(DelMarTrackBase_GetMetaDataAtSplinePoint, SplineIndex) == 0x000000, "Member 'DelMarTrackBase_GetMetaDataAtSplinePoint::SplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetMetaDataAtSplinePoint, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetMetaDataAtSplinePoint::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetNextSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetNextSplinePoint final
{
public:
	int32                                         InSplinePoint;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetNextSplinePoint) == 0x000004, "Wrong alignment on DelMarTrackBase_GetNextSplinePoint");
static_assert(sizeof(DelMarTrackBase_GetNextSplinePoint) == 0x000008, "Wrong size on DelMarTrackBase_GetNextSplinePoint");
static_assert(offsetof(DelMarTrackBase_GetNextSplinePoint, InSplinePoint) == 0x000000, "Member 'DelMarTrackBase_GetNextSplinePoint::InSplinePoint' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetNextSplinePoint, ReturnValue) == 0x000004, "Member 'DelMarTrackBase_GetNextSplinePoint::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetNextSplineSegment
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetNextSplineSegment final
{
public:
	int32                                         InSplineSegmentIndex;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetNextSplineSegment) == 0x000004, "Wrong alignment on DelMarTrackBase_GetNextSplineSegment");
static_assert(sizeof(DelMarTrackBase_GetNextSplineSegment) == 0x000008, "Wrong size on DelMarTrackBase_GetNextSplineSegment");
static_assert(offsetof(DelMarTrackBase_GetNextSplineSegment, InSplineSegmentIndex) == 0x000000, "Member 'DelMarTrackBase_GetNextSplineSegment::InSplineSegmentIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetNextSplineSegment, ReturnValue) == 0x000004, "Member 'DelMarTrackBase_GetNextSplineSegment::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetPreviousSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetPreviousSplinePoint final
{
public:
	int32                                         InSplinePoint;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetPreviousSplinePoint) == 0x000004, "Wrong alignment on DelMarTrackBase_GetPreviousSplinePoint");
static_assert(sizeof(DelMarTrackBase_GetPreviousSplinePoint) == 0x000008, "Wrong size on DelMarTrackBase_GetPreviousSplinePoint");
static_assert(offsetof(DelMarTrackBase_GetPreviousSplinePoint, InSplinePoint) == 0x000000, "Member 'DelMarTrackBase_GetPreviousSplinePoint::InSplinePoint' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetPreviousSplinePoint, ReturnValue) == 0x000004, "Member 'DelMarTrackBase_GetPreviousSplinePoint::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetPreviousSplineSegment
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetPreviousSplineSegment final
{
public:
	int32                                         InSplineSegmentIndex;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetPreviousSplineSegment) == 0x000004, "Wrong alignment on DelMarTrackBase_GetPreviousSplineSegment");
static_assert(sizeof(DelMarTrackBase_GetPreviousSplineSegment) == 0x000008, "Wrong size on DelMarTrackBase_GetPreviousSplineSegment");
static_assert(offsetof(DelMarTrackBase_GetPreviousSplineSegment, InSplineSegmentIndex) == 0x000000, "Member 'DelMarTrackBase_GetPreviousSplineSegment::InSplineSegmentIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetPreviousSplineSegment, ReturnValue) == 0x000004, "Member 'DelMarTrackBase_GetPreviousSplineSegment::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetSegmentClassAtSplinePoint
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetSegmentClassAtSplinePoint final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetSegmentClassAtSplinePoint) == 0x000008, "Wrong alignment on DelMarTrackBase_GetSegmentClassAtSplinePoint");
static_assert(sizeof(DelMarTrackBase_GetSegmentClassAtSplinePoint) == 0x000010, "Wrong size on DelMarTrackBase_GetSegmentClassAtSplinePoint");
static_assert(offsetof(DelMarTrackBase_GetSegmentClassAtSplinePoint, SplineIndex) == 0x000000, "Member 'DelMarTrackBase_GetSegmentClassAtSplinePoint::SplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetSegmentClassAtSplinePoint, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetSegmentClassAtSplinePoint::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetSegmentTrackTypeTag
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackBase_GetSegmentTrackTypeTag final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetSegmentTrackTypeTag) == 0x000004, "Wrong alignment on DelMarTrackBase_GetSegmentTrackTypeTag");
static_assert(sizeof(DelMarTrackBase_GetSegmentTrackTypeTag) == 0x000008, "Wrong size on DelMarTrackBase_GetSegmentTrackTypeTag");
static_assert(offsetof(DelMarTrackBase_GetSegmentTrackTypeTag, SplineIndex) == 0x000000, "Member 'DelMarTrackBase_GetSegmentTrackTypeTag::SplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetSegmentTrackTypeTag, ReturnValue) == 0x000004, "Member 'DelMarTrackBase_GetSegmentTrackTypeTag::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetStartCapClass
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetStartCapClass final
{
public:
	int32                                         SplineIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetStartCapClass) == 0x000008, "Wrong alignment on DelMarTrackBase_GetStartCapClass");
static_assert(sizeof(DelMarTrackBase_GetStartCapClass) == 0x000010, "Wrong size on DelMarTrackBase_GetStartCapClass");
static_assert(offsetof(DelMarTrackBase_GetStartCapClass, SplineIndex) == 0x000000, "Member 'DelMarTrackBase_GetStartCapClass::SplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetStartCapClass, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetStartCapClass::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.GetTransitionSegmentClass
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_GetTransitionSegmentClass final
{
public:
	int32                                         FromSplineIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ToSplineIndex;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_GetTransitionSegmentClass) == 0x000008, "Wrong alignment on DelMarTrackBase_GetTransitionSegmentClass");
static_assert(sizeof(DelMarTrackBase_GetTransitionSegmentClass) == 0x000010, "Wrong size on DelMarTrackBase_GetTransitionSegmentClass");
static_assert(offsetof(DelMarTrackBase_GetTransitionSegmentClass, FromSplineIndex) == 0x000000, "Member 'DelMarTrackBase_GetTransitionSegmentClass::FromSplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetTransitionSegmentClass, ToSplineIndex) == 0x000004, "Member 'DelMarTrackBase_GetTransitionSegmentClass::ToSplineIndex' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_GetTransitionSegmentClass, ReturnValue) == 0x000008, "Member 'DelMarTrackBase_GetTransitionSegmentClass::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.IsCosmetic
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsCosmetic final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_IsCosmetic) == 0x000001, "Wrong alignment on DelMarTrackBase_IsCosmetic");
static_assert(sizeof(DelMarTrackBase_IsCosmetic) == 0x000001, "Wrong size on DelMarTrackBase_IsCosmetic");
static_assert(offsetof(DelMarTrackBase_IsCosmetic, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_IsCosmetic::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.IsDistanceWithinRange
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackBase_IsDistanceWithinRange final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_IsDistanceWithinRange) == 0x000004, "Wrong alignment on DelMarTrackBase_IsDistanceWithinRange");
static_assert(sizeof(DelMarTrackBase_IsDistanceWithinRange) == 0x000010, "Wrong size on DelMarTrackBase_IsDistanceWithinRange");
static_assert(offsetof(DelMarTrackBase_IsDistanceWithinRange, InDistance) == 0x000000, "Member 'DelMarTrackBase_IsDistanceWithinRange::InDistance' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_IsDistanceWithinRange, StartDistance) == 0x000004, "Member 'DelMarTrackBase_IsDistanceWithinRange::StartDistance' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_IsDistanceWithinRange, EndDistance) == 0x000008, "Member 'DelMarTrackBase_IsDistanceWithinRange::EndDistance' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_IsDistanceWithinRange, ReturnValue) == 0x00000C, "Member 'DelMarTrackBase_IsDistanceWithinRange::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.IsPointInOOBTube
// 0x0020 (0x0020 - 0x0000)
struct DelMarTrackBase_IsPointInOOBTube final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackBase_IsPointInOOBTube) == 0x000008, "Wrong alignment on DelMarTrackBase_IsPointInOOBTube");
static_assert(sizeof(DelMarTrackBase_IsPointInOOBTube) == 0x000020, "Wrong size on DelMarTrackBase_IsPointInOOBTube");
static_assert(offsetof(DelMarTrackBase_IsPointInOOBTube, Point) == 0x000000, "Member 'DelMarTrackBase_IsPointInOOBTube::Point' has a wrong offset!");
static_assert(offsetof(DelMarTrackBase_IsPointInOOBTube, ReturnValue) == 0x000018, "Member 'DelMarTrackBase_IsPointInOOBTube::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.IsPrimary
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsPrimary final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_IsPrimary) == 0x000001, "Wrong alignment on DelMarTrackBase_IsPrimary");
static_assert(sizeof(DelMarTrackBase_IsPrimary) == 0x000001, "Wrong size on DelMarTrackBase_IsPrimary");
static_assert(offsetof(DelMarTrackBase_IsPrimary, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_IsPrimary::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.IsSecondary
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsSecondary final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_IsSecondary) == 0x000001, "Wrong alignment on DelMarTrackBase_IsSecondary");
static_assert(sizeof(DelMarTrackBase_IsSecondary) == 0x000001, "Wrong size on DelMarTrackBase_IsSecondary");
static_assert(offsetof(DelMarTrackBase_IsSecondary, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_IsSecondary::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBase.IsTrackable
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBase_IsTrackable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBase_IsTrackable) == 0x000001, "Wrong alignment on DelMarTrackBase_IsTrackable");
static_assert(sizeof(DelMarTrackBase_IsTrackable) == 0x000001, "Wrong size on DelMarTrackBase_IsTrackable");
static_assert(offsetof(DelMarTrackBase_IsTrackable, ReturnValue) == 0x000000, "Member 'DelMarTrackBase_IsTrackable::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.MergeTrack
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrack_MergeTrack final
{
public:
	class ADelMarTrack*                           OtherTrack;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MergeToEndPoint;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CopyFromStartPoint;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrack_MergeTrack) == 0x000008, "Wrong alignment on DelMarTrack_MergeTrack");
static_assert(sizeof(DelMarTrack_MergeTrack) == 0x000010, "Wrong size on DelMarTrack_MergeTrack");
static_assert(offsetof(DelMarTrack_MergeTrack, OtherTrack) == 0x000000, "Member 'DelMarTrack_MergeTrack::OtherTrack' has a wrong offset!");
static_assert(offsetof(DelMarTrack_MergeTrack, MergeToEndPoint) == 0x000008, "Member 'DelMarTrack_MergeTrack::MergeToEndPoint' has a wrong offset!");
static_assert(offsetof(DelMarTrack_MergeTrack, CopyFromStartPoint) == 0x000009, "Member 'DelMarTrack_MergeTrack::CopyFromStartPoint' has a wrong offset!");
static_assert(offsetof(DelMarTrack_MergeTrack, ReturnValue) == 0x00000A, "Member 'DelMarTrack_MergeTrack::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.SplitTrackAtPoint
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_SplitTrackAtPoint final
{
public:
	int32                                         SplitAtPoint;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrack_SplitTrackAtPoint) == 0x000004, "Wrong alignment on DelMarTrack_SplitTrackAtPoint");
static_assert(sizeof(DelMarTrack_SplitTrackAtPoint) == 0x000008, "Wrong size on DelMarTrack_SplitTrackAtPoint");
static_assert(offsetof(DelMarTrack_SplitTrackAtPoint, SplitAtPoint) == 0x000000, "Member 'DelMarTrack_SplitTrackAtPoint::SplitAtPoint' has a wrong offset!");
static_assert(offsetof(DelMarTrack_SplitTrackAtPoint, ReturnValue) == 0x000004, "Member 'DelMarTrack_SplitTrackAtPoint::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetParentEndDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetParentEndDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetParentEndDistance) == 0x000004, "Wrong alignment on DelMarTrack_GetParentEndDistance");
static_assert(sizeof(DelMarTrack_GetParentEndDistance) == 0x000004, "Wrong size on DelMarTrack_GetParentEndDistance");
static_assert(offsetof(DelMarTrack_GetParentEndDistance, ReturnValue) == 0x000000, "Member 'DelMarTrack_GetParentEndDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetParentStartDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetParentStartDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetParentStartDistance) == 0x000004, "Wrong alignment on DelMarTrack_GetParentStartDistance");
static_assert(sizeof(DelMarTrack_GetParentStartDistance) == 0x000004, "Wrong size on DelMarTrack_GetParentStartDistance");
static_assert(offsetof(DelMarTrack_GetParentStartDistance, ReturnValue) == 0x000000, "Member 'DelMarTrack_GetParentStartDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetPrimaryDistance
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_GetPrimaryDistance final
{
public:
	float                                         DistanceOnThisTrack;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetPrimaryDistance) == 0x000004, "Wrong alignment on DelMarTrack_GetPrimaryDistance");
static_assert(sizeof(DelMarTrack_GetPrimaryDistance) == 0x000008, "Wrong size on DelMarTrack_GetPrimaryDistance");
static_assert(offsetof(DelMarTrack_GetPrimaryDistance, DistanceOnThisTrack) == 0x000000, "Member 'DelMarTrack_GetPrimaryDistance::DistanceOnThisTrack' has a wrong offset!");
static_assert(offsetof(DelMarTrack_GetPrimaryDistance, ReturnValue) == 0x000004, "Member 'DelMarTrack_GetPrimaryDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetPrimaryEndDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetPrimaryEndDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetPrimaryEndDistance) == 0x000004, "Wrong alignment on DelMarTrack_GetPrimaryEndDistance");
static_assert(sizeof(DelMarTrack_GetPrimaryEndDistance) == 0x000004, "Wrong size on DelMarTrack_GetPrimaryEndDistance");
static_assert(offsetof(DelMarTrack_GetPrimaryEndDistance, ReturnValue) == 0x000000, "Member 'DelMarTrack_GetPrimaryEndDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetPrimaryStartDistance
// 0x0004 (0x0004 - 0x0000)
struct DelMarTrack_GetPrimaryStartDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetPrimaryStartDistance) == 0x000004, "Wrong alignment on DelMarTrack_GetPrimaryStartDistance");
static_assert(sizeof(DelMarTrack_GetPrimaryStartDistance) == 0x000004, "Wrong size on DelMarTrack_GetPrimaryStartDistance");
static_assert(offsetof(DelMarTrack_GetPrimaryStartDistance, ReturnValue) == 0x000000, "Member 'DelMarTrack_GetPrimaryStartDistance::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetSecondaryEndTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_GetSecondaryEndTrack final
{
public:
	class ADelMarTrack*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetSecondaryEndTrack) == 0x000008, "Wrong alignment on DelMarTrack_GetSecondaryEndTrack");
static_assert(sizeof(DelMarTrack_GetSecondaryEndTrack) == 0x000008, "Wrong size on DelMarTrack_GetSecondaryEndTrack");
static_assert(offsetof(DelMarTrack_GetSecondaryEndTrack, ReturnValue) == 0x000000, "Member 'DelMarTrack_GetSecondaryEndTrack::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrack.GetSecondaryStartTrack
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrack_GetSecondaryStartTrack final
{
public:
	class ADelMarTrack*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrack_GetSecondaryStartTrack) == 0x000008, "Wrong alignment on DelMarTrack_GetSecondaryStartTrack");
static_assert(sizeof(DelMarTrack_GetSecondaryStartTrack) == 0x000008, "Wrong size on DelMarTrack_GetSecondaryStartTrack");
static_assert(offsetof(DelMarTrack_GetSecondaryStartTrack, ReturnValue) == 0x000000, "Member 'DelMarTrack_GetSecondaryStartTrack::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBlueprintFunctionLibrary.IsTrackRadiusCheckDisabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled) == 0x000001, "Wrong alignment on DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled");
static_assert(sizeof(DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled) == 0x000001, "Wrong size on DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled");
static_assert(offsetof(DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled, ReturnValue) == 0x000000, "Member 'DelMarTrackBlueprintFunctionLibrary_IsTrackRadiusCheckDisabled::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackBlueprintFunctionLibrary.TrackPositionDebugDrawEnabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled) == 0x000001, "Wrong alignment on DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled");
static_assert(sizeof(DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled) == 0x000001, "Wrong size on DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled");
static_assert(offsetof(DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled, ReturnValue) == 0x000000, "Member 'DelMarTrackBlueprintFunctionLibrary_TrackPositionDebugDrawEnabled::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackSegmentBase.ContainsDistanceAlongSpline
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackSegmentBase_ContainsDistanceAlongSpline final
{
public:
	float                                         DistanceAlongSpline;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackSegmentBase_ContainsDistanceAlongSpline) == 0x000004, "Wrong alignment on DelMarTrackSegmentBase_ContainsDistanceAlongSpline");
static_assert(sizeof(DelMarTrackSegmentBase_ContainsDistanceAlongSpline) == 0x000008, "Wrong size on DelMarTrackSegmentBase_ContainsDistanceAlongSpline");
static_assert(offsetof(DelMarTrackSegmentBase_ContainsDistanceAlongSpline, DistanceAlongSpline) == 0x000000, "Member 'DelMarTrackSegmentBase_ContainsDistanceAlongSpline::DistanceAlongSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackSegmentBase_ContainsDistanceAlongSpline, ReturnValue) == 0x000004, "Member 'DelMarTrackSegmentBase_ContainsDistanceAlongSpline::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackSegmentBase.GetSplineDistanceRange
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackSegmentBase_GetSplineDistanceRange final
{
public:
	struct FDelMarTrackPointDistanceRange         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackSegmentBase_GetSplineDistanceRange) == 0x000004, "Wrong alignment on DelMarTrackSegmentBase_GetSplineDistanceRange");
static_assert(sizeof(DelMarTrackSegmentBase_GetSplineDistanceRange) == 0x000008, "Wrong size on DelMarTrackSegmentBase_GetSplineDistanceRange");
static_assert(offsetof(DelMarTrackSegmentBase_GetSplineDistanceRange, ReturnValue) == 0x000000, "Member 'DelMarTrackSegmentBase_GetSplineDistanceRange::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackSegmentBase.GetSplineMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarTrackSegmentBase_GetSplineMeshComponent final
{
public:
	class USplineMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTrackSegmentBase_GetSplineMeshComponent) == 0x000008, "Wrong alignment on DelMarTrackSegmentBase_GetSplineMeshComponent");
static_assert(sizeof(DelMarTrackSegmentBase_GetSplineMeshComponent) == 0x000008, "Wrong size on DelMarTrackSegmentBase_GetSplineMeshComponent");
static_assert(offsetof(DelMarTrackSegmentBase_GetSplineMeshComponent, ReturnValue) == 0x000000, "Member 'DelMarTrackSegmentBase_GetSplineMeshComponent::ReturnValue' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnAttachedTrackPointAdded
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnAttachedTrackPointAdded final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackOobTube_OnAttachedTrackPointAdded) == 0x000008, "Wrong alignment on DelMarTrackOobTube_OnAttachedTrackPointAdded");
static_assert(sizeof(DelMarTrackOobTube_OnAttachedTrackPointAdded) == 0x000010, "Wrong size on DelMarTrackOobTube_OnAttachedTrackPointAdded");
static_assert(offsetof(DelMarTrackOobTube_OnAttachedTrackPointAdded, InSpline) == 0x000000, "Member 'DelMarTrackOobTube_OnAttachedTrackPointAdded::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackOobTube_OnAttachedTrackPointAdded, PointIndex) == 0x000008, "Member 'DelMarTrackOobTube_OnAttachedTrackPointAdded::PointIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnAttachedTrackPointChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnAttachedTrackPointChanged final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackOobTube_OnAttachedTrackPointChanged) == 0x000008, "Wrong alignment on DelMarTrackOobTube_OnAttachedTrackPointChanged");
static_assert(sizeof(DelMarTrackOobTube_OnAttachedTrackPointChanged) == 0x000010, "Wrong size on DelMarTrackOobTube_OnAttachedTrackPointChanged");
static_assert(offsetof(DelMarTrackOobTube_OnAttachedTrackPointChanged, InSpline) == 0x000000, "Member 'DelMarTrackOobTube_OnAttachedTrackPointChanged::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackOobTube_OnAttachedTrackPointChanged, PointIndex) == 0x000008, "Member 'DelMarTrackOobTube_OnAttachedTrackPointChanged::PointIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnAttachedTrackPointRemoved
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnAttachedTrackPointRemoved final
{
public:
	class UDelMarTrackSplineComponent*            InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackOobTube_OnAttachedTrackPointRemoved) == 0x000008, "Wrong alignment on DelMarTrackOobTube_OnAttachedTrackPointRemoved");
static_assert(sizeof(DelMarTrackOobTube_OnAttachedTrackPointRemoved) == 0x000010, "Wrong size on DelMarTrackOobTube_OnAttachedTrackPointRemoved");
static_assert(offsetof(DelMarTrackOobTube_OnAttachedTrackPointRemoved, InSpline) == 0x000000, "Member 'DelMarTrackOobTube_OnAttachedTrackPointRemoved::InSpline' has a wrong offset!");
static_assert(offsetof(DelMarTrackOobTube_OnAttachedTrackPointRemoved, PointIndex) == 0x000008, "Member 'DelMarTrackOobTube_OnAttachedTrackPointRemoved::PointIndex' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackOobTube.OnConstructTubeMesh
// 0x0010 (0x0010 - 0x0000)
struct DelMarTrackOobTube_OnConstructTubeMesh final
{
public:
	class USplineMeshComponent*                   TubeMeshComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTransitionMesh;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTransitionIn;                                   // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackOobTube_OnConstructTubeMesh) == 0x000008, "Wrong alignment on DelMarTrackOobTube_OnConstructTubeMesh");
static_assert(sizeof(DelMarTrackOobTube_OnConstructTubeMesh) == 0x000010, "Wrong size on DelMarTrackOobTube_OnConstructTubeMesh");
static_assert(offsetof(DelMarTrackOobTube_OnConstructTubeMesh, TubeMeshComponent) == 0x000000, "Member 'DelMarTrackOobTube_OnConstructTubeMesh::TubeMeshComponent' has a wrong offset!");
static_assert(offsetof(DelMarTrackOobTube_OnConstructTubeMesh, bIsTransitionMesh) == 0x000008, "Member 'DelMarTrackOobTube_OnConstructTubeMesh::bIsTransitionMesh' has a wrong offset!");
static_assert(offsetof(DelMarTrackOobTube_OnConstructTubeMesh, bIsTransitionIn) == 0x000009, "Member 'DelMarTrackOobTube_OnConstructTubeMesh::bIsTransitionIn' has a wrong offset!");

// Function DelMarTrackRuntime.DelMarTrackOobTube.DetermineTubeMeshTransitionType
// 0x000C (0x000C - 0x0000)
struct DelMarTrackOobTube_DetermineTubeMeshTransitionType final
{
public:
	int32                                         CurrentPointIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextPointIndex;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarTrackOobTubeTransitionType             ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarTrackOobTube_DetermineTubeMeshTransitionType) == 0x000004, "Wrong alignment on DelMarTrackOobTube_DetermineTubeMeshTransitionType");
static_assert(sizeof(DelMarTrackOobTube_DetermineTubeMeshTransitionType) == 0x00000C, "Wrong size on DelMarTrackOobTube_DetermineTubeMeshTransitionType");
static_assert(offsetof(DelMarTrackOobTube_DetermineTubeMeshTransitionType, CurrentPointIndex) == 0x000000, "Member 'DelMarTrackOobTube_DetermineTubeMeshTransitionType::CurrentPointIndex' has a wrong offset!");
