#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum DelMarCore.EDelmarDraftingState
// NumValues: 0x0005
enum class EDelmarDraftingState : uint8
{
	NotActive                                = 0,
	HasTarget                                = 1,
	GainingSpeed                             = 2,
	GracePeriod                              = 3,
	LosingSpeed                              = 4,
};

// Enum DelMarCore.EDelMarVehicleDriftState
// NumValues: 0x0007
enum class EDelMarVehicleDriftState : uint8
{
	NotDrifting                              = 0,
	Drifting                                 = 1,
	InitialKick                              = 2,
	SwapKick                                 = 3,
	ExitVelocity                             = 4,
	ExitForward                              = 5,
	ForcedDrift                              = 6,
};

// Enum DelMarCore.EDelMarTurboZoneState
// NumValues: 0x0006
enum class EDelMarTurboZoneState : uint8
{
	None                                     = 0,
	Visible                                  = 1,
	Failed                                   = 2,
	Active                                   = 3,
	Success                                  = 4,
	Missed                                   = 5,
};

// Enum DelMarCore.EDelMarVehicleForwardState
// NumValues: 0x0004
enum class EDelMarVehicleForwardState : uint8
{
	None                                     = 0,
	ForwardAccel                             = 1,
	Braking                                  = 2,
	Reversing                                = 3,
};

// Enum DelMarCore.EDelMarSplineMovementType
// NumValues: 0x0003
enum class EDelMarSplineMovementType : uint8
{
	OneShot                                  = 0,
	Repeat                                   = 1,
	PingPong                                 = 2,
};

// Enum DelMarCore.EDelMarFloatOperation
// NumValues: 0x0008
enum class EDelMarFloatOperation : uint8
{
	DMFO_Set                                 = 0,
	DMFO_Add                                 = 1,
	DMFO_Subtract                            = 2,
	DMFO_Multiply                            = 3,
	DMFO_BaseMultiply                        = 4,
	DMFO_Divide                              = 5,
	DMFO_Min                                 = 6,
	DMFO_Max                                 = 7,
};

// Enum DelMarCore.EDelMarModifierStackingPolicy
// NumValues: 0x0003
enum class EDelMarModifierStackingPolicy : uint8
{
	DMSP_Allow                               = 0,
	DMSP_DontAdd                             = 1,
	DMSP_ClearOthers                         = 2,
};

// Enum DelMarCore.EDelMarGlobalLeaderboardType
// NumValues: 0x0003
enum class EDelMarGlobalLeaderboardType : uint8
{
	Top                                      = 0,
	Focused                                  = 1,
	Friend                                   = 2,
};

// Enum DelMarCore.EDelMarNetModel
// NumValues: 0x0002
enum class EDelMarNetModel : uint8
{
	ClientAuthoritative                      = 0,
	ChaosRollback                            = 1,
};

// Enum DelMarCore.EDelMarJellyHazardProcessorInfo
// NumValues: 0x0003
enum class EDelMarJellyHazardProcessorInfo : uint32
{
	None                                     = 0,
	WithoutJellyHazardHit                    = 1,
	WithJellyHazardHit                       = 2,
};

// Enum DelMarCore.EDelMarDemolishedProcessorInfo
// NumValues: 0x0003
enum class EDelMarDemolishedProcessorInfo : uint32
{
	None                                     = 0,
	WithoutDemolish                          = 1,
	WithDemolish                             = 2,
};

// Enum DelMarCore.EDelMarPositionChangeInfo
// NumValues: 0x0003
enum class EDelMarPositionChangeInfo : uint8
{
	None                                     = 0,
	PassPlayer                               = 1,
	PassedByPlayer                           = 2,
};

// Enum DelMarCore.EDelMarPlaylistTypeInfo
// NumValues: 0x0003
enum class EDelMarPlaylistTypeInfo : uint8
{
	Any                                      = 0,
	Casual                                   = 1,
	Ranked                                   = 2,
};

// Enum DelMarCore.EDelMarPhysicsRate
// NumValues: 0x0003
enum class EDelMarPhysicsRate : uint8
{
	ThirtyHz                                 = 0,
	SixtyHz                                  = 1,
	OneHundredTwentyHz                       = 2,
};

// Enum DelMarCore.EDelMarSplineGenerationMode
// NumValues: 0x0002
enum class EDelMarSplineGenerationMode : uint8
{
	PerSplinePoint                           = 0,
	UserAmount                               = 1,
};

// Enum DelMarCore.EDelMarRaceMode
// NumValues: 0x0005
enum class EDelMarRaceMode : uint8
{
	ChallengeMode                            = 0,
	CompetitiveMode                          = 1,
	DeathRaceMode                            = 2,
	TutorialRaceMode                         = 3,
	Invalid                                  = 4,
};

// Enum DelMarCore.EDelMarInvertSteerMethod
// NumValues: 0x0005
enum class EDelMarInvertSteerMethod : uint8
{
	CeilingAngle                             = 0,
	CeilingTimeDelay                         = 1,
	CeilingReleaseInput                      = 2,
	Never                                    = 3,
	Always                                   = 4,
};

// Enum DelMarCore.EDelMarKickflipDirection
// NumValues: 0x0009
enum class EDelMarKickflipDirection : uint8
{
	None                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	Left                                     = 3,
	Right                                    = 4,
	UpLeft                                   = 5,
	DownLeft                                 = 6,
	UpRight                                  = 7,
	DownRight                                = 8,
};

// Enum DelMarCore.EDelMarVehicleWheelIndex
// NumValues: 0x0005
enum class EDelMarVehicleWheelIndex : uint8
{
	FrontLeft                                = 0,
	FrontRight                               = 1,
	BackLeft                                 = 2,
	BackRight                                = 3,
	Num                                      = 4,
};

// Enum DelMarCore.EMixModifierTarget
// NumValues: 0x0003
enum class EMixModifierTarget : uint8
{
	Volume                                   = 0,
	Pitch                                    = 1,
	LowpassFrequency                         = 2,
};

// Enum DelMarCore.EDelMarCheckpointMeshType
// NumValues: 0x0003
enum class EDelMarCheckpointMeshType : uint8
{
	Default                                  = 0,
	StartLine                                = 1,
	FinishLine                               = 2,
};

// Enum DelMarCore.EDelMarTimerDirection
// NumValues: 0x0002
enum class EDelMarTimerDirection : uint8
{
	CountUp                                  = 0,
	CountDown                                = 1,
};

// Enum DelMarCore.EDelMarPostRaceVote
// NumValues: 0x0004
enum class EDelMarPostRaceVote : uint8
{
	Unset                                    = 0,
	PlayAgain                                = 1,
	NextMap                                  = 2,
	MAX                                      = 3,
};

// Enum DelMarCore.EDelMarVehicleCollisionOverrideSetting
// NumValues: 0x0004
enum class EDelMarVehicleCollisionOverrideSetting : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Unset                                    = 2,
	Max                                      = 3,
};

// Enum DelMarCore.EDelMarRaceSpawnMode
// NumValues: 0x0004
enum class EDelMarRaceSpawnMode : uint8
{
	SpawnAtMostRecentSplinePoint             = 0,
	SpawnAtMostRecentCheckpoint              = 1,
	SpawnAtRaceStart                         = 2,
	NoAutomaticRespawn                       = 3,
};

// Enum DelMarCore.EDelMarPostMatchFlows
// NumValues: 0x0002
enum class EDelMarPostMatchFlows : uint8
{
	PlayTogetherFlow                         = 0,
	PlayTrackFlow                            = 1,
};

// Enum DelMarCore.EDelMarPostMatchState
// NumValues: 0x000A
enum class EDelMarPostMatchState : uint8
{
	WaitingForParty                          = 0,
	WaitingForLobby                          = 1,
	StartingNextRace                         = 2,
	MatchmakingStarted                       = 3,
	MatchmakingSucceeded                     = 4,
	MatchmakingFailed                        = 5,
	Idle                                     = 6,
	Failed                                   = 7,
	Completed                                = 8,
	INVALID                                  = 9,
};

// ScriptStruct DelMarCore.DelMarAIDifficultySpawnInfo
// 0x0008 (0x0008 - 0x0000)
struct FDelMarAIDifficultySpawnInfo final
{
public:
	int32                                         SkillLevel;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BotFillPercentage;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarAIDifficultySpawnInfo) == 0x000004, "Wrong alignment on FDelMarAIDifficultySpawnInfo");
static_assert(sizeof(FDelMarAIDifficultySpawnInfo) == 0x000008, "Wrong size on FDelMarAIDifficultySpawnInfo");
static_assert(offsetof(FDelMarAIDifficultySpawnInfo, SkillLevel) == 0x000000, "Member 'FDelMarAIDifficultySpawnInfo::SkillLevel' has a wrong offset!");
static_assert(offsetof(FDelMarAIDifficultySpawnInfo, BotFillPercentage) == 0x000004, "Member 'FDelMarAIDifficultySpawnInfo::BotFillPercentage' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarAIMMRSpawnDataTableRow
// 0x0020 (0x0028 - 0x0008)
struct FDelMarAIMMRSpawnDataTableRow final : public FTableRowBase
{
public:
	int32                                         MMRBracketLow;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MMRBracketHigh;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FallbackSkillLevel;                                // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarAIDifficultySpawnInfo>   BotSpawnInfo;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarAIMMRSpawnDataTableRow) == 0x000008, "Wrong alignment on FDelMarAIMMRSpawnDataTableRow");
static_assert(sizeof(FDelMarAIMMRSpawnDataTableRow) == 0x000028, "Wrong size on FDelMarAIMMRSpawnDataTableRow");
static_assert(offsetof(FDelMarAIMMRSpawnDataTableRow, MMRBracketLow) == 0x000008, "Member 'FDelMarAIMMRSpawnDataTableRow::MMRBracketLow' has a wrong offset!");
static_assert(offsetof(FDelMarAIMMRSpawnDataTableRow, MMRBracketHigh) == 0x00000C, "Member 'FDelMarAIMMRSpawnDataTableRow::MMRBracketHigh' has a wrong offset!");
static_assert(offsetof(FDelMarAIMMRSpawnDataTableRow, FallbackSkillLevel) == 0x000010, "Member 'FDelMarAIMMRSpawnDataTableRow::FallbackSkillLevel' has a wrong offset!");
static_assert(offsetof(FDelMarAIMMRSpawnDataTableRow, BotSpawnInfo) == 0x000018, "Member 'FDelMarAIMMRSpawnDataTableRow::BotSpawnInfo' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Ability
// 0x0008 (0x0008 - 0x0000)
struct FDelMarVehicleReplicatedState_Ability
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarVehicleReplicatedState_Ability) == 0x000004, "Wrong alignment on FDelMarVehicleReplicatedState_Ability");
static_assert(sizeof(FDelMarVehicleReplicatedState_Ability) == 0x000008, "Wrong size on FDelMarVehicleReplicatedState_Ability");
static_assert(offsetof(FDelMarVehicleReplicatedState_Ability, bActive) == 0x000000, "Member 'FDelMarVehicleReplicatedState_Ability::bActive' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Ability, duration) == 0x000004, "Member 'FDelMarVehicleReplicatedState_Ability::duration' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Reattachment
// 0x0020 (0x0028 - 0x0008)
struct FDelMarVehicleReplicatedState_Reattachment final : public FDelMarVehicleReplicatedState_Ability
{
public:
	struct FVector_NetQuantizeNormal              AttachmentDirection;                               // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanActivate;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarVehicleReplicatedState_Reattachment) == 0x000008, "Wrong alignment on FDelMarVehicleReplicatedState_Reattachment");
static_assert(sizeof(FDelMarVehicleReplicatedState_Reattachment) == 0x000028, "Wrong size on FDelMarVehicleReplicatedState_Reattachment");
static_assert(offsetof(FDelMarVehicleReplicatedState_Reattachment, AttachmentDirection) == 0x000008, "Member 'FDelMarVehicleReplicatedState_Reattachment::AttachmentDirection' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Reattachment, bCanActivate) == 0x000020, "Member 'FDelMarVehicleReplicatedState_Reattachment::bCanActivate' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarAIVehicleCosmeticSlotDataTableInfo
// 0x0040 (0x0040 - 0x0000)
struct FDelMarAIVehicleCosmeticSlotDataTableInfo final
{
public:
	TSoftObjectPtr<class UCosmeticLoadoutSlotTemplate> SlotTemplate;                                      // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              VehicleSlotCosmeticDataTable;                      // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarAIVehicleCosmeticSlotDataTableInfo) == 0x000008, "Wrong alignment on FDelMarAIVehicleCosmeticSlotDataTableInfo");
static_assert(sizeof(FDelMarAIVehicleCosmeticSlotDataTableInfo) == 0x000040, "Wrong size on FDelMarAIVehicleCosmeticSlotDataTableInfo");
static_assert(offsetof(FDelMarAIVehicleCosmeticSlotDataTableInfo, SlotTemplate) == 0x000000, "Member 'FDelMarAIVehicleCosmeticSlotDataTableInfo::SlotTemplate' has a wrong offset!");
static_assert(offsetof(FDelMarAIVehicleCosmeticSlotDataTableInfo, VehicleSlotCosmeticDataTable) == 0x000020, "Member 'FDelMarAIVehicleCosmeticSlotDataTableInfo::VehicleSlotCosmeticDataTable' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarCosmeticLoadoutSlotData
// 0x0040 (0x0040 - 0x0000)
struct FDelMarCosmeticLoadoutSlotData final
{
public:
	TSoftObjectPtr<class UCosmeticLoadoutSlotTemplate> SlotTemplate;                                      // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 EquippedItemDefinitionObject;                      // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarCosmeticLoadoutSlotData) == 0x000008, "Wrong alignment on FDelMarCosmeticLoadoutSlotData");
static_assert(sizeof(FDelMarCosmeticLoadoutSlotData) == 0x000040, "Wrong size on FDelMarCosmeticLoadoutSlotData");
static_assert(offsetof(FDelMarCosmeticLoadoutSlotData, SlotTemplate) == 0x000000, "Member 'FDelMarCosmeticLoadoutSlotData::SlotTemplate' has a wrong offset!");
static_assert(offsetof(FDelMarCosmeticLoadoutSlotData, EquippedItemDefinitionObject) == 0x000020, "Member 'FDelMarCosmeticLoadoutSlotData::EquippedItemDefinitionObject' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleInPersistent
// 0x07D0 (0x0970 - 0x01A0)
struct alignas(0x10) FDelMarVehicleInPersistent final : public FFortVehicleInPersistent
{
public:
	uint8                                         Pad_1A0[0x7D0];                                    // 0x01A0(0x07D0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarVehicleInPersistent) == 0x000010, "Wrong alignment on FDelMarVehicleInPersistent");
static_assert(sizeof(FDelMarVehicleInPersistent) == 0x000970, "Wrong size on FDelMarVehicleInPersistent");

// ScriptStruct DelMarCore.DelMarAIVehicleCosmeticLoadoutSetDataTableRow
// 0x0018 (0x0020 - 0x0008)
struct FDelMarAIVehicleCosmeticLoadoutSetDataTableRow final : public FTableRowBase
{
public:
	TArray<struct FDelMarCosmeticLoadoutSlotData> LoadoutSlots;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarAIVehicleCosmeticLoadoutSetDataTableRow) == 0x000008, "Wrong alignment on FDelMarAIVehicleCosmeticLoadoutSetDataTableRow");
static_assert(sizeof(FDelMarAIVehicleCosmeticLoadoutSetDataTableRow) == 0x000020, "Wrong size on FDelMarAIVehicleCosmeticLoadoutSetDataTableRow");
static_assert(offsetof(FDelMarAIVehicleCosmeticLoadoutSetDataTableRow, LoadoutSlots) == 0x000008, "Member 'FDelMarAIVehicleCosmeticLoadoutSetDataTableRow::LoadoutSlots' has a wrong offset!");
static_assert(offsetof(FDelMarAIVehicleCosmeticLoadoutSetDataTableRow, Weight) == 0x000018, "Member 'FDelMarAIVehicleCosmeticLoadoutSetDataTableRow::Weight' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarAIVehicleCosmeticSlotDataTableRow
// 0x0028 (0x0030 - 0x0008)
struct FDelMarAIVehicleCosmeticSlotDataTableRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UObject>                 EquippedItemDefinitionObject;                      // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarAIVehicleCosmeticSlotDataTableRow) == 0x000008, "Wrong alignment on FDelMarAIVehicleCosmeticSlotDataTableRow");
static_assert(sizeof(FDelMarAIVehicleCosmeticSlotDataTableRow) == 0x000030, "Wrong size on FDelMarAIVehicleCosmeticSlotDataTableRow");
static_assert(offsetof(FDelMarAIVehicleCosmeticSlotDataTableRow, EquippedItemDefinitionObject) == 0x000008, "Member 'FDelMarAIVehicleCosmeticSlotDataTableRow::EquippedItemDefinitionObject' has a wrong offset!");
static_assert(offsetof(FDelMarAIVehicleCosmeticSlotDataTableRow, Weight) == 0x000028, "Member 'FDelMarAIVehicleCosmeticSlotDataTableRow::Weight' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Underthrust
// 0x0004 (0x000C - 0x0008)
struct FDelMarVehicleReplicatedState_Underthrust final : public FDelMarVehicleReplicatedState_Ability
{
public:
	float                                         RemainingThrustSeconds;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarVehicleReplicatedState_Underthrust) == 0x000004, "Wrong alignment on FDelMarVehicleReplicatedState_Underthrust");
static_assert(sizeof(FDelMarVehicleReplicatedState_Underthrust) == 0x00000C, "Wrong size on FDelMarVehicleReplicatedState_Underthrust");
static_assert(offsetof(FDelMarVehicleReplicatedState_Underthrust, RemainingThrustSeconds) == 0x000008, "Member 'FDelMarVehicleReplicatedState_Underthrust::RemainingThrustSeconds' has a wrong offset!");

// ScriptStruct DelMarCore.AvoidanceInfo
// 0x0080 (0x0080 - 0x0000)
struct FAvoidanceInfo final
{
public:
	TMap<TWeakObjectPtr<class AActor>, class UDriveHazardInfo*> DriveHazardInfoMap;                                // 0x0000(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UDriveHazardInfo*>               NonJumpableDriveHazardInfos;                       // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UDriveHazardInfo*>               JumpableDriveHazardInfos;                          // 0x0060(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAvoidanceInfo) == 0x000008, "Wrong alignment on FAvoidanceInfo");
static_assert(sizeof(FAvoidanceInfo) == 0x000080, "Wrong size on FAvoidanceInfo");
static_assert(offsetof(FAvoidanceInfo, DriveHazardInfoMap) == 0x000000, "Member 'FAvoidanceInfo::DriveHazardInfoMap' has a wrong offset!");
static_assert(offsetof(FAvoidanceInfo, NonJumpableDriveHazardInfos) == 0x000050, "Member 'FAvoidanceInfo::NonJumpableDriveHazardInfos' has a wrong offset!");
static_assert(offsetof(FAvoidanceInfo, JumpableDriveHazardInfos) == 0x000060, "Member 'FAvoidanceInfo::JumpableDriveHazardInfos' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarCosmeticSlotInfo
// 0x0060 (0x0060 - 0x0000)
struct FDelMarCosmeticSlotInfo final
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SlotName;                                          // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ShortDescription;                                  // 0x0020(0x0018)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCanBeEmpty;                                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              UnassignedPreviewImage;                            // 0x0040(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarCosmeticSlotInfo) == 0x000008, "Wrong alignment on FDelMarCosmeticSlotInfo");
static_assert(sizeof(FDelMarCosmeticSlotInfo) == 0x000060, "Wrong size on FDelMarCosmeticSlotInfo");
static_assert(offsetof(FDelMarCosmeticSlotInfo, SlotTag) == 0x000000, "Member 'FDelMarCosmeticSlotInfo::SlotTag' has a wrong offset!");
static_assert(offsetof(FDelMarCosmeticSlotInfo, SlotName) == 0x000008, "Member 'FDelMarCosmeticSlotInfo::SlotName' has a wrong offset!");
static_assert(offsetof(FDelMarCosmeticSlotInfo, ShortDescription) == 0x000020, "Member 'FDelMarCosmeticSlotInfo::ShortDescription' has a wrong offset!");
static_assert(offsetof(FDelMarCosmeticSlotInfo, bCanBeEmpty) == 0x000038, "Member 'FDelMarCosmeticSlotInfo::bCanBeEmpty' has a wrong offset!");
static_assert(offsetof(FDelMarCosmeticSlotInfo, UnassignedPreviewImage) == 0x000040, "Member 'FDelMarCosmeticSlotInfo::UnassignedPreviewImage' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Kickflip
// 0x0058 (0x0060 - 0x0008)
struct FDelMarVehicleReplicatedState_Kickflip final : public FDelMarVehicleReplicatedState_Ability
{
public:
	struct FVector_NetQuantizeNormal              RelativeUpDirection;                               // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              KickDirection;                                     // 0x0020(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftSide;                                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakeLongestRoll;                                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateTowardsVelocity;                            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStartLongRoll;                                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartingRollSign;                                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KickflipKeybindPressTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActivationCharges;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              StartingPrimaryDirection;                          // 0x0048(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarVehicleReplicatedState_Kickflip) == 0x000008, "Wrong alignment on FDelMarVehicleReplicatedState_Kickflip");
static_assert(sizeof(FDelMarVehicleReplicatedState_Kickflip) == 0x000060, "Wrong size on FDelMarVehicleReplicatedState_Kickflip");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, RelativeUpDirection) == 0x000008, "Member 'FDelMarVehicleReplicatedState_Kickflip::RelativeUpDirection' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, KickDirection) == 0x000020, "Member 'FDelMarVehicleReplicatedState_Kickflip::KickDirection' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, bLeftSide) == 0x000038, "Member 'FDelMarVehicleReplicatedState_Kickflip::bLeftSide' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, bTakeLongestRoll) == 0x000039, "Member 'FDelMarVehicleReplicatedState_Kickflip::bTakeLongestRoll' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, bRotateTowardsVelocity) == 0x00003A, "Member 'FDelMarVehicleReplicatedState_Kickflip::bRotateTowardsVelocity' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, bCanStartLongRoll) == 0x00003B, "Member 'FDelMarVehicleReplicatedState_Kickflip::bCanStartLongRoll' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, StartingRollSign) == 0x00003C, "Member 'FDelMarVehicleReplicatedState_Kickflip::StartingRollSign' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, KickflipKeybindPressTime) == 0x000040, "Member 'FDelMarVehicleReplicatedState_Kickflip::KickflipKeybindPressTime' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, ActivationCharges) == 0x000044, "Member 'FDelMarVehicleReplicatedState_Kickflip::ActivationCharges' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleReplicatedState_Kickflip, StartingPrimaryDirection) == 0x000048, "Member 'FDelMarVehicleReplicatedState_Kickflip::StartingPrimaryDirection' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_DriverInteractionAdded
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDelMarEvent_DriverInteractionAdded final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_DriverInteractionAdded) == 0x000004, "Wrong alignment on FDelMarEvent_DriverInteractionAdded");
static_assert(sizeof(FDelMarEvent_DriverInteractionAdded) == 0x000008, "Wrong size on FDelMarEvent_DriverInteractionAdded");

// ScriptStruct DelMarCore.DelMarEventRouterExt
// 0x0018 (0x0018 - 0x0000)
struct FDelMarEventRouterExt final
{
public:
	bool                                          bWorldIsTearingDown;                               // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEventRouterComponent*          EventRouter;                                       // 0x0008(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EventRouterContextObject;                          // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarEventRouterExt) == 0x000008, "Wrong alignment on FDelMarEventRouterExt");
static_assert(sizeof(FDelMarEventRouterExt) == 0x000018, "Wrong size on FDelMarEventRouterExt");
static_assert(offsetof(FDelMarEventRouterExt, bWorldIsTearingDown) == 0x000000, "Member 'FDelMarEventRouterExt::bWorldIsTearingDown' has a wrong offset!");
static_assert(offsetof(FDelMarEventRouterExt, EventRouter) == 0x000008, "Member 'FDelMarEventRouterExt::EventRouter' has a wrong offset!");
static_assert(offsetof(FDelMarEventRouterExt, EventRouterContextObject) == 0x000010, "Member 'FDelMarEventRouterExt::EventRouterContextObject' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleInContinuous
// 0x0000 (0x0040 - 0x0040)
struct FDelMarVehicleInContinuous final : public FFortAthenaVehicleInputState
{
};
static_assert(alignof(FDelMarVehicleInContinuous) == 0x000008, "Wrong alignment on FDelMarVehicleInContinuous");
static_assert(sizeof(FDelMarVehicleInContinuous) == 0x000040, "Wrong size on FDelMarVehicleInContinuous");

// ScriptStruct DelMarCore.DelMarGameplayStateChangedEvent
// 0x0008 (0x0008 - 0x0000)
struct FDelMarGameplayStateChangedEvent final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewStateId;                                        // 0x0004(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarGameplayStateChangedEvent) == 0x000004, "Wrong alignment on FDelMarGameplayStateChangedEvent");
static_assert(sizeof(FDelMarGameplayStateChangedEvent) == 0x000008, "Wrong size on FDelMarGameplayStateChangedEvent");
static_assert(offsetof(FDelMarGameplayStateChangedEvent, PrevStateId) == 0x000000, "Member 'FDelMarGameplayStateChangedEvent::PrevStateId' has a wrong offset!");
static_assert(offsetof(FDelMarGameplayStateChangedEvent, NewStateId) == 0x000004, "Member 'FDelMarGameplayStateChangedEvent::NewStateId' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_ResetRace
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_ResetRace final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_ResetRace) == 0x000001, "Wrong alignment on FDelMarEvent_ResetRace");
static_assert(sizeof(FDelMarEvent_ResetRace) == 0x000001, "Wrong size on FDelMarEvent_ResetRace");

// ScriptStruct DelMarCore.DelMarVerbMessageBase
// 0x00C0 (0x0138 - 0x0078)
struct FDelMarVerbMessageBase : public FVerbMessage
{
public:
	struct FSubjectTagsPair                       LevelDescriptionId;                                // 0x0078(0x0038)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSubjectTagsPair                       GameModeId;                                        // 0x00B0(0x0038)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSubjectTagsPair                       VehicleTags;                                       // 0x00E8(0x0038)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	EDelMarPlaylistTypeInfo                       RankedPlaylistInfo;                                // 0x0120(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortVerb_ObjectWrapper>        Cosmetics;                                         // 0x0128(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FDelMarVerbMessageBase) == 0x000008, "Wrong alignment on FDelMarVerbMessageBase");
static_assert(sizeof(FDelMarVerbMessageBase) == 0x000138, "Wrong size on FDelMarVerbMessageBase");
static_assert(offsetof(FDelMarVerbMessageBase, LevelDescriptionId) == 0x000078, "Member 'FDelMarVerbMessageBase::LevelDescriptionId' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessageBase, GameModeId) == 0x0000B0, "Member 'FDelMarVerbMessageBase::GameModeId' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessageBase, VehicleTags) == 0x0000E8, "Member 'FDelMarVerbMessageBase::VehicleTags' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessageBase, RankedPlaylistInfo) == 0x000120, "Member 'FDelMarVerbMessageBase::RankedPlaylistInfo' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessageBase, Cosmetics) == 0x000128, "Member 'FDelMarVerbMessageBase::Cosmetics' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVerbMessage_BonusTurboActivated
// 0x0000 (0x0138 - 0x0138)
struct FDelMarVerbMessage_BonusTurboActivated final : public FDelMarVerbMessageBase
{
};
static_assert(alignof(FDelMarVerbMessage_BonusTurboActivated) == 0x000008, "Wrong alignment on FDelMarVerbMessage_BonusTurboActivated");
static_assert(sizeof(FDelMarVerbMessage_BonusTurboActivated) == 0x000138, "Wrong size on FDelMarVerbMessage_BonusTurboActivated");

// ScriptStruct DelMarCore.DelMarEvent_ResetRun
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_ResetRun final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_ResetRun) == 0x000001, "Wrong alignment on FDelMarEvent_ResetRun");
static_assert(sizeof(FDelMarEvent_ResetRun) == 0x000001, "Wrong size on FDelMarEvent_ResetRun");

// ScriptStruct DelMarCore.DelMarEvent_RaceFinished
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_RaceFinished final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_RaceFinished) == 0x000008, "Wrong alignment on FDelMarEvent_RaceFinished");
static_assert(sizeof(FDelMarEvent_RaceFinished) == 0x000008, "Wrong size on FDelMarEvent_RaceFinished");

// ScriptStruct DelMarCore.DelMarVehicleOutContinuous
// 0x0160 (0x01B0 - 0x0050)
struct alignas(0x10) FDelMarVehicleOutContinuous final : public FFortVehicleOutContinuous
{
public:
	uint8                                         Pad_50[0x160];                                     // 0x0050(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarVehicleOutContinuous) == 0x000010, "Wrong alignment on FDelMarVehicleOutContinuous");
static_assert(sizeof(FDelMarVehicleOutContinuous) == 0x0001B0, "Wrong size on FDelMarVehicleOutContinuous");

// ScriptStruct DelMarCore.DelMarEvent_FirstPlayerFinishedCountdown
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDelMarEvent_FirstPlayerFinishedCountdown final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_FirstPlayerFinishedCountdown) == 0x000008, "Wrong alignment on FDelMarEvent_FirstPlayerFinishedCountdown");
static_assert(sizeof(FDelMarEvent_FirstPlayerFinishedCountdown) == 0x000010, "Wrong size on FDelMarEvent_FirstPlayerFinishedCountdown");

// ScriptStruct DelMarCore.DelMarEvent_RaceActive
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_RaceActive final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_RaceActive) == 0x000008, "Wrong alignment on FDelMarEvent_RaceActive");
static_assert(sizeof(FDelMarEvent_RaceActive) == 0x000008, "Wrong size on FDelMarEvent_RaceActive");

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_AirControl
// 0x0004 (0x000C - 0x0008)
struct FDelMarVehicleReplicatedState_AirControl final : public FDelMarVehicleReplicatedState_Ability
{
public:
	float                                         AerialDivingBonusSpeed;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarVehicleReplicatedState_AirControl) == 0x000004, "Wrong alignment on FDelMarVehicleReplicatedState_AirControl");
static_assert(sizeof(FDelMarVehicleReplicatedState_AirControl) == 0x00000C, "Wrong size on FDelMarVehicleReplicatedState_AirControl");
static_assert(offsetof(FDelMarVehicleReplicatedState_AirControl, AerialDivingBonusSpeed) == 0x000008, "Member 'FDelMarVehicleReplicatedState_AirControl::AerialDivingBonusSpeed' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_RunActive
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDelMarEvent_RunActive final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_RunActive) == 0x000008, "Wrong alignment on FDelMarEvent_RunActive");
static_assert(sizeof(FDelMarEvent_RunActive) == 0x000010, "Wrong size on FDelMarEvent_RunActive");

// ScriptStruct DelMarCore.DelMarEvent_OvertimeActive
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_OvertimeActive final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_OvertimeActive) == 0x000008, "Wrong alignment on FDelMarEvent_OvertimeActive");
static_assert(sizeof(FDelMarEvent_OvertimeActive) == 0x000008, "Wrong size on FDelMarEvent_OvertimeActive");

// ScriptStruct DelMarCore.DelMarEvent_CountdownActive
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FDelMarEvent_CountdownActive final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_CountdownActive) == 0x000008, "Wrong alignment on FDelMarEvent_CountdownActive");
static_assert(sizeof(FDelMarEvent_CountdownActive) == 0x000020, "Wrong size on FDelMarEvent_CountdownActive");

// ScriptStruct DelMarCore.DelMarEvent_PlayerFinishedRace
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FDelMarEvent_PlayerFinishedRace final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_PlayerFinishedRace) == 0x000008, "Wrong alignment on FDelMarEvent_PlayerFinishedRace");
static_assert(sizeof(FDelMarEvent_PlayerFinishedRace) == 0x000018, "Wrong size on FDelMarEvent_PlayerFinishedRace");

// ScriptStruct DelMarCore.DelMarVerbMessage_HighestSpeedUpdated
// 0x0008 (0x0140 - 0x0138)
struct FDelMarVerbMessage_HighestSpeedUpdated final : public FDelMarVerbMessageBase
{
public:
	float                                         HighestSpeed;                                      // 0x0138(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarVerbMessage_HighestSpeedUpdated) == 0x000008, "Wrong alignment on FDelMarVerbMessage_HighestSpeedUpdated");
static_assert(sizeof(FDelMarVerbMessage_HighestSpeedUpdated) == 0x000140, "Wrong size on FDelMarVerbMessage_HighestSpeedUpdated");
static_assert(offsetof(FDelMarVerbMessage_HighestSpeedUpdated, HighestSpeed) == 0x000138, "Member 'FDelMarVerbMessage_HighestSpeedUpdated::HighestSpeed' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_RacerStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FDelMarEvent_RacerStateChanged final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PrevStateId;                                       // 0x0008(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewStateId;                                        // 0x000C(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarEvent_RacerStateChanged) == 0x000004, "Wrong alignment on FDelMarEvent_RacerStateChanged");
static_assert(sizeof(FDelMarEvent_RacerStateChanged) == 0x000010, "Wrong size on FDelMarEvent_RacerStateChanged");
static_assert(offsetof(FDelMarEvent_RacerStateChanged, PrevStateId) == 0x000008, "Member 'FDelMarEvent_RacerStateChanged::PrevStateId' has a wrong offset!");
static_assert(offsetof(FDelMarEvent_RacerStateChanged, NewStateId) == 0x00000C, "Member 'FDelMarEvent_RacerStateChanged::NewStateId' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_PlayerBecomeSpectator
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDelMarEvent_PlayerBecomeSpectator final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_PlayerBecomeSpectator) == 0x000004, "Wrong alignment on FDelMarEvent_PlayerBecomeSpectator");
static_assert(sizeof(FDelMarEvent_PlayerBecomeSpectator) == 0x000008, "Wrong size on FDelMarEvent_PlayerBecomeSpectator");

// ScriptStruct DelMarCore.DelMarVerbMessage_BoostPadHit
// 0x0000 (0x0138 - 0x0138)
struct FDelMarVerbMessage_BoostPadHit final : public FDelMarVerbMessageBase
{
};
static_assert(alignof(FDelMarVerbMessage_BoostPadHit) == 0x000008, "Wrong alignment on FDelMarVerbMessage_BoostPadHit");
static_assert(sizeof(FDelMarVerbMessage_BoostPadHit) == 0x000138, "Wrong size on FDelMarVerbMessage_BoostPadHit");

// ScriptStruct DelMarCore.DelMarEvent_RaceManagerInitialized
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDelMarEvent_RaceManagerInitialized final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_RaceManagerInitialized) == 0x000004, "Wrong alignment on FDelMarEvent_RaceManagerInitialized");
static_assert(sizeof(FDelMarEvent_RaceManagerInitialized) == 0x000008, "Wrong size on FDelMarEvent_RaceManagerInitialized");

// ScriptStruct DelMarCore.DelMarEvent_VehicleAssignedToPawn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDelMarEvent_VehicleAssignedToPawn final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_VehicleAssignedToPawn) == 0x000004, "Wrong alignment on FDelMarEvent_VehicleAssignedToPawn");
static_assert(sizeof(FDelMarEvent_VehicleAssignedToPawn) == 0x000008, "Wrong size on FDelMarEvent_VehicleAssignedToPawn");

// ScriptStruct DelMarCore.DelMarVehicleNetworkInput
// 0x0048 (0x0048 - 0x0000)
struct FDelMarVehicleNetworkInput final
{
public:
	int32                                         FrameNum;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarVehicleInContinuous             Input;                                             // 0x0008(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarVehicleNetworkInput) == 0x000008, "Wrong alignment on FDelMarVehicleNetworkInput");
static_assert(sizeof(FDelMarVehicleNetworkInput) == 0x000048, "Wrong size on FDelMarVehicleNetworkInput");
static_assert(offsetof(FDelMarVehicleNetworkInput, FrameNum) == 0x000000, "Member 'FDelMarVehicleNetworkInput::FrameNum' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleNetworkInput, Input) == 0x000008, "Member 'FDelMarVehicleNetworkInput::Input' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_ServerRaceStartCountdownTime
// 0x0008 (0x0008 - 0x0000)
struct FDelMarEvent_ServerRaceStartCountdownTime final
{
public:
	double                                        ServerTime;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarEvent_ServerRaceStartCountdownTime) == 0x000008, "Wrong alignment on FDelMarEvent_ServerRaceStartCountdownTime");
static_assert(sizeof(FDelMarEvent_ServerRaceStartCountdownTime) == 0x000008, "Wrong size on FDelMarEvent_ServerRaceStartCountdownTime");
static_assert(offsetof(FDelMarEvent_ServerRaceStartCountdownTime, ServerTime) == 0x000000, "Member 'FDelMarEvent_ServerRaceStartCountdownTime::ServerTime' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_ServerPostRaceEndTime
// 0x0008 (0x0008 - 0x0000)
struct FDelMarEvent_ServerPostRaceEndTime final
{
public:
	double                                        ServerTime;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarEvent_ServerPostRaceEndTime) == 0x000008, "Wrong alignment on FDelMarEvent_ServerPostRaceEndTime");
static_assert(sizeof(FDelMarEvent_ServerPostRaceEndTime) == 0x000008, "Wrong size on FDelMarEvent_ServerPostRaceEndTime");
static_assert(offsetof(FDelMarEvent_ServerPostRaceEndTime, ServerTime) == 0x000000, "Member 'FDelMarEvent_ServerPostRaceEndTime::ServerTime' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarScaledCurve
// 0x0090 (0x0090 - 0x0000)
struct FDelMarScaledCurve final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     Curve;                                             // 0x0008(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarScaledCurve) == 0x000008, "Wrong alignment on FDelMarScaledCurve");
static_assert(sizeof(FDelMarScaledCurve) == 0x000090, "Wrong size on FDelMarScaledCurve");
static_assert(offsetof(FDelMarScaledCurve, Scale) == 0x000000, "Member 'FDelMarScaledCurve::Scale' has a wrong offset!");
static_assert(offsetof(FDelMarScaledCurve, Curve) == 0x000008, "Member 'FDelMarScaledCurve::Curve' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarVehicleConfig_AirThrottle
// 0x00A0 (0x00A0 - 0x0000)
struct FDelMarVehicleConfig_AirThrottle final
{
public:
	struct FDelMarScaledCurve                     AccelerationScalarCurve;                           // 0x0000(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         AerialSpeedCap;                                    // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverCapSpeedLossPerSecond;                         // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AerialSlowdownImmunitySeconds;                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyNoThrottleSlowdown;                          // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarVehicleConfig_AirThrottle) == 0x000008, "Wrong alignment on FDelMarVehicleConfig_AirThrottle");
static_assert(sizeof(FDelMarVehicleConfig_AirThrottle) == 0x0000A0, "Wrong size on FDelMarVehicleConfig_AirThrottle");
static_assert(offsetof(FDelMarVehicleConfig_AirThrottle, AccelerationScalarCurve) == 0x000000, "Member 'FDelMarVehicleConfig_AirThrottle::AccelerationScalarCurve' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleConfig_AirThrottle, AerialSpeedCap) == 0x000090, "Member 'FDelMarVehicleConfig_AirThrottle::AerialSpeedCap' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleConfig_AirThrottle, OverCapSpeedLossPerSecond) == 0x000094, "Member 'FDelMarVehicleConfig_AirThrottle::OverCapSpeedLossPerSecond' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleConfig_AirThrottle, AerialSlowdownImmunitySeconds) == 0x000098, "Member 'FDelMarVehicleConfig_AirThrottle::AerialSlowdownImmunitySeconds' has a wrong offset!");
static_assert(offsetof(FDelMarVehicleConfig_AirThrottle, bApplyNoThrottleSlowdown) == 0x00009C, "Member 'FDelMarVehicleConfig_AirThrottle::bApplyNoThrottleSlowdown' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_VehicleDemolished
// 0x000C (0x000C - 0x0000)
struct FDelMarEvent_VehicleDemolished final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CausedByTag;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDelMarEvent_VehicleDemolished) == 0x000004, "Wrong alignment on FDelMarEvent_VehicleDemolished");
static_assert(sizeof(FDelMarEvent_VehicleDemolished) == 0x00000C, "Wrong size on FDelMarEvent_VehicleDemolished");
static_assert(offsetof(FDelMarEvent_VehicleDemolished, CausedByTag) == 0x000008, "Member 'FDelMarEvent_VehicleDemolished::CausedByTag' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_VehicleWrongwayStatus
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_VehicleWrongwayStatus final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_VehicleWrongwayStatus) == 0x000001, "Wrong alignment on FDelMarEvent_VehicleWrongwayStatus");
static_assert(sizeof(FDelMarEvent_VehicleWrongwayStatus) == 0x000001, "Wrong size on FDelMarEvent_VehicleWrongwayStatus");

// ScriptStruct DelMarCore.DelMarVerbMessage_RunComplete
// 0x0018 (0x0150 - 0x0138)
struct FDelMarVerbMessage_RunComplete final : public FDelMarVerbMessageBase
{
public:
	double                                        FinishTime;                                        // 0x0138(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         FinalPlacement;                                    // 0x0140(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EDelMarJellyHazardProcessorInfo               JellyHazardInfo;                                   // 0x0144(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDelMarDemolishedProcessorInfo                DemolishedInfo;                                    // 0x0148(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarVerbMessage_RunComplete) == 0x000008, "Wrong alignment on FDelMarVerbMessage_RunComplete");
static_assert(sizeof(FDelMarVerbMessage_RunComplete) == 0x000150, "Wrong size on FDelMarVerbMessage_RunComplete");
static_assert(offsetof(FDelMarVerbMessage_RunComplete, FinishTime) == 0x000138, "Member 'FDelMarVerbMessage_RunComplete::FinishTime' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessage_RunComplete, FinalPlacement) == 0x000140, "Member 'FDelMarVerbMessage_RunComplete::FinalPlacement' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessage_RunComplete, JellyHazardInfo) == 0x000144, "Member 'FDelMarVerbMessage_RunComplete::JellyHazardInfo' has a wrong offset!");
static_assert(offsetof(FDelMarVerbMessage_RunComplete, DemolishedInfo) == 0x000148, "Member 'FDelMarVerbMessage_RunComplete::DemolishedInfo' has a wrong offset!");

// ScriptStruct DelMarCore.DelMarEvent_MissedCheckpointDemoCountdown
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_MissedCheckpointDemoCountdown final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_MissedCheckpointDemoCountdown) == 0x000008, "Wrong alignment on FDelMarEvent_MissedCheckpointDemoCountdown");
static_assert(sizeof(FDelMarEvent_MissedCheckpointDemoCountdown) == 0x000008, "Wrong size on FDelMarEvent_MissedCheckpointDemoCountdown");

// ScriptStruct DelMarCore.DelMarEvent_ReturnToTrackDemoCountdown
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_ReturnToTrackDemoCountdown final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDelMarEvent_ReturnToTrackDemoCountdown) == 0x000008, "Wrong alignment on FDelMarEvent_ReturnToTrackDemoCountdown");
static_assert(sizeof(FDelMarEvent_ReturnToTrackDemoCountdown) == 0x000008, "Wrong size on FDelMarEvent_ReturnToTrackDemoCountdown");

// ScriptStruct DelMarCore.DelMarVehicleConfig_Kickflip
// 0x0150 (0x0150 - 0x0000)
struct FDelMarVehicleConfig_Kickflip final
{
public:
	float                                         DirectionalSensitivity;                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondaryDirectionalSensitivity;                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowDiagonalKickDirection;                       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumWheelsForLanding;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
