#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "DelMarCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "LinkId_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function DelMarCore.DelMarGhostSessionComponent.IsSessionActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarGhostSessionComponent_IsSessionActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarGhostSessionComponent_IsSessionActive) == 0x000001, "Wrong alignment on DelMarGhostSessionComponent_IsSessionActive");
static_assert(sizeof(DelMarGhostSessionComponent_IsSessionActive) == 0x000001, "Wrong size on DelMarGhostSessionComponent_IsSessionActive");
static_assert(offsetof(DelMarGhostSessionComponent_IsSessionActive, ReturnValue) == 0x000000, "Member 'DelMarGhostSessionComponent_IsSessionActive::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarGhostPlaybackSessionComponent.SetPlaybackLog
// 0x0008 (0x0008 - 0x0000)
struct DelMarGhostPlaybackSessionComponent_SetPlaybackLog final
{
public:
	class UDelMarGhostReplayLog*                  InLog;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarGhostPlaybackSessionComponent_SetPlaybackLog) == 0x000008, "Wrong alignment on DelMarGhostPlaybackSessionComponent_SetPlaybackLog");
static_assert(sizeof(DelMarGhostPlaybackSessionComponent_SetPlaybackLog) == 0x000008, "Wrong size on DelMarGhostPlaybackSessionComponent_SetPlaybackLog");
static_assert(offsetof(DelMarGhostPlaybackSessionComponent_SetPlaybackLog, InLog) == 0x000000, "Member 'DelMarGhostPlaybackSessionComponent_SetPlaybackLog::InLog' has a wrong offset!");

// Function DelMarCore.DelMarAIController.HandleGroundedStateChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarAIController_HandleGroundedStateChanged final
{
public:
	TScriptInterface<class IDelMarVehicleInterface> VehicleRef;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarAIController_HandleGroundedStateChanged) == 0x000008, "Wrong alignment on DelMarAIController_HandleGroundedStateChanged");
static_assert(sizeof(DelMarAIController_HandleGroundedStateChanged) == 0x000018, "Wrong size on DelMarAIController_HandleGroundedStateChanged");
static_assert(offsetof(DelMarAIController_HandleGroundedStateChanged, VehicleRef) == 0x000000, "Member 'DelMarAIController_HandleGroundedStateChanged::VehicleRef' has a wrong offset!");
static_assert(offsetof(DelMarAIController_HandleGroundedStateChanged, bValue) == 0x000010, "Member 'DelMarAIController_HandleGroundedStateChanged::bValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceMusicPlaylistComponent.SetMusicPlaylist
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceMusicPlaylistComponent_SetMusicPlaylist final
{
public:
	class UDelMarRaceMusicPlaylist*               SetPlaylist;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMusic;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceMusicPlaylistComponent_SetMusicPlaylist) == 0x000008, "Wrong alignment on DelMarRaceMusicPlaylistComponent_SetMusicPlaylist");
static_assert(sizeof(DelMarRaceMusicPlaylistComponent_SetMusicPlaylist) == 0x000010, "Wrong size on DelMarRaceMusicPlaylistComponent_SetMusicPlaylist");
static_assert(offsetof(DelMarRaceMusicPlaylistComponent_SetMusicPlaylist, SetPlaylist) == 0x000000, "Member 'DelMarRaceMusicPlaylistComponent_SetMusicPlaylist::SetPlaylist' has a wrong offset!");
static_assert(offsetof(DelMarRaceMusicPlaylistComponent_SetMusicPlaylist, bEnableMusic) == 0x000008, "Member 'DelMarRaceMusicPlaylistComponent_SetMusicPlaylist::bEnableMusic' has a wrong offset!");

// Function DelMarCore.DelMarAIService.GetRegisteredAIBotControllers
// 0x0010 (0x0010 - 0x0000)
struct DelMarAIService_GetRegisteredAIBotControllers final
{
public:
	TArray<class ADelMarAIController*>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarAIService_GetRegisteredAIBotControllers) == 0x000008, "Wrong alignment on DelMarAIService_GetRegisteredAIBotControllers");
static_assert(sizeof(DelMarAIService_GetRegisteredAIBotControllers) == 0x000010, "Wrong size on DelMarAIService_GetRegisteredAIBotControllers");
static_assert(offsetof(DelMarAIService_GetRegisteredAIBotControllers, ReturnValue) == 0x000000, "Member 'DelMarAIService_GetRegisteredAIBotControllers::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarAIService.HandlePlayerRegistered
// 0x0008 (0x0008 - 0x0000)
struct DelMarAIService_HandlePlayerRegistered final
{
public:
	class AFortPlayerState*                       RegisteredPlayerState;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarAIService_HandlePlayerRegistered) == 0x000008, "Wrong alignment on DelMarAIService_HandlePlayerRegistered");
static_assert(sizeof(DelMarAIService_HandlePlayerRegistered) == 0x000008, "Wrong size on DelMarAIService_HandlePlayerRegistered");
static_assert(offsetof(DelMarAIService_HandlePlayerRegistered, RegisteredPlayerState) == 0x000000, "Member 'DelMarAIService_HandlePlayerRegistered::RegisteredPlayerState' has a wrong offset!");

// Function DelMarCore.DelMarAIService.HandlePlayerUnregistered
// 0x0010 (0x0010 - 0x0000)
struct DelMarAIService_HandlePlayerUnregistered final
{
public:
	class AFortPlayerState*                       UnregisteredPlayerState;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarAIService_HandlePlayerUnregistered) == 0x000008, "Wrong alignment on DelMarAIService_HandlePlayerUnregistered");
static_assert(sizeof(DelMarAIService_HandlePlayerUnregistered) == 0x000010, "Wrong size on DelMarAIService_HandlePlayerUnregistered");
static_assert(offsetof(DelMarAIService_HandlePlayerUnregistered, UnregisteredPlayerState) == 0x000000, "Member 'DelMarAIService_HandlePlayerUnregistered::UnregisteredPlayerState' has a wrong offset!");
static_assert(offsetof(DelMarAIService_HandlePlayerUnregistered, bSetAsInactive) == 0x000008, "Member 'DelMarAIService_HandlePlayerUnregistered::bSetAsInactive' has a wrong offset!");

// Function DelMarCore.DelMarAIService.GetMaxNumberOfPlayers
// 0x0004 (0x0004 - 0x0000)
struct DelMarAIService_GetMaxNumberOfPlayers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarAIService_GetMaxNumberOfPlayers) == 0x000004, "Wrong alignment on DelMarAIService_GetMaxNumberOfPlayers");
static_assert(sizeof(DelMarAIService_GetMaxNumberOfPlayers) == 0x000004, "Wrong size on DelMarAIService_GetMaxNumberOfPlayers");
static_assert(offsetof(DelMarAIService_GetMaxNumberOfPlayers, ReturnValue) == 0x000000, "Member 'DelMarAIService_GetMaxNumberOfPlayers::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.FinalizeRegisteredPlayerInitialization
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_FinalizeRegisteredPlayerInitialization final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_FinalizeRegisteredPlayerInitialization) == 0x000008, "Wrong alignment on DelMarRaceManager_FinalizeRegisteredPlayerInitialization");
static_assert(sizeof(DelMarRaceManager_FinalizeRegisteredPlayerInitialization) == 0x000008, "Wrong size on DelMarRaceManager_FinalizeRegisteredPlayerInitialization");
static_assert(offsetof(DelMarRaceManager_FinalizeRegisteredPlayerInitialization, PlayerState) == 0x000000, "Member 'DelMarRaceManager_FinalizeRegisteredPlayerInitialization::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.HandleRegisteredPlayerPawnSet
// 0x0018 (0x0018 - 0x0000)
struct DelMarRaceManager_HandleRegisteredPlayerPawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_HandleRegisteredPlayerPawnSet) == 0x000008, "Wrong alignment on DelMarRaceManager_HandleRegisteredPlayerPawnSet");
static_assert(sizeof(DelMarRaceManager_HandleRegisteredPlayerPawnSet) == 0x000018, "Wrong size on DelMarRaceManager_HandleRegisteredPlayerPawnSet");
static_assert(offsetof(DelMarRaceManager_HandleRegisteredPlayerPawnSet, Player) == 0x000000, "Member 'DelMarRaceManager_HandleRegisteredPlayerPawnSet::Player' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_HandleRegisteredPlayerPawnSet, NewPawn) == 0x000008, "Member 'DelMarRaceManager_HandleRegisteredPlayerPawnSet::NewPawn' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_HandleRegisteredPlayerPawnSet, OldPawn) == 0x000010, "Member 'DelMarRaceManager_HandleRegisteredPlayerPawnSet::OldPawn' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.NetMulticast_FinishRace
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_NetMulticast_FinishRace final
{
public:
	double                                        RaceFinishedTime;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_NetMulticast_FinishRace) == 0x000008, "Wrong alignment on DelMarRaceManager_NetMulticast_FinishRace");
static_assert(sizeof(DelMarRaceManager_NetMulticast_FinishRace) == 0x000008, "Wrong size on DelMarRaceManager_NetMulticast_FinishRace");
static_assert(offsetof(DelMarRaceManager_NetMulticast_FinishRace, RaceFinishedTime) == 0x000000, "Member 'DelMarRaceManager_NetMulticast_FinishRace::RaceFinishedTime' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.NetMulticast_ResetRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_NetMulticast_ResetRace final
{
public:
	bool                                          bNextRound;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_NetMulticast_ResetRace) == 0x000001, "Wrong alignment on DelMarRaceManager_NetMulticast_ResetRace");
static_assert(sizeof(DelMarRaceManager_NetMulticast_ResetRace) == 0x000001, "Wrong size on DelMarRaceManager_NetMulticast_ResetRace");
static_assert(offsetof(DelMarRaceManager_NetMulticast_ResetRace, bNextRound) == 0x000000, "Member 'DelMarRaceManager_NetMulticast_ResetRace::bNextRound' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.NetMulticast_ResetRun
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_NetMulticast_ResetRun final
{
public:
	const class AFortPlayerState*                 InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayerTriggered;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceManager_NetMulticast_ResetRun) == 0x000008, "Wrong alignment on DelMarRaceManager_NetMulticast_ResetRun");
static_assert(sizeof(DelMarRaceManager_NetMulticast_ResetRun) == 0x000010, "Wrong size on DelMarRaceManager_NetMulticast_ResetRun");
static_assert(offsetof(DelMarRaceManager_NetMulticast_ResetRun, InPlayerState) == 0x000000, "Member 'DelMarRaceManager_NetMulticast_ResetRun::InPlayerState' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_NetMulticast_ResetRun, bPlayerTriggered) == 0x000008, "Member 'DelMarRaceManager_NetMulticast_ResetRun::bPlayerTriggered' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.RegisterPlayerController
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RegisterPlayerController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_RegisterPlayerController) == 0x000008, "Wrong alignment on DelMarRaceManager_RegisterPlayerController");
static_assert(sizeof(DelMarRaceManager_RegisterPlayerController) == 0x000008, "Wrong size on DelMarRaceManager_RegisterPlayerController");
static_assert(offsetof(DelMarRaceManager_RegisterPlayerController, InController) == 0x000000, "Member 'DelMarRaceManager_RegisterPlayerController::InController' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.RegisterPlayerState
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RegisterPlayerState final
{
public:
	class AFortPlayerState*                       InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_RegisterPlayerState) == 0x000008, "Wrong alignment on DelMarRaceManager_RegisterPlayerState");
static_assert(sizeof(DelMarRaceManager_RegisterPlayerState) == 0x000008, "Wrong size on DelMarRaceManager_RegisterPlayerState");
static_assert(offsetof(DelMarRaceManager_RegisterPlayerState, InPlayerState) == 0x000000, "Member 'DelMarRaceManager_RegisterPlayerState::InPlayerState' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.RequestStartRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_RequestStartRace final
{
public:
	bool                                          bSkipCountdown;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_RequestStartRace) == 0x000001, "Wrong alignment on DelMarRaceManager_RequestStartRace");
static_assert(sizeof(DelMarRaceManager_RequestStartRace) == 0x000001, "Wrong size on DelMarRaceManager_RequestStartRace");
static_assert(offsetof(DelMarRaceManager_RequestStartRace, bSkipCountdown) == 0x000000, "Member 'DelMarRaceManager_RequestStartRace::bSkipCountdown' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.ResetRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_ResetRace final
{
public:
	bool                                          bIsRoundReset;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_ResetRace) == 0x000001, "Wrong alignment on DelMarRaceManager_ResetRace");
static_assert(sizeof(DelMarRaceManager_ResetRace) == 0x000001, "Wrong size on DelMarRaceManager_ResetRace");
static_assert(offsetof(DelMarRaceManager_ResetRace, bIsRoundReset) == 0x000000, "Member 'DelMarRaceManager_ResetRace::bIsRoundReset' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.ResetRun
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_ResetRun final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayerTriggered;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceManager_ResetRun) == 0x000008, "Wrong alignment on DelMarRaceManager_ResetRun");
static_assert(sizeof(DelMarRaceManager_ResetRun) == 0x000010, "Wrong size on DelMarRaceManager_ResetRun");
static_assert(offsetof(DelMarRaceManager_ResetRun, PlayerState) == 0x000000, "Member 'DelMarRaceManager_ResetRun::PlayerState' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_ResetRun, bPlayerTriggered) == 0x000008, "Member 'DelMarRaceManager_ResetRun::bPlayerTriggered' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.SetActiveRaceLevelConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetActiveRaceLevelConfig final
{
public:
	class ADelMarRaceLevelConfig*                 InRaceLevelConfig;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_SetActiveRaceLevelConfig) == 0x000008, "Wrong alignment on DelMarRaceManager_SetActiveRaceLevelConfig");
static_assert(sizeof(DelMarRaceManager_SetActiveRaceLevelConfig) == 0x000008, "Wrong size on DelMarRaceManager_SetActiveRaceLevelConfig");
static_assert(offsetof(DelMarRaceManager_SetActiveRaceLevelConfig, InRaceLevelConfig) == 0x000000, "Member 'DelMarRaceManager_SetActiveRaceLevelConfig::InRaceLevelConfig' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.SetPlayerAsSpectator
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetPlayerAsSpectator final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_SetPlayerAsSpectator) == 0x000008, "Wrong alignment on DelMarRaceManager_SetPlayerAsSpectator");
static_assert(sizeof(DelMarRaceManager_SetPlayerAsSpectator) == 0x000008, "Wrong size on DelMarRaceManager_SetPlayerAsSpectator");
static_assert(offsetof(DelMarRaceManager_SetPlayerAsSpectator, PlayerState) == 0x000000, "Member 'DelMarRaceManager_SetPlayerAsSpectator::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.SetSpectatorAsPlayer
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetSpectatorAsPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_SetSpectatorAsPlayer) == 0x000008, "Wrong alignment on DelMarRaceManager_SetSpectatorAsPlayer");
static_assert(sizeof(DelMarRaceManager_SetSpectatorAsPlayer) == 0x000008, "Wrong size on DelMarRaceManager_SetSpectatorAsPlayer");
static_assert(offsetof(DelMarRaceManager_SetSpectatorAsPlayer, PlayerState) == 0x000000, "Member 'DelMarRaceManager_SetSpectatorAsPlayer::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.UnregisterAllPlayers
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_UnregisterAllPlayers final
{
public:
	bool                                          bSetAsInactive;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_UnregisterAllPlayers) == 0x000001, "Wrong alignment on DelMarRaceManager_UnregisterAllPlayers");
static_assert(sizeof(DelMarRaceManager_UnregisterAllPlayers) == 0x000001, "Wrong size on DelMarRaceManager_UnregisterAllPlayers");
static_assert(offsetof(DelMarRaceManager_UnregisterAllPlayers, bSetAsInactive) == 0x000000, "Member 'DelMarRaceManager_UnregisterAllPlayers::bSetAsInactive' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.UnregisterPlayerController
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_UnregisterPlayerController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceManager_UnregisterPlayerController) == 0x000008, "Wrong alignment on DelMarRaceManager_UnregisterPlayerController");
static_assert(sizeof(DelMarRaceManager_UnregisterPlayerController) == 0x000010, "Wrong size on DelMarRaceManager_UnregisterPlayerController");
static_assert(offsetof(DelMarRaceManager_UnregisterPlayerController, InController) == 0x000000, "Member 'DelMarRaceManager_UnregisterPlayerController::InController' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_UnregisterPlayerController, bSetAsInactive) == 0x000008, "Member 'DelMarRaceManager_UnregisterPlayerController::bSetAsInactive' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.UnregisterPlayerState
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_UnregisterPlayerState final
{
public:
	class AFortPlayerState*                       InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceManager_UnregisterPlayerState) == 0x000008, "Wrong alignment on DelMarRaceManager_UnregisterPlayerState");
static_assert(sizeof(DelMarRaceManager_UnregisterPlayerState) == 0x000010, "Wrong size on DelMarRaceManager_UnregisterPlayerState");
static_assert(offsetof(DelMarRaceManager_UnregisterPlayerState, InPlayerState) == 0x000000, "Member 'DelMarRaceManager_UnregisterPlayerState::InPlayerState' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_UnregisterPlayerState, bSetAsInactive) == 0x000008, "Member 'DelMarRaceManager_UnregisterPlayerState::bSetAsInactive' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetActiveRaceLevelConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetActiveRaceLevelConfig final
{
public:
	class ADelMarRaceLevelConfig*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetActiveRaceLevelConfig) == 0x000008, "Wrong alignment on DelMarRaceManager_GetActiveRaceLevelConfig");
static_assert(sizeof(DelMarRaceManager_GetActiveRaceLevelConfig) == 0x000008, "Wrong size on DelMarRaceManager_GetActiveRaceLevelConfig");
static_assert(offsetof(DelMarRaceManager_GetActiveRaceLevelConfig, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetActiveRaceLevelConfig::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetActiveRacers
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetActiveRacers final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetActiveRacers) == 0x000008, "Wrong alignment on DelMarRaceManager_GetActiveRacers");
static_assert(sizeof(DelMarRaceManager_GetActiveRacers) == 0x000010, "Wrong size on DelMarRaceManager_GetActiveRacers");
static_assert(offsetof(DelMarRaceManager_GetActiveRacers, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetActiveRacers::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetCurrentRaceMode
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_GetCurrentRaceMode final
{
public:
	EDelMarRaceMode                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetCurrentRaceMode) == 0x000001, "Wrong alignment on DelMarRaceManager_GetCurrentRaceMode");
static_assert(sizeof(DelMarRaceManager_GetCurrentRaceMode) == 0x000001, "Wrong size on DelMarRaceManager_GetCurrentRaceMode");
static_assert(offsetof(DelMarRaceManager_GetCurrentRaceMode, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetCurrentRaceMode::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetCurrentSpawnMode
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_GetCurrentSpawnMode final
{
public:
	EDelMarRaceSpawnMode                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetCurrentSpawnMode) == 0x000001, "Wrong alignment on DelMarRaceManager_GetCurrentSpawnMode");
static_assert(sizeof(DelMarRaceManager_GetCurrentSpawnMode) == 0x000001, "Wrong size on DelMarRaceManager_GetCurrentSpawnMode");
static_assert(offsetof(DelMarRaceManager_GetCurrentSpawnMode, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetCurrentSpawnMode::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetEliminationManagerComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetEliminationManagerComponent final
{
public:
	class UDelMarEliminationRaceManagerComponent* ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetEliminationManagerComponent) == 0x000008, "Wrong alignment on DelMarRaceManager_GetEliminationManagerComponent");
static_assert(sizeof(DelMarRaceManager_GetEliminationManagerComponent) == 0x000008, "Wrong size on DelMarRaceManager_GetEliminationManagerComponent");
static_assert(offsetof(DelMarRaceManager_GetEliminationManagerComponent, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetEliminationManagerComponent::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetManagedPlayerStatesArray
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetManagedPlayerStatesArray final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetManagedPlayerStatesArray) == 0x000008, "Wrong alignment on DelMarRaceManager_GetManagedPlayerStatesArray");
static_assert(sizeof(DelMarRaceManager_GetManagedPlayerStatesArray) == 0x000010, "Wrong size on DelMarRaceManager_GetManagedPlayerStatesArray");
static_assert(offsetof(DelMarRaceManager_GetManagedPlayerStatesArray, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetManagedPlayerStatesArray::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetNumberOfLapsForRace
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceManager_GetNumberOfLapsForRace final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetNumberOfLapsForRace) == 0x000004, "Wrong alignment on DelMarRaceManager_GetNumberOfLapsForRace");
static_assert(sizeof(DelMarRaceManager_GetNumberOfLapsForRace) == 0x000004, "Wrong size on DelMarRaceManager_GetNumberOfLapsForRace");
static_assert(offsetof(DelMarRaceManager_GetNumberOfLapsForRace, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetNumberOfLapsForRace::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetNumInactiveRacers
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceManager_GetNumInactiveRacers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetNumInactiveRacers) == 0x000004, "Wrong alignment on DelMarRaceManager_GetNumInactiveRacers");
static_assert(sizeof(DelMarRaceManager_GetNumInactiveRacers) == 0x000004, "Wrong size on DelMarRaceManager_GetNumInactiveRacers");
static_assert(offsetof(DelMarRaceManager_GetNumInactiveRacers, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetNumInactiveRacers::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetPositionalTracker
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetPositionalTracker final
{
public:
	class UDelMarPositionalTrackerComponent*      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetPositionalTracker) == 0x000008, "Wrong alignment on DelMarRaceManager_GetPositionalTracker");
static_assert(sizeof(DelMarRaceManager_GetPositionalTracker) == 0x000008, "Wrong size on DelMarRaceManager_GetPositionalTracker");
static_assert(offsetof(DelMarRaceManager_GetPositionalTracker, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetPositionalTracker::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetRaceConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRaceConfig final
{
public:
	class UDelMarRaceConfigComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetRaceConfig) == 0x000008, "Wrong alignment on DelMarRaceManager_GetRaceConfig");
static_assert(sizeof(DelMarRaceManager_GetRaceConfig) == 0x000008, "Wrong size on DelMarRaceManager_GetRaceConfig");
static_assert(offsetof(DelMarRaceManager_GetRaceConfig, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetRaceConfig::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetRespawnManagerComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRespawnManagerComponent final
{
public:
	class UDelMarRespawnManagerComponent*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetRespawnManagerComponent) == 0x000008, "Wrong alignment on DelMarRaceManager_GetRespawnManagerComponent");
static_assert(sizeof(DelMarRaceManager_GetRespawnManagerComponent) == 0x000008, "Wrong size on DelMarRaceManager_GetRespawnManagerComponent");
static_assert(offsetof(DelMarRaceManager_GetRespawnManagerComponent, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetRespawnManagerComponent::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetRubberbandingManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRubberbandingManager final
{
public:
	class UDelMarRubberbandingManagerComponent*   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetRubberbandingManager) == 0x000008, "Wrong alignment on DelMarRaceManager_GetRubberbandingManager");
static_assert(sizeof(DelMarRaceManager_GetRubberbandingManager) == 0x000008, "Wrong size on DelMarRaceManager_GetRubberbandingManager");
static_assert(offsetof(DelMarRaceManager_GetRubberbandingManager, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetRubberbandingManager::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetSpectators
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetSpectators final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetSpectators) == 0x000008, "Wrong alignment on DelMarRaceManager_GetSpectators");
static_assert(sizeof(DelMarRaceManager_GetSpectators) == 0x000010, "Wrong size on DelMarRaceManager_GetSpectators");
static_assert(offsetof(DelMarRaceManager_GetSpectators, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetSpectators::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.GetTimeManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetTimeManager final
{
public:
	class UDelMarTimeManagerComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_GetTimeManager) == 0x000008, "Wrong alignment on DelMarRaceManager_GetTimeManager");
static_assert(sizeof(DelMarRaceManager_GetTimeManager) == 0x000008, "Wrong size on DelMarRaceManager_GetTimeManager");
static_assert(offsetof(DelMarRaceManager_GetTimeManager, ReturnValue) == 0x000000, "Member 'DelMarRaceManager_GetTimeManager::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.IsActiveRacer
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_IsActiveRacer final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceManager_IsActiveRacer) == 0x000008, "Wrong alignment on DelMarRaceManager_IsActiveRacer");
static_assert(sizeof(DelMarRaceManager_IsActiveRacer) == 0x000010, "Wrong size on DelMarRaceManager_IsActiveRacer");
static_assert(offsetof(DelMarRaceManager_IsActiveRacer, PlayerState) == 0x000000, "Member 'DelMarRaceManager_IsActiveRacer::PlayerState' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_IsActiveRacer, ReturnValue) == 0x000008, "Member 'DelMarRaceManager_IsActiveRacer::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.IsSpectator
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_IsSpectator final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarRaceManager_IsSpectator) == 0x000008, "Wrong alignment on DelMarRaceManager_IsSpectator");
static_assert(sizeof(DelMarRaceManager_IsSpectator) == 0x000010, "Wrong size on DelMarRaceManager_IsSpectator");
static_assert(offsetof(DelMarRaceManager_IsSpectator, PlayerState) == 0x000000, "Member 'DelMarRaceManager_IsSpectator::PlayerState' has a wrong offset!");
static_assert(offsetof(DelMarRaceManager_IsSpectator, ReturnValue) == 0x000008, "Member 'DelMarRaceManager_IsSpectator::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManager.RequestCountdownForPlayer
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RequestCountdownForPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManager_RequestCountdownForPlayer) == 0x000008, "Wrong alignment on DelMarRaceManager_RequestCountdownForPlayer");
static_assert(sizeof(DelMarRaceManager_RequestCountdownForPlayer) == 0x000008, "Wrong size on DelMarRaceManager_RequestCountdownForPlayer");
static_assert(offsetof(DelMarRaceManager_RequestCountdownForPlayer, PlayerState) == 0x000000, "Member 'DelMarRaceManager_RequestCountdownForPlayer::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarTutorialRaceManager.NetMulticast_TutorialSectionChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrevSectionIndex;                                  // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged) == 0x000008, "Wrong alignment on DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged");
static_assert(sizeof(DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged) == 0x000010, "Wrong size on DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged");
static_assert(offsetof(DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged, PlayerState) == 0x000000, "Member 'DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged, SectionIndex) == 0x000008, "Member 'DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged::SectionIndex' has a wrong offset!");
static_assert(offsetof(DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged, PrevSectionIndex) == 0x00000C, "Member 'DelMarTutorialRaceManager_NetMulticast_TutorialSectionChanged::PrevSectionIndex' has a wrong offset!");

// Function DelMarCore.DelMarTutorialRaceManager.RequestNextTutorialSection
// 0x0008 (0x0008 - 0x0000)
struct DelMarTutorialRaceManager_RequestNextTutorialSection final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTutorialRaceManager_RequestNextTutorialSection) == 0x000008, "Wrong alignment on DelMarTutorialRaceManager_RequestNextTutorialSection");
static_assert(sizeof(DelMarTutorialRaceManager_RequestNextTutorialSection) == 0x000008, "Wrong size on DelMarTutorialRaceManager_RequestNextTutorialSection");
static_assert(offsetof(DelMarTutorialRaceManager_RequestNextTutorialSection, PlayerState) == 0x000000, "Member 'DelMarTutorialRaceManager_RequestNextTutorialSection::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarTutorialRaceManager.RequestPrevTutorialSection
// 0x0008 (0x0008 - 0x0000)
struct DelMarTutorialRaceManager_RequestPrevTutorialSection final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTutorialRaceManager_RequestPrevTutorialSection) == 0x000008, "Wrong alignment on DelMarTutorialRaceManager_RequestPrevTutorialSection");
static_assert(sizeof(DelMarTutorialRaceManager_RequestPrevTutorialSection) == 0x000008, "Wrong size on DelMarTutorialRaceManager_RequestPrevTutorialSection");
static_assert(offsetof(DelMarTutorialRaceManager_RequestPrevTutorialSection, PlayerState) == 0x000000, "Member 'DelMarTutorialRaceManager_RequestPrevTutorialSection::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarTutorialRaceManager.SetCurrentTutorialSection
// 0x0010 (0x0010 - 0x0000)
struct DelMarTutorialRaceManager_SetCurrentTutorialSection final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       PlayerState;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarTutorialRaceManager_SetCurrentTutorialSection) == 0x000008, "Wrong alignment on DelMarTutorialRaceManager_SetCurrentTutorialSection");
static_assert(sizeof(DelMarTutorialRaceManager_SetCurrentTutorialSection) == 0x000010, "Wrong size on DelMarTutorialRaceManager_SetCurrentTutorialSection");
static_assert(offsetof(DelMarTutorialRaceManager_SetCurrentTutorialSection, SectionIndex) == 0x000000, "Member 'DelMarTutorialRaceManager_SetCurrentTutorialSection::SectionIndex' has a wrong offset!");
static_assert(offsetof(DelMarTutorialRaceManager_SetCurrentTutorialSection, PlayerState) == 0x000008, "Member 'DelMarTutorialRaceManager_SetCurrentTutorialSection::PlayerState' has a wrong offset!");

// Function DelMarCore.DelMarSpeedUpDevice.OnBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct DelMarSpeedUpDevice_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarSpeedUpDevice_OnBeginOverlap) == 0x000008, "Wrong alignment on DelMarSpeedUpDevice_OnBeginOverlap");
static_assert(sizeof(DelMarSpeedUpDevice_OnBeginOverlap) == 0x000108, "Wrong size on DelMarSpeedUpDevice_OnBeginOverlap");
static_assert(offsetof(DelMarSpeedUpDevice_OnBeginOverlap, OverlappedComponent) == 0x000000, "Member 'DelMarSpeedUpDevice_OnBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(DelMarSpeedUpDevice_OnBeginOverlap, OtherActor) == 0x000008, "Member 'DelMarSpeedUpDevice_OnBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(DelMarSpeedUpDevice_OnBeginOverlap, OtherComp) == 0x000010, "Member 'DelMarSpeedUpDevice_OnBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(DelMarSpeedUpDevice_OnBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'DelMarSpeedUpDevice_OnBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(DelMarSpeedUpDevice_OnBeginOverlap, bFromSweep) == 0x00001C, "Member 'DelMarSpeedUpDevice_OnBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(DelMarSpeedUpDevice_OnBeginOverlap, SweepResult) == 0x000020, "Member 'DelMarSpeedUpDevice_OnBeginOverlap::SweepResult' has a wrong offset!");

// Function DelMarCore.DelMarSpeedUpDevice.ShouldGrantSpeedEffect
// 0x0010 (0x0010 - 0x0000)
struct DelMarSpeedUpDevice_ShouldGrantSpeedEffect final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarSpeedUpDevice_ShouldGrantSpeedEffect) == 0x000008, "Wrong alignment on DelMarSpeedUpDevice_ShouldGrantSpeedEffect");
static_assert(sizeof(DelMarSpeedUpDevice_ShouldGrantSpeedEffect) == 0x000010, "Wrong size on DelMarSpeedUpDevice_ShouldGrantSpeedEffect");
static_assert(offsetof(DelMarSpeedUpDevice_ShouldGrantSpeedEffect, OtherActor) == 0x000000, "Member 'DelMarSpeedUpDevice_ShouldGrantSpeedEffect::OtherActor' has a wrong offset!");
static_assert(offsetof(DelMarSpeedUpDevice_ShouldGrantSpeedEffect, ReturnValue) == 0x000008, "Member 'DelMarSpeedUpDevice_ShouldGrantSpeedEffect::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandleFinalRacePositionsChanged
// 0x0060 (0x0060 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged final
{
public:
	TArray<struct FDelMarFinalRacePositionEntry>  FinalRacePositions;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDelMarEvent_RunRecorded               RecordedRun;                                       // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged) == 0x000008, "Wrong alignment on DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged");
static_assert(sizeof(DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged) == 0x000060, "Wrong size on DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged");
static_assert(offsetof(DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged, FinalRacePositions) == 0x000000, "Member 'DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged::FinalRacePositions' has a wrong offset!");
static_assert(offsetof(DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged, RecordedRun) == 0x000010, "Member 'DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged::RecordedRun' has a wrong offset!");

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandlePlayerLapCompleted
// 0x0020 (0x0020 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted final
{
public:
	struct FDelMarEvent_LapComplete               LapCompleteEvent;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted) == 0x000008, "Wrong alignment on DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted");
static_assert(sizeof(DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted) == 0x000020, "Wrong size on DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted");
static_assert(offsetof(DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted, LapCompleteEvent) == 0x000000, "Member 'DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted::LapCompleteEvent' has a wrong offset!");

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandlePlayerPositionsChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged final
{
public:
	TArray<class AFortPlayerState*>               RacePositions;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged) == 0x000008, "Wrong alignment on DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged");
static_assert(sizeof(DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged) == 0x000010, "Wrong size on DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged");
static_assert(offsetof(DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged, RacePositions) == 0x000000, "Member 'DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged::RacePositions' has a wrong offset!");

// Function DelMarCore.DelMarBTTask_DriveTrack.HandleVehicleGroundedStateChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged final
{
public:
	TScriptInterface<class IDelMarVehicleInterface> VehicleRef;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged) == 0x000008, "Wrong alignment on DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged");
static_assert(sizeof(DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged) == 0x000018, "Wrong size on DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged");
static_assert(offsetof(DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged, VehicleRef) == 0x000000, "Member 'DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged::VehicleRef' has a wrong offset!");
static_assert(offsetof(DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged, bValue) == 0x000010, "Member 'DelMarBTTask_DriveTrack_HandleVehicleGroundedStateChanged::bValue' has a wrong offset!");

// Function DelMarCore.DelMarBTTask_DriveTrack.TurboBonusZoneStateChanged
// 0x0001 (0x0001 - 0x0000)
struct DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged final
{
public:
	EDelMarTurboZoneState                         NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged) == 0x000001, "Wrong alignment on DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged");
static_assert(sizeof(DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged) == 0x000001, "Wrong size on DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged");
static_assert(offsetof(DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged, NewState) == 0x000000, "Member 'DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged::NewState' has a wrong offset!");

// Function DelMarCore.DelMarChallengeRaceManager.NetMulticast_StartOvertime
// 0x0008 (0x0008 - 0x0000)
struct DelMarChallengeRaceManager_NetMulticast_StartOvertime final
{
public:
	double                                        RaceFinishTimestamp;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarChallengeRaceManager_NetMulticast_StartOvertime) == 0x000008, "Wrong alignment on DelMarChallengeRaceManager_NetMulticast_StartOvertime");
static_assert(sizeof(DelMarChallengeRaceManager_NetMulticast_StartOvertime) == 0x000008, "Wrong size on DelMarChallengeRaceManager_NetMulticast_StartOvertime");
static_assert(offsetof(DelMarChallengeRaceManager_NetMulticast_StartOvertime, RaceFinishTimestamp) == 0x000000, "Member 'DelMarChallengeRaceManager_NetMulticast_StartOvertime::RaceFinishTimestamp' has a wrong offset!");

// Function DelMarCore.DelMarStateMachine.RequestState
// 0x0004 (0x0004 - 0x0000)
struct DelMarStateMachine_RequestState final
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarStateMachine_RequestState) == 0x000004, "Wrong alignment on DelMarStateMachine_RequestState");
static_assert(sizeof(DelMarStateMachine_RequestState) == 0x000004, "Wrong size on DelMarStateMachine_RequestState");
static_assert(offsetof(DelMarStateMachine_RequestState, StateTag) == 0x000000, "Member 'DelMarStateMachine_RequestState::StateTag' has a wrong offset!");

// Function DelMarCore.DelMarStateMachine.GetActiveStateByTag
// 0x0010 (0x0010 - 0x0000)
struct DelMarStateMachine_GetActiveStateByTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarState*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarStateMachine_GetActiveStateByTag) == 0x000008, "Wrong alignment on DelMarStateMachine_GetActiveStateByTag");
static_assert(sizeof(DelMarStateMachine_GetActiveStateByTag) == 0x000010, "Wrong size on DelMarStateMachine_GetActiveStateByTag");
static_assert(offsetof(DelMarStateMachine_GetActiveStateByTag, GameplayTag) == 0x000000, "Member 'DelMarStateMachine_GetActiveStateByTag::GameplayTag' has a wrong offset!");
static_assert(offsetof(DelMarStateMachine_GetActiveStateByTag, ReturnValue) == 0x000008, "Member 'DelMarStateMachine_GetActiveStateByTag::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarStateMachine.GetCurrentState
// 0x0008 (0x0008 - 0x0000)
struct DelMarStateMachine_GetCurrentState final
{
public:
	class UDelMarState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DelMarStateMachine_GetCurrentState) == 0x000008, "Wrong alignment on DelMarStateMachine_GetCurrentState");
static_assert(sizeof(DelMarStateMachine_GetCurrentState) == 0x000008, "Wrong size on DelMarStateMachine_GetCurrentState");
static_assert(offsetof(DelMarStateMachine_GetCurrentState, ReturnValue) == 0x000000, "Member 'DelMarStateMachine_GetCurrentState::ReturnValue' has a wrong offset!");

// Function DelMarCore.DelMarStateMachine.GetCurrentStateTag
// 0x0004 (0x0004 - 0x0000)
struct DelMarStateMachine_GetCurrentStateTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
