#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoverLibraryView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoverLibraryView.DiscoverLibraryView_C
// 0x00A0 (0x04A0 - 0x0400)
class UDiscoverLibraryView_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortDiscoverSurfaceViewModel*          FortDiscoverSurfaceViewModel;                      // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_BackToTopHackForBottomBar;                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptureForPostBufferUpdate_C*      CaptureForPostBufferUpdate;                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HeaderSoftEdge;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingResults_Spinner;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_HasResultsEnum;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TileContainerOverlay;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortActivityTileView*                  TileView_LibraryResults;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discovery_BlankTiles_RoundedCorners_C* WBP_Discovery_BlankTiles_RoundedCorners;           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingMorePages_C*                WBP_LoadingMorePages;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_C*                      WBP_UIKit_Tabs_LIBRARY;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Throbber_C*                  WBP_UIKit_Throbber;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    No_Input_Action_Row;                               // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Back_To_Top_Input_Action_Row;                      // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class USoundBase*                             IntroWhooshSound;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousSelectedTileIndex;                         // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_DiscoverLibraryView(int32 EntryPoint);
	void FillOutTileViewData();
	void OnItemInitialized(class UObject* Item, class UUserWidget* Widget);
	void OnQueryingMorePages(bool IsQueryingNewPages);
	void OnTabSelectedSwitchContent(class FName TabID);
	void OnTileViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnUpdateProviders(TArray<class UFortDiscoverProviderViewModel*>& ProvidersVM);
	void PopulateTabs();
	void PreConstruct(bool IsDesignTime);
	void SetFavoritesHeaderText();
	void SetFavoritesNoResultsText();
	void SetNoResultsAndHeaderText(int32 SelectedTabIndex);
	void SetRecentlyPlayedHeaderText();
	void SetRecentlyPlayedNoResultsText();
	void TopLevelTabChanged(const EFortUIFeature LeavingFeature, const EFortUIFeature EnteringFeature);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void OnUpdateNew(TArray<class UFortDiscoverProviderViewModel*>& ProviderOuterArrayVM, int32 OuterIndex, TArray<class UFortActivityViewModel*>* InnerArray) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoverLibraryView_C">();
	}
	static class UDiscoverLibraryView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverLibraryView_C>();
	}
};
static_assert(alignof(UDiscoverLibraryView_C) == 0x000008, "Wrong alignment on UDiscoverLibraryView_C");
static_assert(sizeof(UDiscoverLibraryView_C) == 0x0004A0, "Wrong size on UDiscoverLibraryView_C");
static_assert(offsetof(UDiscoverLibraryView_C, UberGraphFrame) == 0x000400, "Member 'UDiscoverLibraryView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, FortDiscoverSurfaceViewModel) == 0x000408, "Member 'UDiscoverLibraryView_C::FortDiscoverSurfaceViewModel' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, Button_BackToTopHackForBottomBar) == 0x000410, "Member 'UDiscoverLibraryView_C::Button_BackToTopHackForBottomBar' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, CaptureForPostBufferUpdate) == 0x000418, "Member 'UDiscoverLibraryView_C::CaptureForPostBufferUpdate' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, HeaderText) == 0x000420, "Member 'UDiscoverLibraryView_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, Image_HeaderSoftEdge) == 0x000428, "Member 'UDiscoverLibraryView_C::Image_HeaderSoftEdge' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, LoadingResults_Spinner) == 0x000430, "Member 'UDiscoverLibraryView_C::LoadingResults_Spinner' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, Switcher_HasResultsEnum) == 0x000438, "Member 'UDiscoverLibraryView_C::Switcher_HasResultsEnum' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, TileContainerOverlay) == 0x000440, "Member 'UDiscoverLibraryView_C::TileContainerOverlay' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, TileView_LibraryResults) == 0x000448, "Member 'UDiscoverLibraryView_C::TileView_LibraryResults' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, WBP_Discovery_BlankTiles_RoundedCorners) == 0x000450, "Member 'UDiscoverLibraryView_C::WBP_Discovery_BlankTiles_RoundedCorners' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, WBP_LoadingMorePages) == 0x000458, "Member 'UDiscoverLibraryView_C::WBP_LoadingMorePages' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, WBP_UIKit_Tabs_LIBRARY) == 0x000460, "Member 'UDiscoverLibraryView_C::WBP_UIKit_Tabs_LIBRARY' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, WBP_UIKit_Throbber) == 0x000468, "Member 'UDiscoverLibraryView_C::WBP_UIKit_Throbber' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, No_Input_Action_Row) == 0x000470, "Member 'UDiscoverLibraryView_C::No_Input_Action_Row' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, Back_To_Top_Input_Action_Row) == 0x000480, "Member 'UDiscoverLibraryView_C::Back_To_Top_Input_Action_Row' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, IntroWhooshSound) == 0x000490, "Member 'UDiscoverLibraryView_C::IntroWhooshSound' has a wrong offset!");
static_assert(offsetof(UDiscoverLibraryView_C, PreviousSelectedTileIndex) == 0x000498, "Member 'UDiscoverLibraryView_C::PreviousSelectedTileIndex' has a wrong offset!");

}

