#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoverLibraryView

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DiscoverLibraryView.DiscoverLibraryView_C.BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_Button_BackToTopHackForBottomBar_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'DiscoverLibraryView_C_BndEvt__DiscoverLibraryView_TileView_LibraryResults_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.ExecuteUbergraph_DiscoverLibraryView
// 0x0188 (0x0188 - 0x0000)
struct DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedTabIndex_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Item, class UUserWidget* Widget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ItemOffset;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DistanceRemaining;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TabID)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabIndexByID_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedTabIndex_ReturnValue_1;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDiscoverProviderViewModel*         CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDiscoverProviderViewModel*         CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedTabIndex_ReturnValue_2;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDiscoverProviderViewModel*         CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldQueryOnConstruct_ReturnValue;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeature                                K2Node_CustomEvent_LeavingFeature;                 // 0x00E1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeature                                K2Node_CustomEvent_EnteringFeature;                // 0x00E2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortUIFeature LeavingFeature, EFortUIFeature EnteringFeature)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedTabIndex_ReturnValue_3;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_4;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IslandTile_Minimal_C*              K2Node_DynamicCast_AsWBP_Island_Tile_Minimal;      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDiscoverProviderViewModel*         CallFunc_Array_Get_Item_3;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEntryWidth_ReturnValue;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEntryHeight_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldQueryOnConstruct_ReturnValue_1;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldQueryOnConstruct_ReturnValue_2;     // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldQueryOnConstruct_ReturnValue_3;     // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float ItemOffset, float DistanceRemaining)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0154(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView");
static_assert(sizeof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView) == 0x000188, "Wrong size on DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, EntryPoint) == 0x000000, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::EntryPoint' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetSelectedTabIndex_ReturnValue) == 0x000004, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetSelectedTabIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_Item) == 0x000010, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_Widget) == 0x000018, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SelectInt_ReturnValue) == 0x000020, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetIndexForItem_ReturnValue) == 0x000030, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_ItemOffset) == 0x000040, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_ItemOffset' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_DistanceRemaining) == 0x000044, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_DistanceRemaining' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Abs_ReturnValue) == 0x000058, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_FCeil_ReturnValue) == 0x000060, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_TabId) == 0x00007C, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_TabId' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetTabIndexByID_ReturnValue) == 0x000080, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetTabIndexByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SpawnSound2D_ReturnValue) == 0x000090, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_Event_IsDesignTime) == 0x000098, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetSelectedTabIndex_ReturnValue_1) == 0x00009C, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetSelectedTabIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A0, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SelectInt_ReturnValue_1) == 0x0000A4, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SelectInt_ReturnValue_2) == 0x0000B0, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetSelectedTabIndex_ReturnValue_2) == 0x0000C0, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetSelectedTabIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x0000C8, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000D0, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SelectInt_ReturnValue_3) == 0x0000D4, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_ShouldQueryOnConstruct_ReturnValue) == 0x0000E0, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_ShouldQueryOnConstruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_LeavingFeature) == 0x0000E1, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_LeavingFeature' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CustomEvent_EnteringFeature) == 0x0000E2, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CustomEvent_EnteringFeature' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E3, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E4, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000F0, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetSelectedTabIndex_ReturnValue_3) == 0x0000F4, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetSelectedTabIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000F8, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_ComponentBoundEvent_Widget) == 0x000100, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SelectInt_ReturnValue_4) == 0x000108, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SelectInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_DynamicCast_AsWBP_Island_Tile_Minimal) == 0x000110, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_DynamicCast_AsWBP_Island_Tile_Minimal' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Array_Get_Item_3) == 0x000120, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetEntryWidth_ReturnValue) == 0x000128, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetEntryWidth_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_GetEntryHeight_ReturnValue) == 0x00012C, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_GetEntryHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_MakeArray_Array) == 0x000130, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_MakeVector2D_ReturnValue) == 0x000140, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_ShouldQueryOnConstruct_ReturnValue_1) == 0x000150, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_ShouldQueryOnConstruct_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_ShouldQueryOnConstruct_ReturnValue_2) == 0x000151, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_ShouldQueryOnConstruct_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000152, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_ShouldQueryOnConstruct_ReturnValue_3) == 0x000153, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_ShouldQueryOnConstruct_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, K2Node_CreateDelegate_OutputDelegate_3) == 0x000154, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000168, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000170, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000178, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000180, "Member 'DiscoverLibraryView_C_ExecuteUbergraph_DiscoverLibraryView::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.FillOutTileViewData
// 0x0038 (0x0038 - 0x0000)
struct DiscoverLibraryView_C_FillOutTileViewData final
{
public:
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedTabIndex_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDiscoverProviderViewModel*         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_FillOutTileViewData) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_FillOutTileViewData");
static_assert(sizeof(DiscoverLibraryView_C_FillOutTileViewData) == 0x000038, "Wrong size on DiscoverLibraryView_C_FillOutTileViewData");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000000, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_GetIndexForItem_ReturnValue) == 0x000008, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_GetSelectedTabIndex_ReturnValue) == 0x00000C, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_GetSelectedTabIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_GetItemAt_ReturnValue) == 0x000018, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_SelectInt_ReturnValue) == 0x000020, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000024, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_Array_Get_Item) == 0x000028, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_FillOutTileViewData, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x000030, "Member 'DiscoverLibraryView_C_FillOutTileViewData::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.OnItemInitialized
// 0x0010 (0x0010 - 0x0000)
struct DiscoverLibraryView_C_OnItemInitialized final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_OnItemInitialized) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_OnItemInitialized");
static_assert(sizeof(DiscoverLibraryView_C_OnItemInitialized) == 0x000010, "Wrong size on DiscoverLibraryView_C_OnItemInitialized");
static_assert(offsetof(DiscoverLibraryView_C_OnItemInitialized, Item) == 0x000000, "Member 'DiscoverLibraryView_C_OnItemInitialized::Item' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnItemInitialized, Widget) == 0x000008, "Member 'DiscoverLibraryView_C_OnItemInitialized::Widget' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.OnQueryingMorePages
// 0x0005 (0x0005 - 0x0000)
struct DiscoverLibraryView_C_OnQueryingMorePages final
{
public:
	bool                                          IsQueryingNewPages;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_OnQueryingMorePages) == 0x000001, "Wrong alignment on DiscoverLibraryView_C_OnQueryingMorePages");
static_assert(sizeof(DiscoverLibraryView_C_OnQueryingMorePages) == 0x000005, "Wrong size on DiscoverLibraryView_C_OnQueryingMorePages");
static_assert(offsetof(DiscoverLibraryView_C_OnQueryingMorePages, IsQueryingNewPages) == 0x000000, "Member 'DiscoverLibraryView_C_OnQueryingMorePages::IsQueryingNewPages' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnQueryingMorePages, Temp_bool_Variable) == 0x000001, "Member 'DiscoverLibraryView_C_OnQueryingMorePages::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnQueryingMorePages, Temp_byte_Variable) == 0x000002, "Member 'DiscoverLibraryView_C_OnQueryingMorePages::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnQueryingMorePages, Temp_byte_Variable_1) == 0x000003, "Member 'DiscoverLibraryView_C_OnQueryingMorePages::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnQueryingMorePages, K2Node_Select_Default) == 0x000004, "Member 'DiscoverLibraryView_C_OnQueryingMorePages::K2Node_Select_Default' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.OnTabSelectedSwitchContent
// 0x0004 (0x0004 - 0x0000)
struct DiscoverLibraryView_C_OnTabSelectedSwitchContent final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_OnTabSelectedSwitchContent) == 0x000004, "Wrong alignment on DiscoverLibraryView_C_OnTabSelectedSwitchContent");
static_assert(sizeof(DiscoverLibraryView_C_OnTabSelectedSwitchContent) == 0x000004, "Wrong size on DiscoverLibraryView_C_OnTabSelectedSwitchContent");
static_assert(offsetof(DiscoverLibraryView_C_OnTabSelectedSwitchContent, TabID) == 0x000000, "Member 'DiscoverLibraryView_C_OnTabSelectedSwitchContent::TabID' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.OnTileViewScrolled
// 0x0008 (0x0008 - 0x0000)
struct DiscoverLibraryView_C_OnTileViewScrolled final
{
public:
	float                                         ItemOffset;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceRemaining;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_OnTileViewScrolled) == 0x000004, "Wrong alignment on DiscoverLibraryView_C_OnTileViewScrolled");
static_assert(sizeof(DiscoverLibraryView_C_OnTileViewScrolled) == 0x000008, "Wrong size on DiscoverLibraryView_C_OnTileViewScrolled");
static_assert(offsetof(DiscoverLibraryView_C_OnTileViewScrolled, ItemOffset) == 0x000000, "Member 'DiscoverLibraryView_C_OnTileViewScrolled::ItemOffset' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnTileViewScrolled, DistanceRemaining) == 0x000004, "Member 'DiscoverLibraryView_C_OnTileViewScrolled::DistanceRemaining' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.OnUpdateProviders
// 0x0010 (0x0010 - 0x0000)
struct DiscoverLibraryView_C_OnUpdateProviders final
{
public:
	TArray<class UFortDiscoverProviderViewModel*> ProvidersVM;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DiscoverLibraryView_C_OnUpdateProviders) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_OnUpdateProviders");
static_assert(sizeof(DiscoverLibraryView_C_OnUpdateProviders) == 0x000010, "Wrong size on DiscoverLibraryView_C_OnUpdateProviders");
static_assert(offsetof(DiscoverLibraryView_C_OnUpdateProviders, ProvidersVM) == 0x000000, "Member 'DiscoverLibraryView_C_OnUpdateProviders::ProvidersVM' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.PopulateTabs
// 0x0028 (0x0028 - 0x0000)
struct DiscoverLibraryView_C_PopulateTabs final
{
public:
	class UUIKitTabGroupButtonViewModel*          CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByIndex_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupViewModel*                CallFunc_SpawnObject_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          CallFunc_SpawnObject_ReturnValue_2;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_PopulateTabs) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_PopulateTabs");
static_assert(sizeof(DiscoverLibraryView_C_PopulateTabs) == 0x000028, "Wrong size on DiscoverLibraryView_C_PopulateTabs");
static_assert(offsetof(DiscoverLibraryView_C_PopulateTabs, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'DiscoverLibraryView_C_PopulateTabs::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_PopulateTabs, CallFunc_SelectTabByIndex_ReturnValue) == 0x000008, "Member 'DiscoverLibraryView_C_PopulateTabs::CallFunc_SelectTabByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_PopulateTabs, CallFunc_SpawnObject_ReturnValue_1) == 0x000010, "Member 'DiscoverLibraryView_C_PopulateTabs::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_PopulateTabs, CallFunc_SpawnObject_ReturnValue_2) == 0x000018, "Member 'DiscoverLibraryView_C_PopulateTabs::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_PopulateTabs, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'DiscoverLibraryView_C_PopulateTabs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_PopulateTabs, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'DiscoverLibraryView_C_PopulateTabs::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DiscoverLibraryView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_PreConstruct) == 0x000001, "Wrong alignment on DiscoverLibraryView_C_PreConstruct");
static_assert(sizeof(DiscoverLibraryView_C_PreConstruct) == 0x000001, "Wrong size on DiscoverLibraryView_C_PreConstruct");
static_assert(offsetof(DiscoverLibraryView_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DiscoverLibraryView_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.SetNoResultsAndHeaderText
// 0x0008 (0x0008 - 0x0000)
struct DiscoverLibraryView_C_SetNoResultsAndHeaderText final
{
public:
	int32                                         SelectedTabIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_SetNoResultsAndHeaderText) == 0x000004, "Wrong alignment on DiscoverLibraryView_C_SetNoResultsAndHeaderText");
static_assert(sizeof(DiscoverLibraryView_C_SetNoResultsAndHeaderText) == 0x000008, "Wrong size on DiscoverLibraryView_C_SetNoResultsAndHeaderText");
static_assert(offsetof(DiscoverLibraryView_C_SetNoResultsAndHeaderText, SelectedTabIndex) == 0x000000, "Member 'DiscoverLibraryView_C_SetNoResultsAndHeaderText::SelectedTabIndex' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_SetNoResultsAndHeaderText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'DiscoverLibraryView_C_SetNoResultsAndHeaderText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.TopLevelTabChanged
// 0x0002 (0x0002 - 0x0000)
struct DiscoverLibraryView_C_TopLevelTabChanged final
{
public:
	EFortUIFeature                                LeavingFeature;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeature                                EnteringFeature;                                   // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_TopLevelTabChanged) == 0x000001, "Wrong alignment on DiscoverLibraryView_C_TopLevelTabChanged");
static_assert(sizeof(DiscoverLibraryView_C_TopLevelTabChanged) == 0x000002, "Wrong size on DiscoverLibraryView_C_TopLevelTabChanged");
static_assert(offsetof(DiscoverLibraryView_C_TopLevelTabChanged, LeavingFeature) == 0x000000, "Member 'DiscoverLibraryView_C_TopLevelTabChanged::LeavingFeature' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_TopLevelTabChanged, EnteringFeature) == 0x000001, "Member 'DiscoverLibraryView_C_TopLevelTabChanged::EnteringFeature' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.BP_GetDesiredFocusTarget
// 0x0028 (0x0028 - 0x0000)
struct DiscoverLibraryView_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget) == 0x000028, "Wrong size on DiscoverLibraryView_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, Temp_int_Variable) == 0x000008, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, Temp_bool_Variable) == 0x00000C, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000010, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, CallFunc_GetIndexForItem_ReturnValue) == 0x000018, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_BP_GetDesiredFocusTarget, K2Node_Select_Default) == 0x000020, "Member 'DiscoverLibraryView_C_BP_GetDesiredFocusTarget::K2Node_Select_Default' has a wrong offset!");

// Function DiscoverLibraryView.DiscoverLibraryView_C.OnUpdateNew
// 0x0030 (0x0030 - 0x0000)
struct DiscoverLibraryView_C_OnUpdateNew final
{
public:
	TArray<class UFortDiscoverProviderViewModel*> ProviderOuterArrayVM;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         OuterIndex;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortActivityViewModel*>         InnerArray;                                        // 0x0018(0x0010)(Parm, OutParm)
	class UFortDiscoverProviderViewModel*         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoverLibraryView_C_OnUpdateNew) == 0x000008, "Wrong alignment on DiscoverLibraryView_C_OnUpdateNew");
static_assert(sizeof(DiscoverLibraryView_C_OnUpdateNew) == 0x000030, "Wrong size on DiscoverLibraryView_C_OnUpdateNew");
static_assert(offsetof(DiscoverLibraryView_C_OnUpdateNew, ProviderOuterArrayVM) == 0x000000, "Member 'DiscoverLibraryView_C_OnUpdateNew::ProviderOuterArrayVM' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnUpdateNew, OuterIndex) == 0x000010, "Member 'DiscoverLibraryView_C_OnUpdateNew::OuterIndex' has a wrong offset!");
static_assert(offsetof(DiscoverLibraryView_C_OnUpdateNew, InnerArray) == 0x000018, "Member 'DiscoverLibraryView_C_OnUpdateNew::InnerArray' has a wrong offset!");
