#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DuplicateResOutMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.ExecuteUbergraph_DuplicateResOutMesh
// 0x0230 (0x0230 - 0x0000)
struct DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_CustomEvent_MID_Array;                      // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<class USkeletalMeshComponent*>         K2Node_CustomEvent_External_MEsh_Component_Array;  // 0x0040(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       CallFunc_External_Mesh_Masked_Setup_Corrected_Mid_Array; // 0x01C0(0x0010)(ReferenceParm)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x01E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ProcessSpawnInTimeline_ZHeight_ImplicitCast; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ProcessSpawnInTimeline_LightIntensity_ImplicitCast; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh");
static_assert(sizeof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh) == 0x000230, "Wrong size on DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, EntryPoint) == 0x000000, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::EntryPoint' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Array_Index_Variable) == 0x000004, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_CustomEvent_MID_Array) == 0x000030, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_CustomEvent_MID_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_CustomEvent_External_MEsh_Component_Array) == 0x000040, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_CustomEvent_External_MEsh_Component_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Loop_Counter_Variable_2) == 0x000050, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Array_Index_Variable_2) == 0x00005C, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Get_Item) == 0x000060, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000D8, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_External_Mesh_Masked_Setup_Corrected_Mid_Array) == 0x0001C0, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_External_Mesh_Masked_Setup_Corrected_Mid_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Get_Item_2) == 0x0001D0, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Length_ReturnValue_1) == 0x0001D8, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_GetMaterials_ReturnValue) == 0x0001E0, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001F0, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Length_ReturnValue_2) == 0x0001F4, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001F8, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Length_ReturnValue_3) == 0x0001FC, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Add_IntInt_ReturnValue_3) == 0x000200, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Add_IntInt_ReturnValue_4) == 0x000204, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Get_Item_3) == 0x000208, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_IsValid_ReturnValue_1) == 0x000210, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_SetLifeSpan_InLifespan_ImplicitCast) == 0x000214, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_SetLifeSpan_InLifespan_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000218, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_ProcessSpawnInTimeline_ZHeight_ImplicitCast) == 0x000220, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_ProcessSpawnInTimeline_ZHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_ProcessSpawnInTimeline_LightIntensity_ImplicitCast) == 0x000228, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_ProcessSpawnInTimeline_LightIntensity_ImplicitCast' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.External Mesh Masked Setup
// 0x00E8 (0x00E8 - 0x0000)
struct DuplicateResOutMesh_C_External_Mesh_Masked_Setup final
{
public:
	TArray<class USkeletalMeshComponent*>         External_MEsh_Component_Array;                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       Corrected_Mid_Array;                               // 0x0010(0x0010)(Parm, OutParm)
	int32                                         Increment_MaskedSetup;                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MID_Array_MaskedSetup;                             // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable;                              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup) == 0x000008, "Wrong alignment on DuplicateResOutMesh_C_External_Mesh_Masked_Setup");
static_assert(sizeof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup) == 0x0000E8, "Wrong size on DuplicateResOutMesh_C_External_Mesh_Masked_Setup");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, External_MEsh_Component_Array) == 0x000000, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::External_MEsh_Component_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Corrected_Mid_Array) == 0x000010, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Corrected_Mid_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Increment_MaskedSetup) == 0x000020, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Increment_MaskedSetup' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, MID_Array_MaskedSetup) == 0x000028, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::MID_Array_MaskedSetup' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Get_Item) == 0x000048, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_GetMaterials_ReturnValue) == 0x000050, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Length_ReturnValue_2) == 0x000068, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000080, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, K2Node_DynamicCast_AsMaterial_Instance) == 0x000088, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Contains_ReturnValue) == 0x000091, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Contains_ReturnValue_1) == 0x000092, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000093, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_object_Variable) == 0x000098, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_object_Variable_1) == 0x0000A0, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_bool_Variable) == 0x0000A8, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, K2Node_Select_Default) == 0x0000B0, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000B8, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000C0, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Add_ReturnValue_1) == 0x0000C4, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Get_Item_2) == 0x0000C8, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Array_Get_Item_3) == 0x0000D0, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, Temp_int_Loop_Counter_Variable_1) == 0x0000D8, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_External_Mesh_Masked_Setup, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E0, "Member 'DuplicateResOutMesh_C_External_Mesh_Masked_Setup::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.Find Bounds
// 0x0390 (0x0390 - 0x0000)
struct DuplicateResOutMesh_C_Find_Bounds final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_Select_Default;                             // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0330(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_Find_Bounds) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_Find_Bounds");
static_assert(sizeof(DuplicateResOutMesh_C_Find_Bounds) == 0x000390, "Wrong size on DuplicateResOutMesh_C_Find_Bounds");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, Temp_bool_Variable) == 0x000000, "Member 'DuplicateResOutMesh_C_Find_Bounds::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Location) == 0x000008, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Location_1) == 0x000050, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Rotation_1) == 0x000068, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Scale_1) == 0x000080, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_X) == 0x000098, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_X_1) == 0x0000B0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Y_1) == 0x0000B8, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Z_1) == 0x0000C0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakRotIntoAxes_X) == 0x000100, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakRotIntoAxes_Y) == 0x000118, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakRotIntoAxes_Z) == 0x000130, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0001B0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeTransform_ReturnValue_1) == 0x0001D0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, K2Node_Select_Default) == 0x000230, "Member 'DuplicateResOutMesh_C_Find_Bounds::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Location_2) == 0x000290, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Rotation_2) == 0x0002A8, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Scale_2) == 0x0002C0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_GetActorBounds_Origin) == 0x0002D8, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_GetActorBounds_BoxExtent) == 0x0002F0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_VSize_ReturnValue) == 0x000308, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000310, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeTransform_ReturnValue_2) == 0x000330, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.initializeExternalSkeletalMeshArray
// 0x0040 (0x0040 - 0x0000)
struct DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray final
{
public:
	class APlayerPawn_Athena_Generic_Parent_C*    K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_Parent; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerPawn_Generic_Parent_C*           K2Node_DynamicCast_AsPlayer_Pawn_Generic_Parent;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray) == 0x000008, "Wrong alignment on DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray");
static_assert(sizeof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray) == 0x000040, "Wrong size on DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_Parent) == 0x000000, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_Parent' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_DynamicCast_AsFort_AIPawn) == 0x000010, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_MakeArray_Array) == 0x000020, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_DynamicCast_AsPlayer_Pawn_Generic_Parent) == 0x000030, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_DynamicCast_AsPlayer_Pawn_Generic_Parent' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'DuplicateResOutMesh_C_initializeExternalSkeletalMeshArray::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.Make and slave internal meshes
// 0x0280 (0x0280 - 0x0000)
struct DuplicateResOutMesh_C_Make_and_slave_internal_meshes final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0158(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_3;                         // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_Make_and_slave_internal_meshes");
static_assert(sizeof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes) == 0x000280, "Wrong size on DuplicateResOutMesh_C_Make_and_slave_internal_meshes");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Transform) == 0x000000, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Transform' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Temp_int_Array_Index_Variable) == 0x000060, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Temp_int_Variable) == 0x000064, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_AddComponent_ReturnValue) == 0x0000D0, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000F0, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000150, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000158, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
