#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicPoiPointProviderRuntime

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct DynamicPoiPointProviderRuntime.DynamicPOIMaxActorCondition
// 0x000C (0x000C - 0x0000)
struct FDynamicPOIMaxActorCondition final
{
public:
	float                                         MinAreaSize;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAreaSize;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCount;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicPOIMaxActorCondition) == 0x000004, "Wrong alignment on FDynamicPOIMaxActorCondition");
static_assert(sizeof(FDynamicPOIMaxActorCondition) == 0x00000C, "Wrong size on FDynamicPOIMaxActorCondition");
static_assert(offsetof(FDynamicPOIMaxActorCondition, MinAreaSize) == 0x000000, "Member 'FDynamicPOIMaxActorCondition::MinAreaSize' has a wrong offset!");
static_assert(offsetof(FDynamicPOIMaxActorCondition, MaxAreaSize) == 0x000004, "Member 'FDynamicPOIMaxActorCondition::MaxAreaSize' has a wrong offset!");
static_assert(offsetof(FDynamicPOIMaxActorCondition, MaxCount) == 0x000008, "Member 'FDynamicPOIMaxActorCondition::MaxCount' has a wrong offset!");

}

