#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmberRae_Axe_L_AnimBP_Post

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EmberRae_Axe_L_AnimBP_Post.EmberRae_Axe_L_AnimBP_Post_C
// 0x0BE0 (0x1300 - 0x0720)
class UEmberRae_Axe_L_AnimBP_Post_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0758(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0808(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0828(0x0020)()
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0850(0x0960)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x11B0(0x0128)()
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x12D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TranslateMSTR;                                     // 0x12E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EmberRae_Axe_L_AnimBP_Post(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmberRae_Axe_L_AnimBP_Post_C">();
	}
	static class UEmberRae_Axe_L_AnimBP_Post_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmberRae_Axe_L_AnimBP_Post_C>();
	}
};
static_assert(alignof(UEmberRae_Axe_L_AnimBP_Post_C) == 0x000010, "Wrong alignment on UEmberRae_Axe_L_AnimBP_Post_C");
static_assert(sizeof(UEmberRae_Axe_L_AnimBP_Post_C) == 0x001300, "Wrong size on UEmberRae_Axe_L_AnimBP_Post_C");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, UberGraphFrame) == 0x000720, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimBlueprintExtension_PropertyAccess) == 0x000728, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimBlueprintExtension_Base) == 0x000730, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimGraphNode_Root) == 0x000738, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimGraphNode_SubInput) == 0x000758, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimGraphNode_ComponentToLocalSpace) == 0x000808, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimGraphNode_LocalToComponentSpace) == 0x000828, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimGraphNode_RigidBody) == 0x000850, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, AnimGraphNode_ModifyBone) == 0x0011B0, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, SkeletalMesh) == 0x0012D8, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(UEmberRae_Axe_L_AnimBP_Post_C, TranslateMSTR) == 0x0012E0, "Member 'UEmberRae_Axe_L_AnimBP_Post_C::TranslateMSTR' has a wrong offset!");

}

