#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountersRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "Engine_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum EncountersRuntime.EEncounterMobSpawnType
// NumValues: 0x0002
enum class EEncounterMobSpawnType : uint32
{
	VolumeBased                              = 0,
	StaticPointBased                         = 1,
};

// Enum EncountersRuntime.EAlertLevelComparisonOperator
// NumValues: 0x0006
enum class EAlertLevelComparisonOperator : uint8
{
	GreaterThan                              = 0,
	LessThan                                 = 1,
	EqualTo                                  = 2,
	NotEqualTo                               = 3,
	GreaterThanOrEqualTo                     = 4,
	LessThanOrEqualTo                        = 5,
};

// Enum EncountersRuntime.ESpawnActorPersistenceBehavior
// NumValues: 0x0003
enum class ESpawnActorPersistenceBehavior : uint8
{
	Destroy                                  = 0,
	Transient                                = 1,
	Persistent                               = 2,
};

// Enum EncountersRuntime.EEncounterSuccessState
// NumValues: 0x0003
enum class EEncounterSuccessState : uint8
{
	Passed                                   = 0,
	Failed                                   = 1,
	Any                                      = 2,
};

// ScriptStruct EncountersRuntime.ActorAddLooseTagsStateTreeTaskInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FActorAddLooseTagsStateTreeTaskInstanceData final
{
public:
	TWeakObjectPtr<class AActor>                  InActor;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActorTags;                                         // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FActorAddLooseTagsStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FActorAddLooseTagsStateTreeTaskInstanceData");
static_assert(sizeof(FActorAddLooseTagsStateTreeTaskInstanceData) == 0x000030, "Wrong size on FActorAddLooseTagsStateTreeTaskInstanceData");
static_assert(offsetof(FActorAddLooseTagsStateTreeTaskInstanceData, InActor) == 0x000000, "Member 'FActorAddLooseTagsStateTreeTaskInstanceData::InActor' has a wrong offset!");
static_assert(offsetof(FActorAddLooseTagsStateTreeTaskInstanceData, ActorTags) == 0x000008, "Member 'FActorAddLooseTagsStateTreeTaskInstanceData::ActorTags' has a wrong offset!");
static_assert(offsetof(FActorAddLooseTagsStateTreeTaskInstanceData, UserActor) == 0x000028, "Member 'FActorAddLooseTagsStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableGameplayTagStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetVariableGameplayTagStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetVariableGameplayTagStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetVariableGameplayTagStateTreeTask");
static_assert(sizeof(FEncounterGetVariableGameplayTagStateTreeTask) == 0x000020, "Wrong size on FEncounterGetVariableGameplayTagStateTreeTask");

// ScriptStruct EncountersRuntime.FortVerbMessage_EncounterCompleted
// 0x0050 (0x00C8 - 0x0078)
struct FFortVerbMessage_EncounterCompleted final : public FVerbMessage
{
public:
	struct FSubjectTagsPair                       EncounterItemDef;                                  // 0x0078(0x0038)(Edit, EditConst, NativeAccessSpecifierPrivate)
	bool                                          bSuccess;                                          // 0x00B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSubjectTagsPair>               EncounterPlayers;                                  // 0x00B8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FFortVerbMessage_EncounterCompleted) == 0x000008, "Wrong alignment on FFortVerbMessage_EncounterCompleted");
static_assert(sizeof(FFortVerbMessage_EncounterCompleted) == 0x0000C8, "Wrong size on FFortVerbMessage_EncounterCompleted");
static_assert(offsetof(FFortVerbMessage_EncounterCompleted, EncounterItemDef) == 0x000078, "Member 'FFortVerbMessage_EncounterCompleted::EncounterItemDef' has a wrong offset!");
static_assert(offsetof(FFortVerbMessage_EncounterCompleted, bSuccess) == 0x0000B0, "Member 'FFortVerbMessage_EncounterCompleted::bSuccess' has a wrong offset!");
static_assert(offsetof(FFortVerbMessage_EncounterCompleted, EncounterPlayers) == 0x0000B8, "Member 'FFortVerbMessage_EncounterCompleted::EncounterPlayers' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterMobSpawnInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FEncounterMobSpawnInfo final
{
public:
	struct FScalableFloat                         LeashRadiusInner;                                  // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         LeashRadiusOuter;                                  // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AEncounterMobAnchor>     EncounterAnchorPoint;                              // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEncounterMobSpawnType                        MobSpawnType;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PointProviderFilterTags;                           // 0x0060(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class AFortAthenaLivingWorldStaticPointProvider>> StaticPointProviders;                              // 0x0080(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UEnvQuery*                              PointProviderEQS;                                  // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortAthenaLivingWorldVolume> PointProviderVolumeClass;                          // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterMobSpawnInfo) == 0x000008, "Wrong alignment on FEncounterMobSpawnInfo");
static_assert(sizeof(FEncounterMobSpawnInfo) == 0x0000A0, "Wrong size on FEncounterMobSpawnInfo");
static_assert(offsetof(FEncounterMobSpawnInfo, LeashRadiusInner) == 0x000000, "Member 'FEncounterMobSpawnInfo::LeashRadiusInner' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, LeashRadiusOuter) == 0x000028, "Member 'FEncounterMobSpawnInfo::LeashRadiusOuter' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, EncounterAnchorPoint) == 0x000050, "Member 'FEncounterMobSpawnInfo::EncounterAnchorPoint' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, MobSpawnType) == 0x000058, "Member 'FEncounterMobSpawnInfo::MobSpawnType' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, PointProviderFilterTags) == 0x000060, "Member 'FEncounterMobSpawnInfo::PointProviderFilterTags' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, StaticPointProviders) == 0x000080, "Member 'FEncounterMobSpawnInfo::StaticPointProviders' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, PointProviderEQS) == 0x000090, "Member 'FEncounterMobSpawnInfo::PointProviderEQS' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnInfo, PointProviderVolumeClass) == 0x000098, "Member 'FEncounterMobSpawnInfo::PointProviderVolumeClass' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableLWMEncounterStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetVariableLWMEncounterStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetVariableLWMEncounterStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetVariableLWMEncounterStateTreeTask");
static_assert(sizeof(FEncounterGetVariableLWMEncounterStateTreeTask) == 0x000020, "Wrong size on FEncounterGetVariableLWMEncounterStateTreeTask");

// ScriptStruct EncountersRuntime.EncounterMobSpawnData
// 0x00E0 (0x00E0 - 0x0000)
struct FEncounterMobSpawnData final
{
public:
	class FString                                 DevNotes;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           MobIdentifier;                                     // 0x0010(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActiveOnStart;                                    // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> MobEncounterData;                                  // 0x0018(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDefaultSpawnInfo;                         // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEncounterMobSpawnInfo                 MobSpawnInfo;                                      // 0x0040(0x00A0)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterMobSpawnData) == 0x000008, "Wrong alignment on FEncounterMobSpawnData");
static_assert(sizeof(FEncounterMobSpawnData) == 0x0000E0, "Wrong size on FEncounterMobSpawnData");
static_assert(offsetof(FEncounterMobSpawnData, DevNotes) == 0x000000, "Member 'FEncounterMobSpawnData::DevNotes' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnData, MobIdentifier) == 0x000010, "Member 'FEncounterMobSpawnData::MobIdentifier' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnData, bActiveOnStart) == 0x000014, "Member 'FEncounterMobSpawnData::bActiveOnStart' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnData, MobEncounterData) == 0x000018, "Member 'FEncounterMobSpawnData::MobEncounterData' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnData, bOverrideDefaultSpawnInfo) == 0x000038, "Member 'FEncounterMobSpawnData::bOverrideDefaultSpawnInfo' has a wrong offset!");
static_assert(offsetof(FEncounterMobSpawnData, MobSpawnInfo) == 0x000040, "Member 'FEncounterMobSpawnData::MobSpawnInfo' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterVerbTransitionStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FEncounterVerbTransitionStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FStateTreeStateLink                    TransitionTo;                                      // 0x0020(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEncounterVerbTransitionStateTreeTask) == 0x000008, "Wrong alignment on FEncounterVerbTransitionStateTreeTask");
static_assert(sizeof(FEncounterVerbTransitionStateTreeTask) == 0x000028, "Wrong size on FEncounterVerbTransitionStateTreeTask");
static_assert(offsetof(FEncounterVerbTransitionStateTreeTask, TransitionTo) == 0x000020, "Member 'FEncounterVerbTransitionStateTreeTask::TransitionTo' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           VariableIdentifier;                                // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Value;                                             // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData) == 0x000030, "Wrong size on FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData, VariableIdentifier) == 0x000000, "Member 'FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData::VariableIdentifier' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData, Value) == 0x000008, "Member 'FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData::Value' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData, UserActor) == 0x000028, "Member 'FEncounterGetVariableGameplayTagContainerStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterMobInstance
// 0x0058 (0x0058 - 0x0000)
struct FEncounterMobInstance final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaLivingWorldVolume*           VolumePointProvider;                               // 0x0018(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> CurrentPointProviders;                             // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEncounterMobInstance) == 0x000008, "Wrong alignment on FEncounterMobInstance");
static_assert(sizeof(FEncounterMobInstance) == 0x000058, "Wrong size on FEncounterMobInstance");
static_assert(offsetof(FEncounterMobInstance, VolumePointProvider) == 0x000018, "Member 'FEncounterMobInstance::VolumePointProvider' has a wrong offset!");
static_assert(offsetof(FEncounterMobInstance, CurrentPointProviders) == 0x000030, "Member 'FEncounterMobInstance::CurrentPointProviders' has a wrong offset!");

// ScriptStruct EncountersRuntime.ActorAddLooseTagsStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FActorAddLooseTagsStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FActorAddLooseTagsStateTreeTask) == 0x000008, "Wrong alignment on FActorAddLooseTagsStateTreeTask");
static_assert(sizeof(FActorAddLooseTagsStateTreeTask) == 0x000020, "Wrong size on FActorAddLooseTagsStateTreeTask");

// ScriptStruct EncountersRuntime.ActorPhysicsStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FActorPhysicsStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ActorQuery;                                        // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bShouldWakeup;                                     // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FActorPhysicsStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FActorPhysicsStateTreeTaskInstanceData");
static_assert(sizeof(FActorPhysicsStateTreeTaskInstanceData) == 0x000058, "Wrong size on FActorPhysicsStateTreeTaskInstanceData");
static_assert(offsetof(FActorPhysicsStateTreeTaskInstanceData, ActorQuery) == 0x000000, "Member 'FActorPhysicsStateTreeTaskInstanceData::ActorQuery' has a wrong offset!");
static_assert(offsetof(FActorPhysicsStateTreeTaskInstanceData, bShouldWakeup) == 0x000048, "Member 'FActorPhysicsStateTreeTaskInstanceData::bShouldWakeup' has a wrong offset!");
static_assert(offsetof(FActorPhysicsStateTreeTaskInstanceData, UserActor) == 0x000050, "Member 'FActorPhysicsStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.ActorPhysicsStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FActorPhysicsStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FActorPhysicsStateTreeTask) == 0x000008, "Wrong alignment on FActorPhysicsStateTreeTask");
static_assert(sizeof(FActorPhysicsStateTreeTask) == 0x000020, "Wrong size on FActorPhysicsStateTreeTask");

// ScriptStruct EncountersRuntime.AddEncounterPrefabTagStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FAddEncounterPrefabTagStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           PrefabTag;                                         // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveOnExit;                                     // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAddEncounterPrefabTagStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FAddEncounterPrefabTagStateTreeTaskInstanceData");
static_assert(sizeof(FAddEncounterPrefabTagStateTreeTaskInstanceData) == 0x000010, "Wrong size on FAddEncounterPrefabTagStateTreeTaskInstanceData");
static_assert(offsetof(FAddEncounterPrefabTagStateTreeTaskInstanceData, PrefabTag) == 0x000000, "Member 'FAddEncounterPrefabTagStateTreeTaskInstanceData::PrefabTag' has a wrong offset!");
static_assert(offsetof(FAddEncounterPrefabTagStateTreeTaskInstanceData, bRemoveOnExit) == 0x000004, "Member 'FAddEncounterPrefabTagStateTreeTaskInstanceData::bRemoveOnExit' has a wrong offset!");
static_assert(offsetof(FAddEncounterPrefabTagStateTreeTaskInstanceData, UserActor) == 0x000008, "Member 'FAddEncounterPrefabTagStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.AddEncounterPrefabTagStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FAddEncounterPrefabTagStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FAddEncounterPrefabTagStateTreeTask) == 0x000008, "Wrong alignment on FAddEncounterPrefabTagStateTreeTask");
static_assert(sizeof(FAddEncounterPrefabTagStateTreeTask) == 0x000020, "Wrong size on FAddEncounterPrefabTagStateTreeTask");

// ScriptStruct EncountersRuntime.AddGameplayCueStateTreeTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FAddGameplayCueStateTreeTaskInstanceData final
{
public:
	struct FGameplayCueTag                        GameplayCue;                                       // 0x0000(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLooping;                                        // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAddGameplayCueStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FAddGameplayCueStateTreeTaskInstanceData");
static_assert(sizeof(FAddGameplayCueStateTreeTaskInstanceData) == 0x000018, "Wrong size on FAddGameplayCueStateTreeTaskInstanceData");
static_assert(offsetof(FAddGameplayCueStateTreeTaskInstanceData, GameplayCue) == 0x000000, "Member 'FAddGameplayCueStateTreeTaskInstanceData::GameplayCue' has a wrong offset!");
static_assert(offsetof(FAddGameplayCueStateTreeTaskInstanceData, TargetActor) == 0x000004, "Member 'FAddGameplayCueStateTreeTaskInstanceData::TargetActor' has a wrong offset!");
static_assert(offsetof(FAddGameplayCueStateTreeTaskInstanceData, bIsLooping) == 0x00000C, "Member 'FAddGameplayCueStateTreeTaskInstanceData::bIsLooping' has a wrong offset!");
static_assert(offsetof(FAddGameplayCueStateTreeTaskInstanceData, UserActor) == 0x000010, "Member 'FAddGameplayCueStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.AddGameplayCueStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FAddGameplayCueStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FAddGameplayCueStateTreeTask) == 0x000008, "Wrong alignment on FAddGameplayCueStateTreeTask");
static_assert(sizeof(FAddGameplayCueStateTreeTask) == 0x000020, "Wrong size on FAddGameplayCueStateTreeTask");

// ScriptStruct EncountersRuntime.DestroyActorsStateTreeTaskInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FDestroyActorsStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ActorQuery;                                        // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDestroyActorsStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FDestroyActorsStateTreeTaskInstanceData");
static_assert(sizeof(FDestroyActorsStateTreeTaskInstanceData) == 0x000050, "Wrong size on FDestroyActorsStateTreeTaskInstanceData");
static_assert(offsetof(FDestroyActorsStateTreeTaskInstanceData, ActorQuery) == 0x000000, "Member 'FDestroyActorsStateTreeTaskInstanceData::ActorQuery' has a wrong offset!");
static_assert(offsetof(FDestroyActorsStateTreeTaskInstanceData, UserActor) == 0x000048, "Member 'FDestroyActorsStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.DestroyActorsStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FDestroyActorsStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FDestroyActorsStateTreeTask) == 0x000008, "Wrong alignment on FDestroyActorsStateTreeTask");
static_assert(sizeof(FDestroyActorsStateTreeTask) == 0x000020, "Wrong size on FDestroyActorsStateTreeTask");

// ScriptStruct EncountersRuntime.EnableEncounterPointProvidersStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FEnableEncounterPointProvidersStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ProviderTagQuery;                                  // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bEnableProvider;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEnableEncounterPointProvidersStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEnableEncounterPointProvidersStateTreeTaskInstanceData");
static_assert(sizeof(FEnableEncounterPointProvidersStateTreeTaskInstanceData) == 0x000058, "Wrong size on FEnableEncounterPointProvidersStateTreeTaskInstanceData");
static_assert(offsetof(FEnableEncounterPointProvidersStateTreeTaskInstanceData, ProviderTagQuery) == 0x000000, "Member 'FEnableEncounterPointProvidersStateTreeTaskInstanceData::ProviderTagQuery' has a wrong offset!");
static_assert(offsetof(FEnableEncounterPointProvidersStateTreeTaskInstanceData, bEnableProvider) == 0x000048, "Member 'FEnableEncounterPointProvidersStateTreeTaskInstanceData::bEnableProvider' has a wrong offset!");
static_assert(offsetof(FEnableEncounterPointProvidersStateTreeTaskInstanceData, UserActor) == 0x000050, "Member 'FEnableEncounterPointProvidersStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.StopMobEncounterStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStopMobEncounterStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           MobIdentifier;                                     // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStopMobEncounterStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FStopMobEncounterStateTreeTaskInstanceData");
static_assert(sizeof(FStopMobEncounterStateTreeTaskInstanceData) == 0x000010, "Wrong size on FStopMobEncounterStateTreeTaskInstanceData");
static_assert(offsetof(FStopMobEncounterStateTreeTaskInstanceData, MobIdentifier) == 0x000000, "Member 'FStopMobEncounterStateTreeTaskInstanceData::MobIdentifier' has a wrong offset!");
static_assert(offsetof(FStopMobEncounterStateTreeTaskInstanceData, UserActor) == 0x000008, "Member 'FStopMobEncounterStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EnableEncounterPointProvidersStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEnableEncounterPointProvidersStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEnableEncounterPointProvidersStateTreeTask) == 0x000008, "Wrong alignment on FEnableEncounterPointProvidersStateTreeTask");
static_assert(sizeof(FEnableEncounterPointProvidersStateTreeTask) == 0x000020, "Wrong size on FEnableEncounterPointProvidersStateTreeTask");

// ScriptStruct EncountersRuntime.EnableSmartObjectsStateTreeTaskInstanceData
// 0x0070 (0x0070 - 0x0000)
struct FEnableSmartObjectsStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ActorQuery;                                        // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         AIActors;                                          // 0x0058(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FFortAICommandSOUsageDataBase          AICommandSOUsageData;                              // 0x0068(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEnableSmartObjectsStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEnableSmartObjectsStateTreeTaskInstanceData");
static_assert(sizeof(FEnableSmartObjectsStateTreeTaskInstanceData) == 0x000070, "Wrong size on FEnableSmartObjectsStateTreeTaskInstanceData");
static_assert(offsetof(FEnableSmartObjectsStateTreeTaskInstanceData, ActorQuery) == 0x000000, "Member 'FEnableSmartObjectsStateTreeTaskInstanceData::ActorQuery' has a wrong offset!");
static_assert(offsetof(FEnableSmartObjectsStateTreeTaskInstanceData, bEnable) == 0x000048, "Member 'FEnableSmartObjectsStateTreeTaskInstanceData::bEnable' has a wrong offset!");
static_assert(offsetof(FEnableSmartObjectsStateTreeTaskInstanceData, UserActor) == 0x000050, "Member 'FEnableSmartObjectsStateTreeTaskInstanceData::UserActor' has a wrong offset!");
static_assert(offsetof(FEnableSmartObjectsStateTreeTaskInstanceData, AIActors) == 0x000058, "Member 'FEnableSmartObjectsStateTreeTaskInstanceData::AIActors' has a wrong offset!");
static_assert(offsetof(FEnableSmartObjectsStateTreeTaskInstanceData, AICommandSOUsageData) == 0x000068, "Member 'FEnableSmartObjectsStateTreeTaskInstanceData::AICommandSOUsageData' has a wrong offset!");

// ScriptStruct EncountersRuntime.EnableSmartObjectsStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEnableSmartObjectsStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEnableSmartObjectsStateTreeTask) == 0x000008, "Wrong alignment on FEnableSmartObjectsStateTreeTask");
static_assert(sizeof(FEnableSmartObjectsStateTreeTask) == 0x000020, "Wrong size on FEnableSmartObjectsStateTreeTask");

// ScriptStruct EncountersRuntime.EncounterFactionRow
// 0x0010 (0x0018 - 0x0008)
struct FEncounterFactionRow final : public FTableRowBase
{
public:
	class UEncounterFactionData*                  FactionData;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEncounterFactionRow) == 0x000008, "Wrong alignment on FEncounterFactionRow");
static_assert(sizeof(FEncounterFactionRow) == 0x000018, "Wrong size on FEncounterFactionRow");
static_assert(offsetof(FEncounterFactionRow, FactionData) == 0x000008, "Member 'FEncounterFactionRow::FactionData' has a wrong offset!");
static_assert(offsetof(FEncounterFactionRow, Weight) == 0x000010, "Member 'FEncounterFactionRow::Weight' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetKillCountStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FEncounterGetKillCountStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      EncounterQuery;                                    // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetKillCountStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetKillCountStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetKillCountStateTreeTaskInstanceData) == 0x000058, "Wrong size on FEncounterGetKillCountStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetKillCountStateTreeTaskInstanceData, EncounterQuery) == 0x000000, "Member 'FEncounterGetKillCountStateTreeTaskInstanceData::EncounterQuery' has a wrong offset!");
static_assert(offsetof(FEncounterGetKillCountStateTreeTaskInstanceData, Value) == 0x000048, "Member 'FEncounterGetKillCountStateTreeTaskInstanceData::Value' has a wrong offset!");
static_assert(offsetof(FEncounterGetKillCountStateTreeTaskInstanceData, UserActor) == 0x000050, "Member 'FEncounterGetKillCountStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetKillCountStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetKillCountStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetKillCountStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetKillCountStateTreeTask");
static_assert(sizeof(FEncounterGetKillCountStateTreeTask) == 0x000020, "Wrong size on FEncounterGetKillCountStateTreeTask");

// ScriptStruct EncountersRuntime.StartMobEncounterStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStartMobEncounterStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           MobIdentifier;                                     // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStartMobEncounterStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FStartMobEncounterStateTreeTaskInstanceData");
static_assert(sizeof(FStartMobEncounterStateTreeTaskInstanceData) == 0x000010, "Wrong size on FStartMobEncounterStateTreeTaskInstanceData");
static_assert(offsetof(FStartMobEncounterStateTreeTaskInstanceData, MobIdentifier) == 0x000000, "Member 'FStartMobEncounterStateTreeTaskInstanceData::MobIdentifier' has a wrong offset!");
static_assert(offsetof(FStartMobEncounterStateTreeTaskInstanceData, UserActor) == 0x000008, "Member 'FStartMobEncounterStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetPersistentValueStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FEncounterGetPersistentValueStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           VariableIdentifier;                                // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetPersistentValueStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetPersistentValueStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetPersistentValueStateTreeTaskInstanceData) == 0x000010, "Wrong size on FEncounterGetPersistentValueStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetPersistentValueStateTreeTaskInstanceData, VariableIdentifier) == 0x000000, "Member 'FEncounterGetPersistentValueStateTreeTaskInstanceData::VariableIdentifier' has a wrong offset!");
static_assert(offsetof(FEncounterGetPersistentValueStateTreeTaskInstanceData, Value) == 0x000004, "Member 'FEncounterGetPersistentValueStateTreeTaskInstanceData::Value' has a wrong offset!");
static_assert(offsetof(FEncounterGetPersistentValueStateTreeTaskInstanceData, UserActor) == 0x000008, "Member 'FEncounterGetPersistentValueStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetPersistentValueStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetPersistentValueStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetPersistentValueStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetPersistentValueStateTreeTask");
static_assert(sizeof(FEncounterGetPersistentValueStateTreeTask) == 0x000020, "Wrong size on FEncounterGetPersistentValueStateTreeTask");

// ScriptStruct EncountersRuntime.EncounterPrefabInfo
// 0x0038 (0x0038 - 0x0000)
struct FEncounterPrefabInfo final
{
public:
	class UEncounterItemDefinition*               EncounterDefinition;                               // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EncounterIdentifierTag;                            // 0x0008(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Weight;                                            // 0x0010(0x0028)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterPrefabInfo) == 0x000008, "Wrong alignment on FEncounterPrefabInfo");
static_assert(sizeof(FEncounterPrefabInfo) == 0x000038, "Wrong size on FEncounterPrefabInfo");
static_assert(offsetof(FEncounterPrefabInfo, EncounterDefinition) == 0x000000, "Member 'FEncounterPrefabInfo::EncounterDefinition' has a wrong offset!");
static_assert(offsetof(FEncounterPrefabInfo, EncounterIdentifierTag) == 0x000008, "Member 'FEncounterPrefabInfo::EncounterIdentifierTag' has a wrong offset!");
static_assert(offsetof(FEncounterPrefabInfo, Weight) == 0x000010, "Member 'FEncounterPrefabInfo::Weight' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetRemainingCountStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FEncounterGetRemainingCountStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      EncounterQuery;                                    // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetRemainingCountStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetRemainingCountStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetRemainingCountStateTreeTaskInstanceData) == 0x000058, "Wrong size on FEncounterGetRemainingCountStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetRemainingCountStateTreeTaskInstanceData, EncounterQuery) == 0x000000, "Member 'FEncounterGetRemainingCountStateTreeTaskInstanceData::EncounterQuery' has a wrong offset!");
static_assert(offsetof(FEncounterGetRemainingCountStateTreeTaskInstanceData, Value) == 0x000048, "Member 'FEncounterGetRemainingCountStateTreeTaskInstanceData::Value' has a wrong offset!");
static_assert(offsetof(FEncounterGetRemainingCountStateTreeTaskInstanceData, UserActor) == 0x000050, "Member 'FEncounterGetRemainingCountStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetRemainingCountStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetRemainingCountStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetRemainingCountStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetRemainingCountStateTreeTask");
static_assert(sizeof(FEncounterGetRemainingCountStateTreeTask) == 0x000020, "Wrong size on FEncounterGetRemainingCountStateTreeTask");

// ScriptStruct EncountersRuntime.EncounterRewardBehavior
// 0x0080 (0x0080 - 0x0000)
struct FEncounterRewardBehavior final
{
public:
	struct FVector                                RewardOffset;                                      // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RewardDirection;                                   // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RewardConeAngle;                                   // 0x0030(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RewardFlingMagnitude;                              // 0x0058(0x0028)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterRewardBehavior) == 0x000008, "Wrong alignment on FEncounterRewardBehavior");
static_assert(sizeof(FEncounterRewardBehavior) == 0x000080, "Wrong size on FEncounterRewardBehavior");
static_assert(offsetof(FEncounterRewardBehavior, RewardOffset) == 0x000000, "Member 'FEncounterRewardBehavior::RewardOffset' has a wrong offset!");
static_assert(offsetof(FEncounterRewardBehavior, RewardDirection) == 0x000018, "Member 'FEncounterRewardBehavior::RewardDirection' has a wrong offset!");
static_assert(offsetof(FEncounterRewardBehavior, RewardConeAngle) == 0x000030, "Member 'FEncounterRewardBehavior::RewardConeAngle' has a wrong offset!");
static_assert(offsetof(FEncounterRewardBehavior, RewardFlingMagnitude) == 0x000058, "Member 'FEncounterRewardBehavior::RewardFlingMagnitude' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableActorClassStateTreeTaskInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FEncounterGetVariableActorClassStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           VariableIdentifier;                                // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Value;                                             // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetVariableActorClassStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetVariableActorClassStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetVariableActorClassStateTreeTaskInstanceData) == 0x000030, "Wrong size on FEncounterGetVariableActorClassStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetVariableActorClassStateTreeTaskInstanceData, VariableIdentifier) == 0x000000, "Member 'FEncounterGetVariableActorClassStateTreeTaskInstanceData::VariableIdentifier' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableActorClassStateTreeTaskInstanceData, Value) == 0x000008, "Member 'FEncounterGetVariableActorClassStateTreeTaskInstanceData::Value' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableActorClassStateTreeTaskInstanceData, UserActor) == 0x000028, "Member 'FEncounterGetVariableActorClassStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableActorClassStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetVariableActorClassStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetVariableActorClassStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetVariableActorClassStateTreeTask");
static_assert(sizeof(FEncounterGetVariableActorClassStateTreeTask) == 0x000020, "Wrong size on FEncounterGetVariableActorClassStateTreeTask");

// ScriptStruct EncountersRuntime.SpawnActorStateTreeTaskInstanceData
// 0x00E8 (0x00E8 - 0x0000)
struct FSpawnActorStateTreeTaskInstanceData final
{
public:
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      AnchorQuery;                                       // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                AnchorOffset;                                      // 0x0068(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePhysics;                                    // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachEncounterVolume;                            // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ActorTags;                                         // 0x0088(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActorIdentifierTags;                               // 0x00A8(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bWaitForSpawnedActor;                              // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x00CC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpawnActorTaskHelper*                  SpawnActorHelper;                                  // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FSpawnActorStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FSpawnActorStateTreeTaskInstanceData");
static_assert(sizeof(FSpawnActorStateTreeTaskInstanceData) == 0x0000E8, "Wrong size on FSpawnActorStateTreeTaskInstanceData");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, ActorClass) == 0x000000, "Member 'FSpawnActorStateTreeTaskInstanceData::ActorClass' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, AnchorQuery) == 0x000020, "Member 'FSpawnActorStateTreeTaskInstanceData::AnchorQuery' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, AnchorOffset) == 0x000068, "Member 'FSpawnActorStateTreeTaskInstanceData::AnchorOffset' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, bEnablePhysics) == 0x000080, "Member 'FSpawnActorStateTreeTaskInstanceData::bEnablePhysics' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, bAttachEncounterVolume) == 0x000081, "Member 'FSpawnActorStateTreeTaskInstanceData::bAttachEncounterVolume' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, ActorTags) == 0x000088, "Member 'FSpawnActorStateTreeTaskInstanceData::ActorTags' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, ActorIdentifierTags) == 0x0000A8, "Member 'FSpawnActorStateTreeTaskInstanceData::ActorIdentifierTags' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, bWaitForSpawnedActor) == 0x0000C8, "Member 'FSpawnActorStateTreeTaskInstanceData::bWaitForSpawnedActor' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, SpawnedActor) == 0x0000CC, "Member 'FSpawnActorStateTreeTaskInstanceData::SpawnedActor' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, UserActor) == 0x0000D8, "Member 'FSpawnActorStateTreeTaskInstanceData::UserActor' has a wrong offset!");
static_assert(offsetof(FSpawnActorStateTreeTaskInstanceData, SpawnActorHelper) == 0x0000E0, "Member 'FSpawnActorStateTreeTaskInstanceData::SpawnActorHelper' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableActorDescriptionStateTreeTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           VariableIdentifier;                                // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortAthenaLivingWorldEventDataActorSpawnDescription> Value;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData) == 0x000020, "Wrong size on FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData, VariableIdentifier) == 0x000000, "Member 'FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData::VariableIdentifier' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData, Value) == 0x000008, "Member 'FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData::Value' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData, UserActor) == 0x000018, "Member 'FEncounterGetVariableActorDescriptionStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableActorDescriptionStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetVariableActorDescriptionStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetVariableActorDescriptionStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetVariableActorDescriptionStateTreeTask");
static_assert(sizeof(FEncounterGetVariableActorDescriptionStateTreeTask) == 0x000020, "Wrong size on FEncounterGetVariableActorDescriptionStateTreeTask");

// ScriptStruct EncountersRuntime.EncounterGroupEffectInfo
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FEncounterGroupEffectInfo final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEncounterGroupEffectInfo) == 0x000008, "Wrong alignment on FEncounterGroupEffectInfo");
static_assert(sizeof(FEncounterGroupEffectInfo) == 0x000050, "Wrong size on FEncounterGroupEffectInfo");

// ScriptStruct EncountersRuntime.EncounterGetVariableBoolStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FEncounterGetVariableBoolStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           VariableIdentifier;                                // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetVariableBoolStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetVariableBoolStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetVariableBoolStateTreeTaskInstanceData) == 0x000010, "Wrong size on FEncounterGetVariableBoolStateTreeTaskInstanceData");
static_assert(offsetof(FEncounterGetVariableBoolStateTreeTaskInstanceData, VariableIdentifier) == 0x000000, "Member 'FEncounterGetVariableBoolStateTreeTaskInstanceData::VariableIdentifier' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableBoolStateTreeTaskInstanceData, bValue) == 0x000004, "Member 'FEncounterGetVariableBoolStateTreeTaskInstanceData::bValue' has a wrong offset!");
static_assert(offsetof(FEncounterGetVariableBoolStateTreeTaskInstanceData, UserActor) == 0x000008, "Member 'FEncounterGetVariableBoolStateTreeTaskInstanceData::UserActor' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableBoolStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FEncounterGetVariableBoolStateTreeTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FEncounterGetVariableBoolStateTreeTask) == 0x000008, "Wrong alignment on FEncounterGetVariableBoolStateTreeTask");
static_assert(sizeof(FEncounterGetVariableBoolStateTreeTask) == 0x000020, "Wrong size on FEncounterGetVariableBoolStateTreeTask");

// ScriptStruct EncountersRuntime.LWMEncounterRemainingCountTransitionStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FLWMEncounterRemainingCountTransitionStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FStateTreeStateLink                    TransitionTo;                                      // 0x0020(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLWMEncounterRemainingCountTransitionStateTreeTask) == 0x000008, "Wrong alignment on FLWMEncounterRemainingCountTransitionStateTreeTask");
static_assert(sizeof(FLWMEncounterRemainingCountTransitionStateTreeTask) == 0x000028, "Wrong size on FLWMEncounterRemainingCountTransitionStateTreeTask");
static_assert(offsetof(FLWMEncounterRemainingCountTransitionStateTreeTask, TransitionTo) == 0x000020, "Member 'FLWMEncounterRemainingCountTransitionStateTreeTask::TransitionTo' has a wrong offset!");

// ScriptStruct EncountersRuntime.EncounterGetVariableFloatStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FEncounterGetVariableFloatStateTreeTaskInstanceData final
{
public:
	struct FGameplayTag                           VariableIdentifier;                                // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEncounterGetVariableFloatStateTreeTaskInstanceData) == 0x000008, "Wrong alignment on FEncounterGetVariableFloatStateTreeTaskInstanceData");
static_assert(sizeof(FEncounterGetVariableFloatStateTreeTaskInstanceData) == 0x000010, "Wrong size on FEncounterGetVariableFloatStateTreeTaskInstanceData");
