#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicMediaCDNHostnames

#include "Basic.hpp"


namespace SDK::Params
{

// Function EpicMediaCDNHostnames.EpicMediaCDNHostnames.GetHostnames
// 0x0010 (0x0010 - 0x0000)
struct EpicMediaCDNHostnames_GetHostnames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicMediaCDNHostnames_GetHostnames) == 0x000008, "Wrong alignment on EpicMediaCDNHostnames_GetHostnames");
static_assert(sizeof(EpicMediaCDNHostnames_GetHostnames) == 0x000010, "Wrong size on EpicMediaCDNHostnames_GetHostnames");
static_assert(offsetof(EpicMediaCDNHostnames_GetHostnames, ReturnValue) == 0x000000, "Member 'EpicMediaCDNHostnames_GetHostnames::ReturnValue' has a wrong offset!");

// Function EpicMediaCDNHostnames.EpicMediaCDNHostnames.GetSelectedHostName
// 0x0010 (0x0010 - 0x0000)
struct EpicMediaCDNHostnames_GetSelectedHostName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicMediaCDNHostnames_GetSelectedHostName) == 0x000008, "Wrong alignment on EpicMediaCDNHostnames_GetSelectedHostName");
static_assert(sizeof(EpicMediaCDNHostnames_GetSelectedHostName) == 0x000010, "Wrong size on EpicMediaCDNHostnames_GetSelectedHostName");
static_assert(offsetof(EpicMediaCDNHostnames_GetSelectedHostName, ReturnValue) == 0x000000, "Member 'EpicMediaCDNHostnames_GetSelectedHostName::ReturnValue' has a wrong offset!");

}

