#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesAssets_0

#include "Basic.hpp"

#include "EpicGamesTemporary_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseStruct EpicGamesAssets.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct EpicGamesAssets_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EpicGamesAssets_0::Ftuple_L_R) == 0x000001, "Wrong alignment on EpicGamesAssets_0::Ftuple_L_R");
static_assert(sizeof(EpicGamesAssets_0::Ftuple_L_R) == 0x000001, "Wrong size on EpicGamesAssets_0::Ftuple_L_R");
static_assert(offsetof(EpicGamesAssets_0::Ftuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'EpicGamesAssets_0::Ftuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct EpicGamesAssets.tuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0060 (0x0060 - 0x0000)
struct Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	class UAssets_particle_system*                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	TOptional<struct FVerseRotation>              __verse_0x932BF92E_Elem2;                          // 0x0020(0x0030)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference)
	TOptional<double>                             __verse_0xF64C4596_Elem3;                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R) == 0x000010, "Wrong alignment on Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R");
static_assert(sizeof(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R) == 0x000060, "Wrong size on Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R");
static_assert(offsetof(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x932BF92E_Elem2) == 0x000020, "Member 'Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x932BF92E_Elem2' has a wrong offset!");
static_assert(offsetof(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0xF64C4596_Elem3) == 0x000050, "Member 'Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0xF64C4596_Elem3' has a wrong offset!");

}

