#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngineRestricted_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseStruct EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_query_result
// 0x0080 (0x0080 - 0x0000)
struct FEpicGamesRestricted_Spline_spline_query_result final
{
public:
	struct FSpatialMath_transform                 __verse_0xE64384A9_out_transform;                  // 0x0000(0x0060)(InstancedReference, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x97879EFC_tangent;                        // 0x0060(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEpicGamesRestricted_Spline_spline_query_result) == 0x000010, "Wrong alignment on FEpicGamesRestricted_Spline_spline_query_result");
static_assert(sizeof(FEpicGamesRestricted_Spline_spline_query_result) == 0x000080, "Wrong size on FEpicGamesRestricted_Spline_spline_query_result");
static_assert(offsetof(FEpicGamesRestricted_Spline_spline_query_result, __verse_0xE64384A9_out_transform) == 0x000000, "Member 'FEpicGamesRestricted_Spline_spline_query_result::__verse_0xE64384A9_out_transform' has a wrong offset!");
static_assert(offsetof(FEpicGamesRestricted_Spline_spline_query_result, __verse_0x97879EFC_tangent) == 0x000060, "Member 'FEpicGamesRestricted_Spline_spline_query_result::__verse_0x97879EFC_tangent' has a wrong offset!");

// VerseStruct EpicGamesEngineRestricted.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct EpicGamesEngineRestricted_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EpicGamesEngineRestricted_0::Ftuple_L_R) == 0x000001, "Wrong alignment on EpicGamesEngineRestricted_0::Ftuple_L_R");
static_assert(sizeof(EpicGamesEngineRestricted_0::Ftuple_L_R) == 0x000001, "Wrong size on EpicGamesEngineRestricted_0::Ftuple_L_R");
static_assert(offsetof(EpicGamesEngineRestricted_0::Ftuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'EpicGamesEngineRestricted_0::Ftuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct EpicGamesEngineRestricted.tuple_Lfloat_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R) == 0x000008, "Wrong alignment on EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R");
static_assert(sizeof(EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R) == 0x000010, "Wrong size on EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R");
static_assert(offsetof(EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");

}

