#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngine

#include "Basic.hpp"

#include "EpicGamesEngine_structs.hpp"
#include "EntityActor_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class EpicGamesEngine.VerseUEInputComponentBase
// 0x0370 (0x0440 - 0x00D0)
class UVerseUEInputComponentBase : public UEntityActorPlayerComponent
{
public:
	class UInputComponent*                        InputComponent;                                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVerseActionMappingArray               ReplicatedActionMappingArray;                      // 0x00D8(0x0120)(Net, NativeAccessSpecifierPrivate)
	struct FVerseAxisMappingArray                 ReplicatedAxisMappingArray;                        // 0x01F8(0x0120)(Net, NativeAccessSpecifierPrivate)
	struct FVerseInputBindingArray                ReplicatedInputBindingArray;                       // 0x0318(0x0120)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerTriggerAction(const class FName& ActionName, EInputEvent InputEvent);
	void ServerTriggerAxis(const class FName& AxisName, float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseUEInputComponentBase">();
	}
	static class UVerseUEInputComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseUEInputComponentBase>();
	}
};
static_assert(alignof(UVerseUEInputComponentBase) == 0x000008, "Wrong alignment on UVerseUEInputComponentBase");
static_assert(sizeof(UVerseUEInputComponentBase) == 0x000440, "Wrong size on UVerseUEInputComponentBase");
static_assert(offsetof(UVerseUEInputComponentBase, InputComponent) == 0x0000D0, "Member 'UVerseUEInputComponentBase::InputComponent' has a wrong offset!");
static_assert(offsetof(UVerseUEInputComponentBase, ReplicatedActionMappingArray) == 0x0000D8, "Member 'UVerseUEInputComponentBase::ReplicatedActionMappingArray' has a wrong offset!");
static_assert(offsetof(UVerseUEInputComponentBase, ReplicatedAxisMappingArray) == 0x0001F8, "Member 'UVerseUEInputComponentBase::ReplicatedAxisMappingArray' has a wrong offset!");
static_assert(offsetof(UVerseUEInputComponentBase, ReplicatedInputBindingArray) == 0x000318, "Member 'UVerseUEInputComponentBase::ReplicatedInputBindingArray' has a wrong offset!");

}

