#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorLlama

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorLlama.ErrorLlama_C
// 0x0048 (0x0308 - 0x02C0)
class UErrorLlama_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Llama;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bFlippedTexture;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CurLookAt2D;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurInputType;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EyeInterpSpeed;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialInputScale;                                // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ErrorLlama(int32 EntryPoint);
	void HandleInputTypeChanged(ECommonInputType NewInputType);
	void HandleNormalizedInputDirection(const struct FVector2D& TwoDInputVec);
	void RandomizeColor();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorLlama_C">();
	}
	static class UErrorLlama_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorLlama_C>();
	}
};
static_assert(alignof(UErrorLlama_C) == 0x000008, "Wrong alignment on UErrorLlama_C");
static_assert(sizeof(UErrorLlama_C) == 0x000308, "Wrong size on UErrorLlama_C");
static_assert(offsetof(UErrorLlama_C, UberGraphFrame) == 0x0002C0, "Member 'UErrorLlama_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, Image_0) == 0x0002C8, "Member 'UErrorLlama_C::Image_0' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, MID_Llama) == 0x0002D0, "Member 'UErrorLlama_C::MID_Llama' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, bFlippedTexture) == 0x0002D8, "Member 'UErrorLlama_C::bFlippedTexture' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, CurLookAt2D) == 0x0002E0, "Member 'UErrorLlama_C::CurLookAt2D' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, CurInputType) == 0x0002F0, "Member 'UErrorLlama_C::CurInputType' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, EyeInterpSpeed) == 0x0002F8, "Member 'UErrorLlama_C::EyeInterpSpeed' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, MaterialInputScale) == 0x000300, "Member 'UErrorLlama_C::MaterialInputScale' has a wrong offset!");

}

