#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntryDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C
// 0x03B8 (0x06A8 - 0x02F0)
class UEventLeaderboardEntryDetails_C final : public UFortLeaderboardEntryDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MatchHistoryHover;                                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProfileHover;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_MatchHistory;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Profiles;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ElimPointer;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_PlacementPointer;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderMainContent;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_MatchHistoryTextMatchHistory;      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Placement;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PlayerNames;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PlayerNamesTitle;                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_ProfileText;                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Score;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Title;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_58;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_94;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsBG;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ElimIcon;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LiveMatch;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pie;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PieShadow;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlacementIcon;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayernameBG;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayernameBG_Shadow;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Placement;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PointBreakdown;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TeamMembers;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AltStat2;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AltStat3;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AltStat4;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AveragePlacement;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AveragePointsPerMatch;                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_EliminationsOrAltStat;                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_MatchesPlayed;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_VictoryRoyales;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EliminationPointInfo;                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlacementPointInfo;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Placement;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_StatContainer;                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         LeaderboardEntryData;                              // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ProfileSelectedFromSelector;                       // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UEventPlayerStatProfileSelector_C*      ProfileSelectorInstance;                           // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 TournamentId;                                      // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 EventWindowId;                                     // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             CurrentDisplayInfo;                                // 0x04A0(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 LeaderboardInstanceId;                             // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 LeaderboardGroupingKey;                            // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         AltLeaderboardTrackedStatName;                     // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasAltLeaderboardTrackedStats;                    // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ScoredPointsForPie;                                // 0x06A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_MatchHistory_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_WatchLive_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);
	void EventIntro();
	void ExecuteUbergraph_EventLeaderboardEntryDetails(int32 EntryPoint);
	void LeaderboardEntryDoubleClicked();
	void Set_Alternative_Stat_Widget(class UEventLeaderboardDetails_Stat_C* Stat_Widget, TArray<class FString>& Stats_Names, int32 Stat_Index);
	void Set_Leaderboard_Key(const class FString& LeaderboardInstanceId_0, const class FString& LeaderboardGroupingId);
	void Set_Points_Breakdown(ETournamentDisplayType EventType);
	void Set_Stats_Rows(ETournamentDisplayType EventType);
	void SetTournamentValues(const class FString& InTournamentId, const class FString& InEventWindowId);
	void Show_Details(class UFortEventLeaderboardEntryData* EntryData, ETournamentDisplayType EventType);
	void Update_Alt_Leaderboard_Tracked_Stats();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardEntryDetails_C">();
	}
	static class UEventLeaderboardEntryDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardEntryDetails_C>();
	}
};
static_assert(alignof(UEventLeaderboardEntryDetails_C) == 0x000008, "Wrong alignment on UEventLeaderboardEntryDetails_C");
static_assert(sizeof(UEventLeaderboardEntryDetails_C) == 0x0006A8, "Wrong size on UEventLeaderboardEntryDetails_C");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, UberGraphFrame) == 0x0002F0, "Member 'UEventLeaderboardEntryDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, MatchHistoryHover) == 0x0002F8, "Member 'UEventLeaderboardEntryDetails_C::MatchHistoryHover' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ProfileHover) == 0x000300, "Member 'UEventLeaderboardEntryDetails_C::ProfileHover' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Intro) == 0x000308, "Member 'UEventLeaderboardEntryDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Button_MatchHistory) == 0x000310, "Member 'UEventLeaderboardEntryDetails_C::Button_MatchHistory' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Button_Profiles) == 0x000318, "Member 'UEventLeaderboardEntryDetails_C::Button_Profiles' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorder_ElimPointer) == 0x000320, "Member 'UEventLeaderboardEntryDetails_C::CommonBorder_ElimPointer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorder_PlacementPointer) == 0x000328, "Member 'UEventLeaderboardEntryDetails_C::CommonBorder_PlacementPointer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorderMainContent) == 0x000330, "Member 'UEventLeaderboardEntryDetails_C::CommonBorderMainContent' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_1) == 0x000338, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_MatchHistoryTextMatchHistory) == 0x000340, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_MatchHistoryTextMatchHistory' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Placement) == 0x000348, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Placement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_PlayerNames) == 0x000350, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_PlayerNames' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_PlayerNamesTitle) == 0x000358, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_PlayerNamesTitle' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_ProfileText) == 0x000360, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_ProfileText' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Score) == 0x000368, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Score' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Title) == 0x000370, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Title' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_31) == 0x000378, "Member 'UEventLeaderboardEntryDetails_C::Image_31' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_32) == 0x000380, "Member 'UEventLeaderboardEntryDetails_C::Image_32' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_57) == 0x000388, "Member 'UEventLeaderboardEntryDetails_C::Image_57' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_58) == 0x000390, "Member 'UEventLeaderboardEntryDetails_C::Image_58' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_93) == 0x000398, "Member 'UEventLeaderboardEntryDetails_C::Image_93' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_94) == 0x0003A0, "Member 'UEventLeaderboardEntryDetails_C::Image_94' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_DetailsBG) == 0x0003A8, "Member 'UEventLeaderboardEntryDetails_C::Image_DetailsBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_ElimIcon) == 0x0003B0, "Member 'UEventLeaderboardEntryDetails_C::Image_ElimIcon' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_LiveMatch) == 0x0003B8, "Member 'UEventLeaderboardEntryDetails_C::Image_LiveMatch' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_Pie) == 0x0003C0, "Member 'UEventLeaderboardEntryDetails_C::Image_Pie' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PieShadow) == 0x0003C8, "Member 'UEventLeaderboardEntryDetails_C::Image_PieShadow' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlacementIcon) == 0x0003D0, "Member 'UEventLeaderboardEntryDetails_C::Image_PlacementIcon' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlayernameBG) == 0x0003D8, "Member 'UEventLeaderboardEntryDetails_C::Image_PlayernameBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlayernameBG_Shadow) == 0x0003E0, "Member 'UEventLeaderboardEntryDetails_C::Image_PlayernameBG_Shadow' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_Placement) == 0x0003E8, "Member 'UEventLeaderboardEntryDetails_C::Overlay_Placement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_PointBreakdown) == 0x0003F0, "Member 'UEventLeaderboardEntryDetails_C::Overlay_PointBreakdown' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_TeamMembers) == 0x0003F8, "Member 'UEventLeaderboardEntryDetails_C::Overlay_TeamMembers' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AltStat2) == 0x000400, "Member 'UEventLeaderboardEntryDetails_C::Stat_AltStat2' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AltStat3) == 0x000408, "Member 'UEventLeaderboardEntryDetails_C::Stat_AltStat3' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AltStat4) == 0x000410, "Member 'UEventLeaderboardEntryDetails_C::Stat_AltStat4' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AveragePlacement) == 0x000418, "Member 'UEventLeaderboardEntryDetails_C::Stat_AveragePlacement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AveragePointsPerMatch) == 0x000420, "Member 'UEventLeaderboardEntryDetails_C::Stat_AveragePointsPerMatch' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_EliminationsOrAltStat) == 0x000428, "Member 'UEventLeaderboardEntryDetails_C::Stat_EliminationsOrAltStat' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_MatchesPlayed) == 0x000430, "Member 'UEventLeaderboardEntryDetails_C::Stat_MatchesPlayed' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_VictoryRoyales) == 0x000438, "Member 'UEventLeaderboardEntryDetails_C::Stat_VictoryRoyales' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Text_EliminationPointInfo) == 0x000440, "Member 'UEventLeaderboardEntryDetails_C::Text_EliminationPointInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Text_PlacementPointInfo) == 0x000448, "Member 'UEventLeaderboardEntryDetails_C::Text_PlacementPointInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, VerticalBox_Placement) == 0x000450, "Member 'UEventLeaderboardEntryDetails_C::VerticalBox_Placement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, VerticalBox_StatContainer) == 0x000458, "Member 'UEventLeaderboardEntryDetails_C::VerticalBox_StatContainer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, LeaderboardEntryData) == 0x000460, "Member 'UEventLeaderboardEntryDetails_C::LeaderboardEntryData' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ProfileSelectedFromSelector) == 0x000468, "Member 'UEventLeaderboardEntryDetails_C::ProfileSelectedFromSelector' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ProfileSelectorInstance) == 0x000478, "Member 'UEventLeaderboardEntryDetails_C::ProfileSelectorInstance' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, TournamentId) == 0x000480, "Member 'UEventLeaderboardEntryDetails_C::TournamentId' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, EventWindowId) == 0x000490, "Member 'UEventLeaderboardEntryDetails_C::EventWindowId' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CurrentDisplayInfo) == 0x0004A0, "Member 'UEventLeaderboardEntryDetails_C::CurrentDisplayInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, LeaderboardInstanceId) == 0x000670, "Member 'UEventLeaderboardEntryDetails_C::LeaderboardInstanceId' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, LeaderboardGroupingKey) == 0x000680, "Member 'UEventLeaderboardEntryDetails_C::LeaderboardGroupingKey' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, AltLeaderboardTrackedStatName) == 0x000690, "Member 'UEventLeaderboardEntryDetails_C::AltLeaderboardTrackedStatName' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, bHasAltLeaderboardTrackedStats) == 0x0006A0, "Member 'UEventLeaderboardEntryDetails_C::bHasAltLeaderboardTrackedStats' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, ScoredPointsForPie) == 0x0006A4, "Member 'UEventLeaderboardEntryDetails_C::ScoredPointsForPie' has a wrong offset!");

}

