#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EventTeamMatchHistoryEntry.EventTeamMatchHistoryEntry_C.ExecuteUbergraph_EventTeamMatchHistoryEntry
// 0x00E8 (0x00E8 - 0x0000)
struct EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortEventTeamMatchHistoryEntryData*    K2Node_DynamicCast_AsFort_Event_Team_Match_History_Entry_Data; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_2; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_3; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_4; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_5; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_6; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventTeamMatchHistoryStat_C*           K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_7; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry) == 0x000008, "Wrong alignment on EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry");
static_assert(sizeof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry) == 0x0000E8, "Wrong size on EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, EntryPoint) == 0x000000, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, Temp_struct_Variable) == 0x000004, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat) == 0x000018, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, Temp_struct_Variable_1) == 0x000024, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_Event_ListItemObject) == 0x000048, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsFort_Event_Team_Match_History_Entry_Data) == 0x000050, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsFort_Event_Team_Match_History_Entry_Data' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, CallFunc_Percent_IntInt_ReturnValue) == 0x00005C, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_1) == 0x000068, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_1' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_2) == 0x000078, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_2' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_3) == 0x000088, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_3' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_4) == 0x000090, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_4) == 0x000098, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_4' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_5) == 0x0000A0, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, Temp_bool_Variable) == 0x0000A1, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_Select_Default) == 0x0000A4, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_5) == 0x0000B8, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_5' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_6) == 0x0000C0, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_6) == 0x0000C8, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_6' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_7) == 0x0000D0, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_7) == 0x0000D8, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_AsEvent_Team_Match_History_Stat_7' has a wrong offset!");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry, K2Node_DynamicCast_bSuccess_8) == 0x0000E0, "Member 'EventTeamMatchHistoryEntry_C_ExecuteUbergraph_EventTeamMatchHistoryEntry::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");

// Function EventTeamMatchHistoryEntry.EventTeamMatchHistoryEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct EventTeamMatchHistoryEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventTeamMatchHistoryEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on EventTeamMatchHistoryEntry_C_OnListItemObjectSet");
static_assert(sizeof(EventTeamMatchHistoryEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on EventTeamMatchHistoryEntry_C_OnListItemObjectSet");
static_assert(offsetof(EventTeamMatchHistoryEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'EventTeamMatchHistoryEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

