#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventModeUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class EventModeUI.FocusButton
// 0x0010 (0x0440 - 0x0430)
class UFocusButton final : public UBacchusActionButton
{
public:
	class UPaperSprite*                           StartFocusingSprite;                               // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperSprite*                           StopFocusingSprite;                                // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusButton">();
	}
	static class UFocusButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusButton>();
	}
};
static_assert(alignof(UFocusButton) == 0x000008, "Wrong alignment on UFocusButton");
static_assert(sizeof(UFocusButton) == 0x000440, "Wrong size on UFocusButton");
static_assert(offsetof(UFocusButton, StartFocusingSprite) == 0x000430, "Member 'UFocusButton::StartFocusingSprite' has a wrong offset!");
static_assert(offsetof(UFocusButton, StopFocusingSprite) == 0x000438, "Member 'UFocusButton::StopFocusingSprite' has a wrong offset!");

// Class EventModeUI.FortEventModeEmotesWidget
// 0x0098 (0x03C0 - 0x0328)
class UFortEventModeEmotesWidget final : public UFortHUDElementWidget
{
public:
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote1;                                            // 0x0328(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote2;                                            // 0x0348(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote3;                                            // 0x0368(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortMontageItemDefinitionBase>> RandomEmotes;                                      // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_Emote1;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote2;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote3;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_EmoteRandom;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFocusAvailableChanged(bool bIsFocusAvailable);
	void OnFocusStateChanged(bool bIsFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventModeEmotesWidget">();
	}
	static class UFortEventModeEmotesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventModeEmotesWidget>();
	}
};
static_assert(alignof(UFortEventModeEmotesWidget) == 0x000008, "Wrong alignment on UFortEventModeEmotesWidget");
static_assert(sizeof(UFortEventModeEmotesWidget) == 0x0003C0, "Wrong size on UFortEventModeEmotesWidget");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote1) == 0x000328, "Member 'UFortEventModeEmotesWidget::Emote1' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote2) == 0x000348, "Member 'UFortEventModeEmotesWidget::Emote2' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote3) == 0x000368, "Member 'UFortEventModeEmotesWidget::Emote3' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, RandomEmotes) == 0x000388, "Member 'UFortEventModeEmotesWidget::RandomEmotes' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote1) == 0x0003A0, "Member 'UFortEventModeEmotesWidget::Text_Emote1' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote2) == 0x0003A8, "Member 'UFortEventModeEmotesWidget::Text_Emote2' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote3) == 0x0003B0, "Member 'UFortEventModeEmotesWidget::Text_Emote3' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_EmoteRandom) == 0x0003B8, "Member 'UFortEventModeEmotesWidget::Text_EmoteRandom' has a wrong offset!");

// Class EventModeUI.FortMobileActionButtonBehavior_Focus
// 0x0008 (0x0140 - 0x0138)
class UFortMobileActionButtonBehavior_Focus : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           StopFocusingSprite;                                // 0x0138(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_Focus">();
	}
	static class UFortMobileActionButtonBehavior_Focus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_Focus>();
	}
};
static_assert(alignof(UFortMobileActionButtonBehavior_Focus) == 0x000008, "Wrong alignment on UFortMobileActionButtonBehavior_Focus");
static_assert(sizeof(UFortMobileActionButtonBehavior_Focus) == 0x000140, "Wrong size on UFortMobileActionButtonBehavior_Focus");
static_assert(offsetof(UFortMobileActionButtonBehavior_Focus, StopFocusingSprite) == 0x000138, "Member 'UFortMobileActionButtonBehavior_Focus::StopFocusingSprite' has a wrong offset!");

}

