#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardEntry.EventLeaderboardEntry_C
// 0x00A0 (0x15A0 - 0x1500)
class UEventLeaderboardEntry_C final : public UFortEventLeaderboardEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_IsPlayer;                             // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Zebra;                                // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_Rank;                         // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnlineStatus;                                // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Qualified;                                   // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_OnlineStatus;                              // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_QualifiedContent;                          // 0x1548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Rank;                                         // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Rank_First;                                   // 0x1558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Score;                                        // 0x1560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isZebra;                                           // 0x1568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x1569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156A[0x6];                                     // 0x156A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              TEMPDatatableIdentities;                           // 0x1570(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          isMatchPoint;                                      // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void EventColorize();
	void EventStyleEntry();
	void ExecuteUbergraph_EventLeaderboardEntry(int32 EntryPoint);
	void InitializeTeamTextEntry(class UUserWidget* TeamEntryWidget, const class FText& Usernames);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void SetEntryDetails(class UFortEventLeaderboardEntryData* EntryData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardEntry_C">();
	}
	static class UEventLeaderboardEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardEntry_C>();
	}
};
static_assert(alignof(UEventLeaderboardEntry_C) == 0x000010, "Wrong alignment on UEventLeaderboardEntry_C");
static_assert(sizeof(UEventLeaderboardEntry_C) == 0x0015A0, "Wrong size on UEventLeaderboardEntry_C");
static_assert(offsetof(UEventLeaderboardEntry_C, UberGraphFrame) == 0x001500, "Member 'UEventLeaderboardEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Selected) == 0x001508, "Member 'UEventLeaderboardEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonBorder_IsPlayer) == 0x001510, "Member 'UEventLeaderboardEntry_C::CommonBorder_IsPlayer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonBorder_Zebra) == 0x001518, "Member 'UEventLeaderboardEntry_C::CommonBorder_Zebra' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonWidgetSwitcher_Rank) == 0x001520, "Member 'UEventLeaderboardEntry_C::CommonWidgetSwitcher_Rank' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Image_OnlineStatus) == 0x001528, "Member 'UEventLeaderboardEntry_C::Image_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Image_Qualified) == 0x001530, "Member 'UEventLeaderboardEntry_C::Image_Qualified' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Image_SelectedBG) == 0x001538, "Member 'UEventLeaderboardEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Overlay_OnlineStatus) == 0x001540, "Member 'UEventLeaderboardEntry_C::Overlay_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Overlay_QualifiedContent) == 0x001548, "Member 'UEventLeaderboardEntry_C::Overlay_QualifiedContent' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Text_Rank) == 0x001550, "Member 'UEventLeaderboardEntry_C::Text_Rank' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Text_Rank_First) == 0x001558, "Member 'UEventLeaderboardEntry_C::Text_Rank_First' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Text_Score) == 0x001560, "Member 'UEventLeaderboardEntry_C::Text_Score' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, isZebra) == 0x001568, "Member 'UEventLeaderboardEntry_C::isZebra' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, IsPlayer) == 0x001569, "Member 'UEventLeaderboardEntry_C::IsPlayer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, TEMPDatatableIdentities) == 0x001570, "Member 'UEventLeaderboardEntry_C::TEMPDatatableIdentities' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, isMatchPoint) == 0x001590, "Member 'UEventLeaderboardEntry_C::isMatchPoint' has a wrong offset!");

}

