#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryEntry.EventTeamMatchHistoryEntry_C
// 0x0040 (0x15A0 - 0x1560)
class UEventTeamMatchHistoryEntry_C final : public UFortEventTeamMatchHistoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Zebra;                                      // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hovered;                                           // 0x1578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Unhovered;                                         // 0x1588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_EventTeamMatchHistoryEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryEntry_C">();
	}
	static class UEventTeamMatchHistoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryEntry_C>();
	}
};
static_assert(alignof(UEventTeamMatchHistoryEntry_C) == 0x000010, "Wrong alignment on UEventTeamMatchHistoryEntry_C");
static_assert(sizeof(UEventTeamMatchHistoryEntry_C) == 0x0015A0, "Wrong size on UEventTeamMatchHistoryEntry_C");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, UberGraphFrame) == 0x001560, "Member 'UEventTeamMatchHistoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Selected) == 0x001568, "Member 'UEventTeamMatchHistoryEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Border_Zebra) == 0x001570, "Member 'UEventTeamMatchHistoryEntry_C::Border_Zebra' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Hovered) == 0x001578, "Member 'UEventTeamMatchHistoryEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Unhovered) == 0x001588, "Member 'UEventTeamMatchHistoryEntry_C::Unhovered' has a wrong offset!");

}

