#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScreenBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum EventScreenBase.EEventScreenView
// NumValues: 0x0007
enum class EEventScreenView : uint8
{
	None                                     = 0,
	LandingPage                              = 1,
	RewardPreview                            = 2,
	MoreInfo                                 = 3,
	PurchaseLevels                           = 4,
	PurchasePremiumTrack                     = 5,
	LoadError                                = 6,
};

// Enum EventScreenBase.EEventScreenRewardPreviewType
// NumValues: 0x0004
enum class EEventScreenRewardPreviewType : uint8
{
	None                                     = 0,
	RewardTrack                              = 1,
	SpecialItem                              = 2,
	SpecialPremiumItem                       = 3,
};

// ScriptStruct EventScreenBase.EventItemOverride
// 0x0068 (0x0068 - 0x0000)
struct FEventItemOverride final
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     ItemDefinition;                                    // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              CustomItemTexture;                                 // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              CustomItemTextureMobile;                           // 0x0040(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDoubleWidth;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEventItemOverride) == 0x000008, "Wrong alignment on FEventItemOverride");
static_assert(sizeof(FEventItemOverride) == 0x000068, "Wrong size on FEventItemOverride");
static_assert(offsetof(FEventItemOverride, ItemDefinition) == 0x000000, "Member 'FEventItemOverride::ItemDefinition' has a wrong offset!");
static_assert(offsetof(FEventItemOverride, CustomItemTexture) == 0x000020, "Member 'FEventItemOverride::CustomItemTexture' has a wrong offset!");
static_assert(offsetof(FEventItemOverride, CustomItemTextureMobile) == 0x000040, "Member 'FEventItemOverride::CustomItemTextureMobile' has a wrong offset!");
static_assert(offsetof(FEventItemOverride, bIsDoubleWidth) == 0x000060, "Member 'FEventItemOverride::bIsDoubleWidth' has a wrong offset!");

// ScriptStruct EventScreenBase.EventScreenTrackData
// 0x0030 (0x0030 - 0x0000)
struct FEventScreenTrackData final
{
public:
	struct FLinearColor                           TrackColorPrimary;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TrackColorSecondary;                               // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TrackColorTertiary;                                // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventScreenTrackData) == 0x000004, "Wrong alignment on FEventScreenTrackData");
static_assert(sizeof(FEventScreenTrackData) == 0x000030, "Wrong size on FEventScreenTrackData");
static_assert(offsetof(FEventScreenTrackData, TrackColorPrimary) == 0x000000, "Member 'FEventScreenTrackData::TrackColorPrimary' has a wrong offset!");
static_assert(offsetof(FEventScreenTrackData, TrackColorSecondary) == 0x000010, "Member 'FEventScreenTrackData::TrackColorSecondary' has a wrong offset!");
static_assert(offsetof(FEventScreenTrackData, TrackColorTertiary) == 0x000020, "Member 'FEventScreenTrackData::TrackColorTertiary' has a wrong offset!");

// ScriptStruct EventScreenBase.EventScreenMoreInfoGroup
// 0x0050 (0x0050 - 0x0000)
struct FEventScreenMoreInfoGroup final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Body;                                              // 0x0018(0x0018)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0030(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventScreenMoreInfoGroup) == 0x000008, "Wrong alignment on FEventScreenMoreInfoGroup");
static_assert(sizeof(FEventScreenMoreInfoGroup) == 0x000050, "Wrong size on FEventScreenMoreInfoGroup");
static_assert(offsetof(FEventScreenMoreInfoGroup, Header) == 0x000000, "Member 'FEventScreenMoreInfoGroup::Header' has a wrong offset!");
static_assert(offsetof(FEventScreenMoreInfoGroup, Body) == 0x000018, "Member 'FEventScreenMoreInfoGroup::Body' has a wrong offset!");
static_assert(offsetof(FEventScreenMoreInfoGroup, Icon) == 0x000030, "Member 'FEventScreenMoreInfoGroup::Icon' has a wrong offset!");

// ScriptStruct EventScreenBase.EventScreenCMSMoreInfoGroup
// 0x0040 (0x0040 - 0x0000)
struct FEventScreenCMSMoreInfoGroup final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   Body;                                              // 0x0018(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 IconURL;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventScreenCMSMoreInfoGroup) == 0x000008, "Wrong alignment on FEventScreenCMSMoreInfoGroup");
static_assert(sizeof(FEventScreenCMSMoreInfoGroup) == 0x000040, "Wrong size on FEventScreenCMSMoreInfoGroup");
static_assert(offsetof(FEventScreenCMSMoreInfoGroup, Header) == 0x000000, "Member 'FEventScreenCMSMoreInfoGroup::Header' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSMoreInfoGroup, Body) == 0x000018, "Member 'FEventScreenCMSMoreInfoGroup::Body' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSMoreInfoGroup, IconURL) == 0x000030, "Member 'FEventScreenCMSMoreInfoGroup::IconURL' has a wrong offset!");

// ScriptStruct EventScreenBase.EventScreenCMSResourceGroupOverride
// 0x0018 (0x0018 - 0x0000)
struct FEventScreenCMSResourceGroupOverride final
{
public:
	int32                                         ResourceValue;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 KeyArtOverrideURL;                                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventScreenCMSResourceGroupOverride) == 0x000008, "Wrong alignment on FEventScreenCMSResourceGroupOverride");
static_assert(sizeof(FEventScreenCMSResourceGroupOverride) == 0x000018, "Wrong size on FEventScreenCMSResourceGroupOverride");
static_assert(offsetof(FEventScreenCMSResourceGroupOverride, ResourceValue) == 0x000000, "Member 'FEventScreenCMSResourceGroupOverride::ResourceValue' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSResourceGroupOverride, KeyArtOverrideURL) == 0x000008, "Member 'FEventScreenCMSResourceGroupOverride::KeyArtOverrideURL' has a wrong offset!");

// ScriptStruct EventScreenBase.EventScreenCMSData
// 0x02A8 (0x02A8 - 0x0000)
struct FEventScreenCMSData final
{
public:
	class FString                                 EventCMSId;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   EventName;                                         // 0x0010(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   EventDescription;                                  // 0x0028(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   ResourceHeader;                                    // 0x0040(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   StarterHeader;                                     // 0x0058(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   CompletionHeader;                                  // 0x0070(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   EventCTA;                                          // 0x0088(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   EventCTACompleted;                                 // 0x00A0(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   HeaderCTA;                                         // 0x00B8(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   ItemShopCallout;                                   // 0x00D0(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 CTAIconURL;                                        // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 KeyArtURL;                                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   MoreInfoHeader;                                    // 0x0108(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoSubHeader;                                 // 0x0120(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoLegal;                                     // 0x0138(0x0018)(NativeAccessSpecifierPublic)
	TArray<struct FEventScreenCMSMoreInfoGroup>   MoreInfoGroups;                                    // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   PurchaseLegal;                                     // 0x0160(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   RewardTrackLegal;                                  // 0x0178(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 ItemShopOfferId;                                   // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellUnownedHeader;                        // 0x01A0(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellUnownedBody;                          // 0x01B8(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellOwnedHeader;                          // 0x01D0(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellOwnedBody;                            // 0x01E8(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 PremiumUpsellIconURL;                              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PurchasePremiumTrackHeader;                        // 0x0210(0x0018)(NativeAccessSpecifierPublic)
	TArray<class FText>                           PurchasePremiumTrackBodyList;                      // 0x0228(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialItemUnowned;                         // 0x0238(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialItemOwned;                           // 0x0250(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialPremiumItemUnowned;                  // 0x0268(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialPremiumItemOwned;                    // 0x0280(0x0018)(NativeAccessSpecifierPublic)
	TArray<struct FEventScreenCMSResourceGroupOverride> ResourceGroupOverrides;                            // 0x0298(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventScreenCMSData) == 0x000008, "Wrong alignment on FEventScreenCMSData");
static_assert(sizeof(FEventScreenCMSData) == 0x0002A8, "Wrong size on FEventScreenCMSData");
static_assert(offsetof(FEventScreenCMSData, EventCMSId) == 0x000000, "Member 'FEventScreenCMSData::EventCMSId' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, EventName) == 0x000010, "Member 'FEventScreenCMSData::EventName' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, EventDescription) == 0x000028, "Member 'FEventScreenCMSData::EventDescription' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, ResourceHeader) == 0x000040, "Member 'FEventScreenCMSData::ResourceHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, StarterHeader) == 0x000058, "Member 'FEventScreenCMSData::StarterHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, CompletionHeader) == 0x000070, "Member 'FEventScreenCMSData::CompletionHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, EventCTA) == 0x000088, "Member 'FEventScreenCMSData::EventCTA' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, EventCTACompleted) == 0x0000A0, "Member 'FEventScreenCMSData::EventCTACompleted' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, HeaderCTA) == 0x0000B8, "Member 'FEventScreenCMSData::HeaderCTA' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, ItemShopCallout) == 0x0000D0, "Member 'FEventScreenCMSData::ItemShopCallout' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, CTAIconURL) == 0x0000E8, "Member 'FEventScreenCMSData::CTAIconURL' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, KeyArtURL) == 0x0000F8, "Member 'FEventScreenCMSData::KeyArtURL' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, MoreInfoHeader) == 0x000108, "Member 'FEventScreenCMSData::MoreInfoHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, MoreInfoSubHeader) == 0x000120, "Member 'FEventScreenCMSData::MoreInfoSubHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, MoreInfoLegal) == 0x000138, "Member 'FEventScreenCMSData::MoreInfoLegal' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, MoreInfoGroups) == 0x000150, "Member 'FEventScreenCMSData::MoreInfoGroups' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PurchaseLegal) == 0x000160, "Member 'FEventScreenCMSData::PurchaseLegal' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, RewardTrackLegal) == 0x000178, "Member 'FEventScreenCMSData::RewardTrackLegal' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, ItemShopOfferId) == 0x000190, "Member 'FEventScreenCMSData::ItemShopOfferId' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PremiumUpsellUnownedHeader) == 0x0001A0, "Member 'FEventScreenCMSData::PremiumUpsellUnownedHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PremiumUpsellUnownedBody) == 0x0001B8, "Member 'FEventScreenCMSData::PremiumUpsellUnownedBody' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PremiumUpsellOwnedHeader) == 0x0001D0, "Member 'FEventScreenCMSData::PremiumUpsellOwnedHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PremiumUpsellOwnedBody) == 0x0001E8, "Member 'FEventScreenCMSData::PremiumUpsellOwnedBody' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PremiumUpsellIconURL) == 0x000200, "Member 'FEventScreenCMSData::PremiumUpsellIconURL' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PurchasePremiumTrackHeader) == 0x000210, "Member 'FEventScreenCMSData::PurchasePremiumTrackHeader' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, PurchasePremiumTrackBodyList) == 0x000228, "Member 'FEventScreenCMSData::PurchasePremiumTrackBodyList' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, InspectSpecialItemUnowned) == 0x000238, "Member 'FEventScreenCMSData::InspectSpecialItemUnowned' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, InspectSpecialItemOwned) == 0x000250, "Member 'FEventScreenCMSData::InspectSpecialItemOwned' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, InspectSpecialPremiumItemUnowned) == 0x000268, "Member 'FEventScreenCMSData::InspectSpecialPremiumItemUnowned' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, InspectSpecialPremiumItemOwned) == 0x000280, "Member 'FEventScreenCMSData::InspectSpecialPremiumItemOwned' has a wrong offset!");
static_assert(offsetof(FEventScreenCMSData, ResourceGroupOverrides) == 0x000298, "Member 'FEventScreenCMSData::ResourceGroupOverrides' has a wrong offset!");

// ScriptStruct EventScreenBase.EventScreenCMSGroup
// 0x0010 (0x0010 - 0x0000)
struct FEventScreenCMSGroup final
{
public:
	TArray<struct FEventScreenCMSData>            EventScreens;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEventScreenCMSGroup) == 0x000008, "Wrong alignment on FEventScreenCMSGroup");
static_assert(sizeof(FEventScreenCMSGroup) == 0x000010, "Wrong size on FEventScreenCMSGroup");
static_assert(offsetof(FEventScreenCMSGroup, EventScreens) == 0x000000, "Member 'FEventScreenCMSGroup::EventScreens' has a wrong offset!");

}

