#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryStat.EventTeamMatchHistoryStat_C
// 0x0028 (0x02F8 - 0x02D0)
class UEventTeamMatchHistoryStat_C final : public UFortEventTeamMatchHistoryStat
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class FText                                   Icon_Text;                                         // 0x02E0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_EventTeamMatchHistoryStat(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Hovered_Event();
	void Set_Unhovered_Event();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryStat_C">();
	}
	static class UEventTeamMatchHistoryStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryStat_C>();
	}
};
static_assert(alignof(UEventTeamMatchHistoryStat_C) == 0x000008, "Wrong alignment on UEventTeamMatchHistoryStat_C");
static_assert(sizeof(UEventTeamMatchHistoryStat_C) == 0x0002F8, "Wrong size on UEventTeamMatchHistoryStat_C");
static_assert(offsetof(UEventTeamMatchHistoryStat_C, UberGraphFrame) == 0x0002D0, "Member 'UEventTeamMatchHistoryStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryStat_C, Selected) == 0x0002D8, "Member 'UEventTeamMatchHistoryStat_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryStat_C, Icon_Text) == 0x0002E0, "Member 'UEventTeamMatchHistoryStat_C::Icon_Text' has a wrong offset!");

}

