#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecutionTestSuite_0

#include "Basic.hpp"


namespace SDK
{

// VerseStruct ExecutionTestSuite.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct ExecutionTestSuite_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExecutionTestSuite_0::Ftuple_L_R) == 0x000001, "Wrong alignment on ExecutionTestSuite_0::Ftuple_L_R");
static_assert(sizeof(ExecutionTestSuite_0::Ftuple_L_R) == 0x000001, "Wrong size on ExecutionTestSuite_0::Ftuple_L_R");
static_assert(offsetof(ExecutionTestSuite_0::Ftuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'ExecutionTestSuite_0::Ftuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct ExecutionTestSuite.tuple_Lexecution__subscribable_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lexecution__subscribable_Mlogic_R final
{
public:
	class UExecution_execution_subscribable*      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Ftuple_Lexecution__subscribable_Mlogic_R) == 0x000008, "Wrong alignment on Ftuple_Lexecution__subscribable_Mlogic_R");
static_assert(sizeof(Ftuple_Lexecution__subscribable_Mlogic_R) == 0x000010, "Wrong size on Ftuple_Lexecution__subscribable_Mlogic_R");
static_assert(offsetof(Ftuple_Lexecution__subscribable_Mlogic_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Ftuple_Lexecution__subscribable_Mlogic_R::__verse_0x18E3F084_Elem0' has a wrong offset!");

// VerseStruct ExecutionTestSuite.tuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseFunctionProperty_                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R) == 0x000008, "Wrong alignment on ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R");
static_assert(sizeof(ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R) == 0x000020, "Wrong size on ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R");
static_assert(offsetof(ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x7D844C3C_Elem1) == 0x000010, "Member 'ExecutionTestSuite_0::Ftuple_Lfloat_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// VerseStruct ExecutionTestSuite.tuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseFunctionProperty_                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R) == 0x000008, "Wrong alignment on ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R");
static_assert(sizeof(ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R) == 0x000020, "Wrong size on ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R");
static_assert(offsetof(ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R, __verse_0x7D844C3C_Elem1) == 0x000010, "Member 'ExecutionTestSuite_0::Ftuple_Ltuple_L_R_Tvoid_M_QInterval_Nfloat_20_3d_20_2e_2e_2e_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

}

