#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Prime_Skeleton_AnimBlueprint_E

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Prime_Skeleton_AnimBlueprint_E.F_MED_Prime_Skeleton_AnimBlueprint_E_C
// 0x5F00 (0x6620 - 0x0720)
class UF_MED_Prime_Skeleton_AnimBlueprint_E_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0738(0x0150)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0888(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08A8(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x08C8(0x0478)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x0D40(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x0E48(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x0F50(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x1058(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x1160(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x1268(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x1370(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x1478(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1580(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x16A8(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x17D0(0x0108)()
	uint8                                         Pad_18D8[0x8];                                     // 0x18D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x18E0(0x0960)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x2240(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x2750(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x2C60(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x3170(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x3680(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x3B90(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x40A0(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x45B0(0x0960)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x4F10(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x5038(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x5140(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x5160(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x5288(0x0128)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x53B0(0x0960)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x5D10(0x0128)()
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x5E38(0x07B8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Gravity_Override;                                  // 0x65F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Neck_Alpha;                                        // 0x6608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Head_Tilt_Alpha;                                   // 0x6610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Skydive_Alpha;                                     // 0x6618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint_E(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Prime_Skeleton_AnimBlueprint_E_C">();
	}
	static class UF_MED_Prime_Skeleton_AnimBlueprint_E_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Prime_Skeleton_AnimBlueprint_E_C>();
	}
};
static_assert(alignof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C) == 0x000010, "Wrong alignment on UF_MED_Prime_Skeleton_AnimBlueprint_E_C");
static_assert(sizeof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C) == 0x006620, "Wrong size on UF_MED_Prime_Skeleton_AnimBlueprint_E_C");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, UberGraphFrame) == 0x000720, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimBlueprintExtension_PropertyAccess) == 0x000728, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimBlueprintExtension_Base) == 0x000730, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_CopyPoseFromMesh) == 0x000738, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_LocalToComponentSpace) == 0x000888, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008A8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ControlRig) == 0x0008C8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_9) == 0x000D40, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_8) == 0x000E48, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_7) == 0x000F50, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_6) == 0x001058, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_5) == 0x001160, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_4) == 0x001268, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_3) == 0x001370, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_2) == 0x001478, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ModifyBone_5) == 0x001580, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ModifyBone_4) == 0x0016A8, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint_1) == 0x0017D0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_RigidBody_2) == 0x0018E0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics_6) == 0x002240, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics_5) == 0x002750, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics_4) == 0x002C60, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics_3) == 0x003170, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics_2) == 0x003680, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics_1) == 0x003B90, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_AnimDynamics) == 0x0040A0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_RigidBody_1) == 0x0045B0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ModifyBone_3) == 0x004F10, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Constraint) == 0x005038, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_Root) == 0x005140, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ModifyBone_2) == 0x005160, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ModifyBone_1) == 0x005288, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_RigidBody) == 0x0053B0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, AnimGraphNode_ModifyBone) == 0x005D10, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, Gravity_Override_Params) == 0x005E38, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::Gravity_Override_Params' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, Gravity_Override) == 0x0065F0, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::Gravity_Override' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, Neck_Alpha) == 0x006608, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::Neck_Alpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, Head_Tilt_Alpha) == 0x006610, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::Head_Tilt_Alpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Prime_Skeleton_AnimBlueprint_E_C, Skydive_Alpha) == 0x006618, "Member 'UF_MED_Prime_Skeleton_AnimBlueprint_E_C::Skydive_Alpha' has a wrong offset!");

}

