#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint.F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C
// 0x0190 (0x08B0 - 0x0720)
class UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0758(0x0150)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C">();
	}
	static class UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C) == 0x0008B0, "Wrong size on UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000720, "Member 'UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000728, "Member 'UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000730, "Member 'UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000738, "Member 'UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x000758, "Member 'UF_MED_Ramirez_Fallback_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

