#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricRuntime

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MetasoundEngine_structs.hpp"
#include "Engine_classes.hpp"
#include "FabricRuntime_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "HarmonixDsp_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "HarmonixMetasound_structs.hpp"
#include "HarmonixMidi_structs.hpp"


namespace SDK
{

// Class FabricRuntime.FabricAnimatableButtonInterface
// 0x0000 (0x0028 - 0x0028)
class IFabricAnimatableButtonInterface final : public IInterface
{
public:
	void PlayCloseAnimation();
	void PlayOpenAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAnimatableButtonInterface">();
	}
	static class IFabricAnimatableButtonInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAnimatableButtonInterface>();
	}
};
static_assert(alignof(IFabricAnimatableButtonInterface) == 0x000008, "Wrong alignment on IFabricAnimatableButtonInterface");
static_assert(sizeof(IFabricAnimatableButtonInterface) == 0x000028, "Wrong size on IFabricAnimatableButtonInterface");

// Class FabricRuntime.FabricButtonBase
// 0x0078 (0x0308 - 0x0290)
class AFabricButtonBase final : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayerController* InteractingController, bool IsToggle)> ToggleStateChanged;                                // 0x02A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        OpenTimeSeconds;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CloseTimeSeconds;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToggle;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonPressMethod                            ClickMethod;                                       // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      InteractingController;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ButtonId;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonLabel;                                       // 0x02E0(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x02F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHovered;                                          // 0x02F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPressed;                                          // 0x02FA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECheckBoxState                                ToggleState;                                       // 0x02FB(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricInteractableViewModel*           WidgetViewModel;                                   // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UTimelineComponent* GetCloseTimeline();
	class UTimelineComponent* GetOpenTimeline();
	void HandleButtonClicked();
	void HandleButtonDoubleClicked();
	void HandleButtonHovered();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleButtonUnhovered();
	bool IsEnabled();
	bool IsHovered();
	bool IsPressed();
	bool IsToggledOn();
	void OnButtonClicked();
	void OnButtonDoubleClicked();
	void OnButtonPressed();
	void OnButtonReleased();
	void OnDisabled();
	void OnEnabled();
	void OnHovered();
	void OnToggleStateChanged(bool bIsToggled);
	void OnUnhovered();
	void SetEnabled(bool bNewEnabled);
	void SetToggleState(bool bNewToggleState, bool bBroadcast, bool bForce);
	void SetWidgetViewModel(class UFabricInteractableViewModel* ViewModel);
	void SwapToggle();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricButtonBase">();
	}
	static class AFabricButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFabricButtonBase>();
	}
};
static_assert(alignof(AFabricButtonBase) == 0x000008, "Wrong alignment on AFabricButtonBase");
static_assert(sizeof(AFabricButtonBase) == 0x000308, "Wrong size on AFabricButtonBase");
static_assert(offsetof(AFabricButtonBase, ToggleStateChanged) == 0x0002A0, "Member 'AFabricButtonBase::ToggleStateChanged' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, OpenTimeSeconds) == 0x0002B0, "Member 'AFabricButtonBase::OpenTimeSeconds' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, CloseTimeSeconds) == 0x0002B8, "Member 'AFabricButtonBase::CloseTimeSeconds' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, bHasToggle) == 0x0002C0, "Member 'AFabricButtonBase::bHasToggle' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, ClickMethod) == 0x0002C1, "Member 'AFabricButtonBase::ClickMethod' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, InteractingController) == 0x0002C8, "Member 'AFabricButtonBase::InteractingController' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, ButtonId) == 0x0002D0, "Member 'AFabricButtonBase::ButtonId' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, ButtonLabel) == 0x0002E0, "Member 'AFabricButtonBase::ButtonLabel' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, bEnabled) == 0x0002F8, "Member 'AFabricButtonBase::bEnabled' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, bHovered) == 0x0002F9, "Member 'AFabricButtonBase::bHovered' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, bPressed) == 0x0002FA, "Member 'AFabricButtonBase::bPressed' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, ToggleState) == 0x0002FB, "Member 'AFabricButtonBase::ToggleState' has a wrong offset!");
static_assert(offsetof(AFabricButtonBase, WidgetViewModel) == 0x000300, "Member 'AFabricButtonBase::WidgetViewModel' has a wrong offset!");

// Class FabricRuntime.FabricButtonComponentBase
// 0x0090 (0x0650 - 0x05C0)
class UFabricButtonComponentBase final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_5C0[0x10];                                     // 0x05C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayerController* InteractingController, bool IsToggle)> ToggleStateChanged;                                // 0x05D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        OpenTimeSeconds;                                   // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CloseTimeSeconds;                                  // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToggle;                                        // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonPressMethod                            ClickMethod;                                       // 0x05F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      InteractingController;                             // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ButtonId;                                          // 0x0600(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonLabel;                                       // 0x0610(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseScreenGrid;                                    // 0x0628(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenGridPosition;                                // 0x0630(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0640(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHovered;                                          // 0x0641(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPressed;                                          // 0x0642(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECheckBoxState                                ToggleState;                                       // 0x0643(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricInteractableViewModel*           WidgetViewModel;                                   // 0x0648(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ConstructButton();
	class UTimelineComponent* GetCloseTimeline();
	class UTimelineComponent* GetOpenTimeline();
	void HandleButtonClicked();
	void HandleButtonDoubleClicked();
	void HandleButtonHovered();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleButtonUnhovered();
	bool IsEnabled();
	bool IsHovered();
	bool IsPressed();
	bool IsToggledOn();
	void OnButtonClicked();
	void OnButtonDoubleClicked();
	void OnButtonPressed();
	void OnButtonReleased();
	void OnDisabled();
	void OnEnabled();
	void OnHovered();
	void OnToggleStateChanged(bool bIsToggled);
	void OnUnhovered();
	void SetEnabled(bool bNewEnabled);
	void SetToggleState(bool bNewToggleState, bool bBroadcast, bool bForce);
	void SetWidgetViewModel(class UFabricInteractableViewModel* ViewModel);
	void SwapToggle();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricButtonComponentBase">();
	}
	static class UFabricButtonComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricButtonComponentBase>();
	}
};
static_assert(alignof(UFabricButtonComponentBase) == 0x000010, "Wrong alignment on UFabricButtonComponentBase");
static_assert(sizeof(UFabricButtonComponentBase) == 0x000650, "Wrong size on UFabricButtonComponentBase");
static_assert(offsetof(UFabricButtonComponentBase, ToggleStateChanged) == 0x0005D0, "Member 'UFabricButtonComponentBase::ToggleStateChanged' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, OpenTimeSeconds) == 0x0005E0, "Member 'UFabricButtonComponentBase::OpenTimeSeconds' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, CloseTimeSeconds) == 0x0005E8, "Member 'UFabricButtonComponentBase::CloseTimeSeconds' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, bHasToggle) == 0x0005F0, "Member 'UFabricButtonComponentBase::bHasToggle' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, ClickMethod) == 0x0005F1, "Member 'UFabricButtonComponentBase::ClickMethod' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, InteractingController) == 0x0005F8, "Member 'UFabricButtonComponentBase::InteractingController' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, ButtonId) == 0x000600, "Member 'UFabricButtonComponentBase::ButtonId' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, ButtonLabel) == 0x000610, "Member 'UFabricButtonComponentBase::ButtonLabel' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, bUseScreenGrid) == 0x000628, "Member 'UFabricButtonComponentBase::bUseScreenGrid' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, ScreenGridPosition) == 0x000630, "Member 'UFabricButtonComponentBase::ScreenGridPosition' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, bEnabled) == 0x000640, "Member 'UFabricButtonComponentBase::bEnabled' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, bHovered) == 0x000641, "Member 'UFabricButtonComponentBase::bHovered' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, bPressed) == 0x000642, "Member 'UFabricButtonComponentBase::bPressed' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, ToggleState) == 0x000643, "Member 'UFabricButtonComponentBase::ToggleState' has a wrong offset!");
static_assert(offsetof(UFabricButtonComponentBase, WidgetViewModel) == 0x000648, "Member 'UFabricButtonComponentBase::WidgetViewModel' has a wrong offset!");

// Class FabricRuntime.FabricDevice
// 0x0000 (0x0028 - 0x0028)
class IFabricDevice final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricDevice">();
	}
	static class IFabricDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricDevice>();
	}
};
static_assert(alignof(IFabricDevice) == 0x000008, "Wrong alignment on IFabricDevice");
static_assert(sizeof(IFabricDevice) == 0x000028, "Wrong size on IFabricDevice");

// Class FabricRuntime.FabricMetaSoundPatchOwner
// 0x0000 (0x0028 - 0x0028)
class IFabricMetaSoundPatchOwner final : public IInterface
{
public:
	class UFabricMetaSoundPatchWrapper* GetMetaSoundPatchWrapper();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMetaSoundPatchOwner">();
	}
	static class IFabricMetaSoundPatchOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMetaSoundPatchOwner>();
	}
};
static_assert(alignof(IFabricMetaSoundPatchOwner) == 0x000008, "Wrong alignment on IFabricMetaSoundPatchOwner");
static_assert(sizeof(IFabricMetaSoundPatchOwner) == 0x000028, "Wrong size on IFabricMetaSoundPatchOwner");

// Class FabricRuntime.FabricAudioGenerator
// 0x0000 (0x0028 - 0x0028)
class IFabricAudioGenerator final : public IInterface
{
public:
	struct FSourceEffectChainEntry GetAudioAnalyzer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioGenerator">();
	}
	static class IFabricAudioGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioGenerator>();
	}
};
static_assert(alignof(IFabricAudioGenerator) == 0x000008, "Wrong alignment on IFabricAudioGenerator");
static_assert(sizeof(IFabricAudioGenerator) == 0x000028, "Wrong size on IFabricAudioGenerator");

// Class FabricRuntime.FabricAudioModifier
// 0x0000 (0x0028 - 0x0028)
class IFabricAudioModifier final : public IInterface
{
public:
	TArray<struct FSourceEffectChainEntry> GetSourceEffectChainEntries();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioModifier">();
	}
	static class IFabricAudioModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioModifier>();
	}
};
static_assert(alignof(IFabricAudioModifier) == 0x000008, "Wrong alignment on IFabricAudioModifier");
static_assert(sizeof(IFabricAudioModifier) == 0x000028, "Wrong size on IFabricAudioModifier");

// Class FabricRuntime.FabricAudioReceiver
// 0x0000 (0x0028 - 0x0028)
class IFabricAudioReceiver final : public IInterface
{
public:
	class USoundSourceBus* GetSoundSourceBus();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioReceiver">();
	}
	static class IFabricAudioReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioReceiver>();
	}
};
static_assert(alignof(IFabricAudioReceiver) == 0x000008, "Wrong alignment on IFabricAudioReceiver");
static_assert(sizeof(IFabricAudioReceiver) == 0x000028, "Wrong size on IFabricAudioReceiver");

// Class FabricRuntime.FabricFloatGenerator
// 0x0000 (0x0028 - 0x0028)
class IFabricFloatGenerator final : public IInterface
{
public:
	class UFabricFloatProviderBase* GetFloatProvider();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatGenerator">();
	}
	static class IFabricFloatGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricFloatGenerator>();
	}
};
static_assert(alignof(IFabricFloatGenerator) == 0x000008, "Wrong alignment on IFabricFloatGenerator");
static_assert(sizeof(IFabricFloatGenerator) == 0x000028, "Wrong size on IFabricFloatGenerator");

// Class FabricRuntime.FabricFloatReceiver
// 0x0000 (0x0028 - 0x0028)
class IFabricFloatReceiver final : public IInterface
{
public:
	void SetFloatProviders(const TArray<class UFabricFloatProviderBase*>& FloatProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatReceiver">();
	}
	static class IFabricFloatReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricFloatReceiver>();
	}
};
static_assert(alignof(IFabricFloatReceiver) == 0x000008, "Wrong alignment on IFabricFloatReceiver");
static_assert(sizeof(IFabricFloatReceiver) == 0x000028, "Wrong size on IFabricFloatReceiver");

// Class FabricRuntime.FabricTextureGenerator
// 0x0000 (0x0028 - 0x0028)
class IFabricTextureGenerator final : public IInterface
{
public:
	class UFabricTextureProviderBase* GetTextureProvider();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureGenerator">();
	}
	static class IFabricTextureGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureGenerator>();
	}
};
static_assert(alignof(IFabricTextureGenerator) == 0x000008, "Wrong alignment on IFabricTextureGenerator");
static_assert(sizeof(IFabricTextureGenerator) == 0x000028, "Wrong size on IFabricTextureGenerator");

// Class FabricRuntime.FabricTextureModifier
// 0x0000 (0x0028 - 0x0028)
class IFabricTextureModifier final : public IInterface
{
public:
	class UFabricTextureModifierBase* GetTextureModifier();

	bool IsShowingTexturePreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureModifier">();
	}
	static class IFabricTextureModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureModifier>();
	}
};
static_assert(alignof(IFabricTextureModifier) == 0x000008, "Wrong alignment on IFabricTextureModifier");
static_assert(sizeof(IFabricTextureModifier) == 0x000028, "Wrong size on IFabricTextureModifier");

// Class FabricRuntime.FabricTextureReceiver
// 0x0000 (0x0028 - 0x0028)
class IFabricTextureReceiver final : public IInterface
{
public:
	void OnTexturesChanged(const TArray<struct FFabricTextureProviderTexture>& Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureReceiver">();
	}
	static class IFabricTextureReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureReceiver>();
	}
};
static_assert(alignof(IFabricTextureReceiver) == 0x000008, "Wrong alignment on IFabricTextureReceiver");
static_assert(sizeof(IFabricTextureReceiver) == 0x000028, "Wrong size on IFabricTextureReceiver");

// Class FabricRuntime.FabricMeshGenerator
// 0x0000 (0x0028 - 0x0028)
class IFabricMeshGenerator final : public IInterface
{
public:
	class UFabricMeshProviderBase* GetMeshProvider();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMeshGenerator">();
	}
	static class IFabricMeshGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshGenerator>();
	}
};
static_assert(alignof(IFabricMeshGenerator) == 0x000008, "Wrong alignment on IFabricMeshGenerator");
static_assert(sizeof(IFabricMeshGenerator) == 0x000028, "Wrong size on IFabricMeshGenerator");

// Class FabricRuntime.FabricMeshModifier
// 0x0000 (0x0028 - 0x0028)
class IFabricMeshModifier final : public IInterface
{
public:
	void OnMeshesChanged(const TArray<struct FFabricMeshInstanceReference>& InstanceMeshReferences, bool bInstancesChanged);

	class UFabricMeshModifierBase* GetMeshModifier() const;
	bool IsShowingMeshPreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMeshModifier">();
	}
	static class IFabricMeshModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshModifier>();
	}
};
static_assert(alignof(IFabricMeshModifier) == 0x000008, "Wrong alignment on IFabricMeshModifier");
static_assert(sizeof(IFabricMeshModifier) == 0x000028, "Wrong size on IFabricMeshModifier");

// Class FabricRuntime.FabricMeshReceiver
// 0x0000 (0x0028 - 0x0028)
class IFabricMeshReceiver final : public IInterface
{
public:
	void OnMeshInstanceReferencesChanged(const TArray<struct FFabricMeshInstanceReference>& MeshInstanceReferences, bool bMeshChanged, bool bInstancesChanged);
	void OnMeshInstancesChanged(const TArray<struct FTransform>& Meshes);
	void OnMeshReferenceChanged(const struct FFabricMeshProviderMeshReference& ReferenceMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMeshReceiver">();
	}
	static class IFabricMeshReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshReceiver>();
	}
};
static_assert(alignof(IFabricMeshReceiver) == 0x000008, "Wrong alignment on IFabricMeshReceiver");
static_assert(sizeof(IFabricMeshReceiver) == 0x000028, "Wrong size on IFabricMeshReceiver");

// Class FabricRuntime.FabricModulationNode
// 0x0020 (0x0048 - 0x0028)
class UFabricModulationNode final : public UObject
{
public:
	TArray<class UFabricFloatProviderBase*>       FloatProviders;                                    // 0x0028(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricModulationNode">();
	}
	static class UFabricModulationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricModulationNode>();
	}
};
static_assert(alignof(UFabricModulationNode) == 0x000008, "Wrong alignment on UFabricModulationNode");
static_assert(sizeof(UFabricModulationNode) == 0x000048, "Wrong size on UFabricModulationNode");
static_assert(offsetof(UFabricModulationNode, FloatProviders) == 0x000028, "Member 'UFabricModulationNode::FloatProviders' has a wrong offset!");

// Class FabricRuntime.FabricModulatable
// 0x0300 (0x0328 - 0x0028)
class UFabricModulatable : public UObject
{
public:
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  ModulatedActor;                                    // 0x002C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ModulatorParams;                                   // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSet<class FName>                             NonModulatedParamsWithCallbacks;                   // 0x0048(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, TWeakObjectPtr<class UObject>> Modulators;                                        // 0x0098(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                LastBroadcastedValues;                             // 0x00E8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UObject>>         ModulatorSources;                                  // 0x0138(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x1E0];                                    // 0x0148(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAnyOptionUpdated();
	void OnModulatedPropertyChanged(const class FString& Value, class UObject* ModulatorObject);
	void OnModulatorFloatProviderConnectionChanged(bool bConnected, class UObject* ModulatorObject);
	void OnOptionsLoaded();

	class AActor* GetModulatedActor() const;
	bool GetModulatedBool(const class FString& Param, const struct FMidiSongPos& SongPos, bool* OutBool) const;
	bool GetModulatedEnum(const class FString& Param, const struct FMidiSongPos& SongPos, uint8* OutEnum) const;
	bool GetModulatedFloat(const class FString& Param, const struct FMidiSongPos& SongPos, float* OutFloat) const;
	bool GetModulatedInt(const class FString& Param, const struct FMidiSongPos& SongPos, int32* OutInt) const;
	bool GetModulatedString(const class FString& Param, const struct FMidiSongPos& SongPos, class FString* OutString) const;
	bool IsParamModulated(const class FString& Param) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricModulatable">();
	}
	static class UFabricModulatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricModulatable>();
	}
};
static_assert(alignof(UFabricModulatable) == 0x000008, "Wrong alignment on UFabricModulatable");
static_assert(sizeof(UFabricModulatable) == 0x000328, "Wrong size on UFabricModulatable");
static_assert(offsetof(UFabricModulatable, ModulatedActor) == 0x00002C, "Member 'UFabricModulatable::ModulatedActor' has a wrong offset!");
static_assert(offsetof(UFabricModulatable, ModulatorParams) == 0x000038, "Member 'UFabricModulatable::ModulatorParams' has a wrong offset!");
static_assert(offsetof(UFabricModulatable, NonModulatedParamsWithCallbacks) == 0x000048, "Member 'UFabricModulatable::NonModulatedParamsWithCallbacks' has a wrong offset!");
static_assert(offsetof(UFabricModulatable, Modulators) == 0x000098, "Member 'UFabricModulatable::Modulators' has a wrong offset!");
static_assert(offsetof(UFabricModulatable, LastBroadcastedValues) == 0x0000E8, "Member 'UFabricModulatable::LastBroadcastedValues' has a wrong offset!");
static_assert(offsetof(UFabricModulatable, ModulatorSources) == 0x000138, "Member 'UFabricModulatable::ModulatorSources' has a wrong offset!");

// Class FabricRuntime.FabricFloatProviderBase
// 0x0048 (0x0370 - 0x0328)
class UFabricFloatProviderBase : public UFabricModulatable
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float float)>   OnFloatChanged;                                    // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         CurrentFloat;                                      // 0x0340(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UMusicClockComponent>    MusicClock;                                        // 0x0344(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricMetaSoundModulatorPatchWrapper*  AssociatedPatchWrapper;                            // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 EnabledParam;                                      // 0x0358(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysModulates;                                  // 0x0368(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBindBlueprintOnFloatChanged;                      // 0x0369(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x036A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bModulatorValueChanged;                            // 0x036B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveTick(float DeltaSeconds);
	void SetAssociatedPatchWrapper(class UFabricMetaSoundModulatorPatchWrapper* PatchWrapper);
	void SetMusicClock(class UMusicClockComponent* NewMusicClock);
	void SetProviderEnabled(bool bInIsEnabled);

	class UFabricMetaSoundModulatorPatchWrapper* GetAssociatedPatchWrapper() const;
	float GetCurrentFloat() const;
	struct FMidiSongPos GetCurrentSongPos() const;
	struct FMidiSongPos GetCurrentSongPosWithOffset(float OffsetSeconds) const;
	float GetFloatAtSongPos(const struct FMidiSongPos& SongPos) const;
	EFabricFloatProviderType GetFloatProviderType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderBase">();
	}
	static class UFabricFloatProviderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderBase>();
	}
};
static_assert(alignof(UFabricFloatProviderBase) == 0x000008, "Wrong alignment on UFabricFloatProviderBase");
static_assert(sizeof(UFabricFloatProviderBase) == 0x000370, "Wrong size on UFabricFloatProviderBase");
static_assert(offsetof(UFabricFloatProviderBase, OnFloatChanged) == 0x000330, "Member 'UFabricFloatProviderBase::OnFloatChanged' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, CurrentFloat) == 0x000340, "Member 'UFabricFloatProviderBase::CurrentFloat' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, MusicClock) == 0x000344, "Member 'UFabricFloatProviderBase::MusicClock' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, AssociatedPatchWrapper) == 0x000350, "Member 'UFabricFloatProviderBase::AssociatedPatchWrapper' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, EnabledParam) == 0x000358, "Member 'UFabricFloatProviderBase::EnabledParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, bAlwaysModulates) == 0x000368, "Member 'UFabricFloatProviderBase::bAlwaysModulates' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, bBindBlueprintOnFloatChanged) == 0x000369, "Member 'UFabricFloatProviderBase::bBindBlueprintOnFloatChanged' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, bIsEnabled) == 0x00036A, "Member 'UFabricFloatProviderBase::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderBase, bModulatorValueChanged) == 0x00036B, "Member 'UFabricFloatProviderBase::bModulatorValueChanged' has a wrong offset!");

// Class FabricRuntime.FabricFloatProviderWave
// 0x0150 (0x04C0 - 0x0370)
class UFabricFloatProviderWave final : public UFabricFloatProviderBase
{
public:
	class FString                                 WaveShapeParam;                                    // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 FreeHzParam;                                       // 0x0380(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MinParam;                                          // 0x0390(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MaxParam;                                          // 0x03A0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BeatDurationParam;                                 // 0x03B0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BeatOffsetParam;                                   // 0x03C0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ShapeParam;                                        // 0x03D0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StyleParam;                                        // 0x03E0(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PhaseCPDIndex;                                     // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueCPDIndex;                                     // 0x03F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x78];                                     // 0x03F8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class UStaticMeshComponent>> PreviewDisplayMeshes;                              // 0x0470(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AddPreviewDisplayMesh(class UStaticMeshComponent* Mesh);
	void ClearPreviewDisplayMeshes();
	TArray<class UStaticMeshComponent*> GetPreviewDisplayMeshes();
	void RemovePreviewDisplayMesh(class UStaticMeshComponent* Mesh);
	void SetFreePhase(float InFreePhase);
	void SetRandomSeedByGuid(const struct FGuid& InRandomGuid);

	float GetCurrentFreePhase() const;
	float GetCurrentPhase() const;
	int32 GetRandomSeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderWave">();
	}
	static class UFabricFloatProviderWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderWave>();
	}
};
static_assert(alignof(UFabricFloatProviderWave) == 0x000008, "Wrong alignment on UFabricFloatProviderWave");
static_assert(sizeof(UFabricFloatProviderWave) == 0x0004C0, "Wrong size on UFabricFloatProviderWave");
static_assert(offsetof(UFabricFloatProviderWave, WaveShapeParam) == 0x000370, "Member 'UFabricFloatProviderWave::WaveShapeParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, FreeHzParam) == 0x000380, "Member 'UFabricFloatProviderWave::FreeHzParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, MinParam) == 0x000390, "Member 'UFabricFloatProviderWave::MinParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, MaxParam) == 0x0003A0, "Member 'UFabricFloatProviderWave::MaxParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, BeatDurationParam) == 0x0003B0, "Member 'UFabricFloatProviderWave::BeatDurationParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, BeatOffsetParam) == 0x0003C0, "Member 'UFabricFloatProviderWave::BeatOffsetParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, ShapeParam) == 0x0003D0, "Member 'UFabricFloatProviderWave::ShapeParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, StyleParam) == 0x0003E0, "Member 'UFabricFloatProviderWave::StyleParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, PhaseCPDIndex) == 0x0003F0, "Member 'UFabricFloatProviderWave::PhaseCPDIndex' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, ValueCPDIndex) == 0x0003F4, "Member 'UFabricFloatProviderWave::ValueCPDIndex' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderWave, PreviewDisplayMeshes) == 0x000470, "Member 'UFabricFloatProviderWave::PreviewDisplayMeshes' has a wrong offset!");

// Class FabricRuntime.FabricFloatProviderStep
// 0x0078 (0x03E8 - 0x0370)
class UFabricFloatProviderStep final : public UFabricFloatProviderBase
{
public:
	class FString                                 StepRateParam;                                     // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ActiveStepsParam;                                  // 0x0380(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StepParamBase;                                     // 0x0390(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxSteps;                                          // 0x03A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFabricStepGenerator                   RuntimeGenerator;                                  // 0x03A8(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnFloatProviderStepInitialized;                    // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x10];                                     // 0x03D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetStepLengthBeats() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderStep">();
	}
	static class UFabricFloatProviderStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderStep>();
	}
};
static_assert(alignof(UFabricFloatProviderStep) == 0x000008, "Wrong alignment on UFabricFloatProviderStep");
static_assert(sizeof(UFabricFloatProviderStep) == 0x0003E8, "Wrong size on UFabricFloatProviderStep");
static_assert(offsetof(UFabricFloatProviderStep, StepRateParam) == 0x000370, "Member 'UFabricFloatProviderStep::StepRateParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderStep, ActiveStepsParam) == 0x000380, "Member 'UFabricFloatProviderStep::ActiveStepsParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderStep, StepParamBase) == 0x000390, "Member 'UFabricFloatProviderStep::StepParamBase' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderStep, MaxSteps) == 0x0003A0, "Member 'UFabricFloatProviderStep::MaxSteps' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderStep, RuntimeGenerator) == 0x0003A8, "Member 'UFabricFloatProviderStep::RuntimeGenerator' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderStep, OnFloatProviderStepInitialized) == 0x0003C8, "Member 'UFabricFloatProviderStep::OnFloatProviderStepInitialized' has a wrong offset!");

// Class FabricRuntime.FabricFloatProviderValueSetter
// 0x0080 (0x03F0 - 0x0370)
class UFabricFloatProviderValueSetter final : public UFabricFloatProviderBase
{
public:
	class FString                                 ValueParam;                                        // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TransitionTimingParam;                             // 0x0380(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x60];                                     // 0x0390(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BroadcastCurrentValue(float OverriddenBeat);

	float CalculateTransitionTiming() const;
	bool CanUsePredictiveBeatBroadcasting() const;
	float GetUpdateBeat() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderValueSetter">();
	}
	static class UFabricFloatProviderValueSetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderValueSetter>();
	}
};
static_assert(alignof(UFabricFloatProviderValueSetter) == 0x000008, "Wrong alignment on UFabricFloatProviderValueSetter");
static_assert(sizeof(UFabricFloatProviderValueSetter) == 0x0003F0, "Wrong size on UFabricFloatProviderValueSetter");
static_assert(offsetof(UFabricFloatProviderValueSetter, ValueParam) == 0x000370, "Member 'UFabricFloatProviderValueSetter::ValueParam' has a wrong offset!");
static_assert(offsetof(UFabricFloatProviderValueSetter, TransitionTimingParam) == 0x000380, "Member 'UFabricFloatProviderValueSetter::TransitionTimingParam' has a wrong offset!");

// Class FabricRuntime.FabricHoldable
// 0x0000 (0x0028 - 0x0028)
class IFabricHoldable final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricHoldable">();
	}
	static class IFabricHoldable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricHoldable>();
	}
};
static_assert(alignof(IFabricHoldable) == 0x000008, "Wrong alignment on IFabricHoldable");
static_assert(sizeof(IFabricHoldable) == 0x000028, "Wrong size on IFabricHoldable");

// Class FabricRuntime.FabricInteractableControllerComponent
// 0x0078 (0x0118 - 0x00A0)
class UFabricInteractableControllerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnNoInteractablesHit;                              // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  PlayerController;                                  // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortGadgetItemDefinition> FabricInteractionToolItemDefSoftPtr;               // 0x00C8(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGadgetItemDefinition*              FabricInteractionToolItemDef;                      // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SoftFabricDeviceBaseClass;                         // 0x00F8(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientReceiveDoesIslandContainFabricDevices(const bool bIslandContainsFabricDevices);
	void EnsurePlayerHasInteractionTool();
	void GiveBackInteractionTool();
	void OnCreativeModeEnabledChangedDelegate(bool bCreativeEnabled);
	void ServerGivePlayerFabricInteractionTool();
	void ServerRequestDoesIslandContainFabricDevices();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractableControllerComponent">();
	}
	static class UFabricInteractableControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractableControllerComponent>();
	}
};
static_assert(alignof(UFabricInteractableControllerComponent) == 0x000008, "Wrong alignment on UFabricInteractableControllerComponent");
static_assert(sizeof(UFabricInteractableControllerComponent) == 0x000118, "Wrong size on UFabricInteractableControllerComponent");
static_assert(offsetof(UFabricInteractableControllerComponent, OnNoInteractablesHit) == 0x0000A8, "Member 'UFabricInteractableControllerComponent::OnNoInteractablesHit' has a wrong offset!");
static_assert(offsetof(UFabricInteractableControllerComponent, PlayerController) == 0x0000B8, "Member 'UFabricInteractableControllerComponent::PlayerController' has a wrong offset!");
static_assert(offsetof(UFabricInteractableControllerComponent, PlayerPawn) == 0x0000C0, "Member 'UFabricInteractableControllerComponent::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UFabricInteractableControllerComponent, FabricInteractionToolItemDefSoftPtr) == 0x0000C8, "Member 'UFabricInteractableControllerComponent::FabricInteractionToolItemDefSoftPtr' has a wrong offset!");
static_assert(offsetof(UFabricInteractableControllerComponent, FabricInteractionToolItemDef) == 0x0000E8, "Member 'UFabricInteractableControllerComponent::FabricInteractionToolItemDef' has a wrong offset!");
static_assert(offsetof(UFabricInteractableControllerComponent, SoftFabricDeviceBaseClass) == 0x0000F8, "Member 'UFabricInteractableControllerComponent::SoftFabricDeviceBaseClass' has a wrong offset!");

// Class FabricRuntime.FabricInteractable
// 0x0000 (0x0028 - 0x0028)
class IFabricInteractable final : public IInterface
{
public:
	bool CanInteractWithHoldable(const TScriptInterface<class IFabricHoldable>& Holdable);
	void EndInteraction(class APlayerController* PlayerController, bool bWasDragAndDropInteraction);
	EFabricContinuousInteractionDirection GetContinuousInteractableDirection();
	float GetContinuousInteractableValueNormalized();
	struct FVector GetInteractableComponentLocation(class USceneComponent* Interactable);
	struct FVector GetInteractableForwardVector(class USceneComponent* Interactable);
	EFabricInteractableType GetInteractableType();
	class UAudioComponent* GetInteractionSFX();
	class UObject* GetLinkedInteractable();
	bool IsFocusDependentOnInteractionContext(class APlayerController* Controller);
	bool IsValidToInteractWith(class APlayerController* Controller);
	void OnInteractionFocusTargetChanged(class APlayerController* Controller, class UObject* FocusTarget, bool bIsFocused);
	void SetFocused(bool bIsFocused);
	void SetHitComponent(class USceneComponent* HitComponent);
	void SetInteractable(bool bInteractable);
	bool ShouldPassInteractionToComponent(class AFabricInteractionTool* InteractionTool);
	void StartInteraction(class APlayerController* Controller);
	void StartSpecialInteraction(class APlayerController* Controller);

	bool DoesInteractionRequireHoldable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractable">();
	}
	static class IFabricInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricInteractable>();
	}
};
static_assert(alignof(IFabricInteractable) == 0x000008, "Wrong alignment on IFabricInteractable");
static_assert(sizeof(IFabricInteractable) == 0x000028, "Wrong size on IFabricInteractable");

// Class FabricRuntime.FabricInteractablePlayspaceComponent
// 0x0050 (0x00F0 - 0x00A0)
class UFabricInteractablePlayspaceComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDownloadOnDemandCompleteIndividualClient(const struct FEventMessageTag& Channel, const struct FClientFinishedDownloadOnDemand& Context);
	void OnPlayspaceUserAdded(const struct FPlayspaceUser& PlayspaceUser);
	void SetFabricDeviceExistsInPlayspace();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractablePlayspaceComponent">();
	}
	static class UFabricInteractablePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractablePlayspaceComponent>();
	}
};
static_assert(alignof(UFabricInteractablePlayspaceComponent) == 0x000008, "Wrong alignment on UFabricInteractablePlayspaceComponent");
static_assert(sizeof(UFabricInteractablePlayspaceComponent) == 0x0000F0, "Wrong size on UFabricInteractablePlayspaceComponent");

// Class FabricRuntime.FabricInteractionTool
// 0x0198 (0x16B0 - 0x1518)
class AFabricInteractionTool final : public AFortWeapon
{
public:
	TMulticastInlineDelegate<void(EFabricInteractionToolStates NewState, class AFortCreativeDeviceProp* Device)> OnInteractionStateChanged;                         // 0x1518(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortCreativeDeviceProp* Device)> OnCablesGrabbed;                                   // 0x1528(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortCreativeDeviceProp* Device)> OnCablesDropped;                                   // 0x1538(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float CrossfadeSeconds)> OnMetasoundGeneratorCrossfadeStarted;              // 0x1548(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x1558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxRange;                                          // 0x1560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDragAndDropTriggerTime;                         // 0x1564(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FiringRate;                                        // 0x1568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SplineEndForwardMultiplier;                        // 0x156C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SplineStartForwardMultiplier;                      // 0x1570(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1574[0x4];                                     // 0x1574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                HoveredInteractable;                               // 0x1578(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        HoveredInteractableHitComponent;                   // 0x1580(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                PressedInteractable;                               // 0x1588(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UObject>                 LastPressedInteractable;                           // 0x1590(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PressedInteractableHitComponent;                   // 0x1598(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortCreativeDeviceProp> InteractableOwnerDevice;                           // 0x15A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AccumulatedDragAndDropTriggerTime;                 // 0x15A8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInteractionData                       ServerInteractionData;                             // 0x15AC(0x000C)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15B8[0x11];                                    // 0x15B8(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bServerTriggerPressed;                             // 0x15C9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15CA[0x1];                                     // 0x15CA(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bServerIsHoldingCable;                             // 0x15CB(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15CC[0x14];                                    // 0x15CC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionSplinePoints               ServerSplinePoints;                                // 0x15E0(0x0060)(Net, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         ServerContinuousInteractableValue;                 // 0x1640(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1644[0x6C];                                    // 0x1644(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientDeactiveWeaponAndState();
	void ClientStopInteracting();
	void DeactiveWeaponAndState();
	float GetContinuousInteractableValueNormalized();
	EFabricContinuousInteractionDirection GetContinuousInteractionDirection();
	float GetContinuousMovementValue();
	int32 GetContinuousStateValue();
	EFabricInteractionToolStates GetFabricInteractionToolState();
	class USceneComponent* GetHoveredInteractableHitComponent();
	EFabricInteractableType GetHoveredInteractableType();
	class UObject* GetPressedInteractable();
	void HandleMetasoundGeneratorCrossfade(float CrossfadeSeconds);
	bool IsHoldingCables();
	void OnRep_ServerContinuousInteractableValue();
	void OnRep_ServerInteractionData();
	void OnRep_ServerIsHoldingCable();
	void OnRep_ServerTriggerPressed();
	void OnSplineUpdated(EFabricInteractionToolStates NewInteractionState);
	void ServerHandleFITFired();
	void ServerSetContinuousInteractableValue(float Value);
	void ServerSetInteractionData(const struct FInteractionData& NewData);
	void ServerSetIsHoldingCable(bool bHoldingCable);
	void ServerSetSplinePoints(const struct FInteractionSplinePoints& SplinePoints);
	void ServerSetTriggerPressed(bool bPressed);
	void UnholsterWeapon();

	bool IsRunningOnOwningClient() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractionTool">();
	}
	static class AFabricInteractionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFabricInteractionTool>();
	}
};
static_assert(alignof(AFabricInteractionTool) == 0x000008, "Wrong alignment on AFabricInteractionTool");
