#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FeaturedCreativeContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FeaturedCreativeContent.FeaturedCreativeContent_C
// 0x0040 (0x0300 - 0x02C0)
class UFeaturedCreativeContent_C final : public UFeaturedCreativeContent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCMSImageSlideShow_C*                   CMSImageSlideShow;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IslandCreator;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IslandDetails;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IslandName;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FCreativeAdData>                CurrentAds;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__CMSImageSlideShow_K2Node_ComponentBoundEvent_0_CarouselIndexChanged__DelegateSignature(int32 CurrentPageIndex);
	void ExecuteUbergraph_FeaturedCreativeContent(int32 EntryPoint);
	void OnSetupAds(const TArray<class FString>& MediaURLs, const TArray<struct FCreativeAdData>& AdMetadata);
	void SetFeaturedContentDetails(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FeaturedCreativeContent_C">();
	}
	static class UFeaturedCreativeContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFeaturedCreativeContent_C>();
	}
};
static_assert(alignof(UFeaturedCreativeContent_C) == 0x000008, "Wrong alignment on UFeaturedCreativeContent_C");
static_assert(sizeof(UFeaturedCreativeContent_C) == 0x000300, "Wrong size on UFeaturedCreativeContent_C");
static_assert(offsetof(UFeaturedCreativeContent_C, UberGraphFrame) == 0x0002C0, "Member 'UFeaturedCreativeContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFeaturedCreativeContent_C, base) == 0x0002C8, "Member 'UFeaturedCreativeContent_C::base' has a wrong offset!");
static_assert(offsetof(UFeaturedCreativeContent_C, CMSImageSlideShow) == 0x0002D0, "Member 'UFeaturedCreativeContent_C::CMSImageSlideShow' has a wrong offset!");
static_assert(offsetof(UFeaturedCreativeContent_C, IslandCreator) == 0x0002D8, "Member 'UFeaturedCreativeContent_C::IslandCreator' has a wrong offset!");
static_assert(offsetof(UFeaturedCreativeContent_C, IslandDetails) == 0x0002E0, "Member 'UFeaturedCreativeContent_C::IslandDetails' has a wrong offset!");
static_assert(offsetof(UFeaturedCreativeContent_C, IslandName) == 0x0002E8, "Member 'UFeaturedCreativeContent_C::IslandName' has a wrong offset!");
static_assert(offsetof(UFeaturedCreativeContent_C, CurrentAds) == 0x0002F0, "Member 'UFeaturedCreativeContent_C::CurrentAds' has a wrong offset!");

}

