#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlagSelectionModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FlagSelectionModal.FlagSelectionModal_C
// 0x0040 (0x0668 - 0x0628)
class UFlagSelectionModal_C final : public UFortFlagSelectionModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           FlagConfirmation;                                  // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FlagSelection;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Confirmation;                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             FlagAppearWhooshSound;                             // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FlagClickSound;                                    // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__FlagSelectionModal_Button_Change_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__FlagSelectionModal_Button_ConfirmationCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__FlagSelectionModal_TileView_FlagOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BP_OnActivated();
	void ExecuteUbergraph_FlagSelectionModal(int32 EntryPoint);
	void Handle_Back(bool* Passthrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FlagSelectionModal_C">();
	}
	static class UFlagSelectionModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlagSelectionModal_C>();
	}
};
static_assert(alignof(UFlagSelectionModal_C) == 0x000008, "Wrong alignment on UFlagSelectionModal_C");
static_assert(sizeof(UFlagSelectionModal_C) == 0x000668, "Wrong size on UFlagSelectionModal_C");
static_assert(offsetof(UFlagSelectionModal_C, UberGraphFrame) == 0x000628, "Member 'UFlagSelectionModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, Intro) == 0x000630, "Member 'UFlagSelectionModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, FlagConfirmation) == 0x000638, "Member 'UFlagSelectionModal_C::FlagConfirmation' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, FlagSelection) == 0x000640, "Member 'UFlagSelectionModal_C::FlagSelection' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, SafeZone_0) == 0x000648, "Member 'UFlagSelectionModal_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, Switcher_Confirmation) == 0x000650, "Member 'UFlagSelectionModal_C::Switcher_Confirmation' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, FlagAppearWhooshSound) == 0x000658, "Member 'UFlagSelectionModal_C::FlagAppearWhooshSound' has a wrong offset!");
static_assert(offsetof(UFlagSelectionModal_C, FlagClickSound) == 0x000660, "Member 'UFlagSelectionModal_C::FlagClickSound' has a wrong offset!");

}

