#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamUI

#include "Basic.hpp"

#include "FMJamCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function FMJamUI.JamUIManagerComponent_SongIndicators.RebuildJamSongIndicatorsForPlayspace
// 0x0008 (0x0008 - 0x0000)
struct JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace final
{
public:
	class AJamPlayspace*                          Playspace;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace) == 0x000008, "Wrong alignment on JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace");
static_assert(sizeof(JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace) == 0x000008, "Wrong size on JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace");
static_assert(offsetof(JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace, Playspace) == 0x000000, "Member 'JamUIManagerComponent_SongIndicators_RebuildJamSongIndicatorsForPlayspace::Playspace' has a wrong offset!");

// Function FMJamUI.JamSongIndicator.OnDistanceChanged
// 0x0004 (0x0004 - 0x0000)
struct JamSongIndicator_OnDistanceChanged final
{
public:
	int32                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JamSongIndicator_OnDistanceChanged) == 0x000004, "Wrong alignment on JamSongIndicator_OnDistanceChanged");
static_assert(sizeof(JamSongIndicator_OnDistanceChanged) == 0x000004, "Wrong size on JamSongIndicator_OnDistanceChanged");
static_assert(offsetof(JamSongIndicator_OnDistanceChanged, Distance) == 0x000000, "Member 'JamSongIndicator_OnDistanceChanged::Distance' has a wrong offset!");

// Function FMJamUI.JamSongIndicator.OnInitInfo
// 0x0010 (0x0010 - 0x0000)
struct JamSongIndicator_OnInitInfo final
{
public:
	const class UCatalogData*                     Song;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMJamLoopType                                Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JamSongIndicator_OnInitInfo) == 0x000008, "Wrong alignment on JamSongIndicator_OnInitInfo");
static_assert(sizeof(JamSongIndicator_OnInitInfo) == 0x000010, "Wrong size on JamSongIndicator_OnInitInfo");
static_assert(offsetof(JamSongIndicator_OnInitInfo, Song) == 0x000000, "Member 'JamSongIndicator_OnInitInfo::Song' has a wrong offset!");
static_assert(offsetof(JamSongIndicator_OnInitInfo, Type) == 0x000008, "Member 'JamSongIndicator_OnInitInfo::Type' has a wrong offset!");

// Function FMJamUI.JamSongIndicator.OnScreenClampChanged
// 0x0001 (0x0001 - 0x0000)
struct JamSongIndicator_OnScreenClampChanged final
{
public:
	bool                                          bIsClamped;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JamSongIndicator_OnScreenClampChanged) == 0x000001, "Wrong alignment on JamSongIndicator_OnScreenClampChanged");
static_assert(sizeof(JamSongIndicator_OnScreenClampChanged) == 0x000001, "Wrong size on JamSongIndicator_OnScreenClampChanged");
static_assert(offsetof(JamSongIndicator_OnScreenClampChanged, bIsClamped) == 0x000000, "Member 'JamSongIndicator_OnScreenClampChanged::bIsClamped' has a wrong offset!");

// Function FMJamUI.JamSongIndicator.GetIndicatedPlayerStateAthena
// 0x0008 (0x0008 - 0x0000)
struct JamSongIndicator_GetIndicatedPlayerStateAthena final
{
public:
	const class AFortPlayerStateAthena*           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JamSongIndicator_GetIndicatedPlayerStateAthena) == 0x000008, "Wrong alignment on JamSongIndicator_GetIndicatedPlayerStateAthena");
static_assert(sizeof(JamSongIndicator_GetIndicatedPlayerStateAthena) == 0x000008, "Wrong size on JamSongIndicator_GetIndicatedPlayerStateAthena");
static_assert(offsetof(JamSongIndicator_GetIndicatedPlayerStateAthena, ReturnValue) == 0x000000, "Member 'JamSongIndicator_GetIndicatedPlayerStateAthena::ReturnValue' has a wrong offset!");

}

