#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamContentResolver

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class FMJamContentResolver.JamContentResolver
// 0x0148 (0x01E8 - 0x00A0)
class UJamContentResolver final : public UGameStateComponent
{
public:
	uint8                                         Pad_A0[0x48];                                      // 0x00A0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           DownloadingLinkCodes;                              // 0x00E8(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class FString, class FString>            DownloadedLinkCodes;                               // 0x0138(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         DownloadedLinkCodesInOrder;                        // 0x0188(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_198[0x50];                                     // 0x0198(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleGameFeatureLoadComplete(bool bSuccess, const class FString& LinkCode, const class FString& PluginURL);
	void HandleResolveComplete(bool bSuccess, const class FString& LinkCode, const TArray<class FString>& PluginURLs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamContentResolver">();
	}
	static class UJamContentResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamContentResolver>();
	}
};
static_assert(alignof(UJamContentResolver) == 0x000008, "Wrong alignment on UJamContentResolver");
static_assert(sizeof(UJamContentResolver) == 0x0001E8, "Wrong size on UJamContentResolver");
static_assert(offsetof(UJamContentResolver, DownloadingLinkCodes) == 0x0000E8, "Member 'UJamContentResolver::DownloadingLinkCodes' has a wrong offset!");
static_assert(offsetof(UJamContentResolver, DownloadedLinkCodes) == 0x000138, "Member 'UJamContentResolver::DownloadedLinkCodes' has a wrong offset!");
static_assert(offsetof(UJamContentResolver, DownloadedLinkCodesInOrder) == 0x000188, "Member 'UJamContentResolver::DownloadedLinkCodesInOrder' has a wrong offset!");

}

