#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMM_ExtClamber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ClamberingCodeRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function FMM_ExtClamber.FMM_ExtClamber_C.BP_GetAnimationMontageInformation
// 0x00E8 (0x00E8 - 0x0000)
struct FMM_ExtClamber_C_BP_GetAnimationMontageInformation final
{
public:
	struct FClamberMontageInput                   Context;                                           // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UAnimMontage*                           AnimMontage;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSectionName;                                  // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MontageMiddleSectionName;                          // 0x005C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLedgeLaunch;                                     // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WindowClamber;                                     // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClamberFromFalling;                                // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FutureLedgeY;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasFutureLedge;                                    // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetDistanceZ;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_2;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation) == 0x000008, "Wrong alignment on FMM_ExtClamber_C_BP_GetAnimationMontageInformation");
static_assert(sizeof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation) == 0x0000E8, "Wrong size on FMM_ExtClamber_C_BP_GetAnimationMontageInformation");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, Context) == 0x000000, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::Context' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, AnimMontage) == 0x000050, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::AnimMontage' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, StartSectionName) == 0x000058, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::StartSectionName' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, MontageMiddleSectionName) == 0x00005C, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::MontageMiddleSectionName' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, IsLedgeLaunch) == 0x000060, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::IsLedgeLaunch' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, WindowClamber) == 0x000061, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::WindowClamber' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, ClamberFromFalling) == 0x000062, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::ClamberFromFalling' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, FutureLedgeY) == 0x000068, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::FutureLedgeY' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, HasFutureLedge) == 0x000070, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::HasFutureLedge' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, TargetDistanceZ) == 0x000078, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::TargetDistanceZ' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_BreakVector_X) == 0x000088, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_BreakVector_Y) == 0x000090, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_BreakVector_Z) == 0x000098, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, Temp_bool_Variable) == 0x0000A0, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x0000A4, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000B1, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0000B2, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_BooleanAND_ReturnValue) == 0x0000B3, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x0000B4, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x0000B5, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, Temp_bool_Variable_1) == 0x0000B6, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, K2Node_Select_Default) == 0x0000B8, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, K2Node_Select_Default_1) == 0x0000C0, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, Temp_bool_Variable_2) == 0x0000C8, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, K2Node_Select_Default_2) == 0x0000D0, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000D8, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_GetAnimationMontageInformation, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'FMM_ExtClamber_C_BP_GetAnimationMontageInformation::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function FMM_ExtClamber.FMM_ExtClamber_C.BP_OnExtensionActivate
// 0x0178 (0x0178 - 0x0000)
struct FMM_ExtClamber_C_BP_OnExtensionActivate final
{
public:
	struct FGameplayTag                           NewLocalVar;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetClamberLocation_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0020(0x00D0)(ContainsInstancedReference)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x00F0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1; // 0x0110(0x0020)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue; // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue_1; // 0x016C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMM_ExtClamber_C_BP_OnExtensionActivate) == 0x000008, "Wrong alignment on FMM_ExtClamber_C_BP_OnExtensionActivate");
static_assert(sizeof(FMM_ExtClamber_C_BP_OnExtensionActivate) == 0x000178, "Wrong size on FMM_ExtClamber_C_BP_OnExtensionActivate");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, NewLocalVar) == 0x000000, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::NewLocalVar' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_BP_GetClamberLocation_ReturnValue) == 0x000008, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_BP_GetClamberLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000020, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x0000F0, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1) == 0x000110, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000130, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_HasAuthority_ReturnValue) == 0x000138, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000140, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000148, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000158, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue) == 0x000160, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_Array_Add_ReturnValue) == 0x000168, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue_1) == 0x00016C, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionActivate, CallFunc_Array_Add_ReturnValue_1) == 0x000174, "Member 'FMM_ExtClamber_C_BP_OnExtensionActivate::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function FMM_ExtClamber.FMM_ExtClamber_C.BP_OnExtensionDeactivate
// 0x0058 (0x0058 - 0x0000)
struct FMM_ExtClamber_C_BP_OnExtensionDeactivate final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0010(0x0020)()
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMM_ExtClamber_C_BP_OnExtensionDeactivate) == 0x000008, "Wrong alignment on FMM_ExtClamber_C_BP_OnExtensionDeactivate");
static_assert(sizeof(FMM_ExtClamber_C_BP_OnExtensionDeactivate) == 0x000058, "Wrong size on FMM_ExtClamber_C_BP_OnExtensionDeactivate");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, Temp_int_Array_Index_Variable) == 0x000000, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000010, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_Array_Get_Item) == 0x000030, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_HasAuthority_ReturnValue) == 0x000038, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000040, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000048, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FMM_ExtClamber_C_BP_OnExtensionDeactivate, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'FMM_ExtClamber_C_BP_OnExtensionDeactivate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

