#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_TimedNiagaraNotify

#include "Basic.hpp"

#include "AnimCurveParameterPair_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FN_TimedNiagaraNotify.FN_TimedNiagaraNotify_C
// 0x0020 (0x00A8 - 0x0088)
class UFN_TimedNiagaraNotify_C : public UFortAnimNotifyState_TimedNiagaraEffectVariant
{
public:
	bool                                          Print_Debug;                                       // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_Glider_Deploy_Notify;                           // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_in_Water_Niagara_Variable;                     // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnimCurveParameterPair>        AnimCurveParameterPair;                            // 0x0090(0x0010)(Edit, BlueprintVisible)
	bool                                          IsLargeBodyPawn;                                   // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Absolute_Scale;                                    // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FN_TimedNiagaraNotify_C">();
	}
	static class UFN_TimedNiagaraNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFN_TimedNiagaraNotify_C>();
	}
};
static_assert(alignof(UFN_TimedNiagaraNotify_C) == 0x000008, "Wrong alignment on UFN_TimedNiagaraNotify_C");
static_assert(sizeof(UFN_TimedNiagaraNotify_C) == 0x0000A8, "Wrong size on UFN_TimedNiagaraNotify_C");
static_assert(offsetof(UFN_TimedNiagaraNotify_C, Print_Debug) == 0x000088, "Member 'UFN_TimedNiagaraNotify_C::Print_Debug' has a wrong offset!");
static_assert(offsetof(UFN_TimedNiagaraNotify_C, is_Glider_Deploy_Notify) == 0x000089, "Member 'UFN_TimedNiagaraNotify_C::is_Glider_Deploy_Notify' has a wrong offset!");
static_assert(offsetof(UFN_TimedNiagaraNotify_C, Set_in_Water_Niagara_Variable) == 0x00008A, "Member 'UFN_TimedNiagaraNotify_C::Set_in_Water_Niagara_Variable' has a wrong offset!");
static_assert(offsetof(UFN_TimedNiagaraNotify_C, AnimCurveParameterPair) == 0x000090, "Member 'UFN_TimedNiagaraNotify_C::AnimCurveParameterPair' has a wrong offset!");
static_assert(offsetof(UFN_TimedNiagaraNotify_C, IsLargeBodyPawn) == 0x0000A0, "Member 'UFN_TimedNiagaraNotify_C::IsLargeBodyPawn' has a wrong offset!");
static_assert(offsetof(UFN_TimedNiagaraNotify_C, Absolute_Scale) == 0x0000A1, "Member 'UFN_TimedNiagaraNotify_C::Absolute_Scale' has a wrong offset!");

}

