#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_TimedNiagaraNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimCurveParameterPair_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FN_TimedNiagaraNotify.FN_TimedNiagaraNotify_C.Received_NotifyTick
// 0x0198 (0x0198 - 0x0000)
struct FN_TimedNiagaraNotify_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCurveParameterPair                CuurveParameterPair;                               // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterSurfaceNormal;                                // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterSurfaceLocation;                              // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        waterImmersionDepth;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         waveParamTextureOffset;                            // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInWater;                                        // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            FortMovementComp;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Player_Pawn;                                       // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetSpawnedEffect_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceNormal_ReturnValue;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetWaterSurfaceLocation_ReturnValue;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterImmersionDepth_ReturnValue;       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurfaceSwimming_ReturnValue;            // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue_2;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimCurveParameterPair                CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_waterImmersionDepth_ImplicitCast; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FN_TimedNiagaraNotify_C_Received_NotifyTick) == 0x000008, "Wrong alignment on FN_TimedNiagaraNotify_C_Received_NotifyTick");
static_assert(sizeof(FN_TimedNiagaraNotify_C_Received_NotifyTick) == 0x000198, "Wrong size on FN_TimedNiagaraNotify_C_Received_NotifyTick");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, Animation) == 0x000008, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, EventReference) == 0x000018, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::EventReference' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, ReturnValue) == 0x000048, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CuurveParameterPair) == 0x00004C, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CuurveParameterPair' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, NiagaraSystem) == 0x000058, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, WaterSurfaceNormal) == 0x000060, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::WaterSurfaceNormal' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, WaterSurfaceLocation) == 0x000078, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::WaterSurfaceLocation' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, waterImmersionDepth) == 0x000090, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::waterImmersionDepth' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, waveParamTextureOffset) == 0x000098, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::waveParamTextureOffset' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, bIsInWater) == 0x00009C, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::bIsInWater' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, FortMovementComp) == 0x0000A0, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::FortMovementComp' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, Player_Pawn) == 0x0000A8, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::Player_Pawn' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetSpawnedEffect_ReturnValue) == 0x0000B0, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetSpawnedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetWaterSurfaceNormal_ReturnValue) == 0x0000B8, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetWaterSurfaceNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x0000D0, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetWaterSurfaceLocation_ReturnValue) == 0x0000E0, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetWaterSurfaceLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetWaterImmersionDepth_ReturnValue) == 0x0000F8, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetWaterImmersionDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_IsSurfaceSwimming_ReturnValue) == 0x0000FC, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_IsSurfaceSwimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetCurrentWaterBody_ReturnValue) == 0x000100, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetCurrentWaterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetCurrentWaterBody_ReturnValue_1) == 0x000110, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetCurrentWaterBody_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_BooleanOR_ReturnValue) == 0x000118, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000120, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetAnimInstance_ReturnValue) == 0x000130, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetOwner_ReturnValue) == 0x000138, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000140, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_DynamicCast_AsFort_Movement_Comp_Character) == 0x000150, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_DynamicCast_AsFort_Movement_Comp_Character' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess_2) == 0x000158, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, Temp_int_Array_Index_Variable) == 0x00015C, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetCurrentWaterBody_ReturnValue_2) == 0x000160, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetCurrentWaterBody_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_Array_Get_Item) == 0x000168, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_GetCurveValue_ReturnValue) == 0x000174, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, Temp_int_Loop_Counter_Variable) == 0x000178, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_Less_IntInt_ReturnValue) == 0x00017C, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, K2Node_VariableSet_waterImmersionDepth_ImplicitCast) == 0x000188, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::K2Node_VariableSet_waterImmersionDepth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000190, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyTick, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000194, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyTick::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function FN_TimedNiagaraNotify.FN_TimedNiagaraNotify_C.Received_NotifyBegin
// 0x0170 (0x0170 - 0x0000)
struct FN_TimedNiagaraNotify_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimCurveParameterPair                CurveNameParameterPair;                            // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      ParticleParams;                                    // 0x0060(0x00E0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bisFrontEnd;                                       // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetSpawnedEffect_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0164(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCosmeticObjectDisplayedInFrontendContext_ReturnValue; // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FN_TimedNiagaraNotify_C_Received_NotifyBegin) == 0x000010, "Wrong alignment on FN_TimedNiagaraNotify_C_Received_NotifyBegin");
static_assert(sizeof(FN_TimedNiagaraNotify_C_Received_NotifyBegin) == 0x000170, "Wrong size on FN_TimedNiagaraNotify_C_Received_NotifyBegin");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, EventReference) == 0x000018, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::EventReference' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, ReturnValue) == 0x000048, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, CurveNameParameterPair) == 0x00004C, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::CurveNameParameterPair' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, ParticleParams) == 0x000060, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::ParticleParams' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, NiagaraSystem) == 0x000140, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, bisFrontEnd) == 0x000148, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::bisFrontEnd' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, CallFunc_GetSpawnedEffect_ReturnValue) == 0x000150, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::CallFunc_GetSpawnedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x000158, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, Temp_name_Variable) == 0x000164, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, CallFunc_Array_Add_ReturnValue) == 0x000168, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_TimedNiagaraNotify_C_Received_NotifyBegin, CallFunc_IsCosmeticObjectDisplayedInFrontendContext_ReturnValue) == 0x00016C, "Member 'FN_TimedNiagaraNotify_C_Received_NotifyBegin::CallFunc_IsCosmeticObjectDisplayedInFrontendContext_ReturnValue' has a wrong offset!");

}

