#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNE_UILibrary

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_classes.hpp"
#include "FNE_UILibrary_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class FNE_UILibrary.FNE_ModularButton
// 0x0010 (0x14A0 - 0x1490)
class UFNE_ModularButton : public UCommonButtonBase
{
public:
	TArray<class UFNE_UIBlock*>                   ModularBlocks;                                     // 0x1490(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void RegisterModularBlock(class UFNE_UIBlock* bLock);
	void RequestInstantTransitionOnBlocks(EFNE_UIBlockInstantTransitionState State);
	void RequestTransitionOnBlocks(EFNE_UIBlockVisualState State);
	void SetBlocksTiming(const struct FFNE_UIBlockTiming& Timing);
	void UnregisterAllModularBlocks();
	void UnregisterModularBlock(class UFNE_UIBlock* bLock);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_ModularButton">();
	}
	static class UFNE_ModularButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_ModularButton>();
	}
};
static_assert(alignof(UFNE_ModularButton) == 0x000010, "Wrong alignment on UFNE_ModularButton");
static_assert(sizeof(UFNE_ModularButton) == 0x0014A0, "Wrong size on UFNE_ModularButton");
static_assert(offsetof(UFNE_ModularButton, ModularBlocks) == 0x001490, "Member 'UFNE_ModularButton::ModularBlocks' has a wrong offset!");

// Class FNE_UILibrary.FNE_UIBlock
// 0x0030 (0x02F0 - 0x02C0)
class UFNE_UIBlock final : public UUserWidget
{
public:
	struct FFNE_UIBlockTiming                     TransitionTiming;                                  // 0x02C0(0x002C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetTransitionTime(EFNE_UIBlockVisualState State);
	void OnInstantTransitionToDeselected();
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnInstantTransitionToLocked();
	void OnInstantTransitionToSelected();
	void OnInstantTransitionToUnlocked();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionHoveredRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void OnTransitionUnhoveredRequested();
	void PlayTransition(class UWidgetAnimation* Animation, const bool bPlayForward);
	void RequestInstantTransition(EFNE_UIBlockInstantTransitionState State);
	void RequestTransition(EFNE_UIBlockVisualState State);
	void SetBlockTiming(const struct FFNE_UIBlockTiming& Timing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_UIBlock">();
	}
	static class UFNE_UIBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_UIBlock>();
	}
};
static_assert(alignof(UFNE_UIBlock) == 0x000008, "Wrong alignment on UFNE_UIBlock");
static_assert(sizeof(UFNE_UIBlock) == 0x0002F0, "Wrong size on UFNE_UIBlock");
static_assert(offsetof(UFNE_UIBlock, TransitionTiming) == 0x0002C0, "Member 'UFNE_UIBlock::TransitionTiming' has a wrong offset!");

// Class FNE_UILibrary.FNE_UIBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFNE_UIBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void PlayAnimationDuringTime(class UUserWidget* Widget, class UWidgetAnimation* Animation, const float PlayTime, const bool bPlayForward);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_UIBlueprintFunctionLibrary">();
	}
	static class UFNE_UIBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_UIBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UFNE_UIBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UFNE_UIBlueprintFunctionLibrary");
static_assert(sizeof(UFNE_UIBlueprintFunctionLibrary) == 0x000028, "Wrong size on UFNE_UIBlueprintFunctionLibrary");

// Class FNE_UILibrary.FNE_CTAButton
// 0x0030 (0x14D0 - 0x14A0)
class UFNE_CTAButton final : public UFNE_ModularButton
{
public:
	class FText                                   Text;                                              // 0x14A0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   SecondaryText;                                     // 0x14B8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void BP_SetSecondaryText(const class FText& ButtonSecondaryText);
	void BP_SetText(const class FText& ButtonText);
	void SetSecondaryText(const class FText& ButtonSecondaryText);
	void SetText(const class FText& ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_CTAButton">();
	}
	static class UFNE_CTAButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_CTAButton>();
	}
};
static_assert(alignof(UFNE_CTAButton) == 0x000010, "Wrong alignment on UFNE_CTAButton");
static_assert(sizeof(UFNE_CTAButton) == 0x0014D0, "Wrong size on UFNE_CTAButton");
static_assert(offsetof(UFNE_CTAButton, Text) == 0x0014A0, "Member 'UFNE_CTAButton::Text' has a wrong offset!");
static_assert(offsetof(UFNE_CTAButton, SecondaryText) == 0x0014B8, "Member 'UFNE_CTAButton::SecondaryText' has a wrong offset!");

}

