#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortAnimationBPFunctionLibrary

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "ClothSettingStruct_structs.hpp"
#include "ClothParamsStruct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WindGustParamsStruct_structs.hpp"
#include "ClothCoreSettingStruct_structs.hpp"
#include "WindGustLocalSettingStruct_structs.hpp"
#include "WindGustSettingStruct_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "RBANParamsStruct_structs.hpp"
#include "RBANSettingStruct_structs.hpp"


namespace SDK::Params
{

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.WindGustGeneratorFunction
// 0x02A8 (0x02A8 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                 GustSettings;                                      // 0x0008(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            ClothGustLocalSettings;                            // 0x0080(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        GustStrength___WindVelocity;                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            ClothGustLocalSettingsOut;                         // 0x00A8(0x0014)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ActualTime;                                        // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GustDirectionWeightLocal;                          // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ElapsedTimeLocal;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FinalGustStrengthLocal;                            // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GustDurationLocal;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GustStrengthLocal;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBetweenGustsLocal;                             // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaTimeLocal;                                    // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_ReturnValue;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_ReturnValue_1;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            K2Node_MakeStruct_WindGustLocalSettingStruct;      // 0x0148(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_Return_Value;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue_1;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_Return_Value_1;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_3;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue_2;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_Return_Value_2;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_Value_ImplicitCast;         // 0x01F0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_Value_ImplicitCast_1;       // 0x01F4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ElapsedTimeLocal_ImplicitCast;  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_TimeBetweenGustsLocal_ImplicitCast; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_GustStrengthLocal_ImplicitCast; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_GustDurationLocal_ImplicitCast; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_FinalGustStrengthLocal_ImplicitCast; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_A_ImplicitCast;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_B_ImplicitCast;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_A_ImplicitCast_1;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_B_ImplicitCast_1;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_A_ImplicitCast_2;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UnclampedLerp_B_ImplicitCast_2;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast_1;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast_1;    // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_ElapsedTime_48_9A24DA0842E21D5736699499F1DE1171_ImplicitCast; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_TimeBetweenGusts_54_E1D59EA94088FB83508636942434066D_ImplicitCast; // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_GustStrength_55_7788D1D04920E9BC2F96FCBDDCA7C33A_ImplicitCast; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_GustDuration_56_E42A0C8341E10ACAC2016FA7F726B406_ImplicitCast; // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_FinalGustStrengthLocal_57_BD76FBFF47687A7C38D40EAD653D5618_ImplicitCast; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction) == 0x0002A8, "Wrong size on FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, DeltaTime) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustSettings) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ClothGustLocalSettings) == 0x000080, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ClothGustLocalSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, __WorldContext) == 0x000098, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustStrength___WindVelocity) == 0x0000A0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustStrength___WindVelocity' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ClothGustLocalSettingsOut) == 0x0000A8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ClothGustLocalSettingsOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ActualTime) == 0x0000C0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ActualTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustDirectionWeightLocal) == 0x0000C8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustDirectionWeightLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ElapsedTimeLocal) == 0x0000E0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ElapsedTimeLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, FinalGustStrengthLocal) == 0x0000E8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::FinalGustStrengthLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustDurationLocal) == 0x0000F0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustDurationLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustStrengthLocal) == 0x0000F8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustStrengthLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, TimeBetweenGustsLocal) == 0x000100, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::TimeBetweenGustsLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, DeltaTimeLocal) == 0x000108, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::DeltaTimeLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000110, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_PerlinNoise1D_ReturnValue) == 0x000118, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_PerlinNoise1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000120, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_PerlinNoise1D_ReturnValue_1) == 0x000128, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_PerlinNoise1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000130, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_ReturnValue) == 0x000138, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000140, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_WindGustLocalSettingStruct) == 0x000148, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_WindGustLocalSettingStruct' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000160, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000168, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000170, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000178, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000180, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FClamp_ReturnValue) == 0x000188, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloat_ReturnValue) == 0x000190, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_Return_Value) == 0x000198, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_Return_Value' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001A0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue) == 0x0001A8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue_1) == 0x0001B0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloat_ReturnValue_1) == 0x0001B8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue_2) == 0x0001C0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_Return_Value_1) == 0x0001C8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_Return_Value_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue_3) == 0x0001D0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0001D8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloat_ReturnValue_2) == 0x0001E0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_Return_Value_2) == 0x0001E8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_Return_Value_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_PerlinNoise1D_Value_ImplicitCast) == 0x0001F0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_PerlinNoise1D_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_PerlinNoise1D_Value_ImplicitCast_1) == 0x0001F4, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_PerlinNoise1D_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_VariableSet_ElapsedTimeLocal_ImplicitCast) == 0x0001F8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_VariableSet_ElapsedTimeLocal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_VariableSet_TimeBetweenGustsLocal_ImplicitCast) == 0x000200, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_VariableSet_TimeBetweenGustsLocal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_VariableSet_GustStrengthLocal_ImplicitCast) == 0x000208, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_VariableSet_GustStrengthLocal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_VariableSet_GustDurationLocal_ImplicitCast) == 0x000210, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_VariableSet_GustDurationLocal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_VariableSet_FinalGustStrengthLocal_ImplicitCast) == 0x000218, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_VariableSet_FinalGustStrengthLocal_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000220, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000228, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_A_ImplicitCast) == 0x000230, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_B_ImplicitCast) == 0x000238, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_A_ImplicitCast_1) == 0x000240, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_B_ImplicitCast_1) == 0x000248, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_A_ImplicitCast_2) == 0x000250, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_B_ImplicitCast_2) == 0x000258, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000260, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000268, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_Min_ImplicitCast) == 0x000270, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_Max_ImplicitCast) == 0x000278, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_Min_ImplicitCast_1) == 0x000280, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_Min_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_Max_ImplicitCast_1) == 0x000288, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_ElapsedTime_48_9A24DA0842E21D5736699499F1DE1171_ImplicitCast) == 0x000290, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_ElapsedTime_48_9A24DA0842E21D5736699499F1DE1171_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_TimeBetweenGusts_54_E1D59EA94088FB83508636942434066D_ImplicitCast) == 0x000294, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_TimeBetweenGusts_54_E1D59EA94088FB83508636942434066D_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_GustStrength_55_7788D1D04920E9BC2F96FCBDDCA7C33A_ImplicitCast) == 0x000298, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_GustStrength_55_7788D1D04920E9BC2F96FCBDDCA7C33A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_GustDuration_56_E42A0C8341E10ACAC2016FA7F726B406_ImplicitCast) == 0x00029C, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_GustDuration_56_E42A0C8341E10ACAC2016FA7F726B406_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_FinalGustStrengthLocal_57_BD76FBFF47687A7C38D40EAD653D5618_ImplicitCast) == 0x0002A0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_FinalGustStrengthLocal_57_BD76FBFF47687A7C38D40EAD653D5618_ImplicitCast' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Wind Gust Control Function
// 0x01D8 (0x01D8 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function final
{
public:
	class UCustomCharacterPartAnimInstance*       CharacterPartAnimInstance;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaTime;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GameTimeInSeconds;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JointName;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWindGustSettingStruct                 WindGustSettings;                                  // 0x0020(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            WindGustLocalSettings;                             // 0x0098(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GustStrengthWindVelocity_Out;                      // 0x00B8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            WindGustLocalSettingsOut;                          // 0x00D0(0x0014)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GustStrength___WindVelocityLocal;                  // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                 K2Node_MakeStruct_WindGustSettingStruct;           // 0x0108(0x0078)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_WindGustGeneratorFunction_GustStrength___WindVelocity; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            CallFunc_WindGustGeneratorFunction_ClothGustLocalSettingsOut; // 0x0190(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Random_Vector_Function_VectorOut;         // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function) == 0x0001D8, "Wrong size on FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CharacterPartAnimInstance) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CharacterPartAnimInstance' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, DeltaTime) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, GameTimeInSeconds) == 0x000010, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::GameTimeInSeconds' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, JointName) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::JointName' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, WindGustSettings) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::WindGustSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, WindGustLocalSettings) == 0x000098, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::WindGustLocalSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, __WorldContext) == 0x0000B0, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, GustStrengthWindVelocity_Out) == 0x0000B8, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::GustStrengthWindVelocity_Out' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, WindGustLocalSettingsOut) == 0x0000D0, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::WindGustLocalSettingsOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, GustStrength___WindVelocityLocal) == 0x0000E8, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::GustStrength___WindVelocityLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000100, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, K2Node_MakeStruct_WindGustSettingStruct) == 0x000108, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::K2Node_MakeStruct_WindGustSettingStruct' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_WindGustGeneratorFunction_GustStrength___WindVelocity) == 0x000188, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_WindGustGeneratorFunction_GustStrength___WindVelocity' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_WindGustGeneratorFunction_ClothGustLocalSettingsOut) == 0x000190, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_WindGustGeneratorFunction_ClothGustLocalSettingsOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_Random_Vector_Function_VectorOut) == 0x0001A8, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_Random_Vector_Function_VectorOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C0, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Vehicle Dynamics Scaler Function
// 0x0068 (0x0068 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function final
{
public:
	class UCustomCharacterPartAnimInstance*       CharacterPartAnimInstance;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleHeadScaleAlpha;                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleHeadSimAlpha;                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleSkirtScaleAlpha;                          // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleSkirtSimAlpha;                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleSkirtSimAlphaLocal;                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleSkirtScaleAlphaLocal;                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleHeadSimAlphaLocal;                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InVehicleHeadScaleAlphaLocal;                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function) == 0x000068, "Wrong size on FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CharacterPartAnimInstance) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CharacterPartAnimInstance' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, Debug) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::Debug' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, __WorldContext) == 0x000010, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleHeadScaleAlpha) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleHeadScaleAlpha' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleHeadSimAlpha) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleHeadSimAlpha' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleSkirtScaleAlpha) == 0x000028, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleSkirtScaleAlpha' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleSkirtSimAlpha) == 0x000030, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleSkirtSimAlpha' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleSkirtSimAlphaLocal) == 0x000038, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleSkirtSimAlphaLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleSkirtScaleAlphaLocal) == 0x000040, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleSkirtScaleAlphaLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleHeadSimAlphaLocal) == 0x000048, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleHeadSimAlphaLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, InVehicleHeadScaleAlphaLocal) == 0x000050, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::InVehicleHeadScaleAlphaLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_1) == 0x000059, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_2) == 0x00005A, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_3) == 0x00005B, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_4) == 0x00005C, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_5) == 0x00005D, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_6) == 0x00005E, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_7) == 0x00005F, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_8) == 0x000060, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_9) == 0x000061, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_10) == 0x000062, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_11) == 0x000063, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_12) == 0x000064, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_BooleanOR_ReturnValue_13) == 0x000065, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_BooleanOR_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function, CallFunc_Not_PreBool_ReturnValue) == 0x000066, "Member 'FortAnimationBPFunctionLibrary_C_Vehicle_Dynamics_Scaler_Function::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Set Transformation Montage
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage final
{
public:
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_TransformationMontageStartTime_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage) == 0x000028, "Wrong size on FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, FortPlayerPawn) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, Montage) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::Montage' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, StartTime) == 0x000010, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::StartTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, __WorldContext) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, K2Node_VariableSet_TransformationMontageStartTime_ImplicitCast) == 0x000024, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::K2Node_VariableSet_TransformationMontageStartTime_ImplicitCast' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Separated Cloth Control Write To Instance
// 0x0268 (0x0268 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Separated_Cloth_Control_Write_To_Instance final
{
public:
	class UCustomCharacterPartAnimInstance*       Character_Part_Anim_Instance;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Clothing_Asset_Name;                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FClothCoreSettingStruct                Cloth_Core_Settings;                               // 0x0018(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClothSettingStruct                    Cloth_Settings;                                    // 0x0098(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Gust_Strength___Wind_Velocity;                     // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Joint_Name;                                        // 0x0110(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
