#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Fortnite_M_Avg_Player_AnimBlueprint_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// 0xE130 (0xFC70 - 0x1B40)
class UFortnite_M_Avg_Player_AnimBlueprint_C final : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1B48(0x01A0)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1CE8(0x0008)()
	struct FAnimSubsystem_SharedLinkedAnimLayers  AnimBlueprintExtension_SharedLinkedAnimLayers;     // 0x1CF0(0x0028)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1D18(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1D20(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_57;                  // 0x1D28(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_56;                  // 0x1DD8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_48;                             // 0x1E88(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_55;                  // 0x1EA8(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_54;                  // 0x1F58(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_53;                  // 0x2008(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_47;                             // 0x20B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_52;                  // 0x20D8(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_51;                  // 0x2188(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_46;                             // 0x2238(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_50;                  // 0x2258(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_45;                             // 0x2308(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_49;                  // 0x2328(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_44;                             // 0x23D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_48;                  // 0x23F8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_43;                             // 0x24A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_47;                  // 0x24C8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_42;                             // 0x2578(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_46;                  // 0x2598(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_45;                  // 0x2648(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_41;                             // 0x26F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_44;                  // 0x2718(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_40;                             // 0x27C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_43;                  // 0x27E8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_39;                             // 0x2898(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_42;                  // 0x28B8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_38;                             // 0x2968(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_41;                  // 0x2988(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_37;                             // 0x2A38(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_40;                  // 0x2A58(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_36;                             // 0x2B08(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_39;                  // 0x2B28(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_38;                  // 0x2BD8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_35;                             // 0x2C88(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_37;                  // 0x2CA8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x2D58(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x2D78(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x2D98(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x2DB8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_36;                  // 0x2DD8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x2E88(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_35;                  // 0x2EA8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x2F58(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_34;                  // 0x2F78(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x3028(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_33;                  // 0x3048(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x30F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_32;                  // 0x3118(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x31C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_31;                  // 0x31E8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x3298(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x32B8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x32D8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x32F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_30;                  // 0x3318(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x33C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_29;                  // 0x33E8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x3498(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_28;                  // 0x34B8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x3568(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_27;                  // 0x3588(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_26;                  // 0x3638(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_25;                  // 0x36E8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x3798(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_24;                  // 0x37B8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x3868(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x3888(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x3938(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x39E8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_44;                  // 0x3A08(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x3A50(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping;                       // 0x3A70(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x3CB0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0x3CD0(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x3D48(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x3DF8(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x3EA8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0x3F58(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_102;                   // 0x3FD0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x3FF8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_101;                   // 0x4070(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_26;                  // 0x4098(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_100;                   // 0x4160(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_43;                  // 0x4188(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_99;                    // 0x41D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_98;                    // 0x41F8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_12;                    // 0x4220(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x42E8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x4330(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0x4350(0x00F0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_17;                  // 0x4440(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x44F8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0x45A8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_97;                    // 0x4620(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x4648(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_11;                    // 0x4668(0x00C8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x4730(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x4818(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x4838(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x4858(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x4878(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x4928(0x00C8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0x49F0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x4A68(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x4A88(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x4B38(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x4BE8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_96;                    // 0x4C60(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_25;                  // 0x4C88(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x4D50(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_42;                  // 0x4D70(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x4DB8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x4E68(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_95;                    // 0x4EE0(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_16;                  // 0x4F08(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_94;                    // 0x4FC0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x4FE8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0x5008(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93;                    // 0x5050(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x5078(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x50C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x50E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x5110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x5138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x5160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x5188(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x51B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x51F8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_24;                  // 0x5218(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x52E0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x52F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_92;                    // 0x5310(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_91;                    // 0x5338(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_41;                  // 0x5360(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x53A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x53F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x5410(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x54D8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_90;                    // 0x5550(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_23;                  // 0x5578(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_40;                  // 0x5640(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_22;                  // 0x5688(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x5750(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_89;                    // 0x57C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88;                    // 0x57F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87;                    // 0x5818(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0x5840(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x5930(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0x59A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0x59D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0x59F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x5A20(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x5A68(0x0078)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_Layer_2;                             // 0x5AE0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_21;                  // 0x5BA8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0x5C70(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x5D60(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0x5DD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0x5E00(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x5E28(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_20;                  // 0x5ED8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0x5FA0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0x5FC8(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_39;                  // 0x60B8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x6100(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0x6120(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0x6210(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x62D8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0x6320(0x00F0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x6410(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x6458(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x6520(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_38;                  // 0x65E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x6630(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x6678(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_37;                  // 0x66C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_36;                  // 0x6708(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x6750(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x6798(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x67E0(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x6828(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x68D8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0x6950(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0x6978(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x69A0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x6A50(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0x6AC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0x6AF0(0x0028)()
	struct FFortAnimNode_CurveFilterSlot          FortAnimGraphNode_CurveFilterSlot;                 // 0x6B18(0x0098)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0x6BB0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x6BD8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x6CA0(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x6CE8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x6D98(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_35;                  // 0x6E10(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x6E58(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0x6ED0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x6EF8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x6F18(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x6F60(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_34;                  // 0x6FA8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x6FF0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x7018(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x7060(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x70A8(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x7198(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x71E0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_33;                  // 0x7208(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x7250(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x7298(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x72E0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x7390(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x7408(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x7430(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x7458(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x7480(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x74C8(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x75B8(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x7630(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x7678(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x76A0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0x76C8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x7710(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x7800(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x7820(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0x78D0(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_15;                  // 0x7918(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x79D0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x7A98(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x7B10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x7B38(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x7B60(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x7B80(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x7C30(0x0078)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_14;                  // 0x7CA8(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x7D60(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0x7D88(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x7DD0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x7DF8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x7EE8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x7F08(0x00F0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x7FF8(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x8008(0x00F0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x80F8(0x0010)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x8108(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0x8130(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_13;                  // 0x8178(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x8230(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x8258(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x8280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x82A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x82D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x82F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x8320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x8348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x8370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x8398(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_12;                  // 0x83C0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x8478(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x8498(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x8508(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0x8578(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x85C0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x8630(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x86A0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x86E8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x8758(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x87A0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x8868(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x8888(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x8898(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x88B8(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x8980(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x8A30(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x8AF8(0x0020)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting;                   // 0x8B18(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x8C40(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x8C88(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x8CA8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x8CF0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x8DB0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x8DD8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x8E50(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x8E70(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x8F20(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x8F98(0x0078)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_11;                  // 0x9010(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x90C8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_Layer_1;                             // 0x90F0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_19;                  // 0x91B8(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x9280(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_18;                  // 0x92A0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x9368(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x93E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x9408(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x9430(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x9458(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0x94A0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x94E8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x9508(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x9530(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x95A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x95D0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x95F8(0x0128)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_10;                  // 0x9720(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x97D8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x9800(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x9848(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x98F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x9940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x9968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x9990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x99B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x99E0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x9A08(0x0128)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x9B30(0x0120)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x9C50(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x9C70(0x0020)()
	struct FFortAnimNode_SpeedWarping             FortAnimGraphNode_SpeedWarping;                    // 0x9C90(0x0200)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x9E90(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x9ED8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x9F20(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x9F68(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0xA028(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_1;                    // 0xA070(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0xA120(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0xA140(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0xA168(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0xA1B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0xA1F8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0xA240(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0xA308(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0xA328(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0xA350(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0xA370(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0xA438(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0xA500(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0xA548(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0xA638(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0xA660(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0xA6D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0xA700(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0xA728(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0xA770(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0xA790(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0xA840(0x00B0)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0xA8F0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0xA9A0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0xA9E8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0xAA60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0xAA88(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0xAAB0(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0xABA0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0xABE8(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0xABF8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0xACE8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0xADD8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0xAE00(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0xAE48(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0xAEC0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0xAEE8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0xAF60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0xAF88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0xAFB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0xAFD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0xB000(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0xB028(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0xB070(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0xB160(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0xB250(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0xB298(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0xB2E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0xB308(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0xB330(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0xB358(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0xB380(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0xB470(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0xB4B8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xB5A8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0xB698(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0xB6C0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0xB6E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0xB730(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0xB758(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0xB780(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0xB7A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0xB7D0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0xB818(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xB908(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0xB928(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0xB9D8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0xBA20(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0xBA98(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0xBAE0(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0xBB58(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0xBB80(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0xBBC8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xBBF0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0xBC38(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0xBC60(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xBCD8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0xBD88(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0xBE00(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_17;                  // 0xBE28(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0xBEF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0xBF18(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0xBF40(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0xBFB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0xBFE0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xC028(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0xC070(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0xC098(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0xC0B8(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0xC1D0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0xC218(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0xC260(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0xC378(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xC490(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0xC540(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0xC5B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0xC5E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0xC608(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xC630(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0xC650(0x0078)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0xC6C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0xC6F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0xC718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0xC740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0xC768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0xC790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0xC7B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0xC7E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0xC808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0xC830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0xC858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0xC880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0xC8A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0xC8D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0xC8F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0xC920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0xC948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0xC970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0xC998(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_16;                  // 0xC9C0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0xCA88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0xCAB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0xCAD8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0xCB00(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0xCB10(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_9;                   // 0xCB58(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0xCC10(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_15;                  // 0xCC38(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0xCD00(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0xCDC8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0xCDE8(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_8;                   // 0xCE10(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0xCEC8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0xCEE8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0xCF10(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0xCFD8(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_7;                   // 0xCFF8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0xD0B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xD0D0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0xD0F8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0xD140(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0xD188(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0xD1D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xD1F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xD238(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_6;                   // 0xD258(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xD310(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xD330(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xD378(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_5;                   // 0xD398(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xD450(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xD470(0x00C8)()
	uint8                                         Pad_D538[0x8];                                     // 0xD538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_DeadBlending                 AnimGraphNode_DeadBlending;                        // 0xD540(0x0480)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xD9C0(0x0078)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_Layer;                               // 0xDA38(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_14;                  // 0xDB00(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xDBC8(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0xDC40(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_13;                  // 0xDC88(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_12;                  // 0xDD50(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_4;                   // 0xDE18(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0xDED0(0x0048)()
	struct FFortAnimNode_ScaleCharacterBones      FortAnimGraphNode_ScaleCharacterBones;             // 0xDF18(0x00D8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0xDFF0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xE010(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0xE030(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0xE0F8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0xE1C0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0xE288(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0xE2B0(0x00C8)()
