#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCosmeticVariantRow_RichColor

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function FortCosmeticVariantRow_RichColor.FortCosmeticVariantRow_RichColor_C.BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'FortCosmeticVariantRow_RichColor_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function FortCosmeticVariantRow_RichColor.FortCosmeticVariantRow_RichColor_C.ExecuteUbergraph_FortCosmeticVariantRow_RichColor
// 0x0028 (0x0028 - 0x0000)
struct FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	class UFortVariantItemVM*                     K2Node_DynamicCast_AsFort_Variant_Item_VM;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor) == 0x000008, "Wrong alignment on FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor");
static_assert(sizeof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor) == 0x000028, "Wrong size on FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor, EntryPoint) == 0x000000, "Member 'FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor, K2Node_ComponentBoundEvent_Item) == 0x000008, "Member 'FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor, K2Node_Event_InFocusEvent) == 0x000010, "Member 'FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor, K2Node_DynamicCast_AsFort_Variant_Item_VM) == 0x000018, "Member 'FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor::K2Node_DynamicCast_AsFort_Variant_Item_VM' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FortCosmeticVariantRow_RichColor_C_ExecuteUbergraph_FortCosmeticVariantRow_RichColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FortCosmeticVariantRow_RichColor.FortCosmeticVariantRow_RichColor_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath");
static_assert(sizeof(FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'FortCosmeticVariantRow_RichColor_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function FortCosmeticVariantRow_RichColor.FortCosmeticVariantRow_RichColor_C.SetFortVariantRichColorChannelVM
// 0x0028 (0x0028 - 0x0000)
struct FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM final
{
public:
	class UFortVariantRichColorChannelVM*         ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM) == 0x000008, "Wrong alignment on FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM");
static_assert(sizeof(FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM) == 0x000028, "Wrong size on FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM, ViewModel) == 0x000000, "Member 'FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM::ViewModel' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'FortCosmeticVariantRow_RichColor_C_SetFortVariantRichColorChannelVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function FortCosmeticVariantRow_RichColor.FortCosmeticVariantRow_RichColor_C.GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                FocusTarget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget");
static_assert(sizeof(FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget) == 0x000008, "Wrong size on FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget");
static_assert(offsetof(FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget, FocusTarget) == 0x000000, "Member 'FortCosmeticVariantRow_RichColor_C_GetDesiredFocusTarget::FocusTarget' has a wrong offset!");

}

