#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCosmeticVariantRow_Tiled

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortCosmeticVariantRow_Tiled.FortCosmeticVariantRow_Tiled_C
// 0x0020 (0x0308 - 0x02E8)
class UFortCosmeticVariantRow_Tiled_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_VariantName;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVariantChannelVM*                  FortVariantChannelVM;                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTileView*                        TileView_VariantOptions;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__FortCosmeticVariantRow_Tiled_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void ExecuteUbergraph_FortCosmeticVariantRow_Tiled(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetFortVariantChannelVM(class UFortVariantChannelVM* ViewModel);

	void GetDesiredFocusTarget(class UWidget** FocusTarget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortCosmeticVariantRow_Tiled_C">();
	}
	static class UFortCosmeticVariantRow_Tiled_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticVariantRow_Tiled_C>();
	}
};
static_assert(alignof(UFortCosmeticVariantRow_Tiled_C) == 0x000008, "Wrong alignment on UFortCosmeticVariantRow_Tiled_C");
static_assert(sizeof(UFortCosmeticVariantRow_Tiled_C) == 0x000308, "Wrong size on UFortCosmeticVariantRow_Tiled_C");
static_assert(offsetof(UFortCosmeticVariantRow_Tiled_C, UberGraphFrame) == 0x0002E8, "Member 'UFortCosmeticVariantRow_Tiled_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortCosmeticVariantRow_Tiled_C, Text_VariantName) == 0x0002F0, "Member 'UFortCosmeticVariantRow_Tiled_C::Text_VariantName' has a wrong offset!");
static_assert(offsetof(UFortCosmeticVariantRow_Tiled_C, FortVariantChannelVM) == 0x0002F8, "Member 'UFortCosmeticVariantRow_Tiled_C::FortVariantChannelVM' has a wrong offset!");
static_assert(offsetof(UFortCosmeticVariantRow_Tiled_C, TileView_VariantOptions) == 0x000300, "Member 'UFortCosmeticVariantRow_Tiled_C::TileView_VariantOptions' has a wrong offset!");

}

