#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteAI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "AnimPresetsRuntime_structs.hpp"
#include "GameplayInteractionsModule_classes.hpp"


namespace SDK
{

// Class FortniteAI.AthenaAIService
// 0x0050 (0x0078 - 0x0028)
class UAthenaAIService : public UObject
{
public:
	class AFortGameModeAthena*                    CachedGameMode;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAIServiceManager*                AIServiceManager;                                  // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIService">();
	}
	static class UAthenaAIService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIService>();
	}
};
static_assert(alignof(UAthenaAIService) == 0x000008, "Wrong alignment on UAthenaAIService");
static_assert(sizeof(UAthenaAIService) == 0x000078, "Wrong size on UAthenaAIService");
static_assert(offsetof(UAthenaAIService, CachedGameMode) == 0x000028, "Member 'UAthenaAIService::CachedGameMode' has a wrong offset!");
static_assert(offsetof(UAthenaAIService, CachedGameState) == 0x000030, "Member 'UAthenaAIService::CachedGameState' has a wrong offset!");
static_assert(offsetof(UAthenaAIService, AIServiceManager) == 0x000068, "Member 'UAthenaAIService::AIServiceManager' has a wrong offset!");

// Class FortniteAI.AthenaAIServiceLoot
// 0x0558 (0x05D0 - 0x0078)
class alignas(0x10) UAthenaAIServiceLoot final : public UAthenaAIService
{
public:
	struct FVector                                LootOctreeCenter;                                  // 0x0078(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootOctreeRadius;                                  // 0x0090(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SupplyDropStatusUpdateRate;                        // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RemoveInvalidChestFromOctreeProbability;           // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovingLootTrackingEnabled;                         // 0x0108(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovingLootUpdateRate;                              // 0x0130(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovingLootOctreeUpdateDistanceThreshold;           // 0x0158(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class ABuildingProp>>      HarvestableActorClassList;                         // 0x0180(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringEnabled;                             // 0x0190(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringNeighborDistanceMax;                 // 0x01B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringNeighborhoodCountMin;                // 0x01E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UDataRegistry*                          LootClusteringItemWeightDataRegistry;              // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringDefaultWeight;                       // 0x0210(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringExpandByBoxX;                        // 0x0238(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringExpandByBoxY;                        // 0x0260(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LootClusteringExpandByBoxZ;                        // 0x0288(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0x210];                                    // 0x02B0(0x0210)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TWeakObjectPtr<class AFortPickup>, struct FMovingLootInfo> MovingLoots;                                       // 0x04C0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_510[0x8];                                      // 0x0510(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedSupplyDrop>              CachedSupplyDrops;                                 // 0x0518(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortWorldItem*                         CachedWorldItem;                                   // 0x0528(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             BotBuildingContainerExcludeListDataTable;          // 0x0530(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAthenaGamePhaseStep                          LootClusterCalculationGamePhase;                   // 0x0538(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_539[0x5F];                                     // 0x0539(0x005F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortBotClusterLootWeightDataTableRow> CachedLootClusteringItemWeightTable;               // 0x0598(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A8[0x28];                                     // 0x05A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_AddGameplayTagToLoot(const class AActor* LootActor, const struct FGameplayTag& GameplayTag);
	void K2_RemoveGameplayTagFromLoot(const class AActor* LootActor, const struct FGameplayTag& GameplayTag);
	void UpdateMovingLoots();
	void UpdateSupplyDropStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIServiceLoot">();
	}
	static class UAthenaAIServiceLoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIServiceLoot>();
	}
};
static_assert(alignof(UAthenaAIServiceLoot) == 0x000010, "Wrong alignment on UAthenaAIServiceLoot");
static_assert(sizeof(UAthenaAIServiceLoot) == 0x0005D0, "Wrong size on UAthenaAIServiceLoot");
static_assert(offsetof(UAthenaAIServiceLoot, LootOctreeCenter) == 0x000078, "Member 'UAthenaAIServiceLoot::LootOctreeCenter' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootOctreeRadius) == 0x000090, "Member 'UAthenaAIServiceLoot::LootOctreeRadius' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, SupplyDropStatusUpdateRate) == 0x0000B8, "Member 'UAthenaAIServiceLoot::SupplyDropStatusUpdateRate' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, RemoveInvalidChestFromOctreeProbability) == 0x0000E0, "Member 'UAthenaAIServiceLoot::RemoveInvalidChestFromOctreeProbability' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, MovingLootTrackingEnabled) == 0x000108, "Member 'UAthenaAIServiceLoot::MovingLootTrackingEnabled' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, MovingLootUpdateRate) == 0x000130, "Member 'UAthenaAIServiceLoot::MovingLootUpdateRate' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, MovingLootOctreeUpdateDistanceThreshold) == 0x000158, "Member 'UAthenaAIServiceLoot::MovingLootOctreeUpdateDistanceThreshold' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, HarvestableActorClassList) == 0x000180, "Member 'UAthenaAIServiceLoot::HarvestableActorClassList' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringEnabled) == 0x000190, "Member 'UAthenaAIServiceLoot::LootClusteringEnabled' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringNeighborDistanceMax) == 0x0001B8, "Member 'UAthenaAIServiceLoot::LootClusteringNeighborDistanceMax' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringNeighborhoodCountMin) == 0x0001E0, "Member 'UAthenaAIServiceLoot::LootClusteringNeighborhoodCountMin' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringItemWeightDataRegistry) == 0x000208, "Member 'UAthenaAIServiceLoot::LootClusteringItemWeightDataRegistry' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringDefaultWeight) == 0x000210, "Member 'UAthenaAIServiceLoot::LootClusteringDefaultWeight' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringExpandByBoxX) == 0x000238, "Member 'UAthenaAIServiceLoot::LootClusteringExpandByBoxX' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringExpandByBoxY) == 0x000260, "Member 'UAthenaAIServiceLoot::LootClusteringExpandByBoxY' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusteringExpandByBoxZ) == 0x000288, "Member 'UAthenaAIServiceLoot::LootClusteringExpandByBoxZ' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, MovingLoots) == 0x0004C0, "Member 'UAthenaAIServiceLoot::MovingLoots' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, CachedSupplyDrops) == 0x000518, "Member 'UAthenaAIServiceLoot::CachedSupplyDrops' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, CachedWorldItem) == 0x000528, "Member 'UAthenaAIServiceLoot::CachedWorldItem' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, BotBuildingContainerExcludeListDataTable) == 0x000530, "Member 'UAthenaAIServiceLoot::BotBuildingContainerExcludeListDataTable' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, LootClusterCalculationGamePhase) == 0x000538, "Member 'UAthenaAIServiceLoot::LootClusterCalculationGamePhase' has a wrong offset!");
static_assert(offsetof(UAthenaAIServiceLoot, CachedLootClusteringItemWeightTable) == 0x000598, "Member 'UAthenaAIServiceLoot::CachedLootClusteringItemWeightTable' has a wrong offset!");

// Class FortniteAI.FortQueryContext_ConverterPawn
// 0x0000 (0x0028 - 0x0028)
class UFortQueryContext_ConverterPawn final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryContext_ConverterPawn">();
	}
	static class UFortQueryContext_ConverterPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_ConverterPawn>();
	}
};
static_assert(alignof(UFortQueryContext_ConverterPawn) == 0x000008, "Wrong alignment on UFortQueryContext_ConverterPawn");
static_assert(sizeof(UFortQueryContext_ConverterPawn) == 0x000028, "Wrong size on UFortQueryContext_ConverterPawn");

// Class FortniteAI.FortNavModifierVolume
// 0x0010 (0x02F0 - 0x02E0)
class AFortNavModifierVolume final : public ANavModifierVolume
{
public:
	TArray<TSubclassOf<class ANavigationData>>    EnableOnlyForNavmeshClasses;                       // 0x02E0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNavModifierVolume">();
	}
	static class AFortNavModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNavModifierVolume>();
	}
};
static_assert(alignof(AFortNavModifierVolume) == 0x000008, "Wrong alignment on AFortNavModifierVolume");
static_assert(sizeof(AFortNavModifierVolume) == 0x0002F0, "Wrong size on AFortNavModifierVolume");
static_assert(offsetof(AFortNavModifierVolume, EnableOnlyForNavmeshClasses) == 0x0002E0, "Member 'AFortNavModifierVolume::EnableOnlyForNavmeshClasses' has a wrong offset!");

// Class FortniteAI.FortAITask_Move
// 0x0048 (0x0160 - 0x0118)
class UFortAITask_Move : public UAITask_MoveTo
{
public:
	struct FFortMoveConfig                        MoveConfig;                                        // 0x0118(0x0038)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAITask_Move">();
	}
	static class UFortAITask_Move* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAITask_Move>();
	}
};
static_assert(alignof(UFortAITask_Move) == 0x000008, "Wrong alignment on UFortAITask_Move");
static_assert(sizeof(UFortAITask_Move) == 0x000160, "Wrong size on UFortAITask_Move");
static_assert(offsetof(UFortAITask_Move, MoveConfig) == 0x000118, "Member 'UFortAITask_Move::MoveConfig' has a wrong offset!");

// Class FortniteAI.FortAthenaAISpawnerDataComponent
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAISpawnerDataComponent : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent">();
	}
	static class UFortAthenaAISpawnerDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_CoverBase
// 0x0028 (0x0058 - 0x0030)
class UFortAthenaAISpawnerDataComponent_CoverBase final : public UFortAthenaAISpawnerDataComponent
{
public:
	TSubclassOf<class UNavigationQueryFilter>     CoverPositionFilterClass;                          // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CoverBoxExtent;                                    // 0x0038(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CoverOffset;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_CoverBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_CoverBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_CoverBase>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_CoverBase) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_CoverBase");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_CoverBase) == 0x000058, "Wrong size on UFortAthenaAISpawnerDataComponent_CoverBase");
static_assert(offsetof(UFortAthenaAISpawnerDataComponent_CoverBase, CoverPositionFilterClass) == 0x000030, "Member 'UFortAthenaAISpawnerDataComponent_CoverBase::CoverPositionFilterClass' has a wrong offset!");
static_assert(offsetof(UFortAthenaAISpawnerDataComponent_CoverBase, CoverBoxExtent) == 0x000038, "Member 'UFortAthenaAISpawnerDataComponent_CoverBase::CoverBoxExtent' has a wrong offset!");
static_assert(offsetof(UFortAthenaAISpawnerDataComponent_CoverBase, CoverOffset) == 0x000050, "Member 'UFortAthenaAISpawnerDataComponent_CoverBase::CoverOffset' has a wrong offset!");

// Class FortniteAI.FortAIEnvironmentalDangerSourceInterface
// 0x0000 (0x0028 - 0x0028)
class IFortAIEnvironmentalDangerSourceInterface final : public IInterface
{
public:
	float GetDangerAtLocation(const struct FVector& Location) const;
	bool GetDangerSourceActive() const;
	struct FBox GetDangerSourceBounds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIEnvironmentalDangerSourceInterface">();
	}
	static class IFortAIEnvironmentalDangerSourceInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAIEnvironmentalDangerSourceInterface>();
	}
};
static_assert(alignof(IFortAIEnvironmentalDangerSourceInterface) == 0x000008, "Wrong alignment on IFortAIEnvironmentalDangerSourceInterface");
static_assert(sizeof(IFortAIEnvironmentalDangerSourceInterface) == 0x000028, "Wrong size on IFortAIEnvironmentalDangerSourceInterface");

// Class FortniteAI.FortAthenaAIRuntimeParameters
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAIRuntimeParameters : public UObject
{
public:
	int32                                         ExtractedLevel;                                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIRuntimeParameters">();
	}
	static class UFortAthenaAIRuntimeParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIRuntimeParameters>();
	}
};
static_assert(alignof(UFortAthenaAIRuntimeParameters) == 0x000008, "Wrong alignment on UFortAthenaAIRuntimeParameters");
static_assert(sizeof(UFortAthenaAIRuntimeParameters) == 0x000030, "Wrong size on UFortAthenaAIRuntimeParameters");
static_assert(offsetof(UFortAthenaAIRuntimeParameters, ExtractedLevel) == 0x000028, "Member 'UFortAthenaAIRuntimeParameters::ExtractedLevel' has a wrong offset!");

// Class FortniteAI.FortAthenaAIBotDigestedSkillSet
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAIBotDigestedSkillSet : public UFortAthenaAIRuntimeParameters
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotDigestedSkillSet">();
	}
	static class UFortAthenaAIBotDigestedSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotDigestedSkillSet>();
	}
};
static_assert(alignof(UFortAthenaAIBotDigestedSkillSet) == 0x000008, "Wrong alignment on UFortAthenaAIBotDigestedSkillSet");
static_assert(sizeof(UFortAthenaAIBotDigestedSkillSet) == 0x000030, "Wrong size on UFortAthenaAIBotDigestedSkillSet");

// Class FortniteAI.FortAthenaAILODComponent
// 0x0048 (0x00E8 - 0x00A0)
class UFortAthenaAILODComponent final : public UActorComponent
{
public:
	EFortAILODLevel                               CurrentFortAILODLevel;                             // 0x00A0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x2];                                       // 0x00A1(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_A3_0 : 1;                                   // 0x00A3(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCouldBeVisibleToPlayers : 1;                      // 0x00A3(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CachedFortPawn;                                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaAILODSettingsContainer*      AILODSettingsContainer;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentFortAILODLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAILODComponent">();
	}
	static class UFortAthenaAILODComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAILODComponent>();
	}
};
static_assert(alignof(UFortAthenaAILODComponent) == 0x000008, "Wrong alignment on UFortAthenaAILODComponent");
static_assert(sizeof(UFortAthenaAILODComponent) == 0x0000E8, "Wrong size on UFortAthenaAILODComponent");
static_assert(offsetof(UFortAthenaAILODComponent, CurrentFortAILODLevel) == 0x0000A0, "Member 'UFortAthenaAILODComponent::CurrentFortAILODLevel' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODComponent, CachedFortPawn) == 0x0000A8, "Member 'UFortAthenaAILODComponent::CachedFortPawn' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODComponent, AILODSettingsContainer) == 0x0000B0, "Member 'UFortAthenaAILODComponent::AILODSettingsContainer' has a wrong offset!");

// Class FortniteAI.FortNavModifierComponent
// 0x00A0 (0x0230 - 0x0190)
class UFortNavModifierComponent : public UNavModifierComponent
{
public:
	float                                         LowSpeedSquareThreshold;                           // 0x0190(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LowSpeedSquareDistanceThreshold;                   // 0x0194(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LowSpeedRotationThreshold;                         // 0x0198(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LowSpeedScaleThreshold;                            // 0x019C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAutomaticNavBoundComputation : 1;                 // 0x01A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bForceFailSafeExtent : 1;                          // 0x01A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtrapolationMultiplierForFailsafeExtent;          // 0x01A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class ANavigationData>>    DisableForNavmeshClasses;                          // 0x01A8(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    PrimCompAffectingNavMesh;                          // 0x01B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x70];                                     // 0x01C0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetComponentAffectingNavMesh(class UPrimitiveComponent* InComponentAffectingNavMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNavModifierComponent">();
	}
	static class UFortNavModifierComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavModifierComponent>();
	}
};
static_assert(alignof(UFortNavModifierComponent) == 0x000010, "Wrong alignment on UFortNavModifierComponent");
static_assert(sizeof(UFortNavModifierComponent) == 0x000230, "Wrong size on UFortNavModifierComponent");
static_assert(offsetof(UFortNavModifierComponent, LowSpeedSquareThreshold) == 0x000190, "Member 'UFortNavModifierComponent::LowSpeedSquareThreshold' has a wrong offset!");
static_assert(offsetof(UFortNavModifierComponent, LowSpeedSquareDistanceThreshold) == 0x000194, "Member 'UFortNavModifierComponent::LowSpeedSquareDistanceThreshold' has a wrong offset!");
static_assert(offsetof(UFortNavModifierComponent, LowSpeedRotationThreshold) == 0x000198, "Member 'UFortNavModifierComponent::LowSpeedRotationThreshold' has a wrong offset!");
static_assert(offsetof(UFortNavModifierComponent, LowSpeedScaleThreshold) == 0x00019C, "Member 'UFortNavModifierComponent::LowSpeedScaleThreshold' has a wrong offset!");
static_assert(offsetof(UFortNavModifierComponent, ExtrapolationMultiplierForFailsafeExtent) == 0x0001A4, "Member 'UFortNavModifierComponent::ExtrapolationMultiplierForFailsafeExtent' has a wrong offset!");
static_assert(offsetof(UFortNavModifierComponent, DisableForNavmeshClasses) == 0x0001A8, "Member 'UFortNavModifierComponent::DisableForNavmeshClasses' has a wrong offset!");
static_assert(offsetof(UFortNavModifierComponent, PrimCompAffectingNavMesh) == 0x0001B8, "Member 'UFortNavModifierComponent::PrimCompAffectingNavMesh' has a wrong offset!");

// Class FortniteAI.FortAISmartObjectUserComponent
// 0x01A0 (0x0248 - 0x00A8)
class UFortAISmartObjectUserComponent : public TObjectBasedCycleFixup<class UFortSmartObjectUserComponent, 0x0080, 0x08>
{
public:
	float                                         BaseRunningEvaluationTickInterval;                 // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAISmartObjectEvaluationRequestInternalData RunningQueryInternalData;                          // 0x00B0(0x00C0)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FFortSmartObjectEvaluationResult> ResultsPerEvaluationTag;                           // 0x0170(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x01C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectBanned>             SmartObjectsBannedList;                            // 0x01C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         GlobalDelayToDisableSmartObjectUsage;              // 0x01D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectRecentlyUsed>       SmartObjectsMostRecentlyUsed;                      // 0x01E0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAIRuntimeParametersSmartObjectActivity> SmartObjectActivities;                             // 0x01F0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         ActivitiesIDCount;                                 // 0x0200(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CachedController;                                  // 0x0208(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPawn*                              CachedPawn;                                        // 0x0210(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAIActiveCommandSOUsageData        ActiveCommandSOUsageData;                          // 0x0218(0x0010)(Transient, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortAthenaAILODSettings> CachedLODSettingsManager;                          // 0x0238(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool CommandAIToUseSO(const struct FFortAICommandSOUsageData& CommandSOUsageData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAISmartObjectUserComponent">();
	}
	static class UFortAISmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAISmartObjectUserComponent>();
	}
};
static_assert(alignof(UFortAISmartObjectUserComponent) == 0x000008, "Wrong alignment on UFortAISmartObjectUserComponent");
static_assert(sizeof(UFortAISmartObjectUserComponent) == 0x000248, "Wrong size on UFortAISmartObjectUserComponent");
static_assert(offsetof(UFortAISmartObjectUserComponent, BaseRunningEvaluationTickInterval) == 0x0000A8, "Member 'UFortAISmartObjectUserComponent::BaseRunningEvaluationTickInterval' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, RunningQueryInternalData) == 0x0000B0, "Member 'UFortAISmartObjectUserComponent::RunningQueryInternalData' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, ResultsPerEvaluationTag) == 0x000170, "Member 'UFortAISmartObjectUserComponent::ResultsPerEvaluationTag' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, SmartObjectSubsystem) == 0x0001C0, "Member 'UFortAISmartObjectUserComponent::SmartObjectSubsystem' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, SmartObjectsBannedList) == 0x0001C8, "Member 'UFortAISmartObjectUserComponent::SmartObjectsBannedList' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, GlobalDelayToDisableSmartObjectUsage) == 0x0001D8, "Member 'UFortAISmartObjectUserComponent::GlobalDelayToDisableSmartObjectUsage' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, SmartObjectsMostRecentlyUsed) == 0x0001E0, "Member 'UFortAISmartObjectUserComponent::SmartObjectsMostRecentlyUsed' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, SmartObjectActivities) == 0x0001F0, "Member 'UFortAISmartObjectUserComponent::SmartObjectActivities' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, ActivitiesIDCount) == 0x000200, "Member 'UFortAISmartObjectUserComponent::ActivitiesIDCount' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, CachedController) == 0x000208, "Member 'UFortAISmartObjectUserComponent::CachedController' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, CachedPawn) == 0x000210, "Member 'UFortAISmartObjectUserComponent::CachedPawn' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, ActiveCommandSOUsageData) == 0x000218, "Member 'UFortAISmartObjectUserComponent::ActiveCommandSOUsageData' has a wrong offset!");
static_assert(offsetof(UFortAISmartObjectUserComponent, CachedLODSettingsManager) == 0x000238, "Member 'UFortAISmartObjectUserComponent::CachedLODSettingsManager' has a wrong offset!");

// Class FortniteAI.FortAIBotSmartObjectUserComponent
// 0x0048 (0x0290 - 0x0248)
class UFortAIBotSmartObjectUserComponent final : public UFortAISmartObjectUserComponent
{
public:
	class AFortAthenaAIBotController*             CachedBotController;                               // 0x0248(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x40];                                     // 0x0250(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIBotSmartObjectUserComponent">();
	}
	static class UFortAIBotSmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIBotSmartObjectUserComponent>();
	}
};
static_assert(alignof(UFortAIBotSmartObjectUserComponent) == 0x000008, "Wrong alignment on UFortAIBotSmartObjectUserComponent");
static_assert(sizeof(UFortAIBotSmartObjectUserComponent) == 0x000290, "Wrong size on UFortAIBotSmartObjectUserComponent");
static_assert(offsetof(UFortAIBotSmartObjectUserComponent, CachedBotController) == 0x000248, "Member 'UFortAIBotSmartObjectUserComponent::CachedBotController' has a wrong offset!");

// Class FortniteAI.FortAthenaAILODSettings_CharacterMovement
// 0x0948 (0x0970 - 0x0028)
class UFortAthenaAILODSettings_CharacterMovement final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UFortMovementComp_Character>> SystemClasses;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    BelowLowerLODSettings;                             // 0x0040(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    LowerLODSettings;                                  // 0x01C8(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    AboveLowerLODSettings;                             // 0x0350(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    BelowNormalLODSettings;                            // 0x04D8(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    NormalLODSettings;                                 // 0x0660(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortAILODSetting_CharacterMovement    AboveNormalLODSettings;                            // 0x07E8(0x0188)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAILODSettings_CharacterMovement">();
	}
	static class UFortAthenaAILODSettings_CharacterMovement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAILODSettings_CharacterMovement>();
	}
};
static_assert(alignof(UFortAthenaAILODSettings_CharacterMovement) == 0x000008, "Wrong alignment on UFortAthenaAILODSettings_CharacterMovement");
static_assert(sizeof(UFortAthenaAILODSettings_CharacterMovement) == 0x000970, "Wrong size on UFortAthenaAILODSettings_CharacterMovement");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, SystemClasses) == 0x000030, "Member 'UFortAthenaAILODSettings_CharacterMovement::SystemClasses' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, BelowLowerLODSettings) == 0x000040, "Member 'UFortAthenaAILODSettings_CharacterMovement::BelowLowerLODSettings' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, LowerLODSettings) == 0x0001C8, "Member 'UFortAthenaAILODSettings_CharacterMovement::LowerLODSettings' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, AboveLowerLODSettings) == 0x000350, "Member 'UFortAthenaAILODSettings_CharacterMovement::AboveLowerLODSettings' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, BelowNormalLODSettings) == 0x0004D8, "Member 'UFortAthenaAILODSettings_CharacterMovement::BelowNormalLODSettings' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, NormalLODSettings) == 0x000660, "Member 'UFortAthenaAILODSettings_CharacterMovement::NormalLODSettings' has a wrong offset!");
static_assert(offsetof(UFortAthenaAILODSettings_CharacterMovement, AboveNormalLODSettings) == 0x0007E8, "Member 'UFortAthenaAILODSettings_CharacterMovement::AboveNormalLODSettings' has a wrong offset!");

// Class FortniteAI.ThreatCloud
// 0x0240 (0x04D0 - 0x0290)
class AThreatCloud final : public AActor
{
public:
	TArray<class UBoxComponent*>                  LightningSourceAreas;                              // 0x0290(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FSlateBrush                            MiniMapIconBrush;                                  // 0x02A0(0x00C0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         MiniMapIconPercent;                                // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_364[0xC];                                      // 0x0364(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            MiniMapFarOffIconBrush;                            // 0x0370(0x00C0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           ActiveTint;                                        // 0x0430(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           InActiveTint;                                      // 0x0440(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ActiveTransitionTime;                              // 0x0450(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DeathTimerDuration;                                // 0x0454(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CloudMiniMapTickInterval;                          // 0x0458(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45C[0x14];                                     // 0x045C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MiniMapFarOffIconDegreesOfArc;                     // 0x0470(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_474[0xC];                                      // 0x0474(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   ThreatBoxVolume;                                   // 0x0480(0x0038)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         GroundLevelUnderCloud;                             // 0x04B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        GoalActorLocations;                                // 0x04C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void ManualLightningFlash();
	void OnBeginDeath();
	void OnCloudActivated();
	void OnCloudDeactivated(EFortThreatDeactivationType DeactivationType);
	void OnCloudHiddenChange(bool bCloudsAreHidden);
	void OnCloudStart();
	void OnLightningStrike(const struct FVector& StartLocation, const struct FVector& EndLocation, class ABuildingRift* Rift, bool bLightningStruckRift);
	void OnThreatVolumeChanged();

	struct FBox GetThreatVolume() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ThreatCloud">();
	}
	static class AThreatCloud* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThreatCloud>();
	}
};
static_assert(alignof(AThreatCloud) == 0x000010, "Wrong alignment on AThreatCloud");
static_assert(sizeof(AThreatCloud) == 0x0004D0, "Wrong size on AThreatCloud");
static_assert(offsetof(AThreatCloud, LightningSourceAreas) == 0x000290, "Member 'AThreatCloud::LightningSourceAreas' has a wrong offset!");
static_assert(offsetof(AThreatCloud, MiniMapIconBrush) == 0x0002A0, "Member 'AThreatCloud::MiniMapIconBrush' has a wrong offset!");
static_assert(offsetof(AThreatCloud, MiniMapIconPercent) == 0x000360, "Member 'AThreatCloud::MiniMapIconPercent' has a wrong offset!");
static_assert(offsetof(AThreatCloud, MiniMapFarOffIconBrush) == 0x000370, "Member 'AThreatCloud::MiniMapFarOffIconBrush' has a wrong offset!");
static_assert(offsetof(AThreatCloud, ActiveTint) == 0x000430, "Member 'AThreatCloud::ActiveTint' has a wrong offset!");
static_assert(offsetof(AThreatCloud, InActiveTint) == 0x000440, "Member 'AThreatCloud::InActiveTint' has a wrong offset!");
static_assert(offsetof(AThreatCloud, ActiveTransitionTime) == 0x000450, "Member 'AThreatCloud::ActiveTransitionTime' has a wrong offset!");
static_assert(offsetof(AThreatCloud, DeathTimerDuration) == 0x000454, "Member 'AThreatCloud::DeathTimerDuration' has a wrong offset!");
static_assert(offsetof(AThreatCloud, CloudMiniMapTickInterval) == 0x000458, "Member 'AThreatCloud::CloudMiniMapTickInterval' has a wrong offset!");
static_assert(offsetof(AThreatCloud, MiniMapFarOffIconDegreesOfArc) == 0x000470, "Member 'AThreatCloud::MiniMapFarOffIconDegreesOfArc' has a wrong offset!");
static_assert(offsetof(AThreatCloud, ThreatBoxVolume) == 0x000480, "Member 'AThreatCloud::ThreatBoxVolume' has a wrong offset!");
static_assert(offsetof(AThreatCloud, GroundLevelUnderCloud) == 0x0004B8, "Member 'AThreatCloud::GroundLevelUnderCloud' has a wrong offset!");
static_assert(offsetof(AThreatCloud, GoalActorLocations) == 0x0004C0, "Member 'AThreatCloud::GoalActorLocations' has a wrong offset!");

// Class FortniteAI.FortNavArea
// 0x0008 (0x0050 - 0x0048)
class UFortNavArea : public UNavArea
{
public:
	uint8                                         bObstacle : 1;                                     // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSmashable : 1;                                    // 0x0048(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNavArea">();
	}
	static class UFortNavArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavArea>();
	}
};
static_assert(alignof(UFortNavArea) == 0x000008, "Wrong alignment on UFortNavArea");
static_assert(sizeof(UFortNavArea) == 0x000050, "Wrong size on UFortNavArea");

// Class FortniteAI.FortNavArea_TakerOnly
// 0x0000 (0x0050 - 0x0050)
class UFortNavArea_TakerOnly final : public UFortNavArea
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNavArea_TakerOnly">();
	}
	static class UFortNavArea_TakerOnly* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavArea_TakerOnly>();
	}
};
static_assert(alignof(UFortNavArea_TakerOnly) == 0x000008, "Wrong alignment on UFortNavArea_TakerOnly");
static_assert(sizeof(UFortNavArea_TakerOnly) == 0x000050, "Wrong size on UFortNavArea_TakerOnly");

// Class FortniteAI.FortPhysicsObjectNavigationComponent
// 0x0010 (0x0240 - 0x0230)
class UFortPhysicsObjectNavigationComponent : public UFortNavModifierComponent
{
public:
	class UFortPhysicsObjectComponent*            PhysicsObjectComponent;                            // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSleepStateChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPhysicsObjectNavigationComponent">();
	}
	static class UFortPhysicsObjectNavigationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPhysicsObjectNavigationComponent>();
	}
};
static_assert(alignof(UFortPhysicsObjectNavigationComponent) == 0x000010, "Wrong alignment on UFortPhysicsObjectNavigationComponent");
static_assert(sizeof(UFortPhysicsObjectNavigationComponent) == 0x000240, "Wrong size on UFortPhysicsObjectNavigationComponent");
static_assert(offsetof(UFortPhysicsObjectNavigationComponent, PhysicsObjectComponent) == 0x000230, "Member 'UFortPhysicsObjectNavigationComponent::PhysicsObjectComponent' has a wrong offset!");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_OptimBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_OptimBase : public UFortAthenaAISpawnerDataComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_OptimBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_OptimBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_OptimBase>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_OptimBase) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_OptimBase");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_OptimBase) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent_OptimBase");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_AIPawnOptim
// 0x0008 (0x0038 - 0x0030)
class UFortAthenaAISpawnerDataComponent_AIPawnOptim final : public UFortAthenaAISpawnerDataComponent_OptimBase
{
public:
	uint8                                         bRegisterToAIDropper : 1;                          // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_AIPawnOptim">();
	}
	static class UFortAthenaAISpawnerDataComponent_AIPawnOptim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_AIPawnOptim>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_AIPawnOptim) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_AIPawnOptim");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_AIPawnOptim) == 0x000038, "Wrong size on UFortAthenaAISpawnerDataComponent_AIPawnOptim");

// Class FortniteAI.FortAIAimingInterface
// 0x0000 (0x0028 - 0x0028)
class IFortAIAimingInterface final : public IInterface
{
public:
	void GetAimingRotation(struct FRotator* OutRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIAimingInterface">();
	}
	static class IFortAIAimingInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAIAimingInterface>();
	}
};
static_assert(alignof(IFortAIAimingInterface) == 0x000008, "Wrong alignment on IFortAIAimingInterface");
static_assert(sizeof(IFortAIAimingInterface) == 0x000028, "Wrong size on IFortAIAimingInterface");

// Class FortniteAI.FortAIAimingManagerInterface
// 0x0000 (0x0028 - 0x0028)
class IFortAIAimingManagerInterface final : public IInterface
{
public:
	void ComputeAimingRotations();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIAimingManagerInterface">();
	}
	static class IFortAIAimingManagerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAIAimingManagerInterface>();
	}
};
static_assert(alignof(IFortAIAimingManagerInterface) == 0x000008, "Wrong alignment on IFortAIAimingManagerInterface");
static_assert(sizeof(IFortAIAimingManagerInterface) == 0x000028, "Wrong size on IFortAIAimingManagerInterface");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_ScriptBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_ScriptBase : public UFortAthenaAISpawnerDataComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_ScriptBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_ScriptBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_ScriptBase>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_ScriptBase) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_ScriptBase");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_ScriptBase) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent_ScriptBase");

// Class FortniteAI.FortAIInjectedBehaviorComponent
// 0x0050 (0x00F0 - 0x00A0)
class UFortAIInjectedBehaviorComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIInjectedBehaviorComponent">();
	}
	static class UFortAIInjectedBehaviorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIInjectedBehaviorComponent>();
	}
};
static_assert(alignof(UFortAIInjectedBehaviorComponent) == 0x000008, "Wrong alignment on UFortAIInjectedBehaviorComponent");
static_assert(sizeof(UFortAIInjectedBehaviorComponent) == 0x0000F0, "Wrong size on UFortAIInjectedBehaviorComponent");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_CosmeticBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_CosmeticBase : public UFortAthenaAISpawnerDataComponent
{
public:
	void GetFallbackTag(struct FGameplayTag* OutFallbackTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_CosmeticBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_CosmeticBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_CosmeticBase>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_CosmeticBase) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_CosmeticBase");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_CosmeticBase) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent_CosmeticBase");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_AIPawnCosmeticBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase : public UFortAthenaAISpawnerDataComponent_CosmeticBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_AIPawnCosmeticBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization
// 0x0018 (0x0048 - 0x0030)
class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization final : public UFortAthenaAISpawnerDataComponent_AIPawnCosmeticBase
{
public:
	struct FGameplayTag                           FallbackTag;                                       // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAIPawnCustomizationDefinition*     CustomizationDefinition;                           // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanUnloadCustomization;                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization">();
	}
	static class UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization) == 0x000048, "Wrong size on UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization");
static_assert(offsetof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization, FallbackTag) == 0x000030, "Member 'UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization::FallbackTag' has a wrong offset!");
static_assert(offsetof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization, CustomizationDefinition) == 0x000038, "Member 'UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization::CustomizationDefinition' has a wrong offset!");
static_assert(offsetof(UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization, bCanUnloadCustomization) == 0x000040, "Member 'UFortAthenaAISpawnerDataComponent_AIPawnCosmeticCustomization::bCanUnloadCustomization' has a wrong offset!");

// Class FortniteAI.FortAIPawnSmartObjectUserComponent
// 0x0000 (0x0248 - 0x0248)
class UFortAIPawnSmartObjectUserComponent final : public UFortAISmartObjectUserComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIPawnSmartObjectUserComponent">();
	}
	static class UFortAIPawnSmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIPawnSmartObjectUserComponent>();
	}
};
static_assert(alignof(UFortAIPawnSmartObjectUserComponent) == 0x000008, "Wrong alignment on UFortAIPawnSmartObjectUserComponent");
static_assert(sizeof(UFortAIPawnSmartObjectUserComponent) == 0x000248, "Wrong size on UFortAIPawnSmartObjectUserComponent");

// Class FortniteAI.FortAIPerceptionSystem
// 0x0000 (0x0130 - 0x0130)
class UFortAIPerceptionSystem final : public UAIPerceptionSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIPerceptionSystem">();
	}
	static class UFortAIPerceptionSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIPerceptionSystem>();
	}
};
static_assert(alignof(UFortAIPerceptionSystem) == 0x000008, "Wrong alignment on UFortAIPerceptionSystem");
static_assert(sizeof(UFortAIPerceptionSystem) == 0x000130, "Wrong size on UFortAIPerceptionSystem");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_PerksBase
// 0x0010 (0x0040 - 0x0030)
class UFortAthenaAISpawnerDataComponent_PerksBase final : public UFortAthenaAISpawnerDataComponent
{
public:
	TArray<struct FPerkAvailabilityContainer>     PerksContainers;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_PerksBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_PerksBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_PerksBase>();
	}
};
