#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortControlRigUnits

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// Enum FortControlRigUnits.EFortRigUnitTraceType
// NumValues: 0x0002
enum class EFortRigUnitTraceType : uint8
{
	SingleTrace                              = 0,
	MultiTrace                               = 1,
};

// ScriptStruct FortControlRigUnits.FortRigUnit_SphereTrace_WorkData
// 0x0038 (0x0038 - 0x0000)
struct FFortRigUnit_SphereTrace_WorkData final
{
public:
	uint32                                        Hash;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHit;                                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitialOverlap;                                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormal;                                         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFortRigUnit_SphereTrace_WorkData) == 0x000008, "Wrong alignment on FFortRigUnit_SphereTrace_WorkData");
static_assert(sizeof(FFortRigUnit_SphereTrace_WorkData) == 0x000038, "Wrong size on FFortRigUnit_SphereTrace_WorkData");
static_assert(offsetof(FFortRigUnit_SphereTrace_WorkData, Hash) == 0x000000, "Member 'FFortRigUnit_SphereTrace_WorkData::Hash' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTrace_WorkData, bHit) == 0x000004, "Member 'FFortRigUnit_SphereTrace_WorkData::bHit' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTrace_WorkData, bInitialOverlap) == 0x000005, "Member 'FFortRigUnit_SphereTrace_WorkData::bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTrace_WorkData, HitLocation) == 0x000008, "Member 'FFortRigUnit_SphereTrace_WorkData::HitLocation' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTrace_WorkData, HitNormal) == 0x000020, "Member 'FFortRigUnit_SphereTrace_WorkData::HitNormal' has a wrong offset!");

// ScriptStruct FortControlRigUnits.FortRigUnit_SphereTraceByChannel
// 0x00E0 (0x00E8 - 0x0008)
struct FFortRigUnit_SphereTraceByChannel final : public FRigUnit
{
public:
	struct FVector                                Start;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTraceComplex;                                     // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           IgnoreActorTags;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  IgnoreGameplayTags;                                // 0x0058(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EFortRigUnitTraceType                         TraceType;                                         // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHit;                                              // 0x0079(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitialOverlap;                                   // 0x007A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0080(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormal;                                         // 0x0098(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortRigUnit_SphereTrace_WorkData      WorkData;                                          // 0x00B0(0x0038)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFortRigUnit_SphereTraceByChannel) == 0x000008, "Wrong alignment on FFortRigUnit_SphereTraceByChannel");
static_assert(sizeof(FFortRigUnit_SphereTraceByChannel) == 0x0000E8, "Wrong size on FFortRigUnit_SphereTraceByChannel");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, Start) == 0x000008, "Member 'FFortRigUnit_SphereTraceByChannel::Start' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, End) == 0x000020, "Member 'FFortRigUnit_SphereTraceByChannel::End' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, TraceChannel) == 0x000038, "Member 'FFortRigUnit_SphereTraceByChannel::TraceChannel' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, Radius) == 0x00003C, "Member 'FFortRigUnit_SphereTraceByChannel::Radius' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, bTraceComplex) == 0x000040, "Member 'FFortRigUnit_SphereTraceByChannel::bTraceComplex' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, IgnoreActorTags) == 0x000048, "Member 'FFortRigUnit_SphereTraceByChannel::IgnoreActorTags' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, IgnoreGameplayTags) == 0x000058, "Member 'FFortRigUnit_SphereTraceByChannel::IgnoreGameplayTags' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, TraceType) == 0x000078, "Member 'FFortRigUnit_SphereTraceByChannel::TraceType' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, bHit) == 0x000079, "Member 'FFortRigUnit_SphereTraceByChannel::bHit' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, bInitialOverlap) == 0x00007A, "Member 'FFortRigUnit_SphereTraceByChannel::bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, HitLocation) == 0x000080, "Member 'FFortRigUnit_SphereTraceByChannel::HitLocation' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, HitNormal) == 0x000098, "Member 'FFortRigUnit_SphereTraceByChannel::HitNormal' has a wrong offset!");
static_assert(offsetof(FFortRigUnit_SphereTraceByChannel, WorkData) == 0x0000B0, "Member 'FFortRigUnit_SphereTraceByChannel::WorkData' has a wrong offset!");

}

