#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendItemViewSettingsManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.GetItemViewSettings
// 0x0320 (0x0320 - 0x0000)
struct FrontendItemViewSettingsManager_C_GetItemViewSettings final
{
public:
	EFrontEndCamera                               Camera;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      GameMode;                                          // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SubSlotIndex;                                      // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemViewSettings                  ReturnValue;                                       // 0x0018(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FFortItemViewSettings                  Return_Value;                                      // 0x0068(0x0050)(Edit, BlueprintVisible, NoDestructor)
	TArray<EFortItemType>                         K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue;  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1; // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJunoBuilding_IsJunoBuilding;            // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPetCarrierItemDefinition*        K2Node_DynamicCast_AsAthena_Pet_Carrier_Item_Definition; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaToyItemDefinition*               K2Node_DynamicCast_AsAthena_Toy_Item_Definition;   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJunoBuilding_IsJunoBuilding_1;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_1;                // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue;              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_1;            // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJunoBuilding_IsJunoBuilding_2;          // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_2;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_2;            // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSprayItemDefinition*             K2Node_DynamicCast_AsAthena_Spray_Item_Definition; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSkyDiveContrailItemDefinition*   K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_3;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_3;            // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGliderItemDefinition*            K2Node_DynamicCast_AsAthena_Glider_Item_Definition; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPickaxeItemDefinition*           K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue_1;              // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue; // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_2;                          // 0x0158(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_3;                          // 0x0170(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_4;                          // 0x0188(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound;                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_1;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            K2Node_MakeStruct_FloatRange;                      // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_2;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_3;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_4;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_1;                    // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_2;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_5;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_5;                          // 0x0208(0x0010)(ConstParm, ReferenceParm)
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_2;                    // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_6;               // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_3;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_6;                          // 0x0240(0x0010)(ConstParm, ReferenceParm)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_7;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_6;             // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_3;                    // 0x025C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_7;                          // 0x0270(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_7;             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_8;                          // 0x0288(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_8;             // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_9;                          // 0x02A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_9;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_10;                         // 0x02D0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_10;            // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_11;                         // 0x02E8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_11;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_1; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast_1;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_2; // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast_2;            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_3; // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast_3;            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_4; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_GetItemViewSettings) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_GetItemViewSettings");
static_assert(sizeof(FrontendItemViewSettingsManager_C_GetItemViewSettings) == 0x000320, "Wrong size on FrontendItemViewSettingsManager_C_GetItemViewSettings");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Camera) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Camera' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, GameMode) == 0x000001, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::GameMode' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, ItemDefinition) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::ItemDefinition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, SubSlotIndex) == 0x000010, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::SubSlotIndex' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, ReturnValue) == 0x000018, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Return_Value) == 0x000068, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Return_Value' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array) == 0x0000B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue) == 0x0000C9, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1) == 0x0000CA, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsJunoBuilding_IsJunoBuilding) == 0x0000CB, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsJunoBuilding_IsJunoBuilding' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Pet_Carrier_Item_Definition) == 0x0000D0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Pet_Carrier_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_SelectFloat_ReturnValue) == 0x0000E0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Toy_Item_Definition) == 0x0000E8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Toy_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsJunoBuilding_IsJunoBuilding_1) == 0x0000F1, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsJunoBuilding_IsJunoBuilding_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue) == 0x0000F2, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_1) == 0x0000F3, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue) == 0x0000F4, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_1) == 0x0000F5, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F6, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsJunoBuilding_IsJunoBuilding_2) == 0x0000F7, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsJunoBuilding_IsJunoBuilding_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue) == 0x0000F8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_2) == 0x0000F9, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue) == 0x0000FA, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_2) == 0x0000FB, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Spray_Item_Definition) == 0x000100, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Spray_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue) == 0x000109, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition) == 0x000110, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_3) == 0x000119, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Not_PreBool_ReturnValue) == 0x00011A, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_3) == 0x00011B, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue_1) == 0x00011C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Glider_Item_Definition) == 0x000120, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Glider_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition) == 0x000130, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_5) == 0x000138, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Vector_IsZero_ReturnValue) == 0x000139, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Vector_IsZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Vector_IsZero_ReturnValue_1) == 0x00013A, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Vector_IsZero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue) == 0x00013B, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00013C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00013D, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_1) == 0x000140, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_1) == 0x000150, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_2) == 0x000158, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_2) == 0x000168, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_3) == 0x000170, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_3) == 0x000180, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_4) == 0x000188, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue_2) == 0x000198, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_4) == 0x000199, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralDouble_ReturnValue) == 0x0001A0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound) == 0x0001A8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_1) == 0x0001B0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralDouble_ReturnValue_1) == 0x0001B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange) == 0x0001C0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_2) == 0x0001D0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_3) == 0x0001D8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_4) == 0x0001E0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_1) == 0x0001E8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralDouble_ReturnValue_2) == 0x0001F8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_5) == 0x000200, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_5) == 0x000208, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_2) == 0x000218, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_5) == 0x000228, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_6) == 0x00022C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralDouble_ReturnValue_3) == 0x000238, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_6) == 0x000240, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_7) == 0x000250, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_6) == 0x000258, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_3) == 0x00025C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_7) == 0x000270, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_7) == 0x000280, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_8) == 0x000288, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_8) == 0x000298, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x000299, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_9) == 0x0002A0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_9) == 0x0002B0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Temp_real_Variable) == 0x0002B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Temp_bool_Variable) == 0x0002C0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_Select_Default) == 0x0002C8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_10) == 0x0002D0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_10' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_10) == 0x0002E0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue_2) == 0x0002E1, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_11) == 0x0002E8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_11' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_11) == 0x0002F8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue_3) == 0x0002F9, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast) == 0x0002FC, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_Value_ImplicitCast) == 0x000300, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_1) == 0x000304, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_Value_ImplicitCast_1) == 0x000308, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_2) == 0x00030C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_Value_ImplicitCast_2) == 0x000310, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_3) == 0x000314, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_Value_ImplicitCast_3) == 0x000318, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_4) == 0x00031C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_SetFieldsInStruct_DefaultZoomLevel_ImplicitCast_4' has a wrong offset!");

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.Is Hero or Previews on Hero
// 0x0028 (0x0028 - 0x0000)
struct FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero final
{
public:
	class UFortItemDefinition*                    Item_Definition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SubSlotIndex;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_ShouldShowPreviewOnCurrentHero_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero");
static_assert(sizeof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero) == 0x000028, "Wrong size on FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, Item_Definition) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, SubSlotIndex) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::SubSlotIndex' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, ReturnValue) == 0x00000C, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, K2Node_MakeArray_Array) == 0x000010, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, CallFunc_ShouldShowPreviewOnCurrentHero_ReturnValue) == 0x000020, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::CallFunc_ShouldShowPreviewOnCurrentHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, CallFunc_GetItemType_ReturnValue) == 0x000021, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, CallFunc_Array_Contains_ReturnValue) == 0x000022, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.IsJunoBuilding
// 0x0030 (0x0030 - 0x0000)
struct FrontendItemViewSettingsManager_C_IsJunoBuilding final
{
public:
	class UFortItemDefinition*                    FortItemDefinition;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsJunoBuilding_0;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetType>              K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FPrimaryAssetId                        CallFunc_GetPrimaryAssetIdFromObject_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_IsJunoBuilding) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_IsJunoBuilding");
static_assert(sizeof(FrontendItemViewSettingsManager_C_IsJunoBuilding) == 0x000030, "Wrong size on FrontendItemViewSettingsManager_C_IsJunoBuilding");
static_assert(offsetof(FrontendItemViewSettingsManager_C_IsJunoBuilding, FortItemDefinition) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_IsJunoBuilding::FortItemDefinition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_IsJunoBuilding, IsJunoBuilding_0) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_IsJunoBuilding::IsJunoBuilding_0' has a wrong offset!");
