#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ZipLine_Jump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ZipLine_Jump.GA_Athena_ZipLine_Jump_C
// 0x00A0 (0x0C00 - 0x0B60)
class UGA_Athena_ZipLine_Jump_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxLateralSpeed;                                   // 0x0B70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                ImpulseVec;                                        // 0x0B98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         JumpVertStrength;                                  // 0x0BB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         JumpLateralDamper;                                 // 0x0BD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_ZipLine_Jump(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ZipLine_Jump_C">();
	}
	static class UGA_Athena_ZipLine_Jump_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ZipLine_Jump_C>();
	}
};
static_assert(alignof(UGA_Athena_ZipLine_Jump_C) == 0x000008, "Wrong alignment on UGA_Athena_ZipLine_Jump_C");
static_assert(sizeof(UGA_Athena_ZipLine_Jump_C) == 0x000C00, "Wrong size on UGA_Athena_ZipLine_Jump_C");
static_assert(offsetof(UGA_Athena_ZipLine_Jump_C, UberGraphFrame) == 0x000B60, "Member 'UGA_Athena_ZipLine_Jump_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ZipLine_Jump_C, PlayerPawn) == 0x000B68, "Member 'UGA_Athena_ZipLine_Jump_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ZipLine_Jump_C, MaxLateralSpeed) == 0x000B70, "Member 'UGA_Athena_ZipLine_Jump_C::MaxLateralSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ZipLine_Jump_C, ImpulseVec) == 0x000B98, "Member 'UGA_Athena_ZipLine_Jump_C::ImpulseVec' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ZipLine_Jump_C, JumpVertStrength) == 0x000BB0, "Member 'UGA_Athena_ZipLine_Jump_C::JumpVertStrength' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ZipLine_Jump_C, JumpLateralDamper) == 0x000BD8, "Member 'UGA_Athena_ZipLine_Jump_C::JumpLateralDamper' has a wrong offset!");

}

