#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Player_Slide

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndAbilityClientSide
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_Player_Slide_C_EndAbilityClientSide final
{
public:
	class UCameraModifier_Athena_Sliding_C*       K2Node_DynamicCast_AsCamera_Modifier_Athena_Sliding; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_EndAbilityClientSide) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_EndAbilityClientSide");
static_assert(sizeof(GA_Athena_Player_Slide_C_EndAbilityClientSide) == 0x000010, "Wrong size on GA_Athena_Player_Slide_C_EndAbilityClientSide");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityClientSide, K2Node_DynamicCast_AsCamera_Modifier_Athena_Sliding) == 0x000000, "Member 'GA_Athena_Player_Slide_C_EndAbilityClientSide::K2Node_DynamicCast_AsCamera_Modifier_Athena_Sliding' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityClientSide, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'GA_Athena_Player_Slide_C_EndAbilityClientSide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityClientSide, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'GA_Athena_Player_Slide_C_EndAbilityClientSide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndAbilityServerSide
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Player_Slide_C_EndAbilityServerSide final
{
public:
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_EndAbilityServerSide) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_EndAbilityServerSide");
static_assert(sizeof(GA_Athena_Player_Slide_C_EndAbilityServerSide) == 0x000028, "Wrong size on GA_Athena_Player_Slide_C_EndAbilityServerSide");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000000, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000008, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x000018, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.ExecuteUbergraph_GA_Athena_Player_Slide
// 0x0A50 (0x0A50 - 0x0000)
struct GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsTargeting)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastUpdateVelocity_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlidingControlParams                  CallFunc_GetSlidingControlParams_ReturnValue;      // 0x0078(0x06C0)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_3;  // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74C[0x4];                                      // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0750(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0760(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue; // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0798(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_4;  // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x07A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_5;  // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x07C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x07E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E2[0x6];                                      // 0x07E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_6;  // 0x07E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_Pawn;                           // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FA[0x6];                                      // 0x07FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_7;  // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80A[0x6];                                      // 0x080A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_8;  // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character_2; // 0x0818(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0822(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0823(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0824(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_825[0x3];                                      // 0x0825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0830(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0848(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0878(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0890(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x08A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x08D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x08F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0910(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_9;  // 0x0918(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0920(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue_1;           // 0x0930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0939(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93A[0x6];                                      // 0x093A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character_3; // 0x0940(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_10; // 0x0950(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0958(0x00B0)(ConstParm)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_11; // 0x0A08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x0A10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveCameraModifier_ReturnValue;         // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_3;                // 0x0A20(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsTargeting;                   // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0A29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2A[0x6];                                      // 0x0A2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_12; // 0x0A30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortPlayerPawn* Pawn)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0A38(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A44[0x4];                                      // 0x0A44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_3; // 0x0A48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide");
static_assert(sizeof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide) == 0x000A50, "Wrong size on GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, EntryPoint) == 0x000000, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000018, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1) == 0x000020, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsFalling_ReturnValue) == 0x000029, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_1) == 0x00002A, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character) == 0x000030, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2) == 0x000040, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetLastUpdateVelocity_ReturnValue) == 0x000048, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetLastUpdateVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_VSize_ReturnValue) == 0x000060, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character_1) == 0x000068, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000071, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetSlidingControlParams_ReturnValue) == 0x000078, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetSlidingControlParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000738, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_3) == 0x000740, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetValueAtLevel_ReturnValue) == 0x000748, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000750, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_2) == 0x000758, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000760, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000768, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_2) == 0x000770, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000778, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_3) == 0x000780, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue) == 0x000788, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsServer_ReturnValue) == 0x000790, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000798, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_4) == 0x0007A0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0007A8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_StartCameraShake_ReturnValue) == 0x0007B0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_5) == 0x0007B8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsServer_ReturnValue_1) == 0x0007C0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x0007C8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_3) == 0x0007D0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x0007D8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_4) == 0x0007E0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsServer_ReturnValue_2) == 0x0007E1, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_6) == 0x0007E8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_CustomEvent_Pawn) == 0x0007F0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_4) == 0x0007F8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, Temp_bool_Has_Been_Initd_Variable) == 0x0007F9, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_7) == 0x000800, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_5) == 0x000808, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, Temp_bool_IsClosed_Variable) == 0x000809, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_8) == 0x000810, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character_2) == 0x000818, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_5) == 0x000820, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_Event_bWasCancelled) == 0x000821, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000822, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_bBlockingHit) == 0x000823, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_bInitialOverlap) == 0x000824, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Time) == 0x000828, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Distance) == 0x00082C, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Location) == 0x000830, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_ImpactPoint) == 0x000848, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Normal) == 0x000860, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_ImpactNormal) == 0x000878, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_PhysMat) == 0x000890, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitActor) == 0x000898, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitComponent) == 0x0008A0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitBoneName) == 0x0008A8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_BoneName) == 0x0008AC, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitItem) == 0x0008B0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_ElementIndex) == 0x0008B4, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_FaceIndex) == 0x0008B8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_TraceStart) == 0x0008C0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_TraceEnd) == 0x0008D8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BooleanAND_ReturnValue) == 0x0008F0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_MakeRotFromZ_ReturnValue) == 0x0008F8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000910, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_9) == 0x000918, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x000920, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_6) == 0x000928, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetCurrentWeapon_ReturnValue_1) == 0x000930, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetCurrentWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_6) == 0x000938, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_7) == 0x000939, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character_3) == 0x000940, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_7) == 0x000948, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_10) == 0x000950, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_Event_EventData) == 0x000958, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_11) == 0x000A08, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x000A10, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_RemoveCameraModifier_ReturnValue) == 0x000A18, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_RemoveCameraModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue_3) == 0x000A20, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_CustomEvent_bIsTargeting) == 0x000A28, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_CustomEvent_bIsTargeting' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_8) == 0x000A29, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_12) == 0x000A30, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_CreateDelegate_OutputDelegate_1) == 0x000A38, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_3) == 0x000A48, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_3' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Player_Slide_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Player_Slide_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Player_Slide_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Player_Slide_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Player_Slide_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Player_Slide_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.OnFinishedCharacterCustomization_Event_0
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0 final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0");
static_assert(sizeof(GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0) == 0x000008, "Wrong size on GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0");
static_assert(offsetof(GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0, Pawn) == 0x000000, "Member 'GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0::Pawn' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.OnTargetingChanged
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Player_Slide_C_OnTargetingChanged final
{
public:
	bool                                          bIsTargeting;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_OnTargetingChanged) == 0x000001, "Wrong alignment on GA_Athena_Player_Slide_C_OnTargetingChanged");
static_assert(sizeof(GA_Athena_Player_Slide_C_OnTargetingChanged) == 0x000001, "Wrong size on GA_Athena_Player_Slide_C_OnTargetingChanged");
static_assert(offsetof(GA_Athena_Player_Slide_C_OnTargetingChanged, bIsTargeting) == 0x000000, "Member 'GA_Athena_Player_Slide_C_OnTargetingChanged::bIsTargeting' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.BuildDataRegistryResolverScope
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope final
{
public:
	TArray<class FName>                           InOutResolverScopes;                               // 0x0000(0x0010)(Parm, OutParm)
	int32                                         InOutPriority;                                     // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope");
static_assert(sizeof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope) == 0x000018, "Wrong size on GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope");
static_assert(offsetof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope, InOutResolverScopes) == 0x000000, "Member 'GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope::InOutResolverScopes' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope, InOutPriority) == 0x000010, "Member 'GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope::InOutPriority' has a wrong offset!");
