#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Vehicle_Boost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Vehicle_Boost.GA_Athena_Vehicle_Boost_C
// 0x0020 (0x0B80 - 0x0B60)
class UGA_Athena_Vehicle_Boost_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TriggerDuration;                                   // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BoostCue;                                          // 0x0B78(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_E4232094451482BC683CB7B08344D26A(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Athena_Vehicle_Boost(int32 EntryPoint);
	void FailedToActivatePassiveAbility(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Vehicle_Boost_C">();
	}
	static class UGA_Athena_Vehicle_Boost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Vehicle_Boost_C>();
	}
};
static_assert(alignof(UGA_Athena_Vehicle_Boost_C) == 0x000008, "Wrong alignment on UGA_Athena_Vehicle_Boost_C");
static_assert(sizeof(UGA_Athena_Vehicle_Boost_C) == 0x000B80, "Wrong size on UGA_Athena_Vehicle_Boost_C");
static_assert(offsetof(UGA_Athena_Vehicle_Boost_C, UberGraphFrame) == 0x000B60, "Member 'UGA_Athena_Vehicle_Boost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Vehicle_Boost_C, PlayerPawn) == 0x000B68, "Member 'UGA_Athena_Vehicle_Boost_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Vehicle_Boost_C, TriggerDuration) == 0x000B70, "Member 'UGA_Athena_Vehicle_Boost_C::TriggerDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Vehicle_Boost_C, BoostCue) == 0x000B78, "Member 'UGA_Athena_Vehicle_Boost_C::BoostCue' has a wrong offset!");

}

