#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DudeBro_Vent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DudeBro_Vent.GA_DudeBro_Vent_C
// 0x0048 (0x0BA8 - 0x0B60)
class UGA_DudeBro_Vent_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 VehicleSkelMesh;                                   // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        GravFloorAltitude;                                 // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UpwardLaunchVelocity;                              // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         VentsHitBeforeLanding;                             // 0x0B88(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         NumVentsToHitForQuest;                             // 0x0B98(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_to_Check;                                      // 0x0B9C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VentBlocked;                                       // 0x0BA0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActuallyCleanPlayerUp();
	void Added_4065C3B14D35BDC4C0608DB5BD4A1EBA();
	void ExecuteUbergraph_GA_DudeBro_Vent(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void MovementModeChangedDelegate_Event_0(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void PlayerCapsuleHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DudeBro_Vent_C">();
	}
	static class UGA_DudeBro_Vent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DudeBro_Vent_C>();
	}
};
static_assert(alignof(UGA_DudeBro_Vent_C) == 0x000008, "Wrong alignment on UGA_DudeBro_Vent_C");
static_assert(sizeof(UGA_DudeBro_Vent_C) == 0x000BA8, "Wrong size on UGA_DudeBro_Vent_C");
static_assert(offsetof(UGA_DudeBro_Vent_C, UberGraphFrame) == 0x000B60, "Member 'UGA_DudeBro_Vent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, VehicleSkelMesh) == 0x000B68, "Member 'UGA_DudeBro_Vent_C::VehicleSkelMesh' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, PlayerPawn) == 0x000B70, "Member 'UGA_DudeBro_Vent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, GravFloorAltitude) == 0x000B78, "Member 'UGA_DudeBro_Vent_C::GravFloorAltitude' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, UpwardLaunchVelocity) == 0x000B80, "Member 'UGA_DudeBro_Vent_C::UpwardLaunchVelocity' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, VentsHitBeforeLanding) == 0x000B88, "Member 'UGA_DudeBro_Vent_C::VentsHitBeforeLanding' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, NumVentsToHitForQuest) == 0x000B98, "Member 'UGA_DudeBro_Vent_C::NumVentsToHitForQuest' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, Tag_to_Check) == 0x000B9C, "Member 'UGA_DudeBro_Vent_C::Tag_to_Check' has a wrong offset!");
static_assert(offsetof(UGA_DudeBro_Vent_C, VentBlocked) == 0x000BA0, "Member 'UGA_DudeBro_Vent_C::VentBlocked' has a wrong offset!");

}

