#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Riding_Player_Sprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Riding_Player_Sprint.GA_Riding_Player_Sprint_C
// 0x0020 (0x0B80 - 0x0B60)
class UGA_Riding_Player_Sprint_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   Tags_to_cancel_sprinting;                          // 0x0B68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldCancelSprint;                                // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_BA9D24D64958BB04345A3D89BD7617CA();
	void ExecuteUbergraph_GA_Riding_Player_Sprint(int32 EntryPoint);
	void FailedToActivatePassiveAbility(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnRep_CancelSprintDispatcher();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Riding_Player_Sprint_C">();
	}
	static class UGA_Riding_Player_Sprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Riding_Player_Sprint_C>();
	}
};
static_assert(alignof(UGA_Riding_Player_Sprint_C) == 0x000008, "Wrong alignment on UGA_Riding_Player_Sprint_C");
static_assert(sizeof(UGA_Riding_Player_Sprint_C) == 0x000B80, "Wrong size on UGA_Riding_Player_Sprint_C");
static_assert(offsetof(UGA_Riding_Player_Sprint_C, UberGraphFrame) == 0x000B60, "Member 'UGA_Riding_Player_Sprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Riding_Player_Sprint_C, Tags_to_cancel_sprinting) == 0x000B68, "Member 'UGA_Riding_Player_Sprint_C::Tags_to_cancel_sprinting' has a wrong offset!");
static_assert(offsetof(UGA_Riding_Player_Sprint_C, ShouldCancelSprint) == 0x000B78, "Member 'UGA_Riding_Player_Sprint_C::ShouldCancelSprint' has a wrong offset!");

}

