#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_ApplyFullBodyHit_NonParticipant

#include "Basic.hpp"


namespace SDK::Params
{

// Function GAB_ApplyFullBodyHit_NonParticipant.GAB_ApplyFullBodyHit_NonParticipant_C.PickFullBodyHitMontageSection
// 0x0048 (0x0048 - 0x0000)
struct GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerPawn_NonParticipant_C*        K2Node_DynamicCast_AsBP_Player_Pawn_Non_Participant; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentFullbodyHitReactionMontage_CurrentMontage; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection) == 0x000008, "Wrong alignment on GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection");
static_assert(sizeof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection) == 0x000048, "Wrong size on GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, Temp_int_Variable) == 0x000000, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, Temp_name_Variable) == 0x000004, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, Temp_name_Variable_1) == 0x000008, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, Temp_name_Variable_2) == 0x00000C, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, Temp_name_Variable_3) == 0x000010, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, CallFunc_GetActivatingPawn_ReturnValue) == 0x000018, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000020, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, K2Node_DynamicCast_AsBP_Player_Pawn_Non_Participant) == 0x000028, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::K2Node_DynamicCast_AsBP_Player_Pawn_Non_Participant' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, CallFunc_GetCurrentFullbodyHitReactionMontage_CurrentMontage) == 0x000038, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::CallFunc_GetCurrentFullbodyHitReactionMontage_CurrentMontage' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection, K2Node_Select_Default) == 0x000040, "Member 'GAB_ApplyFullBodyHit_NonParticipant_C_PickFullBodyHitMontageSection::K2Node_Select_Default' has a wrong offset!");

}

