#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AthenaDBNORevive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C
// 0x0038 (0x0B98 - 0x0B60)
class UGAB_AthenaDBNORevive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EC_AppliedEffect;                                  // 0x0B68(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6C[0x4];                                      // 0x0B6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ResurrectCue;                                      // 0x0B78(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ResurrectAthenaCue;                                // 0x0B7C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DBNOMontageOutro;                                  // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DBNOMontageOutroSwimming;                          // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_PlayerDamage_Immune_FX;                         // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_779E7BAA49FEAD286C5164B83CDFD609(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_23712DBC45E68EA0C91A4895CBD8B3A6(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ExecuteUbergraph_GAB_AthenaDBNORevive(int32 EntryPoint);
	void Get_DBNO_Outro_Montage(class UAnimMontage** DBNOMontageOutro_0);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void Removed_620488CD4F8BFC035EC7328664732683();
	void Targeted_779E7BAA49FEAD286C5164B83CDFD609(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_23712DBC45E68EA0C91A4895CBD8B3A6(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_AthenaDBNORevive_C">();
	}
	static class UGAB_AthenaDBNORevive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_AthenaDBNORevive_C>();
	}
};
static_assert(alignof(UGAB_AthenaDBNORevive_C) == 0x000008, "Wrong alignment on UGAB_AthenaDBNORevive_C");
static_assert(sizeof(UGAB_AthenaDBNORevive_C) == 0x000B98, "Wrong size on UGAB_AthenaDBNORevive_C");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, UberGraphFrame) == 0x000B60, "Member 'UGAB_AthenaDBNORevive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, EC_AppliedEffect) == 0x000B68, "Member 'UGAB_AthenaDBNORevive_C::EC_AppliedEffect' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, PlayerPawn) == 0x000B70, "Member 'UGAB_AthenaDBNORevive_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, ResurrectCue) == 0x000B78, "Member 'UGAB_AthenaDBNORevive_C::ResurrectCue' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, ResurrectAthenaCue) == 0x000B7C, "Member 'UGAB_AthenaDBNORevive_C::ResurrectAthenaCue' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, DBNOMontageOutro) == 0x000B80, "Member 'UGAB_AthenaDBNORevive_C::DBNOMontageOutro' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, DBNOMontageOutroSwimming) == 0x000B88, "Member 'UGAB_AthenaDBNORevive_C::DBNOMontageOutroSwimming' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNORevive_C, GE_PlayerDamage_Immune_FX) == 0x000B90, "Member 'UGAB_AthenaDBNORevive_C::GE_PlayerDamage_Immune_FX' has a wrong offset!");

}

