#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericApplyFullBodyHit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C
// 0x0078 (0x0BD8 - 0x0B60)
class UGAB_GenericApplyFullBodyHit_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_FullBodyHitActiveEffect;                        // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitImpulse;                                        // 0x0B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_RestoreControlResistance;                       // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveImpactImmunity;                              // 0x0B90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_ImpactImmunity;                                 // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveFullBodyHit;                                 // 0x0BA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_Triggered_FullBodyHit;                       // 0x0BA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_Control_Ended;                               // 0x0BAC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_TransferFullBodyHit;                            // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FullBodyHitMontage;                                // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   FullBodyHitMontageSection;                         // 0x0BC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndAbilityOnBlendOut;                              // 0x0BC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC5[0x3];                                      // 0x0BC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration_NoAnim;                                   // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugFullBodyHitReact;                             // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_GenericApplyFullBodyHit(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_25E5E66442E815EB40A6DB8205FE0D98();
	void OnCancelled_25E5E66442E815EB40A6DB8205FE0D98();
	void OnCompleted_25E5E66442E815EB40A6DB8205FE0D98();
	void OnHitPawn(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnInterrupted_25E5E66442E815EB40A6DB8205FE0D98();
	void PickFullBodyHitMontageSection();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_GenericApplyFullBodyHit_C">();
	}
	static class UGAB_GenericApplyFullBodyHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_GenericApplyFullBodyHit_C>();
	}
};
static_assert(alignof(UGAB_GenericApplyFullBodyHit_C) == 0x000008, "Wrong alignment on UGAB_GenericApplyFullBodyHit_C");
static_assert(sizeof(UGAB_GenericApplyFullBodyHit_C) == 0x000BD8, "Wrong size on UGAB_GenericApplyFullBodyHit_C");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, UberGraphFrame) == 0x000B60, "Member 'UGAB_GenericApplyFullBodyHit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, GE_FullBodyHitActiveEffect) == 0x000B68, "Member 'UGAB_GenericApplyFullBodyHit_C::GE_FullBodyHitActiveEffect' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, HitImpulse) == 0x000B70, "Member 'UGAB_GenericApplyFullBodyHit_C::HitImpulse' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, GE_RestoreControlResistance) == 0x000B88, "Member 'UGAB_GenericApplyFullBodyHit_C::GE_RestoreControlResistance' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, ActiveImpactImmunity) == 0x000B90, "Member 'UGAB_GenericApplyFullBodyHit_C::ActiveImpactImmunity' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, GE_ImpactImmunity) == 0x000B98, "Member 'UGAB_GenericApplyFullBodyHit_C::GE_ImpactImmunity' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, ActiveFullBodyHit) == 0x000BA0, "Member 'UGAB_GenericApplyFullBodyHit_C::ActiveFullBodyHit' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, Event_Triggered_FullBodyHit) == 0x000BA8, "Member 'UGAB_GenericApplyFullBodyHit_C::Event_Triggered_FullBodyHit' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, Event_Control_Ended) == 0x000BAC, "Member 'UGAB_GenericApplyFullBodyHit_C::Event_Control_Ended' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, GE_TransferFullBodyHit) == 0x000BB0, "Member 'UGAB_GenericApplyFullBodyHit_C::GE_TransferFullBodyHit' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, FullBodyHitMontage) == 0x000BB8, "Member 'UGAB_GenericApplyFullBodyHit_C::FullBodyHitMontage' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, FullBodyHitMontageSection) == 0x000BC0, "Member 'UGAB_GenericApplyFullBodyHit_C::FullBodyHitMontageSection' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, EndAbilityOnBlendOut) == 0x000BC4, "Member 'UGAB_GenericApplyFullBodyHit_C::EndAbilityOnBlendOut' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, Duration_NoAnim) == 0x000BC8, "Member 'UGAB_GenericApplyFullBodyHit_C::Duration_NoAnim' has a wrong offset!");
static_assert(offsetof(UGAB_GenericApplyFullBodyHit_C, DebugFullBodyHitReact) == 0x000BD0, "Member 'UGAB_GenericApplyFullBodyHit_C::DebugFullBodyHitReact' has a wrong offset!");

}

