#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_CarryPlayer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GAB_CarryPlayer.GAB_CarryPlayer_C.ExecuteUbergraph_GAB_CarryPlayer
// 0x0188 (0x0188 - 0x0000)
struct GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortAthenaVehicle* InstigatingVehicle)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0038(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0090(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0150(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_CustomEvent_InstigatingVehicle;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer) == 0x000008, "Wrong alignment on GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer");
static_assert(sizeof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer) == 0x000188, "Wrong size on GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, EntryPoint) == 0x000000, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_Event_bWasCancelled) == 0x000034, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetActorInfo_ReturnValue) == 0x000038, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000080, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000090, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000B8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0000D0, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000F8, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Vector_Distance_ReturnValue) == 0x000110, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Round_ReturnValue) == 0x000118, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Divide_IntInt_ReturnValue) == 0x00011C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsServer_ReturnValue) == 0x000120, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue_2) == 0x000121, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000128, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetQuestManager_ReturnValue) == 0x000130, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsValid_ReturnValue_3) == 0x000138, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_IsServer_ReturnValue_1) == 0x000139, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000140, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000148, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000149, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00014A, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00014B, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_Not_PreBool_ReturnValue) == 0x00014C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_BooleanAND_ReturnValue) == 0x00014D, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CreateDelegate_OutputDelegate_4) == 0x000150, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, CallFunc_K2_CommitAbility_ReturnValue) == 0x00015C, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_CustomEvent_InstigatingVehicle) == 0x000160, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_CustomEvent_InstigatingVehicle' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000168, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x000178, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'GAB_CarryPlayer_C_ExecuteUbergraph_GAB_CarryPlayer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GAB_CarryPlayer.GAB_CarryPlayer_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_CarryPlayer_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_CarryPlayer_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_CarryPlayer_C_K2_OnEndAbility");
static_assert(sizeof(GAB_CarryPlayer_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_CarryPlayer_C_K2_OnEndAbility");
static_assert(offsetof(GAB_CarryPlayer_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_CarryPlayer_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_CarryPlayer.GAB_CarryPlayer_C.OnFortPlayerHitByVehicle_Event
// 0x0008 (0x0008 - 0x0000)
struct GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event final
{
public:
	class AFortAthenaVehicle*                     InstigatingVehicle;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event) == 0x000008, "Wrong alignment on GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event");
static_assert(sizeof(GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event) == 0x000008, "Wrong size on GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event");
static_assert(offsetof(GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event, InstigatingVehicle) == 0x000000, "Member 'GAB_CarryPlayer_C_OnFortPlayerHitByVehicle_Event::InstigatingVehicle' has a wrong offset!");

}

