#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateTreeModule

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function GameplayStateTreeModule.StateTreeComponent.SendStateTreeEvent
// 0x0020 (0x0020 - 0x0000)
struct StateTreeComponent_SendStateTreeEvent final
{
public:
	struct FStateTreeEvent                        Event;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_SendStateTreeEvent) == 0x000008, "Wrong alignment on StateTreeComponent_SendStateTreeEvent");
static_assert(sizeof(StateTreeComponent_SendStateTreeEvent) == 0x000020, "Wrong size on StateTreeComponent_SendStateTreeEvent");
static_assert(offsetof(StateTreeComponent_SendStateTreeEvent, Event) == 0x000000, "Member 'StateTreeComponent_SendStateTreeEvent::Event' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.SetStartLogicAutomatically
// 0x0001 (0x0001 - 0x0000)
struct StateTreeComponent_SetStartLogicAutomatically final
{
public:
	bool                                          bInStartLogicAutomatically;                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_SetStartLogicAutomatically) == 0x000001, "Wrong alignment on StateTreeComponent_SetStartLogicAutomatically");
static_assert(sizeof(StateTreeComponent_SetStartLogicAutomatically) == 0x000001, "Wrong size on StateTreeComponent_SetStartLogicAutomatically");
static_assert(offsetof(StateTreeComponent_SetStartLogicAutomatically, bInStartLogicAutomatically) == 0x000000, "Member 'StateTreeComponent_SetStartLogicAutomatically::bInStartLogicAutomatically' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.GetStateTreeRunStatus
// 0x0001 (0x0001 - 0x0000)
struct StateTreeComponent_GetStateTreeRunStatus final
{
public:
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_GetStateTreeRunStatus) == 0x000001, "Wrong alignment on StateTreeComponent_GetStateTreeRunStatus");
static_assert(sizeof(StateTreeComponent_GetStateTreeRunStatus) == 0x000001, "Wrong size on StateTreeComponent_GetStateTreeRunStatus");
static_assert(offsetof(StateTreeComponent_GetStateTreeRunStatus, ReturnValue) == 0x000000, "Member 'StateTreeComponent_GetStateTreeRunStatus::ReturnValue' has a wrong offset!");

}

