#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFeatureStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameFeatureStatus.GameFeatureStatus_C
// 0x0060 (0x03F8 - 0x0398)
class UGameFeatureStatus_C final : public UAthenaGameFeatureStatus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Downloading_Error;                                 // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Downloading;                                       // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorIcon;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pause;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_ProgressOrError;                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Progress;                                          // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Error;                                             // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Paused;                                            // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GameFeatureStatus(int32 EntryPoint);
	void HandleStatusChanged(EAthenaGameFeatureStatus CurrentStatus);
	void OnStatusChanged(EAthenaGameFeatureStatus NewStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameFeatureStatus_C">();
	}
	static class UGameFeatureStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureStatus_C>();
	}
};
static_assert(alignof(UGameFeatureStatus_C) == 0x000008, "Wrong alignment on UGameFeatureStatus_C");
static_assert(sizeof(UGameFeatureStatus_C) == 0x0003F8, "Wrong size on UGameFeatureStatus_C");
static_assert(offsetof(UGameFeatureStatus_C, UberGraphFrame) == 0x000398, "Member 'UGameFeatureStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Downloading_Error) == 0x0003A0, "Member 'UGameFeatureStatus_C::Downloading_Error' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Downloading) == 0x0003A8, "Member 'UGameFeatureStatus_C::Downloading' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Image_ErrorIcon) == 0x0003B0, "Member 'UGameFeatureStatus_C::Image_ErrorIcon' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Image_Pause) == 0x0003B8, "Member 'UGameFeatureStatus_C::Image_Pause' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Switcher_ProgressOrError) == 0x0003C0, "Member 'UGameFeatureStatus_C::Switcher_ProgressOrError' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Progress) == 0x0003C8, "Member 'UGameFeatureStatus_C::Progress' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Error) == 0x0003D8, "Member 'UGameFeatureStatus_C::Error' has a wrong offset!");
static_assert(offsetof(UGameFeatureStatus_C, Paused) == 0x0003E8, "Member 'UGameFeatureStatus_C::Paused' has a wrong offset!");

}

