#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameHubRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class GameHubRuntime.GameHubBaseMutator
// 0x0010 (0x0348 - 0x0338)
class AGameHubBaseMutator final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_338[0x10];                                     // 0x0338(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubBaseMutator">();
	}
	static class AGameHubBaseMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameHubBaseMutator>();
	}
};
static_assert(alignof(AGameHubBaseMutator) == 0x000008, "Wrong alignment on AGameHubBaseMutator");
static_assert(sizeof(AGameHubBaseMutator) == 0x000348, "Wrong size on AGameHubBaseMutator");

// Class GameHubRuntime.GameHubPlayerSpawningComponent
// 0x0020 (0x00D0 - 0x00B0)
class UGameHubPlayerSpawningComponent final : public UPlayspaceComponent_PlayerSpawning
{
public:
	struct FGameplayTagContainer                  PlayerStartRequirements;                           // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubPlayerSpawningComponent">();
	}
	static class UGameHubPlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameHubPlayerSpawningComponent>();
	}
};
static_assert(alignof(UGameHubPlayerSpawningComponent) == 0x000008, "Wrong alignment on UGameHubPlayerSpawningComponent");
static_assert(sizeof(UGameHubPlayerSpawningComponent) == 0x0000D0, "Wrong size on UGameHubPlayerSpawningComponent");
static_assert(offsetof(UGameHubPlayerSpawningComponent, PlayerStartRequirements) == 0x0000B0, "Member 'UGameHubPlayerSpawningComponent::PlayerStartRequirements' has a wrong offset!");

// Class GameHubRuntime.GameHubPlayspace
// 0x0028 (0x0710 - 0x06E8)
class AGameHubPlayspace final : public AFortPlayspace
{
public:
	bool                                          bSimulatePlayerDamage;                             // 0x06E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PlayerStartRequirements;                           // 0x06F0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubPlayspace">();
	}
	static class AGameHubPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameHubPlayspace>();
	}
};
static_assert(alignof(AGameHubPlayspace) == 0x000008, "Wrong alignment on AGameHubPlayspace");
static_assert(sizeof(AGameHubPlayspace) == 0x000710, "Wrong size on AGameHubPlayspace");
static_assert(offsetof(AGameHubPlayspace, bSimulatePlayerDamage) == 0x0006E8, "Member 'AGameHubPlayspace::bSimulatePlayerDamage' has a wrong offset!");
static_assert(offsetof(AGameHubPlayspace, PlayerStartRequirements) == 0x0006F0, "Member 'AGameHubPlayspace::PlayerStartRequirements' has a wrong offset!");

}

