#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStreamingFN

#include "Basic.hpp"

#include "GameplayStreaming_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayStreamingFN.FortLocalPlayerAccountHelper
// 0x0028 (0x0050 - 0x0028)
class UFortLocalPlayerAccountHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLocalPlayerAccountHelper">();
	}
	static class UFortLocalPlayerAccountHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLocalPlayerAccountHelper>();
	}
};
static_assert(alignof(UFortLocalPlayerAccountHelper) == 0x000008, "Wrong alignment on UFortLocalPlayerAccountHelper");
static_assert(sizeof(UFortLocalPlayerAccountHelper) == 0x000050, "Wrong size on UFortLocalPlayerAccountHelper");

// Class GameplayStreamingFN.FortGFNGameplayStreamingHandler
// 0x0038 (0x00B0 - 0x0078)
class UFortGFNGameplayStreamingHandler final : public UGFNGameplayStreamingHandler
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLocalPlayerAccountHelper*          FortLocalPlayerAccountHelper;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortOnlineAccount>      WeakFortOnlineAccount;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGFNGameplayStreamingHandler">();
	}
	static class UFortGFNGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGFNGameplayStreamingHandler>();
	}
};
static_assert(alignof(UFortGFNGameplayStreamingHandler) == 0x000008, "Wrong alignment on UFortGFNGameplayStreamingHandler");
static_assert(sizeof(UFortGFNGameplayStreamingHandler) == 0x0000B0, "Wrong size on UFortGFNGameplayStreamingHandler");
static_assert(offsetof(UFortGFNGameplayStreamingHandler, FortLocalPlayerAccountHelper) == 0x000080, "Member 'UFortGFNGameplayStreamingHandler::FortLocalPlayerAccountHelper' has a wrong offset!");
static_assert(offsetof(UFortGFNGameplayStreamingHandler, WeakFortOnlineAccount) == 0x000088, "Member 'UFortGFNGameplayStreamingHandler::WeakFortOnlineAccount' has a wrong offset!");

// Class GameplayStreamingFN.FortLunaGameplayStreamingHandler
// 0x0030 (0x00A8 - 0x0078)
class UFortLunaGameplayStreamingHandler final : public ULunaGameplayStreamingHandler
{
public:
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLunaGameplayStreamingHandler">();
	}
	static class UFortLunaGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLunaGameplayStreamingHandler>();
	}
};
static_assert(alignof(UFortLunaGameplayStreamingHandler) == 0x000008, "Wrong alignment on UFortLunaGameplayStreamingHandler");
static_assert(sizeof(UFortLunaGameplayStreamingHandler) == 0x0000A8, "Wrong size on UFortLunaGameplayStreamingHandler");

// Class GameplayStreamingFN.FortSalmonGameplayStreamingHandler
// 0x0018 (0x0090 - 0x0078)
class UFortSalmonGameplayStreamingHandler final : public USalmonGameplayStreamingHandler
{
public:
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSalmonGameplayStreamingHandler">();
	}
	static class UFortSalmonGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSalmonGameplayStreamingHandler>();
	}
};
static_assert(alignof(UFortSalmonGameplayStreamingHandler) == 0x000008, "Wrong alignment on UFortSalmonGameplayStreamingHandler");
static_assert(sizeof(UFortSalmonGameplayStreamingHandler) == 0x000090, "Wrong size on UFortSalmonGameplayStreamingHandler");

// Class GameplayStreamingFN.FortGameplayStreamingHandler
// 0x0000 (0x0028 - 0x0028)
class IFortGameplayStreamingHandler final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayStreamingHandler">();
	}
	static class IFortGameplayStreamingHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortGameplayStreamingHandler>();
	}
};
static_assert(alignof(IFortGameplayStreamingHandler) == 0x000008, "Wrong alignment on IFortGameplayStreamingHandler");
static_assert(sizeof(IFortGameplayStreamingHandler) == 0x000028, "Wrong size on IFortGameplayStreamingHandler");

// Class GameplayStreamingFN.FortGameplayStreamingService
// 0x0008 (0x0038 - 0x0030)
class UFortGameplayStreamingService final : public UGameplayStreamingService
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayStreamingService">();
	}
	static class UFortGameplayStreamingService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayStreamingService>();
	}
};
static_assert(alignof(UFortGameplayStreamingService) == 0x000008, "Wrong alignment on UFortGameplayStreamingService");
static_assert(sizeof(UFortGameplayStreamingService) == 0x000038, "Wrong size on UFortGameplayStreamingService");

}

