#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_BoostJumpPack_Hovering_Infinite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCL_BoostJumpPack_Hovering_Infinite.GCL_BoostJumpPack_Hovering_Infinite_C.ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite
// 0x0100 (0x0100 - 0x0000)
struct GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0008(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite) == 0x000008, "Wrong alignment on GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite");
static_assert(sizeof(GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite) == 0x000100, "Wrong size on GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite, EntryPoint) == 0x000000, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite, K2Node_CustomEvent_Hit) == 0x000008, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_ExecuteUbergraph_GCL_BoostJumpPack_Hovering_Infinite::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function GCL_BoostJumpPack_Hovering_Infinite.GCL_BoostJumpPack_Hovering_Infinite_C.On Pawn Landed
// 0x00E8 (0x00E8 - 0x0000)
struct GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed) == 0x000008, "Wrong alignment on GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed");
static_assert(sizeof(GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed) == 0x0000E8, "Wrong size on GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed, Hit) == 0x000000, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_On_Pawn_Landed::Hit' has a wrong offset!");

// Function GCL_BoostJumpPack_Hovering_Infinite.GCL_BoostJumpPack_Hovering_Infinite_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GCL_BoostJumpPack_Hovering_Infinite_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive) == 0x000008, "Wrong alignment on GCL_BoostJumpPack_Hovering_Infinite_C_OnActive");
static_assert(sizeof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive) == 0x0000F8, "Wrong size on GCL_BoostJumpPack_Hovering_Infinite_C_OnActive");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, MyTarget) == 0x000000, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, Parameters) == 0x000008, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, ReturnValue) == 0x0000D8, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000D9, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x0000E0, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnActive, CallFunc_SpawnFXSystemAttached_ReturnValue) == 0x0000F0, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnActive::CallFunc_SpawnFXSystemAttached_ReturnValue' has a wrong offset!");

// Function GCL_BoostJumpPack_Hovering_Infinite.GCL_BoostJumpPack_Hovering_Infinite_C.OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove) == 0x000008, "Wrong alignment on GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove");
static_assert(sizeof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove) == 0x0000F0, "Wrong size on GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove, MyTarget) == 0x000000, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove, Parameters) == 0x000008, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove, ReturnValue) == 0x0000D8, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x0000E8, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");

// Function GCL_BoostJumpPack_Hovering_Infinite.GCL_BoostJumpPack_Hovering_Infinite_C.SetJetpackAudioEnabled
// 0x0080 (0x0080 - 0x0000)
struct GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_StartTime_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_StartTime_ImplicitCast_1; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled) == 0x000008, "Wrong alignment on GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled");
static_assert(sizeof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled) == 0x000080, "Wrong size on GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, Enabled) == 0x000000, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000018, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x000020, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_K2_GetRootComponent_ReturnValue_3) == 0x000028, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_K2_GetRootComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, Temp_bool_Variable) == 0x00003C, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000040, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, K2Node_Select_Default) == 0x000048, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000058, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000060, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000068, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x000070, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_SpawnSoundAttached_StartTime_ImplicitCast) == 0x000078, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_SpawnSoundAttached_StartTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled, CallFunc_SpawnSoundAttached_StartTime_ImplicitCast_1) == 0x00007C, "Member 'GCL_BoostJumpPack_Hovering_Infinite_C_SetJetpackAudioEnabled::CallFunc_SpawnSoundAttached_StartTime_ImplicitCast_1' has a wrong offset!");

}

