#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_BurtCharging_Player_Latent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_BurtCharging_Player_Latent.GCN_BurtCharging_Player_Latent_C.ExecuteUbergraph_GCN_BurtCharging_Player_Latent
// 0x0038 (0x0038 - 0x0000)
struct GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraLensEffectInterface> CallFunc_AddGenericCameraLensEffect_ReturnValue;   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetPrimaryParticleComponent_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent) == 0x000008, "Wrong alignment on GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent");
static_assert(sizeof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent) == 0x000038, "Wrong size on GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent, EntryPoint) == 0x000000, "Member 'GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent, CallFunc_AddGenericCameraLensEffect_ReturnValue) == 0x000020, "Member 'GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent::CallFunc_AddGenericCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent, CallFunc_GetPrimaryParticleComponent_ReturnValue) == 0x000030, "Member 'GCN_BurtCharging_Player_Latent_C_ExecuteUbergraph_GCN_BurtCharging_Player_Latent::CallFunc_GetPrimaryParticleComponent_ReturnValue' has a wrong offset!");

// Function GCN_BurtCharging_Player_Latent.GCN_BurtCharging_Player_Latent_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_BurtCharging_Player_Latent_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_BurtCharging_Player_Latent_C_OnExecute) == 0x000008, "Wrong alignment on GCN_BurtCharging_Player_Latent_C_OnExecute");
static_assert(sizeof(GCN_BurtCharging_Player_Latent_C_OnExecute) == 0x0000F8, "Wrong size on GCN_BurtCharging_Player_Latent_C_OnExecute");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_BurtCharging_Player_Latent_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_BurtCharging_Player_Latent_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_OnExecute, ReturnValue) == 0x0000D8, "Member 'GCN_BurtCharging_Player_Latent_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_OnExecute, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000E0, "Member 'GCN_BurtCharging_Player_Latent_C_OnExecute::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'GCN_BurtCharging_Player_Latent_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_BurtCharging_Player_Latent_C_OnExecute, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0000F0, "Member 'GCN_BurtCharging_Player_Latent_C_OnExecute::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");

}

