#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_RezOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_RezOut.GCN_RezOut_C
// 0x01F0 (0x0740 - 0x0550)
class AGCN_RezOut_C : public AFortGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TFX_ResOutCharacterMesh_LightIntensity_E9C2D3554642468472CCCFA609A39FBC; // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_ResOutCharacterMesh_ZHeightParam_E9C2D3554642468472CCCFA609A39FBC; // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_ResOutCharacterMesh_TransitionParam_E9C2D3554642468472CCCFA609A39FBC; // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TFX_ResOutCharacterMesh__Direction_E9C2D3554642468472CCCFA609A39FBC; // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TFX_ResOutCharacterMesh;                           // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_GlowCharacterMesh_EmissiveWarp_39A37BC9407CF090A09ABDA5A488F776; // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TFX_GlowCharacterMesh__Direction_39A37BC9407CF090A09ABDA5A488F776; // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TFX_GlowCharacterMesh;                             // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_ANIMATION;                                   // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnDrone;                                        // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Teleportation_Drone;                               // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Teleport_Bot_AnimPlayRate;                         // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Teleport_Bot_Lifespan;                             // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Teleportation_Point_Light;                         // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Teleportation_Light_Offset;                        // 0x05A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Teleportation_Light_Color;                         // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DissolveMIDs;                                      // 0x05D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UMaterialInterface*                     Mat_Chracter_Dissolve;                             // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Pawn;                                              // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TSet<class USkeletalMeshComponent*>           Dissolve;                                          // 0x05F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class FName                                   Socket_Mesh_Top;                                   // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Max_Light_Intensity;                               // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_Mesh_Bottom;                                // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         Meshes_to_Dissolve;                                // 0x0658(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class ABP_TeleportationDrone_C*               Drone;                                             // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          DEBUG_CHILDCOMPONENTS;                             // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             Particle_Components;                               // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class UNiagaraComponent*                      Spawned_Death_VFX;                                 // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         Dissolve_Visual_Effect;                            // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Dissolve_VFX_Spawn_Point_Name;                     // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Base_Elimination_Montage;                          // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DBNO_Elimination_Montage;                          // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Skydiving_Elimination_Montage;                     // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Swimming_Elimination_Montage;                      // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DBNO_Swimming_Elimination_Montage;                 // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawn_VFX_Attached;                                // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Dissolve_Timeline_Playrate;                        // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Glow_Timeline_Playrate;                            // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_REMOVESPAWNVFX;                              // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          DEBUG_REMOVESPAWNEDPOINTLIGHT;                     // 0x06E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_6E2[0x6];                                      // 0x06E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Drone_Visual_Effect;                               // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Drone_VFX_Attach_Point;                            // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_FXSYSTEMCOMPONENTS;                          // 0x06F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDelayBetweenAnimAndVFX;                      // 0x06F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F6[0x2];                                      // 0x06F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBetweenAnimAndVFX;                            // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Material_Override_ID;                              // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPawnMaterialOverrideCopiedParameters Copied_Parameters;                                 // 0x0710(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Clean_Up_Teleportation_Light();
	void Dissolve_Material_Setup();
	void EndVFX();
	void ExecuteUbergraph_GCN_RezOut(int32 EntryPoint);
	void Play_Elmination_AnimMontage();
	void Pre_Sequence_Change();
	void Set_Additional_Niagara_Parameters_on_Drone_FX(class UNiagaraComponent* Drone_FX);
	void Set_Additional_Niagara_Parameters_on_Spawned_FX(class UNiagaraComponent* Spawned_Death_FX);
	void Set_Timeline_Playrates();
	void Spawn_Dissolve_VFX();
	void Spawn_Drone_VFX();
	void Spawn_Teleportation_Drone();
	void Spawn_Teleportation_Light();
	void Stop_Looping_Audio();
	void TFX_GlowCharacterMesh__FinishedFunc();
	void TFX_GlowCharacterMesh__UpdateFunc();
	void TFX_ResOutCharacterMesh__FinishedFunc();
	void TFX_ResOutCharacterMesh__UpdateFunc();
	void TriggerVFX();

	void OnBurstGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_RezOut_C">();
	}
	static class AGCN_RezOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_RezOut_C>();
	}
};
static_assert(alignof(AGCN_RezOut_C) == 0x000008, "Wrong alignment on AGCN_RezOut_C");
static_assert(sizeof(AGCN_RezOut_C) == 0x000740, "Wrong size on AGCN_RezOut_C");
static_assert(offsetof(AGCN_RezOut_C, UberGraphFrame) == 0x000550, "Member 'AGCN_RezOut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_ResOutCharacterMesh_LightIntensity_E9C2D3554642468472CCCFA609A39FBC) == 0x000558, "Member 'AGCN_RezOut_C::TFX_ResOutCharacterMesh_LightIntensity_E9C2D3554642468472CCCFA609A39FBC' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_ResOutCharacterMesh_ZHeightParam_E9C2D3554642468472CCCFA609A39FBC) == 0x00055C, "Member 'AGCN_RezOut_C::TFX_ResOutCharacterMesh_ZHeightParam_E9C2D3554642468472CCCFA609A39FBC' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_ResOutCharacterMesh_TransitionParam_E9C2D3554642468472CCCFA609A39FBC) == 0x000560, "Member 'AGCN_RezOut_C::TFX_ResOutCharacterMesh_TransitionParam_E9C2D3554642468472CCCFA609A39FBC' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_ResOutCharacterMesh__Direction_E9C2D3554642468472CCCFA609A39FBC) == 0x000564, "Member 'AGCN_RezOut_C::TFX_ResOutCharacterMesh__Direction_E9C2D3554642468472CCCFA609A39FBC' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_ResOutCharacterMesh) == 0x000568, "Member 'AGCN_RezOut_C::TFX_ResOutCharacterMesh' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_GlowCharacterMesh_EmissiveWarp_39A37BC9407CF090A09ABDA5A488F776) == 0x000570, "Member 'AGCN_RezOut_C::TFX_GlowCharacterMesh_EmissiveWarp_39A37BC9407CF090A09ABDA5A488F776' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_GlowCharacterMesh__Direction_39A37BC9407CF090A09ABDA5A488F776) == 0x000574, "Member 'AGCN_RezOut_C::TFX_GlowCharacterMesh__Direction_39A37BC9407CF090A09ABDA5A488F776' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, TFX_GlowCharacterMesh) == 0x000578, "Member 'AGCN_RezOut_C::TFX_GlowCharacterMesh' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DEBUG_ANIMATION) == 0x000580, "Member 'AGCN_RezOut_C::DEBUG_ANIMATION' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, SpawnDrone) == 0x000581, "Member 'AGCN_RezOut_C::SpawnDrone' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Teleportation_Drone) == 0x000588, "Member 'AGCN_RezOut_C::Teleportation_Drone' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Teleport_Bot_AnimPlayRate) == 0x000590, "Member 'AGCN_RezOut_C::Teleport_Bot_AnimPlayRate' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Teleport_Bot_Lifespan) == 0x000598, "Member 'AGCN_RezOut_C::Teleport_Bot_Lifespan' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Teleportation_Point_Light) == 0x0005A0, "Member 'AGCN_RezOut_C::Teleportation_Point_Light' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Teleportation_Light_Offset) == 0x0005A8, "Member 'AGCN_RezOut_C::Teleportation_Light_Offset' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Teleportation_Light_Color) == 0x0005C0, "Member 'AGCN_RezOut_C::Teleportation_Light_Color' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DissolveMIDs) == 0x0005D0, "Member 'AGCN_RezOut_C::DissolveMIDs' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Mat_Chracter_Dissolve) == 0x0005E0, "Member 'AGCN_RezOut_C::Mat_Chracter_Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Pawn) == 0x0005E8, "Member 'AGCN_RezOut_C::Pawn' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Dissolve) == 0x0005F0, "Member 'AGCN_RezOut_C::Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Socket_Mesh_Top) == 0x000640, "Member 'AGCN_RezOut_C::Socket_Mesh_Top' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Max_Light_Intensity) == 0x000648, "Member 'AGCN_RezOut_C::Max_Light_Intensity' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Socket_Mesh_Bottom) == 0x000650, "Member 'AGCN_RezOut_C::Socket_Mesh_Bottom' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Meshes_to_Dissolve) == 0x000658, "Member 'AGCN_RezOut_C::Meshes_to_Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Drone) == 0x000668, "Member 'AGCN_RezOut_C::Drone' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DEBUG_CHILDCOMPONENTS) == 0x000670, "Member 'AGCN_RezOut_C::DEBUG_CHILDCOMPONENTS' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Particle_Components) == 0x000678, "Member 'AGCN_RezOut_C::Particle_Components' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Spawned_Death_VFX) == 0x000688, "Member 'AGCN_RezOut_C::Spawned_Death_VFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Dissolve_Visual_Effect) == 0x000690, "Member 'AGCN_RezOut_C::Dissolve_Visual_Effect' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Dissolve_VFX_Spawn_Point_Name) == 0x000698, "Member 'AGCN_RezOut_C::Dissolve_VFX_Spawn_Point_Name' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Base_Elimination_Montage) == 0x0006A0, "Member 'AGCN_RezOut_C::Base_Elimination_Montage' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DBNO_Elimination_Montage) == 0x0006A8, "Member 'AGCN_RezOut_C::DBNO_Elimination_Montage' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Skydiving_Elimination_Montage) == 0x0006B0, "Member 'AGCN_RezOut_C::Skydiving_Elimination_Montage' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Swimming_Elimination_Montage) == 0x0006B8, "Member 'AGCN_RezOut_C::Swimming_Elimination_Montage' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DBNO_Swimming_Elimination_Montage) == 0x0006C0, "Member 'AGCN_RezOut_C::DBNO_Swimming_Elimination_Montage' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Spawn_VFX_Attached) == 0x0006C8, "Member 'AGCN_RezOut_C::Spawn_VFX_Attached' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Dissolve_Timeline_Playrate) == 0x0006D0, "Member 'AGCN_RezOut_C::Dissolve_Timeline_Playrate' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Glow_Timeline_Playrate) == 0x0006D8, "Member 'AGCN_RezOut_C::Glow_Timeline_Playrate' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DEBUG_REMOVESPAWNVFX) == 0x0006E0, "Member 'AGCN_RezOut_C::DEBUG_REMOVESPAWNVFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DEBUG_REMOVESPAWNEDPOINTLIGHT) == 0x0006E1, "Member 'AGCN_RezOut_C::DEBUG_REMOVESPAWNEDPOINTLIGHT' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Drone_Visual_Effect) == 0x0006E8, "Member 'AGCN_RezOut_C::Drone_Visual_Effect' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Drone_VFX_Attach_Point) == 0x0006F0, "Member 'AGCN_RezOut_C::Drone_VFX_Attach_Point' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DEBUG_FXSYSTEMCOMPONENTS) == 0x0006F4, "Member 'AGCN_RezOut_C::DEBUG_FXSYSTEMCOMPONENTS' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, ShouldDelayBetweenAnimAndVFX) == 0x0006F5, "Member 'AGCN_RezOut_C::ShouldDelayBetweenAnimAndVFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, DelayBetweenAnimAndVFX) == 0x0006F8, "Member 'AGCN_RezOut_C::DelayBetweenAnimAndVFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Material_Override_ID) == 0x000700, "Member 'AGCN_RezOut_C::Material_Override_ID' has a wrong offset!");
static_assert(offsetof(AGCN_RezOut_C, Copied_Parameters) == 0x000710, "Member 'AGCN_RezOut_C::Copied_Parameters' has a wrong offset!");

}

