#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_VictoryCrown_CrownWearer_Looping

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping
// 0x0270 (0x0270 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0020(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     K2Node_Event_BurstCameraShakeInstance;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x0130(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0140(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0158(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x0228(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0238(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping) == 0x000270, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, EntryPoint) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_MakeArray_Array) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_MyTarget_1) == 0x000018, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_Parameters_1) == 0x000020, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_ParticleComponents_1) == 0x0000F0, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_AudioComponents_1) == 0x000100, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_BurstCameraShakeInstance) == 0x000110, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_BurstDecalInstance) == 0x000118, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000120, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue) == 0x000124, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAsBool_ReturnValue) == 0x000128, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, Temp_object_Variable) == 0x000130, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_CreateDelegate_OutputDelegate) == 0x000140, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00014C, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_MyTarget) == 0x000150, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_Parameters) == 0x000158, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_ParticleComponents) == 0x000228, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, K2Node_Event_AudioComponents) == 0x000238, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000248, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000250, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping, CallFunc_GetActorTeam_ReturnValue) == 0x000268, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_ExecuteUbergraph_GCNL_Athena_VictoryCrown_CrownWearer_Looping::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.OnLoopingStartGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric) == 0x0000F8, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_VictoryCrown_CrownWearer_Looping.GCNL_Athena_VictoryCrown_CrownWearer_Looping_C.OnRemovalGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric) == 0x000108, "Wrong size on GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric, BurstDecalInstance) == 0x000100, "Member 'GCNL_Athena_VictoryCrown_CrownWearer_Looping_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

}

