#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Player_TacticalSprint_Speedlines

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C.CheckSurfaceType
// 0x0010 (0x0010 - 0x0000)
struct GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SurfaceTypeInt_0;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortFootstepSurfaceType                      CallFunc_GetFootstepSurfaceType_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType) == 0x000008, "Wrong alignment on GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType");
static_assert(sizeof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType) == 0x000010, "Wrong size on GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType, Pawn) == 0x000000, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType::Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType, SurfaceTypeInt_0) == 0x000008, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType::SurfaceTypeInt_0' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType, CallFunc_GetFootstepSurfaceType_ReturnValue) == 0x00000C, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType::CallFunc_GetFootstepSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000D, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000E, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000F, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_CheckSurfaceType::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C.ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines
// 0x02C8 (0x02C8 - 0x0000)
struct GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0038(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_Event_ParticleComponents_1;                 // 0x0108(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0118(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0144(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPercentageSprintEnergy_CurrentEnergyPercentage; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_2;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x017C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalking_ReturnValue;                    // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x01A0(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x0270(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0280(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     K2Node_Event_BurstCameraShakeInstance;             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalking_ReturnValue_1;                  // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_3;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckSurfaceType_SurfaceTypeInt;          // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines) == 0x000008, "Wrong alignment on GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines");
static_assert(sizeof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines) == 0x0002C8, "Wrong size on GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, EntryPoint) == 0x000000, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Length_ReturnValue_1) == 0x000008, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00000D, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Get_Item) == 0x000010, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Length_ReturnValue_2) == 0x000018, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x00001D, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsLocallyViewed_ReturnValue) == 0x000028, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_MyTarget_1) == 0x000030, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_Parameters_1) == 0x000038, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_ParticleComponents_1) == 0x000108, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_AudioComponents_1) == 0x000118, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000128, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_DynamicCast_AsCharacter) == 0x000138, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_CreateDelegate_OutputDelegate) == 0x000144, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000150, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue_2) == 0x000158, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_GetPercentageSprintEnergy_CurrentEnergyPercentage) == 0x000160, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_GetPercentageSprintEnergy_CurrentEnergyPercentage' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Get_Item_2) == 0x000168, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue_3) == 0x000170, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Length_ReturnValue_3) == 0x000174, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x000178, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_CreateDelegate_OutputDelegate_1) == 0x00017C, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_CustomEvent_Character) == 0x000188, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_CustomEvent_PrevMovementMode) == 0x000190, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_CustomEvent_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_CustomEvent_PreviousCustomMode) == 0x000191, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_CustomEvent_PreviousCustomMode' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue_4) == 0x000192, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsWalking_ReturnValue) == 0x000193, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsWalking_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_MyTarget) == 0x000198, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_Parameters) == 0x0001A0, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_ParticleComponents) == 0x000270, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_AudioComponents) == 0x000280, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_BurstCameraShakeInstance) == 0x000290, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_Event_BurstDecalInstance) == 0x000298, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A0, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue_5) == 0x0002AC, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsWalking_ReturnValue_1) == 0x0002AD, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsWalking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_Array_Get_Item_3) == 0x0002B0, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_IsValid_ReturnValue_6) == 0x0002B8, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_CheckSurfaceType_SurfaceTypeInt) == 0x0002BC, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_CheckSurfaceType_SurfaceTypeInt' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002C0, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x0002C4, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C.GetPercentageSprintEnergy
// 0x0030 (0x0030 - 0x0000)
struct GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy final
{
public:
	class AActor*                                 Energy_Owning_Actor;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentEnergyPercentage;                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTacticalSprintEnergyComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentEnergyPercentage_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_CurrentEnergyPercentage_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy) == 0x000008, "Wrong alignment on GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy");
static_assert(sizeof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy) == 0x000030, "Wrong size on GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, Energy_Owning_Actor) == 0x000000, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::Energy_Owning_Actor' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, CurrentEnergyPercentage) == 0x000008, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::CurrentEnergyPercentage' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, CallFunc_GetCurrentEnergyPercentage_ReturnValue) == 0x000024, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::CallFunc_GetCurrentEnergyPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy, K2Node_FunctionResult_CurrentEnergyPercentage_ImplicitCast) == 0x000028, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_GetPercentageSprintEnergy::K2Node_FunctionResult_CurrentEnergyPercentage_ImplicitCast' has a wrong offset!");

// Function GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C.MovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged) == 0x000008, "Wrong alignment on GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged");
static_assert(sizeof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged) == 0x000010, "Wrong size on GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged, Character) == 0x000000, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged::Character' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged, PrevMovementMode) == 0x000008, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged, PreviousCustomMode) == 0x000009, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_MovementModeChanged::PreviousCustomMode' has a wrong offset!");

// Function GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C.OnLoopingStartNiagara
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara) == 0x000008, "Wrong alignment on GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara");
static_assert(sizeof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara) == 0x0000F8, "Wrong size on GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara, MyTarget) == 0x000000, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara, Parameters) == 0x000008, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnLoopingStartNiagara::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C.OnRemovalGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric) == 0x000108, "Wrong size on GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_Athena_Player_TacticalSprint_Speedlines_C_OnRemovalGeneric::Parameters' has a wrong offset!");
