#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Player_TacticalSprint_Speedlines

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_Player_TacticalSprint_Speedlines.GCNL_Athena_Player_TacticalSprint_Speedlines_C
// 0x0048 (0x09F8 - 0x09B0)
class AGCNL_Athena_Player_TacticalSprint_Speedlines_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        TimeBetweenLoopUpdates;                            // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              Particle_Components;                               // 0x09C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ACharacter*                             TargetCharacter;                                   // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocallyViewed;                                   // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D9[0x7];                                      // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        As_Fort_Player_Pawn;                               // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SurfaceTypeInt;                                    // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9EC[0x4];                                      // 0x09EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LoopUpdateTimer;                                   // 0x09F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSurfaceType(class AFortPawn* Pawn, int32* SurfaceTypeInt_0);
	void ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_Speedlines(int32 EntryPoint);
	void GetPercentageSprintEnergy(class AActor* Energy_Owning_Actor, double* CurrentEnergyPercentage);
	void LoopUpdate();
	void MovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnLoopingStartNiagara(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UNiagaraComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void UpdateSurfaceType();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_Player_TacticalSprint_Speedlines_C">();
	}
	static class AGCNL_Athena_Player_TacticalSprint_Speedlines_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_Player_TacticalSprint_Speedlines_C>();
	}
};
static_assert(alignof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C) == 0x000008, "Wrong alignment on AGCNL_Athena_Player_TacticalSprint_Speedlines_C");
static_assert(sizeof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C) == 0x0009F8, "Wrong size on AGCNL_Athena_Player_TacticalSprint_Speedlines_C");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, UberGraphFrame) == 0x0009B0, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, TimeBetweenLoopUpdates) == 0x0009B8, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::TimeBetweenLoopUpdates' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, Particle_Components) == 0x0009C0, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::Particle_Components' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, TargetCharacter) == 0x0009D0, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::TargetCharacter' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, IsLocallyViewed) == 0x0009D8, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::IsLocallyViewed' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, As_Fort_Player_Pawn) == 0x0009E0, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::As_Fort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, SurfaceTypeInt) == 0x0009E8, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::SurfaceTypeInt' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_Speedlines_C, LoopUpdateTimer) == 0x0009F0, "Member 'AGCNL_Athena_Player_TacticalSprint_Speedlines_C::LoopUpdateTimer' has a wrong offset!");

}

