#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Tether

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_Tether.GCNL_Athena_Tether_C
// 0x0088 (0x0A38 - 0x09B0)
class AGCNL_Athena_Tether_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLayeredAudioComponent*             FortLayeredAudio;                                  // 0x09B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LandFX;                                            // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      WaterFX;                                           // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RightSki;                                          // 0x09D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LeftSki;                                           // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4; // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4; // 0x09E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E5[0x3];                                      // 0x09E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleInSkis;                                       // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        OwningFPP;                                         // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInWater;                                         // 0x09F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F9[0x7];                                      // 0x09F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NormalizedSpeed;                                   // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnSpeed;                                         // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceFeedbackIntensity;                            // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ScaleInSkisTimerHandle;                            // 0x0A18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        SkiScaleInDelay;                                   // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICameraLensEffectInterface> CameraLensEffectInterface;                         // 0x0A28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature(class UAudioComponent* AudioComponent, class FName ParameterName, int32 OneshotIndex);
	void ExecuteUbergraph_GCNL_Athena_Tether(int32 EntryPoint);
	void InitializeTetherGCNL(class UObject* Object);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ScaleInSkis__FinishedFunc();
	void ScaleInSkis__UpdateFunc();
	void ScaleInSkisForPlayer();
	void StartFF();
	void StopFF();
	void UpdateAudio(int32 Surface);
	void UpdateFF();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_Tether_C">();
	}
	static class AGCNL_Athena_Tether_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_Tether_C>();
	}
};
static_assert(alignof(AGCNL_Athena_Tether_C) == 0x000008, "Wrong alignment on AGCNL_Athena_Tether_C");
static_assert(sizeof(AGCNL_Athena_Tether_C) == 0x000A38, "Wrong size on AGCNL_Athena_Tether_C");
static_assert(offsetof(AGCNL_Athena_Tether_C, UberGraphFrame) == 0x0009B0, "Member 'AGCNL_Athena_Tether_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, FortLayeredAudio) == 0x0009B8, "Member 'AGCNL_Athena_Tether_C::FortLayeredAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, LandFX) == 0x0009C0, "Member 'AGCNL_Athena_Tether_C::LandFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, WaterFX) == 0x0009C8, "Member 'AGCNL_Athena_Tether_C::WaterFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, RightSki) == 0x0009D0, "Member 'AGCNL_Athena_Tether_C::RightSki' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, LeftSki) == 0x0009D8, "Member 'AGCNL_Athena_Tether_C::LeftSki' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4) == 0x0009E0, "Member 'AGCNL_Athena_Tether_C::ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4) == 0x0009E4, "Member 'AGCNL_Athena_Tether_C::ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkis) == 0x0009E8, "Member 'AGCNL_Athena_Tether_C::ScaleInSkis' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, OwningFPP) == 0x0009F0, "Member 'AGCNL_Athena_Tether_C::OwningFPP' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, IsInWater) == 0x0009F8, "Member 'AGCNL_Athena_Tether_C::IsInWater' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, NormalizedSpeed) == 0x000A00, "Member 'AGCNL_Athena_Tether_C::NormalizedSpeed' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, TurnSpeed) == 0x000A08, "Member 'AGCNL_Athena_Tether_C::TurnSpeed' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ForceFeedbackIntensity) == 0x000A10, "Member 'AGCNL_Athena_Tether_C::ForceFeedbackIntensity' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, ScaleInSkisTimerHandle) == 0x000A18, "Member 'AGCNL_Athena_Tether_C::ScaleInSkisTimerHandle' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, SkiScaleInDelay) == 0x000A20, "Member 'AGCNL_Athena_Tether_C::SkiScaleInDelay' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Tether_C, CameraLensEffectInterface) == 0x000A28, "Member 'AGCNL_Athena_Tether_C::CameraLensEffectInterface' has a wrong offset!");

}

