#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_PlayerIsRiding

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNL_PlayerIsRiding.GCNL_PlayerIsRiding_C.CalculateVelocityParam
// 0x0040 (0x0040 - 0x0000)
struct GCNL_PlayerIsRiding_C_CalculateVelocityParam final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_PlayerIsRiding_C_CalculateVelocityParam) == 0x000008, "Wrong alignment on GCNL_PlayerIsRiding_C_CalculateVelocityParam");
static_assert(sizeof(GCNL_PlayerIsRiding_C_CalculateVelocityParam) == 0x000040, "Wrong size on GCNL_PlayerIsRiding_C_CalculateVelocityParam");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_VSize_ReturnValue) == 0x000008, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_SetFloatParameter_self_CastInput) == 0x000010, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_FInterpTo_ReturnValue) == 0x000028, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_MapRangeClamped_ReturnValue) == 0x000030, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_CalculateVelocityParam, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x000038, "Member 'GCNL_PlayerIsRiding_C_CalculateVelocityParam::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");

// Function GCNL_PlayerIsRiding.GCNL_PlayerIsRiding_C.ExecuteUbergraph_GCNL_PlayerIsRiding
// 0x02C8 (0x02C8 - 0x0000)
struct GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0040(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x0110(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0120(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0138(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x0208(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0218(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     K2Node_Event_BurstCameraShakeInstance;             // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          Temp_byte_Variable;                                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue; // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding) == 0x000008, "Wrong alignment on GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding");
static_assert(sizeof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding) == 0x0002C8, "Wrong size on GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, EntryPoint) == 0x000000, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, Temp_bool_Variable) == 0x000004, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000008, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_2) == 0x00001A, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000028, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_MyTarget_1) == 0x000038, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_Parameters_1) == 0x000040, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_ParticleComponents_1) == 0x000110, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_AudioComponents_1) == 0x000120, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_MyTarget) == 0x000130, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_Parameters) == 0x000138, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_ParticleComponents) == 0x000208, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_AudioComponents) == 0x000218, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_BurstCameraShakeInstance) == 0x000228, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Event_BurstDecalInstance) == 0x000230, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, Temp_byte_Variable) == 0x000238, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, Temp_bool_Variable_1) == 0x000239, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_Not_PreBool_ReturnValue_1) == 0x00023A, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_K2_SetTimer_ReturnValue) == 0x000240, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000248, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_3) == 0x000250, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_4) == 0x000251, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue) == 0x000252, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_5) == 0x000253, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x000258, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000260, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_Select_Default) == 0x000278, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_6) == 0x000280, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_7) == 0x000281, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000288, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000290, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000298, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_8) == 0x000299, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_9) == 0x00029A, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x00029B, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_GetAttachParentActor_ReturnValue) == 0x0002A0, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_IsValid_ReturnValue_10) == 0x0002A8, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_DynamicCast_AsFort_AIPawn) == 0x0002B0, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding, CallFunc_GetMovementComponent_ReturnValue) == 0x0002C0, "Member 'GCNL_PlayerIsRiding_C_ExecuteUbergraph_GCNL_PlayerIsRiding::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");

// Function GCNL_PlayerIsRiding.GCNL_PlayerIsRiding_C.OnLoopingStartGeneric
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_PlayerIsRiding_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_PlayerIsRiding_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_PlayerIsRiding_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_PlayerIsRiding_C_OnLoopingStartGeneric) == 0x0000F8, "Wrong size on GCNL_PlayerIsRiding_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_PlayerIsRiding_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_PlayerIsRiding_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_PlayerIsRiding_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnLoopingStartGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_PlayerIsRiding_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_PlayerIsRiding.GCNL_PlayerIsRiding_C.OnRemovalGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_PlayerIsRiding_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_PlayerIsRiding_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_PlayerIsRiding_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_PlayerIsRiding_C_OnRemovalGeneric) == 0x000108, "Wrong size on GCNL_PlayerIsRiding_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_PlayerIsRiding_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_PlayerIsRiding_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnRemovalGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_PlayerIsRiding_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnRemovalGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_PlayerIsRiding_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_PlayerIsRiding_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_OnRemovalGeneric, BurstDecalInstance) == 0x000100, "Member 'GCNL_PlayerIsRiding_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_PlayerIsRiding.GCNL_PlayerIsRiding_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCNL_PlayerIsRiding_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_PlayerIsRiding_C_ReceiveTick) == 0x000004, "Wrong alignment on GCNL_PlayerIsRiding_C_ReceiveTick");
static_assert(sizeof(GCNL_PlayerIsRiding_C_ReceiveTick) == 0x000004, "Wrong size on GCNL_PlayerIsRiding_C_ReceiveTick");
static_assert(offsetof(GCNL_PlayerIsRiding_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCNL_PlayerIsRiding_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCNL_PlayerIsRiding.GCNL_PlayerIsRiding_C.WhileActive
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_PlayerIsRiding_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_PlayerIsRiding_C_WhileActive) == 0x000008, "Wrong alignment on GCNL_PlayerIsRiding_C_WhileActive");
static_assert(sizeof(GCNL_PlayerIsRiding_C_WhileActive) == 0x0000E0, "Wrong size on GCNL_PlayerIsRiding_C_WhileActive");
static_assert(offsetof(GCNL_PlayerIsRiding_C_WhileActive, MyTarget) == 0x000000, "Member 'GCNL_PlayerIsRiding_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_WhileActive, Parameters) == 0x000008, "Member 'GCNL_PlayerIsRiding_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_PlayerIsRiding_C_WhileActive, ReturnValue) == 0x0000D8, "Member 'GCNL_PlayerIsRiding_C_WhileActive::ReturnValue' has a wrong offset!");

}

