#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Player_TacticalSprint_CameraShake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_Player_TacticalSprint_CameraShake.GCNL_Athena_Player_TacticalSprint_CameraShake_C
// 0x0028 (0x09D8 - 0x09B0)
class AGCNL_Athena_Player_TacticalSprint_CameraShake_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraShakeBase*                       ShakeNoise;                                        // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       TacSprintIntroShake;                               // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       FOVFlare;                                          // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  FortPlayerController;                              // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_Player_TacticalSprint_CameraShake(int32 EntryPoint);
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_Player_TacticalSprint_CameraShake_C">();
	}
	static class AGCNL_Athena_Player_TacticalSprint_CameraShake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_Player_TacticalSprint_CameraShake_C>();
	}
};
static_assert(alignof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C) == 0x000008, "Wrong alignment on AGCNL_Athena_Player_TacticalSprint_CameraShake_C");
static_assert(sizeof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C) == 0x0009D8, "Wrong size on AGCNL_Athena_Player_TacticalSprint_CameraShake_C");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C, UberGraphFrame) == 0x0009B0, "Member 'AGCNL_Athena_Player_TacticalSprint_CameraShake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C, ShakeNoise) == 0x0009B8, "Member 'AGCNL_Athena_Player_TacticalSprint_CameraShake_C::ShakeNoise' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C, TacSprintIntroShake) == 0x0009C0, "Member 'AGCNL_Athena_Player_TacticalSprint_CameraShake_C::TacSprintIntroShake' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C, FOVFlare) == 0x0009C8, "Member 'AGCNL_Athena_Player_TacticalSprint_CameraShake_C::FOVFlare' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_Player_TacticalSprint_CameraShake_C, FortPlayerController) == 0x0009D0, "Member 'AGCNL_Athena_Player_TacticalSprint_CameraShake_C::FortPlayerController' has a wrong offset!");

}

