#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_RidingSprint_SpeedLines

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_RidingSprint_SpeedLines.GCNL_RidingSprint_SpeedLines_C.ExecuteUbergraph_GCNL_RidingSprint_SpeedLines
// 0x0240 (0x0240 - 0x0000)
struct GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     K2Node_Event_BurstCameraShakeInstance_1;           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0140(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x0210(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0220(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     K2Node_Event_BurstCameraShakeInstance;             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines) == 0x000008, "Wrong alignment on GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines");
static_assert(sizeof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines) == 0x000240, "Wrong size on GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, EntryPoint) == 0x000000, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_MyTarget_1) == 0x000008, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_ParticleComponents_1) == 0x0000E0, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_AudioComponents_1) == 0x0000F0, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_BurstCameraShakeInstance_1) == 0x000100, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_BurstDecalInstance_1) == 0x000108, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_DynamicCast_AsFort_Pawn) == 0x000110, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000120, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, CallFunc_IsLocallyControlled_ReturnValue) == 0x000128, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, CallFunc_IsValid_ReturnValue) == 0x000129, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000130, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_MyTarget) == 0x000138, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_Parameters) == 0x000140, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_ParticleComponents) == 0x000210, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_AudioComponents) == 0x000220, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_BurstCameraShakeInstance) == 0x000230, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines, K2Node_Event_BurstDecalInstance) == 0x000238, "Member 'GCNL_RidingSprint_SpeedLines_C_ExecuteUbergraph_GCNL_RidingSprint_SpeedLines::K2Node_Event_BurstDecalInstance' has a wrong offset!");

// Function GCNL_RidingSprint_SpeedLines.GCNL_RidingSprint_SpeedLines_C.OnApplicationGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric) == 0x000008, "Wrong alignment on GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric");
static_assert(sizeof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric) == 0x000108, "Wrong size on GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric, MyTarget) == 0x000000, "Member 'GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric, Parameters) == 0x000008, "Member 'GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric, BurstDecalInstance) == 0x000100, "Member 'GCNL_RidingSprint_SpeedLines_C_OnApplicationGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_RidingSprint_SpeedLines.GCNL_RidingSprint_SpeedLines_C.OnRemovalGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class ULegacyCameraShake*                     BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric) == 0x000108, "Wrong size on GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric, ParticleComponents) == 0x0000D8, "Member 'GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric, AudioComponents) == 0x0000E8, "Member 'GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric, BurstDecalInstance) == 0x000100, "Member 'GCNL_RidingSprint_SpeedLines_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

}

