#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericModalButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GenericModalButton.GenericModalButton_C
// 0x00A0 (0x1580 - 0x14E0)
class UGenericModalButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover2;                                            // 0x14E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x14F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Right_Image;                               // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_Text;                                         // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x1528(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x1540(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_1554[0x4];                                     // 0x1554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material_Brush;                                    // 0x1558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x1560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x1568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x1569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SimpleHover;                                       // 0x156A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOverride;                                  // 0x156B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x156C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShearText;                                         // 0x1570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_GenericModalButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBorderShowEffectWhenDisable(bool ShowEffectWhenDisabled);
	void SetButtonText(const class FText& ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GenericModalButton_C">();
	}
	static class UGenericModalButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericModalButton_C>();
	}
};
static_assert(alignof(UGenericModalButton_C) == 0x000010, "Wrong alignment on UGenericModalButton_C");
static_assert(sizeof(UGenericModalButton_C) == 0x001580, "Wrong size on UGenericModalButton_C");
static_assert(offsetof(UGenericModalButton_C, UberGraphFrame) == 0x0014E0, "Member 'UGenericModalButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Hover2) == 0x0014E8, "Member 'UGenericModalButton_C::Hover2' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Hover) == 0x0014F0, "Member 'UGenericModalButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Border_Material) == 0x0014F8, "Member 'UGenericModalButton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Image) == 0x001500, "Member 'UGenericModalButton_C::Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Image_45) == 0x001508, "Member 'UGenericModalButton_C::Image_45' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Overlay_Right_Image) == 0x001510, "Member 'UGenericModalButton_C::Overlay_Right_Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Rich_Text) == 0x001518, "Member 'UGenericModalButton_C::Rich_Text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, SizeBox_Height) == 0x001520, "Member 'UGenericModalButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Button_text) == 0x001528, "Member 'UGenericModalButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Text_Color) == 0x001540, "Member 'UGenericModalButton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Material_Brush) == 0x001558, "Member 'UGenericModalButton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Right_Image) == 0x001560, "Member 'UGenericModalButton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Justifiction) == 0x001568, "Member 'UGenericModalButton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Auto_wrap_text) == 0x001569, "Member 'UGenericModalButton_C::Auto_wrap_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, SimpleHover) == 0x00156A, "Member 'UGenericModalButton_C::SimpleHover' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, FontSizeOverride) == 0x00156B, "Member 'UGenericModalButton_C::FontSizeOverride' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, FontSize) == 0x00156C, "Member 'UGenericModalButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, ShearText) == 0x001570, "Member 'UGenericModalButton_C::ShearText' has a wrong offset!");

}

