#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "GiftingUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SocialUMG_classes.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// Class GiftingUI.AthenaGiftConfirmedPanel
// 0x0030 (0x0430 - 0x0400)
class UAthenaGiftConfirmedPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x18];                                     // 0x0400(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftConfirmedPanel">();
	}
	static class UAthenaGiftConfirmedPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftConfirmedPanel>();
	}
};
static_assert(alignof(UAthenaGiftConfirmedPanel) == 0x000008, "Wrong alignment on UAthenaGiftConfirmedPanel");
static_assert(sizeof(UAthenaGiftConfirmedPanel) == 0x000430, "Wrong size on UAthenaGiftConfirmedPanel");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Text_RecipientInfo) == 0x000418, "Member 'UAthenaGiftConfirmedPanel::Text_RecipientInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Button_Back) == 0x000420, "Member 'UAthenaGiftConfirmedPanel::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftConfirmedPanel, Button_CloseTouch) == 0x000428, "Member 'UAthenaGiftConfirmedPanel::Button_CloseTouch' has a wrong offset!");

// Class GiftingUI.AthenaGiftingConfirmationScreen
// 0x0158 (0x0558 - 0x0400)
class UAthenaGiftingConfirmationScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x30];                                     // 0x0400(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               PresentedGiftableOfferInfo;                        // 0x0430(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               PresentedOptionalTokenOfferInfo;                   // 0x0438(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0xBC];                                     // 0x0440(0x00BC)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinGiftSubmissionDelay;                            // 0x04FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxGiftSubmissionDelay;                            // 0x0500(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_504[0x14];                                     // 0x0504(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_WrapOptions;                                // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MtxWallet;                                  // 0x0530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPurchasePanel*            Panel_GiftingPurchase;                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingWrapOptionsPanel*         Panel_WrapOptions;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftConfirmedPanel*              Panel_GiftConfirmed;                               // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingErrorsPanel*              Panel_GiftingErrors;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Dismiss(const bool bGiftConfirmed);
	void HandleGiftSent(bool bSuccess, const TArray<class FString>& IneligibleAccounts, const TArray<class FString>& ErrorCodes);
	void HandleTokenOfferPurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void OnPresentationModeChanged(EGiftingPresentationMode NewMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingConfirmationScreen">();
	}
	static class UAthenaGiftingConfirmationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingConfirmationScreen>();
	}
};
static_assert(alignof(UAthenaGiftingConfirmationScreen) == 0x000008, "Wrong alignment on UAthenaGiftingConfirmationScreen");
static_assert(sizeof(UAthenaGiftingConfirmationScreen) == 0x000558, "Wrong size on UAthenaGiftingConfirmationScreen");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, PresentedGiftableOfferInfo) == 0x000430, "Member 'UAthenaGiftingConfirmationScreen::PresentedGiftableOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, PresentedOptionalTokenOfferInfo) == 0x000438, "Member 'UAthenaGiftingConfirmationScreen::PresentedOptionalTokenOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, MinGiftSubmissionDelay) == 0x0004FC, "Member 'UAthenaGiftingConfirmationScreen::MinGiftSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, MaxGiftSubmissionDelay) == 0x000500, "Member 'UAthenaGiftingConfirmationScreen::MaxGiftSubmissionDelay' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_WrapOptions) == 0x000518, "Member 'UAthenaGiftingConfirmationScreen::Button_WrapOptions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_Back) == 0x000520, "Member 'UAthenaGiftingConfirmationScreen::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_CloseTouch) == 0x000528, "Member 'UAthenaGiftingConfirmationScreen::Button_CloseTouch' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Button_MtxWallet) == 0x000530, "Member 'UAthenaGiftingConfirmationScreen::Button_MtxWallet' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftingPurchase) == 0x000538, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftingPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_WrapOptions) == 0x000540, "Member 'UAthenaGiftingConfirmationScreen::Panel_WrapOptions' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftConfirmed) == 0x000548, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftConfirmed' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingConfirmationScreen, Panel_GiftingErrors) == 0x000550, "Member 'UAthenaGiftingConfirmationScreen::Panel_GiftingErrors' has a wrong offset!");

// Class GiftingUI.AthenaGiftingErrorsPanel
// 0x0060 (0x0460 - 0x0400)
class UAthenaGiftingErrorsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x30];                                     // 0x0400(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Title;                                        // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Continue;                                   // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void UpdateGiftEligibility(bool bStillGiftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingErrorsPanel">();
	}
	static class UAthenaGiftingErrorsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingErrorsPanel>();
	}
};
static_assert(alignof(UAthenaGiftingErrorsPanel) == 0x000008, "Wrong alignment on UAthenaGiftingErrorsPanel");
static_assert(sizeof(UAthenaGiftingErrorsPanel) == 0x000460, "Wrong size on UAthenaGiftingErrorsPanel");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Text_RecipientInfo) == 0x000430, "Member 'UAthenaGiftingErrorsPanel::Text_RecipientInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Text_Title) == 0x000438, "Member 'UAthenaGiftingErrorsPanel::Text_Title' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_CloseTouch) == 0x000440, "Member 'UAthenaGiftingErrorsPanel::Button_CloseTouch' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_Back) == 0x000448, "Member 'UAthenaGiftingErrorsPanel::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, Button_Continue) == 0x000450, "Member 'UAthenaGiftingErrorsPanel::Button_Continue' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingErrorsPanel, TileView_Items) == 0x000458, "Member 'UAthenaGiftingErrorsPanel::TileView_Items' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPriceWidget
// 0x0020 (0x0308 - 0x02E8)
class UAthenaGiftingPriceWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_RealMoneyPrice;                               // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalPrice;                                   // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RegularPrice;                                 // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_SalePrice;                                 // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPresentationMode(EGiftingPricePresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPriceWidget">();
	}
	static class UAthenaGiftingPriceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPriceWidget>();
	}
};
static_assert(alignof(UAthenaGiftingPriceWidget) == 0x000008, "Wrong alignment on UAthenaGiftingPriceWidget");
static_assert(sizeof(UAthenaGiftingPriceWidget) == 0x000308, "Wrong size on UAthenaGiftingPriceWidget");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_RealMoneyPrice) == 0x0002E8, "Member 'UAthenaGiftingPriceWidget::Text_RealMoneyPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_FinalPrice) == 0x0002F0, "Member 'UAthenaGiftingPriceWidget::Text_FinalPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Text_RegularPrice) == 0x0002F8, "Member 'UAthenaGiftingPriceWidget::Text_RegularPrice' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPriceWidget, Overlay_SalePrice) == 0x000300, "Member 'UAthenaGiftingPriceWidget::Overlay_SalePrice' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPurchaseButton
// 0x0010 (0x1540 - 0x1530)
class UAthenaGiftingPurchaseButton final : public UFortHoldableButton
{
public:
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x1528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x1530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1538[0x8];                                     // 0x1538(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchaseButton">();
	}
	static class UAthenaGiftingPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchaseButton>();
	}
};
static_assert(alignof(UAthenaGiftingPurchaseButton) == 0x000010, "Wrong alignment on UAthenaGiftingPurchaseButton");
static_assert(sizeof(UAthenaGiftingPurchaseButton) == 0x001540, "Wrong size on UAthenaGiftingPurchaseButton");
static_assert(offsetof(UAthenaGiftingPurchaseButton, Widget_Price) == 0x001528, "Member 'UAthenaGiftingPurchaseButton::Widget_Price' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchaseButton, Text_Title) == 0x001530, "Member 'UAthenaGiftingPurchaseButton::Text_Title' has a wrong offset!");

// Class GiftingUI.AthenaGiftingPurchasePanel
// 0x0048 (0x0448 - 0x0400)
class UAthenaGiftingPurchasePanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x18];                                     // 0x0400(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGiftingPurchaseButton*           Button_PurchaseGift;                               // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SocialNameInfo;                               // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemsCount;                                   // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PlayIntroAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchasePanel">();
	}
	static class UAthenaGiftingPurchasePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchasePanel>();
	}
};
static_assert(alignof(UAthenaGiftingPurchasePanel) == 0x000008, "Wrong alignment on UAthenaGiftingPurchasePanel");
static_assert(sizeof(UAthenaGiftingPurchasePanel) == 0x000448, "Wrong size on UAthenaGiftingPurchasePanel");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Button_PurchaseGift) == 0x000418, "Member 'UAthenaGiftingPurchasePanel::Button_PurchaseGift' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Avatar_MemberIcon) == 0x000420, "Member 'UAthenaGiftingPurchasePanel::Avatar_MemberIcon' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_SocialNameInfo) == 0x000428, "Member 'UAthenaGiftingPurchasePanel::Text_SocialNameInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_ItemsCount) == 0x000430, "Member 'UAthenaGiftingPurchasePanel::Text_ItemsCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, Text_OfferName) == 0x000438, "Member 'UAthenaGiftingPurchasePanel::Text_OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingPurchasePanel, TileView_Items) == 0x000440, "Member 'UAthenaGiftingPurchasePanel::TileView_Items' has a wrong offset!");

// Class GiftingUI.AthenaGiftingScreen
// 0x0200 (0x0930 - 0x0730)
class UAthenaGiftingScreen final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_730[0x8];                                      // 0x0730(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftingUserSearchWidget*           SearchWidget_SocialSearchWidget;                   // 0x0738(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGiftingSocialUserListView*         ListView_Recipients;                               // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0750(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0758(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftingPolicy;                              // 0x0760(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CameraControl;                              // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VBucksOffCount;                               // 0x0778(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ShownItemIndex;                               // 0x0780(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_NoContent;                                    // 0x0788(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OfferItemOwnedCount;                      // 0x0790(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Container_VBucksOffViolator;                       // 0x0798(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_GiftCount;                                // 0x07A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x07A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                  Widget_ItemInfo;                                   // 0x07B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_FilterTabs;                               // 0x07B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsPrevious;                   // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsNext;                       // 0x07C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingConfirmationScreen*       ActivatableWidget_GiftingConfirmation;             // 0x07D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ItemCyclingInterval;                               // 0x07D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7DC[0x4];                                      // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FilterTabsPreviousAction;                          // 0x07E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    FilterTabsNextAction;                              // 0x07F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class FText                                   RegularGiftingPolicy;                              // 0x0800(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   BattlePassGiftingPolicy;                           // 0x0818(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_830[0x60];                                     // 0x0830(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCommonButtonBase*, EFilterType>   FilterMap;                                         // 0x0890(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 FilterGroup;                                       // 0x08E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaGiftingScreenGiftableItemsData  GiftableItems;                                     // 0x08E8(0x0030)(Transient, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    PresentedItemDefinition;                           // 0x0918(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               GiftableOfferInfo;                                 // 0x0920(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               OptionalTokenOfferInfo;                            // 0x0928(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BlockScreenContent(const bool bBlockScreen, const class FText& ContentBlockedText);
	void OnFilterChanged(EFilterType FilterType);
	void OnFriendSelectionChanged();
	void OnHandlePreviewItem(bool bUseWidePreview);
	void OnPartyListUpdated(bool bEmpty);
	void OnPresentationModeChanged(EGiftingScreenPresentationMode Mode);
	void OnSetupFilterTabButton(class UCommonButtonBase* Button, EFilterType FilterType);
	void OnShownItemChanged();
	void OnShowSearchWarningText(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingScreen">();
	}
	static class UAthenaGiftingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingScreen>();
	}
};
static_assert(alignof(UAthenaGiftingScreen) == 0x000008, "Wrong alignment on UAthenaGiftingScreen");
static_assert(sizeof(UAthenaGiftingScreen) == 0x000930, "Wrong size on UAthenaGiftingScreen");
static_assert(offsetof(UAthenaGiftingScreen, SearchWidget_SocialSearchWidget) == 0x000738, "Member 'UAthenaGiftingScreen::SearchWidget_SocialSearchWidget' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ListView_Recipients) == 0x000740, "Member 'UAthenaGiftingScreen::ListView_Recipients' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, TileView_Items) == 0x000748, "Member 'UAthenaGiftingScreen::TileView_Items' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_Back) == 0x000750, "Member 'UAthenaGiftingScreen::Button_Back' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_CloseTouch) == 0x000758, "Member 'UAthenaGiftingScreen::Button_CloseTouch' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_GiftingPolicy) == 0x000760, "Member 'UAthenaGiftingScreen::Button_GiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Button_CameraControl) == 0x000768, "Member 'UAthenaGiftingScreen::Button_CameraControl' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_OfferName) == 0x000770, "Member 'UAthenaGiftingScreen::Text_OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_VBucksOffCount) == 0x000778, "Member 'UAthenaGiftingScreen::Text_VBucksOffCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_ShownItemIndex) == 0x000780, "Member 'UAthenaGiftingScreen::Text_ShownItemIndex' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Text_NoContent) == 0x000788, "Member 'UAthenaGiftingScreen::Text_NoContent' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RichText_OfferItemOwnedCount) == 0x000790, "Member 'UAthenaGiftingScreen::RichText_OfferItemOwnedCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Container_VBucksOffViolator) == 0x000798, "Member 'UAthenaGiftingScreen::Container_VBucksOffViolator' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RichText_GiftCount) == 0x0007A0, "Member 'UAthenaGiftingScreen::RichText_GiftCount' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Widget_Price) == 0x0007A8, "Member 'UAthenaGiftingScreen::Widget_Price' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, Widget_ItemInfo) == 0x0007B0, "Member 'UAthenaGiftingScreen::Widget_ItemInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, EntryBox_FilterTabs) == 0x0007B8, "Member 'UAthenaGiftingScreen::EntryBox_FilterTabs' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActionWidget_FilterTabsPrevious) == 0x0007C0, "Member 'UAthenaGiftingScreen::ActionWidget_FilterTabsPrevious' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActionWidget_FilterTabsNext) == 0x0007C8, "Member 'UAthenaGiftingScreen::ActionWidget_FilterTabsNext' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ActivatableWidget_GiftingConfirmation) == 0x0007D0, "Member 'UAthenaGiftingScreen::ActivatableWidget_GiftingConfirmation' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, ItemCyclingInterval) == 0x0007D8, "Member 'UAthenaGiftingScreen::ItemCyclingInterval' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterTabsPreviousAction) == 0x0007E0, "Member 'UAthenaGiftingScreen::FilterTabsPreviousAction' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterTabsNextAction) == 0x0007F0, "Member 'UAthenaGiftingScreen::FilterTabsNextAction' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, RegularGiftingPolicy) == 0x000800, "Member 'UAthenaGiftingScreen::RegularGiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, BattlePassGiftingPolicy) == 0x000818, "Member 'UAthenaGiftingScreen::BattlePassGiftingPolicy' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterMap) == 0x000890, "Member 'UAthenaGiftingScreen::FilterMap' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, FilterGroup) == 0x0008E0, "Member 'UAthenaGiftingScreen::FilterGroup' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, GiftableItems) == 0x0008E8, "Member 'UAthenaGiftingScreen::GiftableItems' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, PresentedItemDefinition) == 0x000918, "Member 'UAthenaGiftingScreen::PresentedItemDefinition' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, GiftableOfferInfo) == 0x000920, "Member 'UAthenaGiftingScreen::GiftableOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingScreen, OptionalTokenOfferInfo) == 0x000928, "Member 'UAthenaGiftingScreen::OptionalTokenOfferInfo' has a wrong offset!");

// Class GiftingUI.AthenaGiftingWrapOptionsPanel
// 0x0068 (0x0468 - 0x0400)
class UAthenaGiftingWrapOptionsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_400[0x28];                                     // 0x0400(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UFortGiftBoxItemDefinition>> GiftBoxes;                                         // 0x0428(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortGiftBoxItemDefinition*>     GiftBoxItemDefs;                                   // 0x0438(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x10];                                     // 0x0448(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_ConfirmWrap;                                // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_WrapOptions;                              // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingWrapOptionsPanel">();
	}
	static class UAthenaGiftingWrapOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingWrapOptionsPanel>();
	}
};
static_assert(alignof(UAthenaGiftingWrapOptionsPanel) == 0x000008, "Wrong alignment on UAthenaGiftingWrapOptionsPanel");
static_assert(sizeof(UAthenaGiftingWrapOptionsPanel) == 0x000468, "Wrong size on UAthenaGiftingWrapOptionsPanel");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, GiftBoxes) == 0x000428, "Member 'UAthenaGiftingWrapOptionsPanel::GiftBoxes' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, GiftBoxItemDefs) == 0x000438, "Member 'UAthenaGiftingWrapOptionsPanel::GiftBoxItemDefs' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, Button_ConfirmWrap) == 0x000458, "Member 'UAthenaGiftingWrapOptionsPanel::Button_ConfirmWrap' has a wrong offset!");
static_assert(offsetof(UAthenaGiftingWrapOptionsPanel, TileView_WrapOptions) == 0x000460, "Member 'UAthenaGiftingWrapOptionsPanel::TileView_WrapOptions' has a wrong offset!");

// Class GiftingUI.FortGiftingSocialUserListEntry
// 0x00E0 (0x15E0 - 0x1500)
class UFortGiftingSocialUserListEntry final : public USocialListEntryBase
{
public:
	uint8                                         Pad_14F8[0xC0];                                    // 0x14F8(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x15B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_EligibilityStatus;                        // 0x15C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OwnedItems;                               // 0x15D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnHighlightedStateChanged(bool bInIsHighlighted, bool bPlayAnimation);
	void BP_OnTouchSelectionConfirmed();
	void OnRecipientStatusUpdated();
	void OnUserItemSet();
	void SetPresentationMode(ERecipientPresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListEntry">();
	}
	static class UFortGiftingSocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListEntry>();
	}
};
static_assert(alignof(UFortGiftingSocialUserListEntry) == 0x000010, "Wrong alignment on UFortGiftingSocialUserListEntry");
static_assert(sizeof(UFortGiftingSocialUserListEntry) == 0x0015E0, "Wrong size on UFortGiftingSocialUserListEntry");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Avatar_MemberIcon) == 0x0015B8, "Member 'UFortGiftingSocialUserListEntry::Avatar_MemberIcon' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Text_SocialName) == 0x0015C0, "Member 'UFortGiftingSocialUserListEntry::Text_SocialName' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, RichText_EligibilityStatus) == 0x0015C8, "Member 'UFortGiftingSocialUserListEntry::RichText_EligibilityStatus' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, RichText_OwnedItems) == 0x0015D0, "Member 'UFortGiftingSocialUserListEntry::RichText_OwnedItems' has a wrong offset!");
static_assert(offsetof(UFortGiftingSocialUserListEntry, Widget_Price) == 0x0015D8, "Member 'UFortGiftingSocialUserListEntry::Widget_Price' has a wrong offset!");

// Class GiftingUI.FortGiftingSocialUserListView
// 0x00F8 (0x04A0 - 0x03A8)
class UFortGiftingSocialUserListView final : public USocialUserListViewBase
{
public:
	float                                         RefreshRecipientStatusDelay;                       // 0x03A8(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3AC[0xF4];                                     // 0x03AC(0x00F4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListView">();
	}
	static class UFortGiftingSocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListView>();
	}
};
static_assert(alignof(UFortGiftingSocialUserListView) == 0x000008, "Wrong alignment on UFortGiftingSocialUserListView");
static_assert(sizeof(UFortGiftingSocialUserListView) == 0x0004A0, "Wrong size on UFortGiftingSocialUserListView");
static_assert(offsetof(UFortGiftingSocialUserListView, RefreshRecipientStatusDelay) == 0x0003A8, "Member 'UFortGiftingSocialUserListView::RefreshRecipientStatusDelay' has a wrong offset!");

// Class GiftingUI.FortGiftingUserSearchWidget
// 0x0048 (0x0330 - 0x02E8)
class UFortGiftingUserSearchWidget final : public UCommonUserWidget
{
public:
	class UEditableText*                          EditableText_SearchFriends;                        // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ClearQuery;                                 // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SubmitQuery;                                // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_300[0x30];                                     // 0x0300(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FocusEditableText();
	void HandleSearchFriendsTextChanged(const class FText& Text);
	void HandleSearchFriendsTextEntered(const class FText& Text, ETextCommit CommitMethod);
	void OnSearchCommit(bool bSearchStringShort);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingUserSearchWidget">();
	}
	static class UFortGiftingUserSearchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingUserSearchWidget>();
	}
};
static_assert(alignof(UFortGiftingUserSearchWidget) == 0x000008, "Wrong alignment on UFortGiftingUserSearchWidget");
static_assert(sizeof(UFortGiftingUserSearchWidget) == 0x000330, "Wrong size on UFortGiftingUserSearchWidget");
static_assert(offsetof(UFortGiftingUserSearchWidget, EditableText_SearchFriends) == 0x0002E8, "Member 'UFortGiftingUserSearchWidget::EditableText_SearchFriends' has a wrong offset!");
static_assert(offsetof(UFortGiftingUserSearchWidget, Button_ClearQuery) == 0x0002F0, "Member 'UFortGiftingUserSearchWidget::Button_ClearQuery' has a wrong offset!");
static_assert(offsetof(UFortGiftingUserSearchWidget, Button_SubmitQuery) == 0x0002F8, "Member 'UFortGiftingUserSearchWidget::Button_SubmitQuery' has a wrong offset!");

// Class GiftingUI.FortGiftingWrapOptionListEntry
// 0x0020 (0x1500 - 0x14E0)
class UFortGiftingWrapOptionListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_14E0[0x8];                                     // 0x14E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftBoxItemDefinition*             GiftBoxDefinition;                                 // 0x14E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       Image_Gift;                                        // 0x14F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14F8[0x8];                                     // 0x14F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingWrapOptionListEntry">();
	}
	static class UFortGiftingWrapOptionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingWrapOptionListEntry>();
	}
};
static_assert(alignof(UFortGiftingWrapOptionListEntry) == 0x000010, "Wrong alignment on UFortGiftingWrapOptionListEntry");
static_assert(sizeof(UFortGiftingWrapOptionListEntry) == 0x001500, "Wrong size on UFortGiftingWrapOptionListEntry");
static_assert(offsetof(UFortGiftingWrapOptionListEntry, GiftBoxDefinition) == 0x0014E8, "Member 'UFortGiftingWrapOptionListEntry::GiftBoxDefinition' has a wrong offset!");
static_assert(offsetof(UFortGiftingWrapOptionListEntry, Image_Gift) == 0x0014F0, "Member 'UFortGiftingWrapOptionListEntry::Image_Gift' has a wrong offset!");

// Class GiftingUI.FortGiftingData
// 0x0020 (0x0550 - 0x0530)
class UFortGiftingData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   GiftingScreenClass;                                // 0x0530(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingData">();
	}
	static class UFortGiftingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingData>();
	}
};
static_assert(alignof(UFortGiftingData) == 0x000008, "Wrong alignment on UFortGiftingData");
static_assert(sizeof(UFortGiftingData) == 0x000550, "Wrong size on UFortGiftingData");
static_assert(offsetof(UFortGiftingData, GiftingScreenClass) == 0x000530, "Member 'UFortGiftingData::GiftingScreenClass' has a wrong offset!");

}

