#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrindRailRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GrindRailRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GrindRailRuntime.FortGrindRail.IsTipCapped
// 0x0002 (0x0002 - 0x0000)
struct FortGrindRail_IsTipCapped final
{
public:
	bool                                          bStartTip;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_IsTipCapped) == 0x000001, "Wrong alignment on FortGrindRail_IsTipCapped");
static_assert(sizeof(FortGrindRail_IsTipCapped) == 0x000002, "Wrong size on FortGrindRail_IsTipCapped");
static_assert(offsetof(FortGrindRail_IsTipCapped, bStartTip) == 0x000000, "Member 'FortGrindRail_IsTipCapped::bStartTip' has a wrong offset!");
static_assert(offsetof(FortGrindRail_IsTipCapped, ReturnValue) == 0x000001, "Member 'FortGrindRail_IsTipCapped::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.NativeGetNextPositionToGrind
// 0x0048 (0x0048 - 0x0000)
struct FortGrindRail_NativeGetNextPositionToGrind final
{
public:
	float                                         DistanceToTravel;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentDistanceAlongSpline;                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightLeanValue;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutNextLocation;                                   // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGotToEnd;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NextLocationOnRail;                                // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrindRailBoosterMode                         BoosterMode;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitObstacle;                                      // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewRail;                                          // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceAlongNewRail;                              // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortGrindRail*                         TheNewRail;                                        // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewRailReverseDirection;                          // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortGrindRail_NativeGetNextPositionToGrind) == 0x000008, "Wrong alignment on FortGrindRail_NativeGetNextPositionToGrind");
static_assert(sizeof(FortGrindRail_NativeGetNextPositionToGrind) == 0x000048, "Wrong size on FortGrindRail_NativeGetNextPositionToGrind");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, DistanceToTravel) == 0x000000, "Member 'FortGrindRail_NativeGetNextPositionToGrind::DistanceToTravel' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, CurrentDistanceAlongSpline) == 0x000004, "Member 'FortGrindRail_NativeGetNextPositionToGrind::CurrentDistanceAlongSpline' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, RightLeanValue) == 0x000008, "Member 'FortGrindRail_NativeGetNextPositionToGrind::RightLeanValue' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, OutNextLocation) == 0x000010, "Member 'FortGrindRail_NativeGetNextPositionToGrind::OutNextLocation' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, bGotToEnd) == 0x000028, "Member 'FortGrindRail_NativeGetNextPositionToGrind::bGotToEnd' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, NextLocationOnRail) == 0x00002C, "Member 'FortGrindRail_NativeGetNextPositionToGrind::NextLocationOnRail' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, BoosterMode) == 0x000030, "Member 'FortGrindRail_NativeGetNextPositionToGrind::BoosterMode' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, bHitObstacle) == 0x000031, "Member 'FortGrindRail_NativeGetNextPositionToGrind::bHitObstacle' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, bNewRail) == 0x000032, "Member 'FortGrindRail_NativeGetNextPositionToGrind::bNewRail' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, DistanceAlongNewRail) == 0x000034, "Member 'FortGrindRail_NativeGetNextPositionToGrind::DistanceAlongNewRail' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, TheNewRail) == 0x000038, "Member 'FortGrindRail_NativeGetNextPositionToGrind::TheNewRail' has a wrong offset!");
static_assert(offsetof(FortGrindRail_NativeGetNextPositionToGrind, bNewRailReverseDirection) == 0x000040, "Member 'FortGrindRail_NativeGetNextPositionToGrind::bNewRailReverseDirection' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.OnPlayerBeganGrinding
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_OnPlayerBeganGrinding final
{
public:
	class AFortPlayerPawn*                        GrindingPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_OnPlayerBeganGrinding) == 0x000008, "Wrong alignment on FortGrindRail_OnPlayerBeganGrinding");
static_assert(sizeof(FortGrindRail_OnPlayerBeganGrinding) == 0x000008, "Wrong size on FortGrindRail_OnPlayerBeganGrinding");
static_assert(offsetof(FortGrindRail_OnPlayerBeganGrinding, GrindingPawn) == 0x000000, "Member 'FortGrindRail_OnPlayerBeganGrinding::GrindingPawn' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.OnPlayerEndedGrinding
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_OnPlayerEndedGrinding final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_OnPlayerEndedGrinding) == 0x000008, "Wrong alignment on FortGrindRail_OnPlayerEndedGrinding");
static_assert(sizeof(FortGrindRail_OnPlayerEndedGrinding) == 0x000008, "Wrong size on FortGrindRail_OnPlayerEndedGrinding");
static_assert(offsetof(FortGrindRail_OnPlayerEndedGrinding, Pawn) == 0x000000, "Member 'FortGrindRail_OnPlayerEndedGrinding::Pawn' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortGrindRail_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_OnPlaylistDataReady) == 0x000008, "Wrong alignment on FortGrindRail_OnPlaylistDataReady");
static_assert(sizeof(FortGrindRail_OnPlaylistDataReady) == 0x000030, "Wrong size on FortGrindRail_OnPlaylistDataReady");
static_assert(offsetof(FortGrindRail_OnPlaylistDataReady, GameState) == 0x000000, "Member 'FortGrindRail_OnPlaylistDataReady::GameState' has a wrong offset!");
static_assert(offsetof(FortGrindRail_OnPlaylistDataReady, Playlist) == 0x000008, "Member 'FortGrindRail_OnPlaylistDataReady::Playlist' has a wrong offset!");
static_assert(offsetof(FortGrindRail_OnPlaylistDataReady, PlaylistContextTags) == 0x000010, "Member 'FortGrindRail_OnPlaylistDataReady::PlaylistContextTags' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.SetupMeshInfo
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_SetupMeshInfo final
{
public:
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_SetupMeshInfo) == 0x000008, "Wrong alignment on FortGrindRail_SetupMeshInfo");
static_assert(sizeof(FortGrindRail_SetupMeshInfo) == 0x000008, "Wrong size on FortGrindRail_SetupMeshInfo");
static_assert(offsetof(FortGrindRail_SetupMeshInfo, SplineMeshComponent) == 0x000000, "Member 'FortGrindRail_SetupMeshInfo::SplineMeshComponent' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.UpdateTransientComponentTransforms
// 0x0010 (0x0010 - 0x0000)
struct FortGrindRail_UpdateTransientComponentTransforms final
{
public:
	TArray<class USceneComponent*>                TransientSceneComponents;                          // 0x0000(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_UpdateTransientComponentTransforms) == 0x000008, "Wrong alignment on FortGrindRail_UpdateTransientComponentTransforms");
static_assert(sizeof(FortGrindRail_UpdateTransientComponentTransforms) == 0x000010, "Wrong size on FortGrindRail_UpdateTransientComponentTransforms");
static_assert(offsetof(FortGrindRail_UpdateTransientComponentTransforms, TransientSceneComponents) == 0x000000, "Member 'FortGrindRail_UpdateTransientComponentTransforms::TransientSceneComponents' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.AllowSprinting
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_AllowSprinting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_AllowSprinting) == 0x000001, "Wrong alignment on FortGrindRail_AllowSprinting");
static_assert(sizeof(FortGrindRail_AllowSprinting) == 0x000001, "Wrong size on FortGrindRail_AllowSprinting");
static_assert(offsetof(FortGrindRail_AllowSprinting, ReturnValue) == 0x000000, "Member 'FortGrindRail_AllowSprinting::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.GetSpeedSettingsOverride
// 0x001C (0x001C - 0x0000)
struct FortGrindRail_GetSpeedSettingsOverride final
{
public:
	struct FGrindRailSpeedSettings                SpeedSettingsOverride;                             // 0x0000(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortGrindRail_GetSpeedSettingsOverride) == 0x000004, "Wrong alignment on FortGrindRail_GetSpeedSettingsOverride");
static_assert(sizeof(FortGrindRail_GetSpeedSettingsOverride) == 0x00001C, "Wrong size on FortGrindRail_GetSpeedSettingsOverride");
static_assert(offsetof(FortGrindRail_GetSpeedSettingsOverride, SpeedSettingsOverride) == 0x000000, "Member 'FortGrindRail_GetSpeedSettingsOverride::SpeedSettingsOverride' has a wrong offset!");
static_assert(offsetof(FortGrindRail_GetSpeedSettingsOverride, ReturnValue) == 0x000018, "Member 'FortGrindRail_GetSpeedSettingsOverride::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.HasHeadConnection
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_HasHeadConnection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_HasHeadConnection) == 0x000001, "Wrong alignment on FortGrindRail_HasHeadConnection");
static_assert(sizeof(FortGrindRail_HasHeadConnection) == 0x000001, "Wrong size on FortGrindRail_HasHeadConnection");
static_assert(offsetof(FortGrindRail_HasHeadConnection, ReturnValue) == 0x000000, "Member 'FortGrindRail_HasHeadConnection::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.HasTailConnection
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_HasTailConnection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_HasTailConnection) == 0x000001, "Wrong alignment on FortGrindRail_HasTailConnection");
static_assert(sizeof(FortGrindRail_HasTailConnection) == 0x000001, "Wrong size on FortGrindRail_HasTailConnection");
static_assert(offsetof(FortGrindRail_HasTailConnection, ReturnValue) == 0x000000, "Member 'FortGrindRail_HasTailConnection::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.IsGrindRailEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_IsGrindRailEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_IsGrindRailEnabled) == 0x000001, "Wrong alignment on FortGrindRail_IsGrindRailEnabled");
static_assert(sizeof(FortGrindRail_IsGrindRailEnabled) == 0x000001, "Wrong size on FortGrindRail_IsGrindRailEnabled");
static_assert(offsetof(FortGrindRail_IsGrindRailEnabled, ReturnValue) == 0x000000, "Member 'FortGrindRail_IsGrindRailEnabled::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRail.ShouldApplyFallDamageImmunity
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_ShouldApplyFallDamageImmunity final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRail_ShouldApplyFallDamageImmunity) == 0x000001, "Wrong alignment on FortGrindRail_ShouldApplyFallDamageImmunity");
static_assert(sizeof(FortGrindRail_ShouldApplyFallDamageImmunity) == 0x000001, "Wrong size on FortGrindRail_ShouldApplyFallDamageImmunity");
static_assert(offsetof(FortGrindRail_ShouldApplyFallDamageImmunity, ReturnValue) == 0x000000, "Member 'FortGrindRail_ShouldApplyFallDamageImmunity::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.AnimNotify_EntryEnter
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter final
{
public:
	const class UAnimNotify*                      Notify;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter) == 0x000008, "Wrong alignment on FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter");
static_assert(sizeof(FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter) == 0x000008, "Wrong size on FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter");
static_assert(offsetof(FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter, Notify) == 0x000000, "Member 'FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter::Notify' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.AnimNotify_EntryExit
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRailLayerAnimInstance_AnimNotify_EntryExit final
{
public:
	const class UAnimNotify*                      Notify;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRailLayerAnimInstance_AnimNotify_EntryExit) == 0x000008, "Wrong alignment on FortGrindRailLayerAnimInstance_AnimNotify_EntryExit");
static_assert(sizeof(FortGrindRailLayerAnimInstance_AnimNotify_EntryExit) == 0x000008, "Wrong size on FortGrindRailLayerAnimInstance_AnimNotify_EntryExit");
static_assert(offsetof(FortGrindRailLayerAnimInstance_AnimNotify_EntryExit, Notify) == 0x000000, "Member 'FortGrindRailLayerAnimInstance_AnimNotify_EntryExit::Notify' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.AnimNotify_IdleEnter
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter final
{
public:
	const class UAnimNotify*                      Notify;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter) == 0x000008, "Wrong alignment on FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter");
static_assert(sizeof(FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter) == 0x000008, "Wrong size on FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter");
static_assert(offsetof(FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter, Notify) == 0x000000, "Member 'FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter::Notify' has a wrong offset!");

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.HandleBegunGrinding
// 0x0020 (0x0020 - 0x0000)
struct FortGrindRailLayerAnimInstance_HandleBegunGrinding final
{
public:
	bool                                          bWasAlreadyGrinding;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasJumpingFromRail;                               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromInteraction;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousPlayerLocation;                            // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGrindRailLayerAnimInstance_HandleBegunGrinding) == 0x000008, "Wrong alignment on FortGrindRailLayerAnimInstance_HandleBegunGrinding");
static_assert(sizeof(FortGrindRailLayerAnimInstance_HandleBegunGrinding) == 0x000020, "Wrong size on FortGrindRailLayerAnimInstance_HandleBegunGrinding");
static_assert(offsetof(FortGrindRailLayerAnimInstance_HandleBegunGrinding, bWasAlreadyGrinding) == 0x000000, "Member 'FortGrindRailLayerAnimInstance_HandleBegunGrinding::bWasAlreadyGrinding' has a wrong offset!");
static_assert(offsetof(FortGrindRailLayerAnimInstance_HandleBegunGrinding, bWasJumpingFromRail) == 0x000001, "Member 'FortGrindRailLayerAnimInstance_HandleBegunGrinding::bWasJumpingFromRail' has a wrong offset!");
static_assert(offsetof(FortGrindRailLayerAnimInstance_HandleBegunGrinding, bFromInteraction) == 0x000002, "Member 'FortGrindRailLayerAnimInstance_HandleBegunGrinding::bFromInteraction' has a wrong offset!");
static_assert(offsetof(FortGrindRailLayerAnimInstance_HandleBegunGrinding, PreviousPlayerLocation) == 0x000008, "Member 'FortGrindRailLayerAnimInstance_HandleBegunGrinding::PreviousPlayerLocation' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.AddTemporaryMoveIgnoreActor
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IgnoreDuration;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor, BuildingActor) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor::BuildingActor' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor, IgnoreDuration) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor::IgnoreDuration' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.ApplyDamageToDevice
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice, BuildingActor) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice::BuildingActor' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnApplyDamageToDevice
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice, BuildingActor) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice::BuildingActor' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnBaseMeshReady
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady, Pawn) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady::Pawn' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady, MeshComponent) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady::MeshComponent' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnEnergyCompletelyDrained
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained final
{
public:
	class UFortComponent_Energy*                  EnergyComponentDrained;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained, EnergyComponentDrained) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained::EnergyComponentDrained' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnJumpInput
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput) == 0x000001, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput) == 0x000001, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput, bPressed) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput::bPressed' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnPawnLanded
// 0x00E8 (0x00E8 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded) == 0x0000E8, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded, Hit) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded::Hit' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnSprintInputPressed
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed) == 0x000001, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed) == 0x000001, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed, bPressed) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed::bPressed' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnTeleport
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport final
{
public:
	class AFortPawn*                              TeleportedPawn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport, TeleportedPawn) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport::TeleportedPawn' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_BlockSprinting
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting) == 0x000004, "Wrong alignment on FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting, tag) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting::tag' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting, NewCount) == 0x000004, "Member 'FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting::NewCount' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_BlockSprintingAndHolstering
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering) == 0x000004, "Wrong alignment on FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering, tag) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering::tag' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering, NewCount) == 0x000004, "Member 'FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering::NewCount' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GetGrindInAirGameplayEffectClass
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass::GrindRail' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass, ReturnValue) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnBoosterModeChange
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrindRailBoosterMode                         OldBoosterMode;                                    // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrindRailBoosterMode                         NewBoosterMode;                                    // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange::GrindRail' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange, OldBoosterMode) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange::OldBoosterMode' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange, NewBoosterMode) == 0x000009, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange::NewBoosterMode' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnFeetLanding
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding::GrindRail' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnHit
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit::GrindRail' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnRailJump
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump final
{
public:
	bool                                          bIsAnchorJumpActive;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump) == 0x000001, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump) == 0x000001, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump, bIsAnchorJumpActive) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump::bIsAnchorJumpActive' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnSprinting
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsToGrindSprint;                               // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting::GrindRail' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting, bWantsToGrindSprint) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting::bWantsToGrindSprint' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayEffectsOnVehicleHit
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit final
{
public:
	class AFortAthenaVehicle*                     AthenaVehicle;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit, AthenaVehicle) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit::AthenaVehicle' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGrindingBegun
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGrindingBegun final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGrindingBegun) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGrindingBegun");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGrindingBegun) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGrindingBegun");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGrindingBegun, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGrindingBegun::GrindRail' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGrindingEnded
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGrindingEnded final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_HandleGrindingEnded) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_HandleGrindingEnded");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_HandleGrindingEnded) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_HandleGrindingEnded");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_HandleGrindingEnded, GrindRail) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_HandleGrindingEnded::GrindRail' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.IsDamageableDevice
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_IsDamageableDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_IsDamageableDevice) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_IsDamageableDevice");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_IsDamageableDevice) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_IsDamageableDevice");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_IsDamageableDevice, BuildingActor) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_IsDamageableDevice::BuildingActor' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_IsDamageableDevice, ReturnValue) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_IsDamageableDevice::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.IsThrowableItem
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_IsThrowableItem final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_IsThrowableItem) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_IsThrowableItem");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_IsThrowableItem) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_IsThrowableItem");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_IsThrowableItem, BuildingActor) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_IsThrowableItem::BuildingActor' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_IsThrowableItem, ReturnValue) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_IsThrowableItem::ReturnValue' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.OnIgnoredBuildingEndPlay
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay, Actor) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay, EndPlayReason) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay::EndPlayReason' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.DrawDebugHUD
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_DrawDebugHUD final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvas*                                Canvas;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_DrawDebugHUD) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicGrinding_DrawDebugHUD");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_DrawDebugHUD) == 0x000010, "Wrong size on FortMovementMode_ExtLogicGrinding_DrawDebugHUD");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_DrawDebugHUD, HUD) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_DrawDebugHUD::HUD' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_DrawDebugHUD, Canvas) == 0x000008, "Member 'FortMovementMode_ExtLogicGrinding_DrawDebugHUD::Canvas' has a wrong offset!");

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_CancelGrinding
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding) == 0x000004, "Wrong alignment on FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding");
static_assert(sizeof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding) == 0x000008, "Wrong size on FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding, tag) == 0x000000, "Member 'FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding::tag' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding, NewCount) == 0x000004, "Member 'FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding::NewCount' has a wrong offset!");

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.BP_HandleGameplayEffectsOnPlayerJumpOff
// 0x0018 (0x0018 - 0x0000)
struct FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff final
{
public:
	struct FVector                                PlayerPosition;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff) == 0x000008, "Wrong alignment on FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff");
static_assert(sizeof(FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff) == 0x000018, "Wrong size on FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff");
static_assert(offsetof(FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff, PlayerPosition) == 0x000000, "Member 'FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff::PlayerPosition' has a wrong offset!");

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.BP_HandleGrindStartRequestData
// 0x0098 (0x0098 - 0x0000)
struct FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData final
{
public:
	class AFortGrindRail*                         GrindRail;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PawnLocation;                                      // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastUpdateVelocity;                                // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGrinding;                                       // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartedFromLand;                                  // 0x0041(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentSpeedAlongSpline;                           // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CurrentDirection;                                  // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGrindingRequestCalculationData        ReturnValue;                                       // 0x0060(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData) == 0x000008, "Wrong alignment on FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData");
static_assert(sizeof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData) == 0x000098, "Wrong size on FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData");
static_assert(offsetof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData, GrindRail) == 0x000000, "Member 'FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData::GrindRail' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData, PawnLocation) == 0x000008, "Member 'FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData::PawnLocation' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData, StartDistance) == 0x000020, "Member 'FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData::StartDistance' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData, LastUpdateVelocity) == 0x000028, "Member 'FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData::LastUpdateVelocity' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData, bIsGrinding) == 0x000040, "Member 'FortPawnComponent_GrindingProvider_BP_HandleGrindStartRequestData::bIsGrinding' has a wrong offset!");
