#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthShieldRegenRuntime

#include "Basic.hpp"

#include "HealthShieldRegenRuntime_structs.hpp"


namespace SDK::Params
{

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AllowHealthShieldRegen
// 0x0001 (0x0001 - 0x0000)
struct FortHealthShieldRegenComponent_AllowHealthShieldRegen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHealthShieldRegenComponent_AllowHealthShieldRegen) == 0x000001, "Wrong alignment on FortHealthShieldRegenComponent_AllowHealthShieldRegen");
static_assert(sizeof(FortHealthShieldRegenComponent_AllowHealthShieldRegen) == 0x000001, "Wrong size on FortHealthShieldRegenComponent_AllowHealthShieldRegen");
static_assert(offsetof(FortHealthShieldRegenComponent_AllowHealthShieldRegen, ReturnValue) == 0x000000, "Member 'FortHealthShieldRegenComponent_AllowHealthShieldRegen::ReturnValue' has a wrong offset!");

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AssignHealthShieldRegen_HealthListenerDelegates
// 0x0020 (0x0020 - 0x0000)
struct FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortHealthShieldRegen_HealthDelegateContainer Delegates;                                         // 0x0008(0x0018)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates) == 0x000008, "Wrong alignment on FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates");
static_assert(sizeof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates) == 0x000020, "Wrong size on FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates");
static_assert(offsetof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates, OwningAbility) == 0x000000, "Member 'FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates::OwningAbility' has a wrong offset!");
static_assert(offsetof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates, Delegates) == 0x000008, "Member 'FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates::Delegates' has a wrong offset!");

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AssignHealthShieldRegen_ShieldListenerDelegates
// 0x0038 (0x0038 - 0x0000)
struct FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortHealthShieldRegen_ShieldDelegateContainer Delegates;                                         // 0x0008(0x0030)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates) == 0x000008, "Wrong alignment on FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates");
static_assert(sizeof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates) == 0x000038, "Wrong size on FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates");
static_assert(offsetof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates, OwningAbility) == 0x000000, "Member 'FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates::OwningAbility' has a wrong offset!");
static_assert(offsetof(FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates, Delegates) == 0x000008, "Member 'FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates::Delegates' has a wrong offset!");

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.ClearHealthShieldRegen_HealthListenerDelegates
// 0x0008 (0x0008 - 0x0000)
struct FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates) == 0x000008, "Wrong alignment on FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates");
static_assert(sizeof(FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates) == 0x000008, "Wrong size on FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates");
static_assert(offsetof(FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates, OwningAbility) == 0x000000, "Member 'FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates::OwningAbility' has a wrong offset!");

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.ClearHealthShieldRegen_ShieldListenerDelegates
// 0x0008 (0x0008 - 0x0000)
struct FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates) == 0x000008, "Wrong alignment on FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates");
static_assert(sizeof(FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates) == 0x000008, "Wrong size on FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates");
static_assert(offsetof(FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates, OwningAbility) == 0x000000, "Member 'FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates::OwningAbility' has a wrong offset!");

}

