#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomerUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function HomerUI.FortHomerComponent.HandleLocalPlayerEliminatedPlayer
// 0x0008 (0x0008 - 0x0000)
struct FortHomerComponent_HandleLocalPlayerEliminatedPlayer final
{
public:
	const class AFortPlayerStateAthena*           Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHomerComponent_HandleLocalPlayerEliminatedPlayer) == 0x000008, "Wrong alignment on FortHomerComponent_HandleLocalPlayerEliminatedPlayer");
static_assert(sizeof(FortHomerComponent_HandleLocalPlayerEliminatedPlayer) == 0x000008, "Wrong size on FortHomerComponent_HandleLocalPlayerEliminatedPlayer");
static_assert(offsetof(FortHomerComponent_HandleLocalPlayerEliminatedPlayer, Player) == 0x000000, "Member 'FortHomerComponent_HandleLocalPlayerEliminatedPlayer::Player' has a wrong offset!");

// Function HomerUI.FortHomerComponent.HandlePawnEmoteStopped
// 0x0010 (0x0010 - 0x0000)
struct FortHomerComponent_HandlePawnEmoteStopped final
{
public:
	const class UFortItemDefinition*              MontageItemDef;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHomerComponent_HandlePawnEmoteStopped) == 0x000008, "Wrong alignment on FortHomerComponent_HandlePawnEmoteStopped");
static_assert(sizeof(FortHomerComponent_HandlePawnEmoteStopped) == 0x000010, "Wrong size on FortHomerComponent_HandlePawnEmoteStopped");
static_assert(offsetof(FortHomerComponent_HandlePawnEmoteStopped, MontageItemDef) == 0x000000, "Member 'FortHomerComponent_HandlePawnEmoteStopped::MontageItemDef' has a wrong offset!");
static_assert(offsetof(FortHomerComponent_HandlePawnEmoteStopped, PawnEmoting) == 0x000008, "Member 'FortHomerComponent_HandlePawnEmoteStopped::PawnEmoting' has a wrong offset!");

}

