#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hoverboard_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Hoverboard_V2.Hoverboard_V2_C.BP_CanBoost
// 0x0002 (0x0002 - 0x0000)
struct Hoverboard_V2_C_BP_CanBoost final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hoverboard_V2_C_BP_CanBoost) == 0x000001, "Wrong alignment on Hoverboard_V2_C_BP_CanBoost");
static_assert(sizeof(Hoverboard_V2_C_BP_CanBoost) == 0x000002, "Wrong size on Hoverboard_V2_C_BP_CanBoost");
static_assert(offsetof(Hoverboard_V2_C_BP_CanBoost, ReturnValue) == 0x000000, "Member 'Hoverboard_V2_C_BP_CanBoost::ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_BP_CanBoost, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Hoverboard_V2_C_BP_CanBoost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Hoverboard_V2.Hoverboard_V2_C.BP_OnGainedFuel
// 0x0004 (0x0004 - 0x0000)
struct Hoverboard_V2_C_BP_OnGainedFuel final
{
public:
	float                                         NewPercent;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hoverboard_V2_C_BP_OnGainedFuel) == 0x000004, "Wrong alignment on Hoverboard_V2_C_BP_OnGainedFuel");
static_assert(sizeof(Hoverboard_V2_C_BP_OnGainedFuel) == 0x000004, "Wrong size on Hoverboard_V2_C_BP_OnGainedFuel");
static_assert(offsetof(Hoverboard_V2_C_BP_OnGainedFuel, NewPercent) == 0x000000, "Member 'Hoverboard_V2_C_BP_OnGainedFuel::NewPercent' has a wrong offset!");

// Function Hoverboard_V2.Hoverboard_V2_C.DeactivateComponents
// 0x0001 (0x0001 - 0x0000)
struct Hoverboard_V2_C_DeactivateComponents final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hoverboard_V2_C_DeactivateComponents) == 0x000001, "Wrong alignment on Hoverboard_V2_C_DeactivateComponents");
static_assert(sizeof(Hoverboard_V2_C_DeactivateComponents) == 0x000001, "Wrong size on Hoverboard_V2_C_DeactivateComponents");
static_assert(offsetof(Hoverboard_V2_C_DeactivateComponents, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Hoverboard_V2_C_DeactivateComponents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Hoverboard_V2.Hoverboard_V2_C.ExecuteUbergraph_Hoverboard_V2
// 0x0800 (0x0800 - 0x0000)
struct Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0040(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0138(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewPercent;                           // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Charge;                               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0260(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormalImpulse;                     // 0x0278(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitFrictionImpulse;                   // 0x0290(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x02A8(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_HitActor;                             // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_HitSurfaceType;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateSurfaceType_Output;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_Event_WaterBody_1;                          // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_Event_WaterBody;                            // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_WaterSurfacePoint_1;                  // 0x03A8(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_WaterSurfacePoint;                    // 0x03E8(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWaterSurfaceInfo                      CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo; // 0x0438(0x0068)(NoDestructor)
	double                                        CallFunc_BreakVector_X_2;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterSurfaceLocation; // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterSurfaceNormal; // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterVelocity; // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterDepth; // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x05C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x06B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x06D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x06FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x06FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0708(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0710(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0720(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFN_WashForce_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x07AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AD[0x3];                                      // 0x07AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x07B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x07BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BD[0x3];                                      // 0x07BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x07C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_HapticsOnHit_HitMagnitude_ImplicitCast;   // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_4;    // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CheckWater_WaterLocationZ_ImplicitCast;   // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2) == 0x000010, "Wrong alignment on Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2");
static_assert(sizeof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2) == 0x000800, "Wrong size on Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, EntryPoint) == 0x000000, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_Damage) == 0x000004, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_DamageTags) == 0x000008, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_Momentum) == 0x000028, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitInfo) == 0x000040, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_InstigatedBy) == 0x000128, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_DamageCauser) == 0x000130, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_EffectContext) == 0x000138, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000150, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetSocketTransform_ReturnValue) == 0x000170, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakTransform_Location) == 0x0001D0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakTransform_Rotation) == 0x0001E8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakTransform_Scale) == 0x000200, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000218, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetVehicleVelocity_ReturnValue) == 0x000220, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetVehicleVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_NewPercent) == 0x000238, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_NewPercent' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_Charge) == 0x00023C, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_Charge' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000240, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000248, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue) == 0x000250, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_StartCameraShake_ReturnValue) == 0x000258, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitLocation) == 0x000260, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitNormalImpulse) == 0x000278, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitNormalImpulse' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitFrictionImpulse) == 0x000290, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitFrictionImpulse' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitNormal) == 0x0002A8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitActor) == 0x0002C0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_HitSurfaceType) == 0x0002C8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_HitSurfaceType' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_UpdateSurfaceType_Output) == 0x0002CC, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_UpdateSurfaceType_Output' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue_1) == 0x0002D0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_DynamicCast_AsFort_Pawn) == 0x0002D8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_DynamicCast_bSuccess) == 0x0002E0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0002E8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_OnCollision_OutResult) == 0x000300, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_OnCollision_OutMagnitude) == 0x000304, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsDedicatedServer_ReturnValue) == 0x000308, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000309, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x00030A, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00030B, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue_2) == 0x00030C, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetActorUpVector_ReturnValue) == 0x000310, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Dot_VectorVector_ReturnValue) == 0x000328, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000330, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000338, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000340, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x000348, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_ReturnValue_5) == 0x000349, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BooleanAND_ReturnValue) == 0x00034A, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue_3) == 0x00034B, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x00034C, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000350, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_IntInt_ReturnValue) == 0x000351, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000358, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000360, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000368, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_WaterBody_1) == 0x000380, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_WaterBody_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_X) == 0x000388, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Y) == 0x000390, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Z) == 0x000398, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_WaterBody) == 0x0003A0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_WaterBody' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_WaterSurfacePoint_1) == 0x0003A8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_WaterSurfacePoint_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_X_1) == 0x0003C0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Y_1) == 0x0003C8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Z_1) == 0x0003D0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003D8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0003E0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Event_WaterSurfacePoint) == 0x0003E8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Event_WaterSurfacePoint' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_MakeVector_ReturnValue) == 0x000400, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetSocketLocation_ReturnValue) == 0x000418, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x000430, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo) == 0x000438, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_X_2) == 0x0004A0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Y_2) == 0x0004A8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Z_2) == 0x0004B0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0004B8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0004D0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, Temp_object_Variable) == 0x0004E8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0004F0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0004F8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterSurfaceLocation) == 0x000510, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterSurfaceLocation' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterSurfaceNormal) == 0x000528, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterSurfaceNormal' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterVelocity) == 0x000540, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterVelocity' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterDepth) == 0x000558, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetWaterSurfaceInfoAtLocation_OutWaterDepth' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000560, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_X_3) == 0x000578, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Y_3) == 0x000580, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Z_3) == 0x000588, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_X_4) == 0x000590, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Y_4) == 0x000598, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BreakVector_Z_4) == 0x0005A0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_MakeVector_ReturnValue_1) == 0x0005A8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0005C0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, Temp_object_Variable_1) == 0x0006A8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0006B0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetActorForwardVector_ReturnValue) == 0x0006B8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0006D0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue_4) == 0x0006E8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetCurrentMontage_ReturnValue) == 0x0006F0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Array_Contains_ReturnValue) == 0x0006F8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue_5) == 0x0006F9, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0006FA, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, Temp_bool_Variable) == 0x0006FB, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_Select_Default) == 0x000700, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000708, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x000710, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000720, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000780, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000788, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000790, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_FinishSpawningActor_ReturnValue) == 0x000798, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetGameUserSettings_ReturnValue) == 0x0007A0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x0007A8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0007AC, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, K2Node_CreateDelegate_OutputDelegate) == 0x0007B0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_IsValid_ReturnValue_6) == 0x0007BC, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0007C0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0007C8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_HapticsOnHit_HitMagnitude_ImplicitCast) == 0x0007D0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_HapticsOnHit_HitMagnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0007D8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x0007E0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x0007E8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_Greater_DoubleDouble_A_ImplicitCast_4) == 0x0007F0, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_Greater_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2, CallFunc_CheckWater_WaterLocationZ_ImplicitCast) == 0x0007F8, "Member 'Hoverboard_V2_C_ExecuteUbergraph_Hoverboard_V2::CallFunc_CheckWater_WaterLocationZ_ImplicitCast' has a wrong offset!");

// Function Hoverboard_V2.Hoverboard_V2_C.OnCollisionHitEffects
// 0x0070 (0x0070 - 0x0000)
struct Hoverboard_V2_C_OnCollisionHitEffects final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormalImpulse;                                  // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitFrictionImpulse;                                // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              HitSurfaceType;                                    // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hoverboard_V2_C_OnCollisionHitEffects) == 0x000008, "Wrong alignment on Hoverboard_V2_C_OnCollisionHitEffects");
static_assert(sizeof(Hoverboard_V2_C_OnCollisionHitEffects) == 0x000070, "Wrong size on Hoverboard_V2_C_OnCollisionHitEffects");
static_assert(offsetof(Hoverboard_V2_C_OnCollisionHitEffects, HitLocation) == 0x000000, "Member 'Hoverboard_V2_C_OnCollisionHitEffects::HitLocation' has a wrong offset!");
static_assert(offsetof(Hoverboard_V2_C_OnCollisionHitEffects, HitNormalImpulse) == 0x000018, "Member 'Hoverboard_V2_C_OnCollisionHitEffects::HitNormalImpulse' has a wrong offset!");
