#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InfernoRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct InfernoRuntime.FortCurieVoxelPropagationProperties
// 0x0010 (0x0018 - 0x0008)
struct FFortCurieVoxelPropagationProperties final : public FTableRowBase
{
public:
	float                                         PropagationZDirectionDownMultiplier;               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationZDirectionUpMultiplier;                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationBaseDelay;                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationBaseSpeed;                              // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFortCurieVoxelPropagationProperties) == 0x000008, "Wrong alignment on FFortCurieVoxelPropagationProperties");
static_assert(sizeof(FFortCurieVoxelPropagationProperties) == 0x000018, "Wrong size on FFortCurieVoxelPropagationProperties");
static_assert(offsetof(FFortCurieVoxelPropagationProperties, PropagationZDirectionDownMultiplier) == 0x000008, "Member 'FFortCurieVoxelPropagationProperties::PropagationZDirectionDownMultiplier' has a wrong offset!");
static_assert(offsetof(FFortCurieVoxelPropagationProperties, PropagationZDirectionUpMultiplier) == 0x00000C, "Member 'FFortCurieVoxelPropagationProperties::PropagationZDirectionUpMultiplier' has a wrong offset!");
static_assert(offsetof(FFortCurieVoxelPropagationProperties, PropagationBaseDelay) == 0x000010, "Member 'FFortCurieVoxelPropagationProperties::PropagationBaseDelay' has a wrong offset!");
static_assert(offsetof(FFortCurieVoxelPropagationProperties, PropagationBaseSpeed) == 0x000014, "Member 'FFortCurieVoxelPropagationProperties::PropagationBaseSpeed' has a wrong offset!");

// ScriptStruct InfernoRuntime.FortCurieVoxelFirePropagationManagerTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FFortCurieVoxelFirePropagationManagerTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortCurieVoxelFirePropagationManagerTickFunction) == 0x000008, "Wrong alignment on FFortCurieVoxelFirePropagationManagerTickFunction");
static_assert(sizeof(FFortCurieVoxelFirePropagationManagerTickFunction) == 0x000030, "Wrong size on FFortCurieVoxelFirePropagationManagerTickFunction");

// ScriptStruct InfernoRuntime.FortCurieVoxelFireParticleGrassData
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FFortCurieVoxelFireParticleGrassData final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortCurieVoxelFireParticleGrassData) == 0x000008, "Wrong alignment on FFortCurieVoxelFireParticleGrassData");
static_assert(sizeof(FFortCurieVoxelFireParticleGrassData) == 0x000058, "Wrong size on FFortCurieVoxelFireParticleGrassData");

}

