#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationRuntime

#include "Basic.hpp"

#include "ItemizationRuntime_structs.hpp"
#include "FortImGuiCore_classes.hpp"
#include "ItemizationCoreRuntime_classes.hpp"


namespace SDK
{

// Class ItemizationRuntime.InventoryDebugMenu
// 0x0080 (0x0540 - 0x04C0)
class AInventoryDebugMenu final : public AImGuiDebugMenuBase
{
public:
	class AActor*                                 MonitoredActor;                                    // 0x04B8(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInventoryCollectionDebugSnapshot      ServerDebugSnapshot;                               // 0x04C0(0x0030)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FFortInventoryDebugSnapshot            ServerDebugSnapshot_FortInventory;                 // 0x04F0(0x0048)(Net, Transient, NativeAccessSpecifierPrivate)
	int32                                         SelectedInventoryIndex;                            // 0x0538(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayClient;                                    // 0x053C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayServer;                                    // 0x053D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayFortInventories;                           // 0x053E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayInventoryCollections;                      // 0x053F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ServerClose();
	void ServerSetMonitoredActor(class AActor* ActorToMonitor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryDebugMenu">();
	}
	static class AInventoryDebugMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInventoryDebugMenu>();
	}
};
static_assert(alignof(AInventoryDebugMenu) == 0x000010, "Wrong alignment on AInventoryDebugMenu");
static_assert(sizeof(AInventoryDebugMenu) == 0x000540, "Wrong size on AInventoryDebugMenu");
static_assert(offsetof(AInventoryDebugMenu, MonitoredActor) == 0x0004B8, "Member 'AInventoryDebugMenu::MonitoredActor' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, ServerDebugSnapshot) == 0x0004C0, "Member 'AInventoryDebugMenu::ServerDebugSnapshot' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, ServerDebugSnapshot_FortInventory) == 0x0004F0, "Member 'AInventoryDebugMenu::ServerDebugSnapshot_FortInventory' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, SelectedInventoryIndex) == 0x000538, "Member 'AInventoryDebugMenu::SelectedInventoryIndex' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, bDisplayClient) == 0x00053C, "Member 'AInventoryDebugMenu::bDisplayClient' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, bDisplayServer) == 0x00053D, "Member 'AInventoryDebugMenu::bDisplayServer' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, bDisplayFortInventories) == 0x00053E, "Member 'AInventoryDebugMenu::bDisplayFortInventories' has a wrong offset!");
static_assert(offsetof(AInventoryDebugMenu, bDisplayInventoryCollections) == 0x00053F, "Member 'AInventoryDebugMenu::bDisplayInventoryCollections' has a wrong offset!");

// Class ItemizationRuntime.ItemGamePickup
// 0x0008 (0x02C0 - 0x02B8)
class AItemGamePickup final : public AItemPickup
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemGamePickup">();
	}
	static class AItemGamePickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemGamePickup>();
	}
};
static_assert(alignof(AItemGamePickup) == 0x000008, "Wrong alignment on AItemGamePickup");
static_assert(sizeof(AItemGamePickup) == 0x0002C0, "Wrong size on AItemGamePickup");

}

