#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopRefreshTimerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopRefreshTimerButton.ItemShopRefreshTimerButton_C
// 0x0020 (0x15A0 - 0x1580)
class UItemShopRefreshTimerButton_C final : public UAthenaItemShopRefreshTimerButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Timerimage;                                        // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ItemShopRefreshTimerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopRefreshTimerButton_C">();
	}
	static class UItemShopRefreshTimerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopRefreshTimerButton_C>();
	}
};
static_assert(alignof(UItemShopRefreshTimerButton_C) == 0x000010, "Wrong alignment on UItemShopRefreshTimerButton_C");
static_assert(sizeof(UItemShopRefreshTimerButton_C) == 0x0015A0, "Wrong size on UItemShopRefreshTimerButton_C");
static_assert(offsetof(UItemShopRefreshTimerButton_C, UberGraphFrame) == 0x001580, "Member 'UItemShopRefreshTimerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopRefreshTimerButton_C, Hover) == 0x001588, "Member 'UItemShopRefreshTimerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UItemShopRefreshTimerButton_C, Timerimage) == 0x001590, "Member 'UItemShopRefreshTimerButton_C::Timerimage' has a wrong offset!");

}

