#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JackalVehicle_Hoverboard_Base_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct JackalVehicle_Hoverboard_Base_AnimBP.JackalVehicle_Hoverboard_Base_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x1F3F (0x1F40 - 0x0001)
struct JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1174;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1175;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1176;                               // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1177;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1178;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1179;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1180;                              // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1181;                              // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1182;                              // 0x0040(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1183;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1184;                              // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1185;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1186;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1187;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1188;                              // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1189;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1190;                              // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1191;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1192;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1193;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1194;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1195;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1196;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1197;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1198;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1199;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1200;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1201;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1202;                              // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1203;                               // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1204;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1205;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1206;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1207;                               // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1208;                                // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1209;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1210;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1211;                              // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1212;                              // 0x0100(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1213;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1214;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1215;                               // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1216;                              // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1217;                             // 0x0120(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1218;                              // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1219;                               // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1220;                               // 0x0151(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1221;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1222;                             // 0x0158(0x0018)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_1223;                               // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1224;                                 // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1225;                               // 0x0180(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1226;                               // 0x0181(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1227;                               // 0x0182(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1228;                              // 0x0188(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0198(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0218(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_38;                 // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_37;                 // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_36;                 // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;                 // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;                 // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;                 // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;                 // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;                 // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;                 // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;                 // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_41;                   // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_40;                   // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_3;                   // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_26;                      // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_39;                   // 0x0500(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_25;                      // 0x0530(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_38;                   // 0x0560(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_2;                   // 0x0590(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_37;                   // 0x05C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_24;                      // 0x05F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_36;                   // 0x0620(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_35;                   // 0x0650(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_34;                   // 0x0680(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_33;                   // 0x06B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_32;                   // 0x06E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_14;                  // 0x0710(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_13;                  // 0x0740(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_12;                  // 0x0770(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_11;                  // 0x07A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_31;                   // 0x07D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_30;                   // 0x0800(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_29;                   // 0x0830(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;                   // 0x0860(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_23;                      // 0x0890(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;                  // 0x08C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_28;                   // 0x08F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;                     // 0x0920(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_22;                      // 0x0950(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;                      // 0x0980(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;                     // 0x09B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;                  // 0x09E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_10;                  // 0x0A10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;                    // 0x0A40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                     // 0x0A70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                     // 0x0AA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                     // 0x0AD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x0B00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_27;                   // 0x0B30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x0B60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_9;                   // 0x0B90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_26;                   // 0x0BC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;                   // 0x0BF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_25;                   // 0x0C20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                         // 0x0C50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;                    // 0x0C80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;                 // 0x0CB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;                 // 0x0CE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;                 // 0x0D10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;                 // 0x0D40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;                 // 0x0D70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;                 // 0x0DA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;                 // 0x0DD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_24;                   // 0x0E00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_21;                      // 0x0E30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;                 // 0x0E60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;                 // 0x0E90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;                 // 0x0EC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;                 // 0x0EF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;                 // 0x0F20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;                 // 0x0F50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;                 // 0x0F80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                     // 0x0FB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_20;                      // 0x0FE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_23;                   // 0x1010(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;                   // 0x1040(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;                   // 0x1070(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;                   // 0x10A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;                   // 0x10D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_19;                      // 0x1100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;                   // 0x1130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;                      // 0x1160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;                   // 0x1190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;                   // 0x11C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;                   // 0x11F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;                   // 0x1220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;                   // 0x1250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;                      // 0x1280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;                   // 0x12B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x12E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;                   // 0x1310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x1340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;                   // 0x1370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;                      // 0x13A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;                      // 0x13D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;                      // 0x1400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x1430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;                      // 0x1460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                      // 0x1490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;                      // 0x14C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;                 // 0x14F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;                 // 0x1520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;                 // 0x1550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;                 // 0x1580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;                 // 0x15B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;                  // 0x15E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;                  // 0x1610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;                  // 0x1640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;                   // 0x1670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;                      // 0x16A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;                   // 0x16D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;                      // 0x1700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;                   // 0x1730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                      // 0x1760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;                   // 0x1790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                       // 0x17C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x17F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                       // 0x1820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                      // 0x1850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                       // 0x1880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                      // 0x18B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;                    // 0x18E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x1910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x1940(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;                    // 0x1970(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x19A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;                    // 0x19D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;                  // 0x1A00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x1A30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x1A60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x1A90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                       // 0x1AC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x1AF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                       // 0x1B20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x1B50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x1B80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                      // 0x1BB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x1BE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x1C10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x1C40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x1C70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x1CA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x1CD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x1D00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x1D30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x1D60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x1D90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x1DC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x1DF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                     // 0x1E20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x1E50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x1E80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x1EB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x1EE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x1F10(0x0030)()
};
static_assert(alignof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x001F40, "Wrong size on JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1174) == 0x000004, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1174' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1175) == 0x000008, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1175' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1176) == 0x00000C, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1176' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1177) == 0x000010, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1177' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1178) == 0x000014, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1178' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1179) == 0x000018, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1179' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1180) == 0x000020, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1180' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1181) == 0x000030, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1181' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1182) == 0x000040, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1182' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1183) == 0x000050, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1183' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1184) == 0x000058, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1184' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1185) == 0x000068, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1185' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1186) == 0x00006C, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1186' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1187) == 0x000070, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1187' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1188) == 0x000074, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1188' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1189) == 0x000078, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1189' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1190) == 0x000080, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1190' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1191) == 0x000090, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1191' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1192) == 0x000094, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1192' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1193) == 0x000098, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1193' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1194) == 0x00009C, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1194' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1195) == 0x0000A0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1195' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1196) == 0x0000A4, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1196' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1197) == 0x0000A8, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1197' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1198) == 0x0000AC, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1198' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1199) == 0x0000B0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1199' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1200) == 0x0000B4, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1200' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1201) == 0x0000B8, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1201' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1202) == 0x0000C0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1202' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1203) == 0x0000D0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1203' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1204) == 0x0000D4, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1204' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1205) == 0x0000D8, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1205' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1206) == 0x0000DC, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1206' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1207) == 0x0000E0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1207' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1208) == 0x0000E4, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1208' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1209) == 0x0000E8, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1209' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1210) == 0x0000EC, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1210' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1211) == 0x0000F0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1211' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1212) == 0x000100, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1212' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1213) == 0x000110, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1213' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1214) == 0x000114, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1214' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1215) == 0x000118, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1215' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1216) == 0x00011C, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1216' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1217) == 0x000120, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1217' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1218) == 0x00014C, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1218' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1219) == 0x000150, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1219' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1220) == 0x000151, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1220' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1221) == 0x000154, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1221' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1222) == 0x000158, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1222' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1223) == 0x000170, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1223' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1224) == 0x000178, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1224' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1225) == 0x000180, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1225' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1226) == 0x000181, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1226' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1227) == 0x000182, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1227' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1228) == 0x000188, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1228' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000198, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000218, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000230, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_38) == 0x000260, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_38' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_37) == 0x000290, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_37' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_36) == 0x0002C0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_36' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_35) == 0x0002F0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_35' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_34) == 0x000320, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_34' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_33) == 0x000350, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_33' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_32) == 0x000380, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_32' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_31) == 0x0003B0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_31' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_30) == 0x0003E0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_30' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_29) == 0x000410, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_29' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_41) == 0x000440, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_41' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_40) == 0x000470, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_40' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_3) == 0x0004A0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_26) == 0x0004D0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_26' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_39) == 0x000500, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_39' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_25) == 0x000530, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_25' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_38) == 0x000560, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_38' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_2) == 0x000590, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_37) == 0x0005C0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_37' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_24) == 0x0005F0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_24' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_36) == 0x000620, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_36' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_35) == 0x000650, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_35' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_34) == 0x000680, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_34' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_33) == 0x0006B0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_33' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_32) == 0x0006E0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_32' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_14) == 0x000710, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_14' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_13) == 0x000740, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_13' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_12) == 0x000770, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_12' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_11) == 0x0007A0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_11' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_31) == 0x0007D0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_31' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_30) == 0x000800, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_30' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_29) == 0x000830, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_29' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_1) == 0x000860, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_23) == 0x000890, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_23' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_3) == 0x0008C0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_28) == 0x0008F0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_28' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_4) == 0x000920, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_22) == 0x000950, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_22' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_6) == 0x000980, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_6' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_3) == 0x0009B0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_2) == 0x0009E0, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_10) == 0x000A10, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_10' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000A40, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_2) == 0x000A70, "Member 'JackalVehicle_Hoverboard_Base_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
