#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "DeltaFileSystem_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CraftingRuntime_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteAI_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "SpatialMetricsCore_classes.hpp"
#include "EnergyRuntime_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MeshNetwork_classes.hpp"
#include "WorldConditions_classes.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "SoundLibrary_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "GameplayGraph_structs.hpp"
#include "FortGameplayGraph_structs.hpp"
#include "FortImGuiCore_classes.hpp"


namespace SDK
{

// Class JunoGameNative.FortAutomationRpcManager_Juno
// 0x0050 (0x00A8 - 0x0058)
class UFortAutomationRpcManager_Juno final : public UFortAutomationRpcManager
{
public:
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAutomationRpcManager_Juno">();
	}
	static class UFortAutomationRpcManager_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAutomationRpcManager_Juno>();
	}
};
static_assert(alignof(UFortAutomationRpcManager_Juno) == 0x000008, "Wrong alignment on UFortAutomationRpcManager_Juno");
static_assert(sizeof(UFortAutomationRpcManager_Juno) == 0x0000A8, "Wrong size on UFortAutomationRpcManager_Juno");

// Class JunoGameNative.JunoPassiveCraftingAnalyticsComponent
// 0x0048 (0x00E8 - 0x00A0)
class UJunoPassiveCraftingAnalyticsComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoPassiveCraftingItemAndCount       AccumulatedItem;                                   // 0x00A8(0x0010)(SaveGame, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FJunoPassiveCraftingContributorAnalytics> AccumulatedContributors;                           // 0x00B8(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	TArray<struct FJunoPassiveCraftingItemAndCount> AccumulatedIngredients;                            // 0x00C8(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	class FName                                   Recipe;                                            // 0x00D8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AccumulatedCraftingTime;                           // 0x00E0(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPassiveCraftingAnalyticsComponent">();
	}
	static class UJunoPassiveCraftingAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveCraftingAnalyticsComponent>();
	}
};
static_assert(alignof(UJunoPassiveCraftingAnalyticsComponent) == 0x000008, "Wrong alignment on UJunoPassiveCraftingAnalyticsComponent");
static_assert(sizeof(UJunoPassiveCraftingAnalyticsComponent) == 0x0000E8, "Wrong size on UJunoPassiveCraftingAnalyticsComponent");
static_assert(offsetof(UJunoPassiveCraftingAnalyticsComponent, AccumulatedItem) == 0x0000A8, "Member 'UJunoPassiveCraftingAnalyticsComponent::AccumulatedItem' has a wrong offset!");
static_assert(offsetof(UJunoPassiveCraftingAnalyticsComponent, AccumulatedContributors) == 0x0000B8, "Member 'UJunoPassiveCraftingAnalyticsComponent::AccumulatedContributors' has a wrong offset!");
static_assert(offsetof(UJunoPassiveCraftingAnalyticsComponent, AccumulatedIngredients) == 0x0000C8, "Member 'UJunoPassiveCraftingAnalyticsComponent::AccumulatedIngredients' has a wrong offset!");
static_assert(offsetof(UJunoPassiveCraftingAnalyticsComponent, Recipe) == 0x0000D8, "Member 'UJunoPassiveCraftingAnalyticsComponent::Recipe' has a wrong offset!");
static_assert(offsetof(UJunoPassiveCraftingAnalyticsComponent, AccumulatedCraftingTime) == 0x0000E0, "Member 'UJunoPassiveCraftingAnalyticsComponent::AccumulatedCraftingTime' has a wrong offset!");

// Class JunoGameNative.FortQueryGenerator_PointsOutsideVolume
// 0x0078 (0x0100 - 0x0088)
class UFortQueryGenerator_PointsOutsideVolume final : public UEnvQueryGenerator_ProjectedPoints
{
public:
	struct FAIDataProviderFloatValue              SpaceBetween;                                      // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAIDataProviderFloatValue              NumberOfRingsAroundVolume;                         // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext>           GenerateInVolume;                                  // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryGenerator_PointsOutsideVolume">();
	}
	static class UFortQueryGenerator_PointsOutsideVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_PointsOutsideVolume>();
	}
};
static_assert(alignof(UFortQueryGenerator_PointsOutsideVolume) == 0x000008, "Wrong alignment on UFortQueryGenerator_PointsOutsideVolume");
static_assert(sizeof(UFortQueryGenerator_PointsOutsideVolume) == 0x000100, "Wrong size on UFortQueryGenerator_PointsOutsideVolume");
static_assert(offsetof(UFortQueryGenerator_PointsOutsideVolume, SpaceBetween) == 0x000088, "Member 'UFortQueryGenerator_PointsOutsideVolume::SpaceBetween' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_PointsOutsideVolume, NumberOfRingsAroundVolume) == 0x0000C0, "Member 'UFortQueryGenerator_PointsOutsideVolume::NumberOfRingsAroundVolume' has a wrong offset!");
static_assert(offsetof(UFortQueryGenerator_PointsOutsideVolume, GenerateInVolume) == 0x0000F8, "Member 'UFortQueryGenerator_PointsOutsideVolume::GenerateInVolume' has a wrong offset!");

// Class JunoGameNative.JunoBuildingTrackedActorInterface
// 0x0000 (0x0028 - 0x0028)
class IJunoBuildingTrackedActorInterface final : public IInterface
{
public:
	float GetNetRelevanceDistanceOverride() const;
	int32 GetNumberOfRelevantActors() const;
	bool ShouldBeTrackedByMetrics() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingTrackedActorInterface">();
	}
	static class IJunoBuildingTrackedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuildingTrackedActorInterface>();
	}
};
static_assert(alignof(IJunoBuildingTrackedActorInterface) == 0x000008, "Wrong alignment on IJunoBuildingTrackedActorInterface");
static_assert(sizeof(IJunoBuildingTrackedActorInterface) == 0x000028, "Wrong size on IJunoBuildingTrackedActorInterface");

// Class JunoGameNative.JunoPickup
// 0x0008 (0x07C0 - 0x07B8)
class AJunoPickup final : public AFortPickupAthena
{
public:
	float                                         MaxDropTossSpeed;                                  // 0x07B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPickup">();
	}
	static class AJunoPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPickup>();
	}
};
static_assert(alignof(AJunoPickup) == 0x000008, "Wrong alignment on AJunoPickup");
static_assert(sizeof(AJunoPickup) == 0x0007C0, "Wrong size on AJunoPickup");
static_assert(offsetof(AJunoPickup, MaxDropTossSpeed) == 0x0007B8, "Member 'AJunoPickup::MaxDropTossSpeed' has a wrong offset!");

// Class JunoGameNative.JunoAbility_PlayerPushPhysicsObject
// 0x0130 (0x0C90 - 0x0B60)
class UJunoAbility_PlayerPushPhysicsObject final : public UFortGameplayAbility
{
public:
	EFortPhysicsSimSize                           MaxPhysicsObjectSizeToPush;                        // 0x0B60(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           MinPhysicsObjectSizeToPush;                        // 0x0B61(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B62[0x6];                                      // 0x0B62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NoTagsPusher;                                      // 0x0B68(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  NoTagsPushedObject;                                // 0x0B88(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           DefaultPushMontage;                                // 0x0BA8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPushMontageData>               SpecializedPushMontages;                           // 0x0BB0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      EnergyComponentQuery;                              // 0x0BC0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyInitialCost;                                 // 0x0C08(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyDrainPerSecond;                              // 0x0C30(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bEnergyExhausted;                                  // 0x0C58(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C59[0x3];                                      // 0x0C59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortComponent_Energy>   CachedEnergyComponent;                             // 0x0C5C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C64[0xC];                                      // 0x0C64(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  TrackedObjectToPush;                               // 0x0C70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           TrackedObjectSimSize;                              // 0x0C78(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C79[0x17];                                     // 0x0C79(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelPushingPhysicsObject();
	void OnEnergyDrained(class UFortComponent_Energy* EnergyComponentDrained);
	void OnEnergyFullyRecharged(class UFortComponent_Energy* EnergyComponentRecharged);
	void OnPlayerHit(class AActor* HitPlayer, class AActor* HitActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void PotentiallyStartUsingEnergy();
	void StopUsingEnergy();

	class UAnimMontage* GetMontageToPlay() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAbility_PlayerPushPhysicsObject">();
	}
	static class UJunoAbility_PlayerPushPhysicsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAbility_PlayerPushPhysicsObject>();
	}
};
static_assert(alignof(UJunoAbility_PlayerPushPhysicsObject) == 0x000008, "Wrong alignment on UJunoAbility_PlayerPushPhysicsObject");
static_assert(sizeof(UJunoAbility_PlayerPushPhysicsObject) == 0x000C90, "Wrong size on UJunoAbility_PlayerPushPhysicsObject");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, MaxPhysicsObjectSizeToPush) == 0x000B60, "Member 'UJunoAbility_PlayerPushPhysicsObject::MaxPhysicsObjectSizeToPush' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, MinPhysicsObjectSizeToPush) == 0x000B61, "Member 'UJunoAbility_PlayerPushPhysicsObject::MinPhysicsObjectSizeToPush' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, NoTagsPusher) == 0x000B68, "Member 'UJunoAbility_PlayerPushPhysicsObject::NoTagsPusher' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, NoTagsPushedObject) == 0x000B88, "Member 'UJunoAbility_PlayerPushPhysicsObject::NoTagsPushedObject' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, DefaultPushMontage) == 0x000BA8, "Member 'UJunoAbility_PlayerPushPhysicsObject::DefaultPushMontage' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, SpecializedPushMontages) == 0x000BB0, "Member 'UJunoAbility_PlayerPushPhysicsObject::SpecializedPushMontages' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, EnergyComponentQuery) == 0x000BC0, "Member 'UJunoAbility_PlayerPushPhysicsObject::EnergyComponentQuery' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, EnergyInitialCost) == 0x000C08, "Member 'UJunoAbility_PlayerPushPhysicsObject::EnergyInitialCost' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, EnergyDrainPerSecond) == 0x000C30, "Member 'UJunoAbility_PlayerPushPhysicsObject::EnergyDrainPerSecond' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, bEnergyExhausted) == 0x000C58, "Member 'UJunoAbility_PlayerPushPhysicsObject::bEnergyExhausted' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, CachedEnergyComponent) == 0x000C5C, "Member 'UJunoAbility_PlayerPushPhysicsObject::CachedEnergyComponent' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, TrackedObjectToPush) == 0x000C70, "Member 'UJunoAbility_PlayerPushPhysicsObject::TrackedObjectToPush' has a wrong offset!");
static_assert(offsetof(UJunoAbility_PlayerPushPhysicsObject, TrackedObjectSimSize) == 0x000C78, "Member 'UJunoAbility_PlayerPushPhysicsObject::TrackedObjectSimSize' has a wrong offset!");

// Class JunoGameNative.JunoAccountItemDefinitionOverrideManager
// 0x0168 (0x0190 - 0x0028)
class UJunoAccountItemDefinitionOverrideManager : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          JunoHeroDefinition;                                // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             DefaultCharacters;                                 // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, TSoftClassPtr<class UClass>> PreviewActorClasses;                               // 0x0040(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagParentsToRemoveFromOverrides;           // 0x0090(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagsToAdd;                                 // 0x00E0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, struct FJunoAccountItemDefinitionOverride> Overrides;                                         // 0x0130(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAccountItemDefinitionOverrideManager">();
	}
	static class UJunoAccountItemDefinitionOverrideManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemDefinitionOverrideManager>();
	}
};
static_assert(alignof(UJunoAccountItemDefinitionOverrideManager) == 0x000008, "Wrong alignment on UJunoAccountItemDefinitionOverrideManager");
static_assert(sizeof(UJunoAccountItemDefinitionOverrideManager) == 0x000190, "Wrong size on UJunoAccountItemDefinitionOverrideManager");
static_assert(offsetof(UJunoAccountItemDefinitionOverrideManager, JunoHeroDefinition) == 0x000030, "Member 'UJunoAccountItemDefinitionOverrideManager::JunoHeroDefinition' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemDefinitionOverrideManager, DefaultCharacters) == 0x000038, "Member 'UJunoAccountItemDefinitionOverrideManager::DefaultCharacters' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemDefinitionOverrideManager, PreviewActorClasses) == 0x000040, "Member 'UJunoAccountItemDefinitionOverrideManager::PreviewActorClasses' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemDefinitionOverrideManager, GameplayTagParentsToRemoveFromOverrides) == 0x000090, "Member 'UJunoAccountItemDefinitionOverrideManager::GameplayTagParentsToRemoveFromOverrides' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemDefinitionOverrideManager, GameplayTagsToAdd) == 0x0000E0, "Member 'UJunoAccountItemDefinitionOverrideManager::GameplayTagsToAdd' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemDefinitionOverrideManager, Overrides) == 0x000130, "Member 'UJunoAccountItemDefinitionOverrideManager::Overrides' has a wrong offset!");

// Class JunoGameNative.JunoPassiveResourcesGatheringComponent
// 0x00D8 (0x0178 - 0x00A0)
class UJunoPassiveResourcesGatheringComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPassiveResourcesGatheringRowRuntime> ActiveGatheringRows;                               // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AActor* GeneratingActor, int32 GeneratedItemsCount, bool bIsRuntime)> OnPassiveResourceGeneratedDelegate;                // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x28];                                      // 0x00E8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      MatchingRolesQuery;                                // 0x0110(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FDataTableRowHandle>            GatheringRows;                                     // 0x0158(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    SimulationConfigurationRow;                        // 0x0168(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	bool OverrideGatheringRow(const struct FDataTableRowHandle& GatheringRow);
	void RemoveGatheringRowOverride();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPassiveResourcesGatheringComponent">();
	}
	static class UJunoPassiveResourcesGatheringComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPassiveResourcesGatheringComponent>();
	}
};
static_assert(alignof(UJunoPassiveResourcesGatheringComponent) == 0x000008, "Wrong alignment on UJunoPassiveResourcesGatheringComponent");
static_assert(sizeof(UJunoPassiveResourcesGatheringComponent) == 0x000178, "Wrong size on UJunoPassiveResourcesGatheringComponent");
static_assert(offsetof(UJunoPassiveResourcesGatheringComponent, ActiveGatheringRows) == 0x0000C8, "Member 'UJunoPassiveResourcesGatheringComponent::ActiveGatheringRows' has a wrong offset!");
static_assert(offsetof(UJunoPassiveResourcesGatheringComponent, OnPassiveResourceGeneratedDelegate) == 0x0000D8, "Member 'UJunoPassiveResourcesGatheringComponent::OnPassiveResourceGeneratedDelegate' has a wrong offset!");
static_assert(offsetof(UJunoPassiveResourcesGatheringComponent, MatchingRolesQuery) == 0x000110, "Member 'UJunoPassiveResourcesGatheringComponent::MatchingRolesQuery' has a wrong offset!");
static_assert(offsetof(UJunoPassiveResourcesGatheringComponent, GatheringRows) == 0x000158, "Member 'UJunoPassiveResourcesGatheringComponent::GatheringRows' has a wrong offset!");
static_assert(offsetof(UJunoPassiveResourcesGatheringComponent, SimulationConfigurationRow) == 0x000168, "Member 'UJunoPassiveResourcesGatheringComponent::SimulationConfigurationRow' has a wrong offset!");

// Class JunoGameNative.JunoAccountItemOverrideDefinition
// 0x0078 (0x00A8 - 0x0030)
class UJunoAccountItemOverrideDefinition : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  GameplayTagsToAdd;                                 // 0x0030(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverrideFrontendTransform;                        // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrontendPreviewScale;                              // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FrontendPreviewPivotOffset;                        // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               FrontendPreviewInitialRotation;                    // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   PreviewActorClass;                                 // 0x0088(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAccountItemOverrideDefinition">();
	}
	static class UJunoAccountItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemOverrideDefinition>();
	}
};
static_assert(alignof(UJunoAccountItemOverrideDefinition) == 0x000008, "Wrong alignment on UJunoAccountItemOverrideDefinition");
static_assert(sizeof(UJunoAccountItemOverrideDefinition) == 0x0000A8, "Wrong size on UJunoAccountItemOverrideDefinition");
static_assert(offsetof(UJunoAccountItemOverrideDefinition, GameplayTagsToAdd) == 0x000030, "Member 'UJunoAccountItemOverrideDefinition::GameplayTagsToAdd' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemOverrideDefinition, bOverrideFrontendTransform) == 0x000050, "Member 'UJunoAccountItemOverrideDefinition::bOverrideFrontendTransform' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemOverrideDefinition, FrontendPreviewScale) == 0x000054, "Member 'UJunoAccountItemOverrideDefinition::FrontendPreviewScale' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemOverrideDefinition, FrontendPreviewPivotOffset) == 0x000058, "Member 'UJunoAccountItemOverrideDefinition::FrontendPreviewPivotOffset' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemOverrideDefinition, FrontendPreviewInitialRotation) == 0x000070, "Member 'UJunoAccountItemOverrideDefinition::FrontendPreviewInitialRotation' has a wrong offset!");
static_assert(offsetof(UJunoAccountItemOverrideDefinition, PreviewActorClass) == 0x000088, "Member 'UJunoAccountItemOverrideDefinition::PreviewActorClass' has a wrong offset!");

// Class JunoGameNative.JunoAthenaCharacterItemOverrideDefinition
// 0x0088 (0x0130 - 0x00A8)
class UJunoAthenaCharacterItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> BaseAthenaCharacterItemDefinition;                 // 0x00A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    AssembledMeshSchema;                               // 0x00C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    LowDetailsAssembledMeshSchema;                     // 0x00E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontendAnimMontageIdleOverride;                   // 0x0108(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviewPawnScale;                                  // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseAthenaCharacterItemDefinition(TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAthenaCharacterItemOverrideDefinition">();
	}
	static class UJunoAthenaCharacterItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaCharacterItemOverrideDefinition>();
	}
};
static_assert(alignof(UJunoAthenaCharacterItemOverrideDefinition) == 0x000008, "Wrong alignment on UJunoAthenaCharacterItemOverrideDefinition");
static_assert(sizeof(UJunoAthenaCharacterItemOverrideDefinition) == 0x000130, "Wrong size on UJunoAthenaCharacterItemOverrideDefinition");
static_assert(offsetof(UJunoAthenaCharacterItemOverrideDefinition, BaseAthenaCharacterItemDefinition) == 0x0000A8, "Member 'UJunoAthenaCharacterItemOverrideDefinition::BaseAthenaCharacterItemDefinition' has a wrong offset!");
static_assert(offsetof(UJunoAthenaCharacterItemOverrideDefinition, AssembledMeshSchema) == 0x0000C8, "Member 'UJunoAthenaCharacterItemOverrideDefinition::AssembledMeshSchema' has a wrong offset!");
static_assert(offsetof(UJunoAthenaCharacterItemOverrideDefinition, LowDetailsAssembledMeshSchema) == 0x0000E8, "Member 'UJunoAthenaCharacterItemOverrideDefinition::LowDetailsAssembledMeshSchema' has a wrong offset!");
static_assert(offsetof(UJunoAthenaCharacterItemOverrideDefinition, FrontendAnimMontageIdleOverride) == 0x000108, "Member 'UJunoAthenaCharacterItemOverrideDefinition::FrontendAnimMontageIdleOverride' has a wrong offset!");
static_assert(offsetof(UJunoAthenaCharacterItemOverrideDefinition, PreviewPawnScale) == 0x000128, "Member 'UJunoAthenaCharacterItemOverrideDefinition::PreviewPawnScale' has a wrong offset!");

// Class JunoGameNative.JunoMutator_AutoPickup
// 0x0020 (0x0358 - 0x0338)
class AJunoMutator_AutoPickup final : public AFortAthenaMutator
{
public:
	struct FGameplayTagContainer                  DoNotAutoPickupGameplayTags;                       // 0x0338(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMutator_AutoPickup">();
	}
	static class AJunoMutator_AutoPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoMutator_AutoPickup>();
	}
};
static_assert(alignof(AJunoMutator_AutoPickup) == 0x000008, "Wrong alignment on AJunoMutator_AutoPickup");
static_assert(sizeof(AJunoMutator_AutoPickup) == 0x000358, "Wrong size on AJunoMutator_AutoPickup");
static_assert(offsetof(AJunoMutator_AutoPickup, DoNotAutoPickupGameplayTags) == 0x000338, "Member 'AJunoMutator_AutoPickup::DoNotAutoPickupGameplayTags' has a wrong offset!");

// Class JunoGameNative.JunoAthenaDanceItemOverrideDefinition
// 0x00E8 (0x0190 - 0x00A8)
class UJunoAthenaDanceItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	TSoftObjectPtr<class UAthenaDanceItemDefinition> BaseAthenaDanceItemDefinition;                     // 0x00A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x00C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            AnimationFemaleOverride;                           // 0x00E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              AnimationOverrides;                                // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimation;                                 // 0x0118(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimationFemaleOverride;                   // 0x0138(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              FrontEndAnimationOverrides;                        // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                GroupEmotePositionOffset;                          // 0x0168(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmotePositionOffsetTolerance;                 // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmoteFollowDistance;                          // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkForwardSpeed;                                  // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseAthenaDanceItemDefinition(TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAthenaDanceItemOverrideDefinition">();
	}
	static class UJunoAthenaDanceItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaDanceItemOverrideDefinition>();
	}
};
static_assert(alignof(UJunoAthenaDanceItemOverrideDefinition) == 0x000008, "Wrong alignment on UJunoAthenaDanceItemOverrideDefinition");
static_assert(sizeof(UJunoAthenaDanceItemOverrideDefinition) == 0x000190, "Wrong size on UJunoAthenaDanceItemOverrideDefinition");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, BaseAthenaDanceItemDefinition) == 0x0000A8, "Member 'UJunoAthenaDanceItemOverrideDefinition::BaseAthenaDanceItemDefinition' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, Animation) == 0x0000C8, "Member 'UJunoAthenaDanceItemOverrideDefinition::Animation' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, AnimationFemaleOverride) == 0x0000E8, "Member 'UJunoAthenaDanceItemOverrideDefinition::AnimationFemaleOverride' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, AnimationOverrides) == 0x000108, "Member 'UJunoAthenaDanceItemOverrideDefinition::AnimationOverrides' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, FrontEndAnimation) == 0x000118, "Member 'UJunoAthenaDanceItemOverrideDefinition::FrontEndAnimation' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, FrontEndAnimationFemaleOverride) == 0x000138, "Member 'UJunoAthenaDanceItemOverrideDefinition::FrontEndAnimationFemaleOverride' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, FrontEndAnimationOverrides) == 0x000158, "Member 'UJunoAthenaDanceItemOverrideDefinition::FrontEndAnimationOverrides' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, GroupEmotePositionOffset) == 0x000168, "Member 'UJunoAthenaDanceItemOverrideDefinition::GroupEmotePositionOffset' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, GroupEmotePositionOffsetTolerance) == 0x000180, "Member 'UJunoAthenaDanceItemOverrideDefinition::GroupEmotePositionOffsetTolerance' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, GroupEmoteFollowDistance) == 0x000184, "Member 'UJunoAthenaDanceItemOverrideDefinition::GroupEmoteFollowDistance' has a wrong offset!");
static_assert(offsetof(UJunoAthenaDanceItemOverrideDefinition, WalkForwardSpeed) == 0x000188, "Member 'UJunoAthenaDanceItemOverrideDefinition::WalkForwardSpeed' has a wrong offset!");

// Class JunoGameNative.JunoActionConfig
// 0x0010 (0x0038 - 0x0028)
class UJunoActionConfig : public UObject
{
public:
	TSubclassOf<class UJunoAction>                JunoActionClass;                                   // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoActionExecutionConfig                    JunoActionExecutionConfig;                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig">();
	}
	static class UJunoActionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig>();
	}
};
static_assert(alignof(UJunoActionConfig) == 0x000008, "Wrong alignment on UJunoActionConfig");
static_assert(sizeof(UJunoActionConfig) == 0x000038, "Wrong size on UJunoActionConfig");
static_assert(offsetof(UJunoActionConfig, JunoActionClass) == 0x000028, "Member 'UJunoActionConfig::JunoActionClass' has a wrong offset!");
static_assert(offsetof(UJunoActionConfig, JunoActionExecutionConfig) == 0x000030, "Member 'UJunoActionConfig::JunoActionExecutionConfig' has a wrong offset!");

// Class JunoGameNative.JunoPersistenceReportGenerator
// 0x0020 (0x0048 - 0x0028)
class UJunoPersistenceReportGenerator final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceReportGenerator">();
	}
	static class UJunoPersistenceReportGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPersistenceReportGenerator>();
	}
};
static_assert(alignof(UJunoPersistenceReportGenerator) == 0x000008, "Wrong alignment on UJunoPersistenceReportGenerator");
static_assert(sizeof(UJunoPersistenceReportGenerator) == 0x000048, "Wrong size on UJunoPersistenceReportGenerator");

// Class JunoGameNative.JunoActionConfig_StaticMesh
// 0x0008 (0x0040 - 0x0038)
class UJunoActionConfig_StaticMesh final : public UJunoActionConfig
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig_StaticMesh">();
	}
	static class UJunoActionConfig_StaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig_StaticMesh>();
	}
};
static_assert(alignof(UJunoActionConfig_StaticMesh) == 0x000008, "Wrong alignment on UJunoActionConfig_StaticMesh");
static_assert(sizeof(UJunoActionConfig_StaticMesh) == 0x000040, "Wrong size on UJunoActionConfig_StaticMesh");
static_assert(offsetof(UJunoActionConfig_StaticMesh, StaticMesh) == 0x000038, "Member 'UJunoActionConfig_StaticMesh::StaticMesh' has a wrong offset!");

// Class JunoGameNative.JunoActorAttributeOverrideComponent
// 0x0018 (0x00B8 - 0x00A0)
class UJunoActorAttributeOverrideComponent final : public UFortBuildingActorTagComponent
{
public:
	struct FDataRegistryType                      AttributeOverrideDataRegistry;                     // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryId                        DataRegistryItemId;                                // 0x00A4(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0xC];                                       // 0x00AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetPrimaryLootTier();
	class FName GetSecondaryLootTier();
	void SetupHealthAttributeSet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorAttributeOverrideComponent">();
	}
	static class UJunoActorAttributeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorAttributeOverrideComponent>();
	}
};
static_assert(alignof(UJunoActorAttributeOverrideComponent) == 0x000008, "Wrong alignment on UJunoActorAttributeOverrideComponent");
static_assert(sizeof(UJunoActorAttributeOverrideComponent) == 0x0000B8, "Wrong size on UJunoActorAttributeOverrideComponent");
static_assert(offsetof(UJunoActorAttributeOverrideComponent, AttributeOverrideDataRegistry) == 0x0000A0, "Member 'UJunoActorAttributeOverrideComponent::AttributeOverrideDataRegistry' has a wrong offset!");
static_assert(offsetof(UJunoActorAttributeOverrideComponent, DataRegistryItemId) == 0x0000A4, "Member 'UJunoActorAttributeOverrideComponent::DataRegistryItemId' has a wrong offset!");

// Class JunoGameNative.JunoPersistenceFeatureDataActor
// 0x0040 (0x02D0 - 0x0290)
class AJunoPersistenceFeatureDataActor : public AInfo
{
public:
	uint8                                         Pad_290[0x28];                                     // 0x0290(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x02B8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Version;                                           // 0x02C8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpawnedByLevelSaveRecord;                         // 0x02CC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceDirty;                                       // 0x02CD(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDirty;                                            // 0x02CE(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CF[0x1];                                      // 0x02CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPersistentDataModified();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceFeatureDataActor">();
	}
	static class AJunoPersistenceFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPersistenceFeatureDataActor>();
	}
};
static_assert(alignof(AJunoPersistenceFeatureDataActor) == 0x000008, "Wrong alignment on AJunoPersistenceFeatureDataActor");
static_assert(sizeof(AJunoPersistenceFeatureDataActor) == 0x0002D0, "Wrong size on AJunoPersistenceFeatureDataActor");
static_assert(offsetof(AJunoPersistenceFeatureDataActor, SavedActorGuid) == 0x0002B8, "Member 'AJunoPersistenceFeatureDataActor::SavedActorGuid' has a wrong offset!");
static_assert(offsetof(AJunoPersistenceFeatureDataActor, Version) == 0x0002C8, "Member 'AJunoPersistenceFeatureDataActor::Version' has a wrong offset!");
static_assert(offsetof(AJunoPersistenceFeatureDataActor, bSpawnedByLevelSaveRecord) == 0x0002CC, "Member 'AJunoPersistenceFeatureDataActor::bSpawnedByLevelSaveRecord' has a wrong offset!");
static_assert(offsetof(AJunoPersistenceFeatureDataActor, bForceDirty) == 0x0002CD, "Member 'AJunoPersistenceFeatureDataActor::bForceDirty' has a wrong offset!");
static_assert(offsetof(AJunoPersistenceFeatureDataActor, bDirty) == 0x0002CE, "Member 'AJunoPersistenceFeatureDataActor::bDirty' has a wrong offset!");

// Class JunoGameNative.JunoPlayspaceAccountantFeatureDataActor
// 0x0058 (0x0328 - 0x02D0)
class AJunoPlayspaceAccountantFeatureDataActor final : public AJunoPersistenceFeatureDataActor
{
public:
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      PersistentValueTable;                              // 0x02D8(0x0050)(SaveGame, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayspaceAccountantFeatureDataActor">();
	}
	static class AJunoPlayspaceAccountantFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPlayspaceAccountantFeatureDataActor>();
	}
};
static_assert(alignof(AJunoPlayspaceAccountantFeatureDataActor) == 0x000008, "Wrong alignment on AJunoPlayspaceAccountantFeatureDataActor");
static_assert(sizeof(AJunoPlayspaceAccountantFeatureDataActor) == 0x000328, "Wrong size on AJunoPlayspaceAccountantFeatureDataActor");
static_assert(offsetof(AJunoPlayspaceAccountantFeatureDataActor, PersistentValueTable) == 0x0002D8, "Member 'AJunoPlayspaceAccountantFeatureDataActor::PersistentValueTable' has a wrong offset!");

// Class JunoGameNative.JunoActorInstancesReportHandler
// 0x0028 (0x0050 - 0x0028)
class UJunoActorInstancesReportHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorInstancesReportHandler">();
	}
	static class UJunoActorInstancesReportHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorInstancesReportHandler>();
	}
};
static_assert(alignof(UJunoActorInstancesReportHandler) == 0x000008, "Wrong alignment on UJunoActorInstancesReportHandler");
static_assert(sizeof(UJunoActorInstancesReportHandler) == 0x000050, "Wrong size on UJunoActorInstancesReportHandler");

// Class JunoGameNative.JunoPlayerCampPawnComponent
// 0x0070 (0x0110 - 0x00A0)
class UJunoPlayerCampPawnComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x70];                                      // 0x00A0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& ChangeData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerCampPawnComponent">();
	}
	static class UJunoPlayerCampPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerCampPawnComponent>();
	}
};
static_assert(alignof(UJunoPlayerCampPawnComponent) == 0x000008, "Wrong alignment on UJunoPlayerCampPawnComponent");
static_assert(sizeof(UJunoPlayerCampPawnComponent) == 0x000110, "Wrong size on UJunoPlayerCampPawnComponent");

// Class JunoGameNative.JunoAIPersistenceFeatureDataActor
// 0x0130 (0x0400 - 0x02D0)
class AJunoAIPersistenceFeatureDataActor final : public AJunoPersistenceFeatureDataActor
{
public:
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedAIDataManager                    SavedAIData;                                       // 0x02E0(0x0120)(SaveGame, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureDataActor">();
	}
	static class AJunoAIPersistenceFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoAIPersistenceFeatureDataActor>();
	}
};
static_assert(alignof(AJunoAIPersistenceFeatureDataActor) == 0x000008, "Wrong alignment on AJunoAIPersistenceFeatureDataActor");
static_assert(sizeof(AJunoAIPersistenceFeatureDataActor) == 0x000400, "Wrong size on AJunoAIPersistenceFeatureDataActor");
static_assert(offsetof(AJunoAIPersistenceFeatureDataActor, SavedAIData) == 0x0002E0, "Member 'AJunoAIPersistenceFeatureDataActor::SavedAIData' has a wrong offset!");

// Class JunoGameNative.JunoAIPersistenceFeatureDataInterface
// 0x0000 (0x0028 - 0x0028)
class IJunoAIPersistenceFeatureDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureDataInterface">();
	}
	static class IJunoAIPersistenceFeatureDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoAIPersistenceFeatureDataInterface>();
	}
};
static_assert(alignof(IJunoAIPersistenceFeatureDataInterface) == 0x000008, "Wrong alignment on IJunoAIPersistenceFeatureDataInterface");
static_assert(sizeof(IJunoAIPersistenceFeatureDataInterface) == 0x000028, "Wrong size on IJunoAIPersistenceFeatureDataInterface");

// Class JunoGameNative.JunoPersistenceFeatureData
// 0x0000 (0x0028 - 0x0028)
class IJunoPersistenceFeatureData final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceFeatureData">();
	}
	static class IJunoPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoPersistenceFeatureData>();
	}
};
static_assert(alignof(IJunoPersistenceFeatureData) == 0x000008, "Wrong alignment on IJunoPersistenceFeatureData");
static_assert(sizeof(IJunoPersistenceFeatureData) == 0x000028, "Wrong size on IJunoPersistenceFeatureData");

// Class JunoGameNative.JunoAIPersistenceFeatureModule
// 0x0000 (0x00E0 - 0x00E0)
class UJunoAIPersistenceFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureModule">();
	}
	static class UJunoAIPersistenceFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureModule>();
	}
};
static_assert(alignof(UJunoAIPersistenceFeatureModule) == 0x000008, "Wrong alignment on UJunoAIPersistenceFeatureModule");
static_assert(sizeof(UJunoAIPersistenceFeatureModule) == 0x0000E0, "Wrong size on UJunoAIPersistenceFeatureModule");

// Class JunoGameNative.JunoBasePFWContainer
// 0x00A0 (0x01E0 - 0x0140)
class UJunoBasePFWContainer : public UPersistenceFrameworkContainer
{
public:
	uint8                                         Pad_140[0xA0];                                     // 0x0140(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWContainer">();
	}
	static class UJunoBasePFWContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWContainer>();
	}
};
static_assert(alignof(UJunoBasePFWContainer) == 0x000008, "Wrong alignment on UJunoBasePFWContainer");
static_assert(sizeof(UJunoBasePFWContainer) == 0x0001E0, "Wrong size on UJunoBasePFWContainer");

// Class JunoGameNative.JunoPlayerSaveData_Container
// 0x0068 (0x0248 - 0x01E0)
class UJunoPlayerSaveData_Container final : public UJunoBasePFWContainer
{
public:
	struct FPersistenceFrameworkPlayerInfo        PlayerInfo;                                        // 0x01E0(0x0020)(NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0200(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_230[0x18];                                     // 0x0230(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerSaveData_Container">();
	}
	static class UJunoPlayerSaveData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerSaveData_Container>();
	}
};
static_assert(alignof(UJunoPlayerSaveData_Container) == 0x000008, "Wrong alignment on UJunoPlayerSaveData_Container");
static_assert(sizeof(UJunoPlayerSaveData_Container) == 0x000248, "Wrong size on UJunoPlayerSaveData_Container");
static_assert(offsetof(UJunoPlayerSaveData_Container, PlayerInfo) == 0x0001E0, "Member 'UJunoPlayerSaveData_Container::PlayerInfo' has a wrong offset!");
static_assert(offsetof(UJunoPlayerSaveData_Container, PlayerNetId) == 0x000200, "Member 'UJunoPlayerSaveData_Container::PlayerNetId' has a wrong offset!");

// Class JunoGameNative.JunoBasePFWPersistenceFeatureDataContainer
// 0x0000 (0x01E0 - 0x01E0)
class UJunoBasePFWPersistenceFeatureDataContainer : public UJunoBasePFWContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWPersistenceFeatureDataContainer">();
	}
	static class UJunoBasePFWPersistenceFeatureDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWPersistenceFeatureDataContainer>();
	}
};
static_assert(alignof(UJunoBasePFWPersistenceFeatureDataContainer) == 0x000008, "Wrong alignment on UJunoBasePFWPersistenceFeatureDataContainer");
static_assert(sizeof(UJunoBasePFWPersistenceFeatureDataContainer) == 0x0001E0, "Wrong size on UJunoBasePFWPersistenceFeatureDataContainer");

// Class JunoGameNative.JunoAIPersistenceFeatureData_Container
// 0x0000 (0x01E0 - 0x01E0)
class UJunoAIPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureData_Container">();
	}
	static class UJunoAIPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureData_Container>();
	}
};
static_assert(alignof(UJunoAIPersistenceFeatureData_Container) == 0x000008, "Wrong alignment on UJunoAIPersistenceFeatureData_Container");
static_assert(sizeof(UJunoAIPersistenceFeatureData_Container) == 0x0001E0, "Wrong size on UJunoAIPersistenceFeatureData_Container");

// Class JunoGameNative.JunoQueryContext_Camp_Extents
// 0x0000 (0x0028 - 0x0028)
class UJunoQueryContext_Camp_Extents final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQueryContext_Camp_Extents">();
	}
	static class UJunoQueryContext_Camp_Extents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQueryContext_Camp_Extents>();
	}
};
static_assert(alignof(UJunoQueryContext_Camp_Extents) == 0x000008, "Wrong alignment on UJunoQueryContext_Camp_Extents");
static_assert(sizeof(UJunoQueryContext_Camp_Extents) == 0x000028, "Wrong size on UJunoQueryContext_Camp_Extents");

// Class JunoGameNative.JunoAlterationCraftingComponent
// 0x0010 (0x00B0 - 0x00A0)
class UJunoAlterationCraftingComponent final : public UGameFrameworkComponent
{
public:
	TWeakObjectPtr<class UCraftingObjectComponent> CachedCraftingObjectComponent;                     // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      WeaponEssenceDataRegistryType;                     // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCraftingStateChanged(const struct FCraftingObjectStateChangedEvent& Event);
	bool OnCheckValidItemType(class AFortPlayerController* Instigator);
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAlterationCraftingComponent">();
	}
	static class UJunoAlterationCraftingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAlterationCraftingComponent>();
	}
};
static_assert(alignof(UJunoAlterationCraftingComponent) == 0x000008, "Wrong alignment on UJunoAlterationCraftingComponent");
static_assert(sizeof(UJunoAlterationCraftingComponent) == 0x0000B0, "Wrong size on UJunoAlterationCraftingComponent");
static_assert(offsetof(UJunoAlterationCraftingComponent, CachedCraftingObjectComponent) == 0x0000A0, "Member 'UJunoAlterationCraftingComponent::CachedCraftingObjectComponent' has a wrong offset!");
static_assert(offsetof(UJunoAlterationCraftingComponent, WeaponEssenceDataRegistryType) == 0x0000A8, "Member 'UJunoAlterationCraftingComponent::WeaponEssenceDataRegistryType' has a wrong offset!");

// Class JunoGameNative.JunoAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnalytics">();
	}
	static class UJunoAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnalytics>();
	}
};
static_assert(alignof(UJunoAnalytics) == 0x000008, "Wrong alignment on UJunoAnalytics");
static_assert(sizeof(UJunoAnalytics) == 0x000028, "Wrong size on UJunoAnalytics");

// Class JunoGameNative.JunoPlayspaceAccountantPersistenceFeatureData_Container
// 0x0000 (0x01E0 - 0x01E0)
class UJunoPlayspaceAccountantPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayspaceAccountantPersistenceFeatureData_Container">();
	}
	static class UJunoPlayspaceAccountantPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayspaceAccountantPersistenceFeatureData_Container>();
	}
};
static_assert(alignof(UJunoPlayspaceAccountantPersistenceFeatureData_Container) == 0x000008, "Wrong alignment on UJunoPlayspaceAccountantPersistenceFeatureData_Container");
static_assert(sizeof(UJunoPlayspaceAccountantPersistenceFeatureData_Container) == 0x0001E0, "Wrong size on UJunoPlayspaceAccountantPersistenceFeatureData_Container");

// Class JunoGameNative.JunoAnimNotifyState_QueueInput
// 0x0068 (0x0098 - 0x0030)
class UJunoAnimNotifyState_QueueInput final : public UAnimNotifyState
{
public:
	bool                                          bQueueMantisInput;                                 // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayEventTagsToQueue;                          // 0x0038(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0058(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0078(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimNotifyState_QueueInput">();
	}
	static class UJunoAnimNotifyState_QueueInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_QueueInput>();
	}
};
static_assert(alignof(UJunoAnimNotifyState_QueueInput) == 0x000008, "Wrong alignment on UJunoAnimNotifyState_QueueInput");
