#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoFrontendUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "ModelViewViewModel_classes.hpp"


namespace SDK
{

// Class JunoFrontendUI.JunoFrontendExperienceFlow
// 0x00D0 (0x00F8 - 0x0028)
class UJunoFrontendExperienceFlow final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStreamMediaSource*                 VideoStream_Source;                                // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x0050(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         FlowStepArray;                                     // 0x0070(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bEnableTrailer;                                    // 0x0080(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CinematicTrailerVUID;                              // 0x0088(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CinematicTrailerString;                            // 0x0098(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CinematicTrailerRating;                            // 0x00A0(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoFrontendExperienceFlow">();
	}
	static class UJunoFrontendExperienceFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoFrontendExperienceFlow>();
	}
};
static_assert(alignof(UJunoFrontendExperienceFlow) == 0x000008, "Wrong alignment on UJunoFrontendExperienceFlow");
static_assert(sizeof(UJunoFrontendExperienceFlow) == 0x0000F8, "Wrong size on UJunoFrontendExperienceFlow");
static_assert(offsetof(UJunoFrontendExperienceFlow, VideoStream_Source) == 0x000048, "Member 'UJunoFrontendExperienceFlow::VideoStream_Source' has a wrong offset!");
static_assert(offsetof(UJunoFrontendExperienceFlow, VideoPlayerClass) == 0x000050, "Member 'UJunoFrontendExperienceFlow::VideoPlayerClass' has a wrong offset!");
static_assert(offsetof(UJunoFrontendExperienceFlow, FlowStepArray) == 0x000070, "Member 'UJunoFrontendExperienceFlow::FlowStepArray' has a wrong offset!");
static_assert(offsetof(UJunoFrontendExperienceFlow, bEnableTrailer) == 0x000080, "Member 'UJunoFrontendExperienceFlow::bEnableTrailer' has a wrong offset!");
static_assert(offsetof(UJunoFrontendExperienceFlow, CinematicTrailerVUID) == 0x000088, "Member 'UJunoFrontendExperienceFlow::CinematicTrailerVUID' has a wrong offset!");
static_assert(offsetof(UJunoFrontendExperienceFlow, CinematicTrailerString) == 0x000098, "Member 'UJunoFrontendExperienceFlow::CinematicTrailerString' has a wrong offset!");
static_assert(offsetof(UJunoFrontendExperienceFlow, CinematicTrailerRating) == 0x0000A0, "Member 'UJunoFrontendExperienceFlow::CinematicTrailerRating' has a wrong offset!");

// Class JunoFrontendUI.JunoMatchmakingUtilityExtension
// 0x0000 (0x0028 - 0x0028)
class UJunoMatchmakingUtilityExtension final : public UMatchmakingUtilityExtensionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMatchmakingUtilityExtension">();
	}
	static class UJunoMatchmakingUtilityExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMatchmakingUtilityExtension>();
	}
};
static_assert(alignof(UJunoMatchmakingUtilityExtension) == 0x000008, "Wrong alignment on UJunoMatchmakingUtilityExtension");
static_assert(sizeof(UJunoMatchmakingUtilityExtension) == 0x000028, "Wrong size on UJunoMatchmakingUtilityExtension");

// Class JunoFrontendUI.JunoMatchmakingWidgetExtension
// 0x0020 (0x0048 - 0x0028)
class UJunoMatchmakingWidgetExtension final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> GameSelectionOverride;                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                CustomHeadingWidget;                               // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayGameSelectionOnContentStack;               // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMatchmakingWidgetExtension">();
	}
	static class UJunoMatchmakingWidgetExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMatchmakingWidgetExtension>();
	}
};
static_assert(alignof(UJunoMatchmakingWidgetExtension) == 0x000008, "Wrong alignment on UJunoMatchmakingWidgetExtension");
static_assert(sizeof(UJunoMatchmakingWidgetExtension) == 0x000048, "Wrong size on UJunoMatchmakingWidgetExtension");
static_assert(offsetof(UJunoMatchmakingWidgetExtension, GameSelectionOverride) == 0x000030, "Member 'UJunoMatchmakingWidgetExtension::GameSelectionOverride' has a wrong offset!");
static_assert(offsetof(UJunoMatchmakingWidgetExtension, CustomHeadingWidget) == 0x000038, "Member 'UJunoMatchmakingWidgetExtension::CustomHeadingWidget' has a wrong offset!");
static_assert(offsetof(UJunoMatchmakingWidgetExtension, bDisplayGameSelectionOnContentStack) == 0x000040, "Member 'UJunoMatchmakingWidgetExtension::bDisplayGameSelectionOnContentStack' has a wrong offset!");

// Class JunoFrontendUI.JunoTabGroupButtonViewModel
// 0x0000 (0x0098 - 0x0098)
class UJunoTabGroupButtonViewModel final : public UUIKitTabGroupButtonViewModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTabGroupButtonViewModel">();
	}
	static class UJunoTabGroupButtonViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTabGroupButtonViewModel>();
	}
};
static_assert(alignof(UJunoTabGroupButtonViewModel) == 0x000008, "Wrong alignment on UJunoTabGroupButtonViewModel");
static_assert(sizeof(UJunoTabGroupButtonViewModel) == 0x000098, "Wrong size on UJunoTabGroupButtonViewModel");

// Class JunoFrontendUI.JunoWorldManagementViewModel
// 0x00E0 (0x0148 - 0x0068)
class UJunoWorldManagementViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bAllowWorldCreation;                               // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxWorldSlots;                                     // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModeratorModeEnabled;                           // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoWorldDataViewModel*>        OwnerWorlds;                                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldDataViewModel*>        SharedWorlds;                                      // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldDataViewModel*>        WorldSlots;                                        // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UJunoWorldDataViewModel*                SelectedWorld;                                     // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldDataViewModel*                EmptyWorld;                                        // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DataRefreshFrequency;                              // 0x00D8(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x54];                                      // 0x00DC(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             SettingDataTable;                                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UJunoWorldImageObject*>          WorldImageList;                                    // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void DisableDataRefresh();
	void EnableDataRefresh();
	void FetchWorldData();
	void InitWorldData(const TSoftObjectPtr<class UDataTable>& InSettingDataTable, const TSoftObjectPtr<class UDataTable>& InWorldImageDataTable);
	void RemoveSelectedWorldFromList();
	void StartMatchmakingInModeratorMode(const class FString& InWorldId);

	bool GetIsCreateFlowSelected() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldManagementViewModel">();
	}
	static class UJunoWorldManagementViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagementViewModel>();
	}
};
static_assert(alignof(UJunoWorldManagementViewModel) == 0x000008, "Wrong alignment on UJunoWorldManagementViewModel");
static_assert(sizeof(UJunoWorldManagementViewModel) == 0x000148, "Wrong size on UJunoWorldManagementViewModel");
static_assert(offsetof(UJunoWorldManagementViewModel, bAllowWorldCreation) == 0x000068, "Member 'UJunoWorldManagementViewModel::bAllowWorldCreation' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, MaxWorldSlots) == 0x00006C, "Member 'UJunoWorldManagementViewModel::MaxWorldSlots' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, bIsModeratorModeEnabled) == 0x000070, "Member 'UJunoWorldManagementViewModel::bIsModeratorModeEnabled' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, OwnerWorlds) == 0x000078, "Member 'UJunoWorldManagementViewModel::OwnerWorlds' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, SharedWorlds) == 0x000088, "Member 'UJunoWorldManagementViewModel::SharedWorlds' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, WorldSlots) == 0x000098, "Member 'UJunoWorldManagementViewModel::WorldSlots' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, SelectedWorld) == 0x0000A8, "Member 'UJunoWorldManagementViewModel::SelectedWorld' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, EmptyWorld) == 0x0000B0, "Member 'UJunoWorldManagementViewModel::EmptyWorld' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, DataRefreshFrequency) == 0x0000D8, "Member 'UJunoWorldManagementViewModel::DataRefreshFrequency' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, SettingDataTable) == 0x000130, "Member 'UJunoWorldManagementViewModel::SettingDataTable' has a wrong offset!");
static_assert(offsetof(UJunoWorldManagementViewModel, WorldImageList) == 0x000138, "Member 'UJunoWorldManagementViewModel::WorldImageList' has a wrong offset!");

}

