#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoLowMemoryFallbackRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function JunoLowMemoryFallbackRuntime.JunoLowMemoryFallbackPlayerControllerComponent.Server_TriggerStrategy
// 0x0008 (0x0008 - 0x0000)
struct JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy final
{
public:
	TSubclassOf<class ULowMemoryFallbackStrategy> StrategyClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy) == 0x000008, "Wrong alignment on JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy");
static_assert(sizeof(JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy) == 0x000008, "Wrong size on JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy");
static_assert(offsetof(JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy, StrategyClass) == 0x000000, "Member 'JunoLowMemoryFallbackPlayerControllerComponent_Server_TriggerStrategy::StrategyClass' has a wrong offset!");

// Function JunoLowMemoryFallbackRuntime.JunoLowMemoryFallbackPlayerControllerComponent.Server_UntriggerStrategy
// 0x0008 (0x0008 - 0x0000)
struct JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy final
{
public:
	TSubclassOf<class ULowMemoryFallbackStrategy> StrategyClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy) == 0x000008, "Wrong alignment on JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy");
static_assert(sizeof(JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy) == 0x000008, "Wrong size on JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy");
static_assert(offsetof(JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy, StrategyClass) == 0x000000, "Member 'JunoLowMemoryFallbackPlayerControllerComponent_Server_UntriggerStrategy::StrategyClass' has a wrong offset!");

}

