#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCraftingBaseUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum JunoCraftingBaseUI.EJunoRecipeSortType
// NumValues: 0x0004
enum class EJunoRecipeSortType : uint8
{
	BySet                                    = 0,
	ByName                                   = 1,
	BySortPriority                           = 2,
	MAX_None                                 = 3,
};

// ScriptStruct JunoCraftingBaseUI.JunoCraftingIngredientShopUIData
// 0x0020 (0x0068 - 0x0048)
struct FJunoCraftingIngredientShopUIData final : public FCraftingIngredientUIData
{
public:
	class FText                                   DisplayName;                                       // 0x0048(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EFortRarity                                   Rarity;                                            // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoCraftingIngredientShopUIData) == 0x000008, "Wrong alignment on FJunoCraftingIngredientShopUIData");
static_assert(sizeof(FJunoCraftingIngredientShopUIData) == 0x000068, "Wrong size on FJunoCraftingIngredientShopUIData");
static_assert(offsetof(FJunoCraftingIngredientShopUIData, DisplayName) == 0x000048, "Member 'FJunoCraftingIngredientShopUIData::DisplayName' has a wrong offset!");
static_assert(offsetof(FJunoCraftingIngredientShopUIData, Rarity) == 0x000060, "Member 'FJunoCraftingIngredientShopUIData::Rarity' has a wrong offset!");

// ScriptStruct JunoCraftingBaseUI.JunoCraftingHeaderUIDataEntry
// 0x0020 (0x0020 - 0x0000)
struct FJunoCraftingHeaderUIDataEntry final
{
public:
	struct FGameplayTag                           HeaderTag;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeaderText;                                        // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCraftingHeaderUIDataEntry) == 0x000008, "Wrong alignment on FJunoCraftingHeaderUIDataEntry");
static_assert(sizeof(FJunoCraftingHeaderUIDataEntry) == 0x000020, "Wrong size on FJunoCraftingHeaderUIDataEntry");
static_assert(offsetof(FJunoCraftingHeaderUIDataEntry, HeaderTag) == 0x000000, "Member 'FJunoCraftingHeaderUIDataEntry::HeaderTag' has a wrong offset!");
static_assert(offsetof(FJunoCraftingHeaderUIDataEntry, HeaderText) == 0x000008, "Member 'FJunoCraftingHeaderUIDataEntry::HeaderText' has a wrong offset!");

// ScriptStruct JunoCraftingBaseUI.JunoCraftingSubCategoryUIDataEntry
// 0x0060 (0x0060 - 0x0000)
struct FJunoCraftingSubCategoryUIDataEntry final
{
public:
	struct FGameplayTag                           CategoryTag;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CategoryIcon;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitle;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FJunoCraftingHeaderUIDataEntry> Headers;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<EJunoRecipeSortType>                   SortingPreferences;                                // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCraftingSubCategoryUIDataEntry) == 0x000008, "Wrong alignment on FJunoCraftingSubCategoryUIDataEntry");
static_assert(sizeof(FJunoCraftingSubCategoryUIDataEntry) == 0x000060, "Wrong size on FJunoCraftingSubCategoryUIDataEntry");
static_assert(offsetof(FJunoCraftingSubCategoryUIDataEntry, CategoryTag) == 0x000000, "Member 'FJunoCraftingSubCategoryUIDataEntry::CategoryTag' has a wrong offset!");
static_assert(offsetof(FJunoCraftingSubCategoryUIDataEntry, CategoryIcon) == 0x000008, "Member 'FJunoCraftingSubCategoryUIDataEntry::CategoryIcon' has a wrong offset!");
static_assert(offsetof(FJunoCraftingSubCategoryUIDataEntry, CategoryTitle) == 0x000028, "Member 'FJunoCraftingSubCategoryUIDataEntry::CategoryTitle' has a wrong offset!");
static_assert(offsetof(FJunoCraftingSubCategoryUIDataEntry, Headers) == 0x000040, "Member 'FJunoCraftingSubCategoryUIDataEntry::Headers' has a wrong offset!");
static_assert(offsetof(FJunoCraftingSubCategoryUIDataEntry, SortingPreferences) == 0x000050, "Member 'FJunoCraftingSubCategoryUIDataEntry::SortingPreferences' has a wrong offset!");

// ScriptStruct JunoCraftingBaseUI.JunoCraftingCategoryUIDataEntry
// 0x0070 (0x0070 - 0x0000)
struct FJunoCraftingCategoryUIDataEntry final
{
public:
	struct FGameplayTag                           CategoryTag;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CategoryIcon;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitle;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FJunoCraftingHeaderUIDataEntry> Headers;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FJunoCraftingSubCategoryUIDataEntry> Subcategories;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<EJunoRecipeSortType>                   SortingPreferences;                                // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCraftingCategoryUIDataEntry) == 0x000008, "Wrong alignment on FJunoCraftingCategoryUIDataEntry");
static_assert(sizeof(FJunoCraftingCategoryUIDataEntry) == 0x000070, "Wrong size on FJunoCraftingCategoryUIDataEntry");
static_assert(offsetof(FJunoCraftingCategoryUIDataEntry, CategoryTag) == 0x000000, "Member 'FJunoCraftingCategoryUIDataEntry::CategoryTag' has a wrong offset!");
static_assert(offsetof(FJunoCraftingCategoryUIDataEntry, CategoryIcon) == 0x000008, "Member 'FJunoCraftingCategoryUIDataEntry::CategoryIcon' has a wrong offset!");
static_assert(offsetof(FJunoCraftingCategoryUIDataEntry, CategoryTitle) == 0x000028, "Member 'FJunoCraftingCategoryUIDataEntry::CategoryTitle' has a wrong offset!");
static_assert(offsetof(FJunoCraftingCategoryUIDataEntry, Headers) == 0x000040, "Member 'FJunoCraftingCategoryUIDataEntry::Headers' has a wrong offset!");
static_assert(offsetof(FJunoCraftingCategoryUIDataEntry, Subcategories) == 0x000050, "Member 'FJunoCraftingCategoryUIDataEntry::Subcategories' has a wrong offset!");
static_assert(offsetof(FJunoCraftingCategoryUIDataEntry, SortingPreferences) == 0x000060, "Member 'FJunoCraftingCategoryUIDataEntry::SortingPreferences' has a wrong offset!");

}

