#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoFishing

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "JunoFishing_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class JunoFishing.JunoFishingAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoFishingAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoFishingAnalytics">();
	}
	static class UJunoFishingAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoFishingAnalytics>();
	}
};
static_assert(alignof(UJunoFishingAnalytics) == 0x000008, "Wrong alignment on UJunoFishingAnalytics");
static_assert(sizeof(UJunoFishingAnalytics) == 0x000028, "Wrong size on UJunoFishingAnalytics");

// Class JunoFishing.JunoFishingBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoFishingBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void FireEvent_BeginJunoFishingSession(class AFortPlayerPawn* PlayerPawn);
	static void FireEvent_EndJunoFishingSession(class AFortPlayerPawn* PlayerPawn, const class UFortWorldItemDefinition* ItemFished, const bool bFromHotspot, const bool bIsPlayerSpawnedHotspot, const class FString& HotspotTierTag, const class FString& WaterBodyName, const class FString& CatchTypeName, const class AActor* ItemUsedToFish);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoFishingBlueprintLibrary">();
	}
	static class UJunoFishingBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoFishingBlueprintLibrary>();
	}
};
static_assert(alignof(UJunoFishingBlueprintLibrary) == 0x000008, "Wrong alignment on UJunoFishingBlueprintLibrary");
static_assert(sizeof(UJunoFishingBlueprintLibrary) == 0x000028, "Wrong size on UJunoFishingBlueprintLibrary");

// Class JunoFishing.JunoPlayerControllerComponent_FishingAnalytics
// 0x0050 (0x00F0 - 0x00A0)
class UJunoPlayerControllerComponent_FishingAnalytics final : public UControllerComponent
{
public:
	struct FJunoPlayerFishingTelemetryData        PlayerFishingTelemetryData;                        // 0x00A0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerControllerComponent_FishingAnalytics">();
	}
	static class UJunoPlayerControllerComponent_FishingAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerControllerComponent_FishingAnalytics>();
	}
};
static_assert(alignof(UJunoPlayerControllerComponent_FishingAnalytics) == 0x000008, "Wrong alignment on UJunoPlayerControllerComponent_FishingAnalytics");
static_assert(sizeof(UJunoPlayerControllerComponent_FishingAnalytics) == 0x0000F0, "Wrong size on UJunoPlayerControllerComponent_FishingAnalytics");
static_assert(offsetof(UJunoPlayerControllerComponent_FishingAnalytics, PlayerFishingTelemetryData) == 0x0000A0, "Member 'UJunoPlayerControllerComponent_FishingAnalytics::PlayerFishingTelemetryData' has a wrong offset!");

}

