#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAdventuresRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "JunoAdventuresRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonConversationRuntime_classes.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteAI_classes.hpp"


namespace SDK
{

// Class JunoAdventuresRuntime.JunoAdventuresAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoAdventuresAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAdventuresAnalytics">();
	}
	static class UJunoAdventuresAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAdventuresAnalytics>();
	}
};
static_assert(alignof(UJunoAdventuresAnalytics) == 0x000008, "Wrong alignment on UJunoAdventuresAnalytics");
static_assert(sizeof(UJunoAdventuresAnalytics) == 0x000028, "Wrong size on UJunoAdventuresAnalytics");

// Class JunoAdventuresRuntime.JunoContextualMessageConfigCollection
// 0x0030 (0x0060 - 0x0030)
class UJunoContextualMessageConfigCollection final : public UDataAsset
{
public:
	TArray<struct FJunoSpecializedContextualMessageConfig> SpecializedConfigs;                                // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoContextualMessageConfig           GeneralConfig;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    GeneralConfigTableRow;                             // 0x0050(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoContextualMessageConfigCollection">();
	}
	static class UJunoContextualMessageConfigCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoContextualMessageConfigCollection>();
	}
};
static_assert(alignof(UJunoContextualMessageConfigCollection) == 0x000008, "Wrong alignment on UJunoContextualMessageConfigCollection");
static_assert(sizeof(UJunoContextualMessageConfigCollection) == 0x000060, "Wrong size on UJunoContextualMessageConfigCollection");
static_assert(offsetof(UJunoContextualMessageConfigCollection, SpecializedConfigs) == 0x000030, "Member 'UJunoContextualMessageConfigCollection::SpecializedConfigs' has a wrong offset!");
static_assert(offsetof(UJunoContextualMessageConfigCollection, GeneralConfig) == 0x000040, "Member 'UJunoContextualMessageConfigCollection::GeneralConfig' has a wrong offset!");
static_assert(offsetof(UJunoContextualMessageConfigCollection, GeneralConfigTableRow) == 0x000050, "Member 'UJunoContextualMessageConfigCollection::GeneralConfigTableRow' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerComponent_ConversationHistory
// 0x00A8 (0x02A0 - 0x01F8)
class UJunoControllerComponent_ConversationHistory final : public UFortControllerComponent_ConversationHistory
{
public:
	uint8                                         Pad_1F8[0xA8];                                     // 0x01F8(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_SetCachedContextualMessageResult(const struct FJunoContextualMessageQueryResult& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerComponent_ConversationHistory">();
	}
	static class UJunoControllerComponent_ConversationHistory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerComponent_ConversationHistory>();
	}
};
static_assert(alignof(UJunoControllerComponent_ConversationHistory) == 0x000008, "Wrong alignment on UJunoControllerComponent_ConversationHistory");
static_assert(sizeof(UJunoControllerComponent_ConversationHistory) == 0x0002A0, "Wrong size on UJunoControllerComponent_ConversationHistory");

// Class JunoAdventuresRuntime.JunoControllerRequirement
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement : public UFortControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement">();
	}
	static class UJunoControllerRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement>();
	}
};
static_assert(alignof(UJunoControllerRequirement) == 0x000008, "Wrong alignment on UJunoControllerRequirement");
static_assert(sizeof(UJunoControllerRequirement) == 0x000030, "Wrong size on UJunoControllerRequirement");

// Class JunoAdventuresRuntime.JunoControllerRequirement_CampResidentsHaveTag
// 0x0010 (0x0040 - 0x0030)
class UJunoControllerRequirement_CampResidentsHaveTag final : public UJunoControllerRequirement
{
public:
	struct FGameplayTag                           RoleTagToValidate;                                 // 0x0030(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           UniqueIdentifierTagToValidate;                     // 0x0034(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIncludeSpeakingNpcInQueries;                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ValidateRoleTag(const struct FGameplayTag& OtherResidentIdentifier, const class UPlayspaceComponent_JunoAIPersistence* RootAIPersistenceComp) const;
	bool ValidateUniqueResidentTag(const struct FGameplayTag& OtherResidentIdentifier) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_CampResidentsHaveTag">();
	}
	static class UJunoControllerRequirement_CampResidentsHaveTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_CampResidentsHaveTag>();
	}
};
static_assert(alignof(UJunoControllerRequirement_CampResidentsHaveTag) == 0x000008, "Wrong alignment on UJunoControllerRequirement_CampResidentsHaveTag");
static_assert(sizeof(UJunoControllerRequirement_CampResidentsHaveTag) == 0x000040, "Wrong size on UJunoControllerRequirement_CampResidentsHaveTag");
static_assert(offsetof(UJunoControllerRequirement_CampResidentsHaveTag, RoleTagToValidate) == 0x000030, "Member 'UJunoControllerRequirement_CampResidentsHaveTag::RoleTagToValidate' has a wrong offset!");
static_assert(offsetof(UJunoControllerRequirement_CampResidentsHaveTag, UniqueIdentifierTagToValidate) == 0x000034, "Member 'UJunoControllerRequirement_CampResidentsHaveTag::UniqueIdentifierTagToValidate' has a wrong offset!");
static_assert(offsetof(UJunoControllerRequirement_CampResidentsHaveTag, bIncludeSpeakingNpcInQueries) == 0x000038, "Member 'UJunoControllerRequirement_CampResidentsHaveTag::bIncludeSpeakingNpcInQueries' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerRequirement_HasCompletedQuestObjective
// 0x0020 (0x0050 - 0x0030)
class UJunoControllerRequirement_HasCompletedQuestObjective final : public UFortControllerRequirement
{
public:
	struct FSoftObjectPath                        QuestDefinition;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectiveBackendName;                              // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> Editor_GetValidObjectives() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_HasCompletedQuestObjective">();
	}
	static class UJunoControllerRequirement_HasCompletedQuestObjective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_HasCompletedQuestObjective>();
	}
};
static_assert(alignof(UJunoControllerRequirement_HasCompletedQuestObjective) == 0x000008, "Wrong alignment on UJunoControllerRequirement_HasCompletedQuestObjective");
static_assert(sizeof(UJunoControllerRequirement_HasCompletedQuestObjective) == 0x000050, "Wrong size on UJunoControllerRequirement_HasCompletedQuestObjective");
static_assert(offsetof(UJunoControllerRequirement_HasCompletedQuestObjective, QuestDefinition) == 0x000030, "Member 'UJunoControllerRequirement_HasCompletedQuestObjective::QuestDefinition' has a wrong offset!");
static_assert(offsetof(UJunoControllerRequirement_HasCompletedQuestObjective, ObjectiveBackendName) == 0x000048, "Member 'UJunoControllerRequirement_HasCompletedQuestObjective::ObjectiveBackendName' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerRequirement_HasEntryTag
// 0x0008 (0x0038 - 0x0030)
class UJunoControllerRequirement_HasEntryTag final : public UFortControllerRequirement
{
public:
	struct FGameplayTag                           QueryTag;                                          // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_HasEntryTag">();
	}
	static class UJunoControllerRequirement_HasEntryTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_HasEntryTag>();
	}
};
static_assert(alignof(UJunoControllerRequirement_HasEntryTag) == 0x000008, "Wrong alignment on UJunoControllerRequirement_HasEntryTag");
static_assert(sizeof(UJunoControllerRequirement_HasEntryTag) == 0x000038, "Wrong size on UJunoControllerRequirement_HasEntryTag");
static_assert(offsetof(UJunoControllerRequirement_HasEntryTag, QueryTag) == 0x000030, "Member 'UJunoControllerRequirement_HasEntryTag::QueryTag' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsFirstConversationWithNPC
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement_IsFirstConversationWithNPC final : public UJunoControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_IsFirstConversationWithNPC">();
	}
	static class UJunoControllerRequirement_IsFirstConversationWithNPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsFirstConversationWithNPC>();
	}
};
static_assert(alignof(UJunoControllerRequirement_IsFirstConversationWithNPC) == 0x000008, "Wrong alignment on UJunoControllerRequirement_IsFirstConversationWithNPC");
static_assert(sizeof(UJunoControllerRequirement_IsFirstConversationWithNPC) == 0x000030, "Wrong size on UJunoControllerRequirement_IsFirstConversationWithNPC");

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsFollowingAnotherPlayer
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement_IsFollowingAnotherPlayer final : public UJunoControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_IsFollowingAnotherPlayer">();
	}
	static class UJunoControllerRequirement_IsFollowingAnotherPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsFollowingAnotherPlayer>();
	}
};
static_assert(alignof(UJunoControllerRequirement_IsFollowingAnotherPlayer) == 0x000008, "Wrong alignment on UJunoControllerRequirement_IsFollowingAnotherPlayer");
static_assert(sizeof(UJunoControllerRequirement_IsFollowingAnotherPlayer) == 0x000030, "Wrong size on UJunoControllerRequirement_IsFollowingAnotherPlayer");

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsGeneratingResourcesAndEmpty
// 0x0008 (0x0038 - 0x0030)
class UJunoControllerRequirement_IsGeneratingResourcesAndEmpty final : public UJunoControllerRequirement
{
public:
	bool                                          bRequiresGeneratedPercentageWhenNoLootGenerated;   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_IsGeneratingResourcesAndEmpty">();
	}
	static class UJunoControllerRequirement_IsGeneratingResourcesAndEmpty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsGeneratingResourcesAndEmpty>();
	}
};
static_assert(alignof(UJunoControllerRequirement_IsGeneratingResourcesAndEmpty) == 0x000008, "Wrong alignment on UJunoControllerRequirement_IsGeneratingResourcesAndEmpty");
static_assert(sizeof(UJunoControllerRequirement_IsGeneratingResourcesAndEmpty) == 0x000038, "Wrong size on UJunoControllerRequirement_IsGeneratingResourcesAndEmpty");
static_assert(offsetof(UJunoControllerRequirement_IsGeneratingResourcesAndEmpty, bRequiresGeneratedPercentageWhenNoLootGenerated) == 0x000030, "Member 'UJunoControllerRequirement_IsGeneratingResourcesAndEmpty::bRequiresGeneratedPercentageWhenNoLootGenerated' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerRequirement_MerchantHasStock
// 0x0000 (0x0030 - 0x0030)
class UJunoControllerRequirement_MerchantHasStock final : public UJunoControllerRequirement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_MerchantHasStock">();
	}
	static class UJunoControllerRequirement_MerchantHasStock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_MerchantHasStock>();
	}
};
static_assert(alignof(UJunoControllerRequirement_MerchantHasStock) == 0x000008, "Wrong alignment on UJunoControllerRequirement_MerchantHasStock");
static_assert(sizeof(UJunoControllerRequirement_MerchantHasStock) == 0x000030, "Wrong size on UJunoControllerRequirement_MerchantHasStock");

// Class JunoAdventuresRuntime.JunoConversationRequirementDatabase
// 0x0008 (0x0100 - 0x00F8)
class UJunoConversationRequirementDatabase final : public UFortPlayspaceComponent
{
public:
	class UJunoConversationRequirementMappings*   ConversationRequirementMappingData;                // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationRequirementDatabase">();
	}
	static class UJunoConversationRequirementDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirementDatabase>();
	}
};
static_assert(alignof(UJunoConversationRequirementDatabase) == 0x000008, "Wrong alignment on UJunoConversationRequirementDatabase");
static_assert(sizeof(UJunoConversationRequirementDatabase) == 0x000100, "Wrong size on UJunoConversationRequirementDatabase");
static_assert(offsetof(UJunoConversationRequirementDatabase, ConversationRequirementMappingData) == 0x0000F8, "Member 'UJunoConversationRequirementDatabase::ConversationRequirementMappingData' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationRequirementMappings
// 0x0050 (0x0080 - 0x0030)
class UJunoConversationRequirementMappings final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, class UFortControllerRequirement*> ConversationRequirementMappings;                   // 0x0030(0x0050)(Edit, ExportObject, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationRequirementMappings">();
	}
	static class UJunoConversationRequirementMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirementMappings>();
	}
};
static_assert(alignof(UJunoConversationRequirementMappings) == 0x000008, "Wrong alignment on UJunoConversationRequirementMappings");
static_assert(sizeof(UJunoConversationRequirementMappings) == 0x000080, "Wrong size on UJunoConversationRequirementMappings");
static_assert(offsetof(UJunoConversationRequirementMappings, ConversationRequirementMappings) == 0x000030, "Member 'UJunoConversationRequirementMappings::ConversationRequirementMappings' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationRequirement_NearestCampWorldConditionSchema
// 0x0010 (0x0048 - 0x0038)
class UJunoConversationRequirement_NearestCampWorldConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationRequirement_NearestCampWorldConditionSchema">();
	}
	static class UJunoConversationRequirement_NearestCampWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirement_NearestCampWorldConditionSchema>();
	}
};
static_assert(alignof(UJunoConversationRequirement_NearestCampWorldConditionSchema) == 0x000008, "Wrong alignment on UJunoConversationRequirement_NearestCampWorldConditionSchema");
static_assert(sizeof(UJunoConversationRequirement_NearestCampWorldConditionSchema) == 0x000048, "Wrong size on UJunoConversationRequirement_NearestCampWorldConditionSchema");

// Class JunoAdventuresRuntime.JunoConversationRequirement_NearestCampWorldCondition
// 0x0048 (0x00A0 - 0x0058)
class UJunoConversationRequirement_NearestCampWorldCondition final : public UConversationRequirementNode
{
public:
	int32                                         CampSlot;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxDistanceFromCamp;                               // 0x0060(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FWorldConditionQueryDefinition         Conditions;                                        // 0x0088(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationRequirement_NearestCampWorldCondition">();
	}
	static class UJunoConversationRequirement_NearestCampWorldCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationRequirement_NearestCampWorldCondition>();
	}
};
static_assert(alignof(UJunoConversationRequirement_NearestCampWorldCondition) == 0x000008, "Wrong alignment on UJunoConversationRequirement_NearestCampWorldCondition");
static_assert(sizeof(UJunoConversationRequirement_NearestCampWorldCondition) == 0x0000A0, "Wrong size on UJunoConversationRequirement_NearestCampWorldCondition");
static_assert(offsetof(UJunoConversationRequirement_NearestCampWorldCondition, CampSlot) == 0x000058, "Member 'UJunoConversationRequirement_NearestCampWorldCondition::CampSlot' has a wrong offset!");
static_assert(offsetof(UJunoConversationRequirement_NearestCampWorldCondition, MaxDistanceFromCamp) == 0x000060, "Member 'UJunoConversationRequirement_NearestCampWorldCondition::MaxDistanceFromCamp' has a wrong offset!");
static_assert(offsetof(UJunoConversationRequirement_NearestCampWorldCondition, Conditions) == 0x000088, "Member 'UJunoConversationRequirement_NearestCampWorldCondition::Conditions' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CampFollowerAssignment
// 0x0008 (0x0198 - 0x0190)
class UJunoConversationTaskNode_CampFollowerAssignment final : public UFortConversationTaskNode_Service
{
public:
	bool                                          bEnableFollower;                                   // 0x0190(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCampRecruitment;                                  // 0x0191(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_CampFollowerAssignment">();
	}
	static class UJunoConversationTaskNode_CampFollowerAssignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CampFollowerAssignment>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_CampFollowerAssignment) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_CampFollowerAssignment");
static_assert(sizeof(UJunoConversationTaskNode_CampFollowerAssignment) == 0x000198, "Wrong size on UJunoConversationTaskNode_CampFollowerAssignment");
static_assert(offsetof(UJunoConversationTaskNode_CampFollowerAssignment, bEnableFollower) == 0x000190, "Member 'UJunoConversationTaskNode_CampFollowerAssignment::bEnableFollower' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_CampFollowerAssignment, bCampRecruitment) == 0x000191, "Member 'UJunoConversationTaskNode_CampFollowerAssignment::bCampRecruitment' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CampJobAssignment
// 0x0008 (0x0198 - 0x0190)
class UJunoConversationTaskNode_CampJobAssignment final : public UFortConversationTaskNode_Service
{
public:
	struct FGameplayTag                           JobTag;                                            // 0x0190(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRemoveJob;                                        // 0x0194(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_CampJobAssignment">();
	}
	static class UJunoConversationTaskNode_CampJobAssignment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CampJobAssignment>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_CampJobAssignment) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_CampJobAssignment");
static_assert(sizeof(UJunoConversationTaskNode_CampJobAssignment) == 0x000198, "Wrong size on UJunoConversationTaskNode_CampJobAssignment");
static_assert(offsetof(UJunoConversationTaskNode_CampJobAssignment, JobTag) == 0x000190, "Member 'UJunoConversationTaskNode_CampJobAssignment::JobTag' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_CampJobAssignment, bRemoveJob) == 0x000194, "Member 'UJunoConversationTaskNode_CampJobAssignment::bRemoveJob' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CampRecruitment
// 0x0000 (0x0190 - 0x0190)
class UJunoConversationTaskNode_CampRecruitment final : public UFortConversationTaskNode_Service
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_CampRecruitment">();
	}
	static class UJunoConversationTaskNode_CampRecruitment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CampRecruitment>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_CampRecruitment) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_CampRecruitment");
static_assert(sizeof(UJunoConversationTaskNode_CampRecruitment) == 0x000190, "Wrong size on UJunoConversationTaskNode_CampRecruitment");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GetResource
// 0x0038 (0x01C8 - 0x0190)
class UJunoConversationTaskNode_GetResource final : public UFortConversationTaskNode_Service
{
public:
	int32                                         ResourceSlot;                                      // 0x0190(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GetTextFormat;                                     // 0x0198(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   FinishedTextFormat;                                // 0x01B0(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_GetResource">();
	}
	static class UJunoConversationTaskNode_GetResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GetResource>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_GetResource) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_GetResource");
static_assert(sizeof(UJunoConversationTaskNode_GetResource) == 0x0001C8, "Wrong size on UJunoConversationTaskNode_GetResource");
static_assert(offsetof(UJunoConversationTaskNode_GetResource, ResourceSlot) == 0x000190, "Member 'UJunoConversationTaskNode_GetResource::ResourceSlot' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_GetResource, GetTextFormat) == 0x000198, "Member 'UJunoConversationTaskNode_GetResource::GetTextFormat' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_GetResource, FinishedTextFormat) == 0x0001B0, "Member 'UJunoConversationTaskNode_GetResource::FinishedTextFormat' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GiftNPC
// 0x0030 (0x01A0 - 0x0170)
class UJunoConversationTaskNode_GiftNPC final : public UFortConversationTaskNode
{
public:
	class FText                                   GiftTextFormat;                                    // 0x0170(0x0018)(Edit, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	int32                                         MaxChoiceNodesToGenerate;                          // 0x0188(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   InventoryGroupTypesToPickItemsFrom;                // 0x0190(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_GiftNPC">();
	}
	static class UJunoConversationTaskNode_GiftNPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GiftNPC>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_GiftNPC) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_GiftNPC");
static_assert(sizeof(UJunoConversationTaskNode_GiftNPC) == 0x0001A0, "Wrong size on UJunoConversationTaskNode_GiftNPC");
static_assert(offsetof(UJunoConversationTaskNode_GiftNPC, GiftTextFormat) == 0x000170, "Member 'UJunoConversationTaskNode_GiftNPC::GiftTextFormat' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_GiftNPC, MaxChoiceNodesToGenerate) == 0x000188, "Member 'UJunoConversationTaskNode_GiftNPC::MaxChoiceNodesToGenerate' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_GiftNPC, InventoryGroupTypesToPickItemsFrom) == 0x000190, "Member 'UJunoConversationTaskNode_GiftNPC::InventoryGroupTypesToPickItemsFrom' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GrantAwesomePoints
// 0x0008 (0x0178 - 0x0170)
class UJunoConversationTaskNode_GrantAwesomePoints final : public UFortConversationTaskNode
{
public:
	struct FGameplayTag                           AwesomeInteractionTag;                             // 0x0170(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_GrantAwesomePoints">();
	}
	static class UJunoConversationTaskNode_GrantAwesomePoints* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GrantAwesomePoints>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_GrantAwesomePoints) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_GrantAwesomePoints");
static_assert(sizeof(UJunoConversationTaskNode_GrantAwesomePoints) == 0x000178, "Wrong size on UJunoConversationTaskNode_GrantAwesomePoints");
static_assert(offsetof(UJunoConversationTaskNode_GrantAwesomePoints, AwesomeInteractionTag) == 0x000170, "Member 'UJunoConversationTaskNode_GrantAwesomePoints::AwesomeInteractionTag' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GrantNPCCampReward
// 0x0000 (0x0190 - 0x0190)
class UJunoConversationTaskNode_GrantNPCCampReward final : public UFortConversationTaskNode_Service
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_GrantNPCCampReward">();
	}
	static class UJunoConversationTaskNode_GrantNPCCampReward* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GrantNPCCampReward>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_GrantNPCCampReward) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_GrantNPCCampReward");
static_assert(sizeof(UJunoConversationTaskNode_GrantNPCCampReward) == 0x000190, "Wrong size on UJunoConversationTaskNode_GrantNPCCampReward");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_MarkFirstConversationComplete
// 0x0000 (0x0170 - 0x0170)
class UJunoConversationTaskNode_MarkFirstConversationComplete final : public UFortConversationTaskNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_MarkFirstConversationComplete">();
	}
	static class UJunoConversationTaskNode_MarkFirstConversationComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_MarkFirstConversationComplete>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_MarkFirstConversationComplete) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_MarkFirstConversationComplete");
static_assert(sizeof(UJunoConversationTaskNode_MarkFirstConversationComplete) == 0x000170, "Wrong size on UJunoConversationTaskNode_MarkFirstConversationComplete");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_NukeVillager
// 0x0000 (0x0190 - 0x0190)
class UJunoConversationTaskNode_NukeVillager final : public UFortConversationTaskNode_Service
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_NukeVillager">();
	}
	static class UJunoConversationTaskNode_NukeVillager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_NukeVillager>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_NukeVillager) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_NukeVillager");
static_assert(sizeof(UJunoConversationTaskNode_NukeVillager) == 0x000190, "Wrong size on UJunoConversationTaskNode_NukeVillager");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_RemoteCampRecruitment
// 0x0048 (0x01D8 - 0x0190)
class UJunoConversationTaskNode_RemoteCampRecruitment final : public UFortConversationTaskNode_Service
{
public:
	int32                                         CampSlot;                                          // 0x0190(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   JoinCampTextFormat;                                // 0x0198(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxDistanceFromCamp;                               // 0x01B0(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_RemoteCampRecruitment">();
	}
	static class UJunoConversationTaskNode_RemoteCampRecruitment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_RemoteCampRecruitment>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_RemoteCampRecruitment) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_RemoteCampRecruitment");
static_assert(sizeof(UJunoConversationTaskNode_RemoteCampRecruitment) == 0x0001D8, "Wrong size on UJunoConversationTaskNode_RemoteCampRecruitment");
static_assert(offsetof(UJunoConversationTaskNode_RemoteCampRecruitment, CampSlot) == 0x000190, "Member 'UJunoConversationTaskNode_RemoteCampRecruitment::CampSlot' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_RemoteCampRecruitment, JoinCampTextFormat) == 0x000198, "Member 'UJunoConversationTaskNode_RemoteCampRecruitment::JoinCampTextFormat' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_RemoteCampRecruitment, MaxDistanceFromCamp) == 0x0001B0, "Member 'UJunoConversationTaskNode_RemoteCampRecruitment::MaxDistanceFromCamp' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_Speech
// 0x0090 (0x0200 - 0x0170)
class UJunoConversationTaskNode_Speech final : public UFortConversationTaskNode
{
public:
	class FString                                 MetaIdentifier_Animations;                         // 0x0170(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SpeakerTag;                                        // 0x0180(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ListenerTag;                                       // 0x0184(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DefaultMoodReactionTag;                            // 0x0188(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StyledParticipantNameFormat;                       // 0x0190(0x0018)(Edit, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseInlineConfig;                                  // 0x01A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoContextualMessageConfigCollection* ExternalContextualMessageCollection;               // 0x01B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FJunoSpecializedContextualMessageConfig> SpecializedConfigs;                                // 0x01B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FJunoContextualMessageConfig           GeneralConfig;                                     // 0x01C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    GeneralConfigTableRow;                             // 0x01D8(0x0010)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E8[0x18];                                     // 0x01E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayClientVoiceLine(const struct FConversationContext& Context, const struct FJunoContextualMessageQueryResult& MessageParams) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_Speech">();
	}
	static class UJunoConversationTaskNode_Speech* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_Speech>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_Speech) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_Speech");
static_assert(sizeof(UJunoConversationTaskNode_Speech) == 0x000200, "Wrong size on UJunoConversationTaskNode_Speech");
static_assert(offsetof(UJunoConversationTaskNode_Speech, MetaIdentifier_Animations) == 0x000170, "Member 'UJunoConversationTaskNode_Speech::MetaIdentifier_Animations' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, SpeakerTag) == 0x000180, "Member 'UJunoConversationTaskNode_Speech::SpeakerTag' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, ListenerTag) == 0x000184, "Member 'UJunoConversationTaskNode_Speech::ListenerTag' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, DefaultMoodReactionTag) == 0x000188, "Member 'UJunoConversationTaskNode_Speech::DefaultMoodReactionTag' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, StyledParticipantNameFormat) == 0x000190, "Member 'UJunoConversationTaskNode_Speech::StyledParticipantNameFormat' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, bUseInlineConfig) == 0x0001A8, "Member 'UJunoConversationTaskNode_Speech::bUseInlineConfig' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, ExternalContextualMessageCollection) == 0x0001B0, "Member 'UJunoConversationTaskNode_Speech::ExternalContextualMessageCollection' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, SpecializedConfigs) == 0x0001B8, "Member 'UJunoConversationTaskNode_Speech::SpecializedConfigs' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, GeneralConfig) == 0x0001C8, "Member 'UJunoConversationTaskNode_Speech::GeneralConfig' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_Speech, GeneralConfigTableRow) == 0x0001D8, "Member 'UJunoConversationTaskNode_Speech::GeneralConfigTableRow' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_TagCurrentConversation
// 0x0020 (0x0190 - 0x0170)
class UJunoConversationTaskNode_TagCurrentConversation final : public UFortConversationTaskNode
{
public:
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x0170(0x0020)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_TagCurrentConversation">();
	}
	static class UJunoConversationTaskNode_TagCurrentConversation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_TagCurrentConversation>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_TagCurrentConversation) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_TagCurrentConversation");
static_assert(sizeof(UJunoConversationTaskNode_TagCurrentConversation) == 0x000190, "Wrong size on UJunoConversationTaskNode_TagCurrentConversation");
static_assert(offsetof(UJunoConversationTaskNode_TagCurrentConversation, TagsToApply) == 0x000170, "Member 'UJunoConversationTaskNode_TagCurrentConversation::TagsToApply' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_TradeWithMerchant
// 0x0068 (0x01D8 - 0x0170)
class UJunoConversationTaskNode_TradeWithMerchant final : public UFortConversationTaskNode
{
public:
	class FText                                   TradeTextFormat_Single;                            // 0x0170(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   TradeTextFormat_Plural;                            // 0x0188(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   NotEnoughForTradeTextFormat_Single;                // 0x01A0(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   NotEnoughForTradeTextFormat_Plural;                // 0x01B8(0x0018)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxChoiceNodesToGenerate;                          // 0x01D0(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_TradeWithMerchant">();
	}
	static class UJunoConversationTaskNode_TradeWithMerchant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_TradeWithMerchant>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_TradeWithMerchant) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_TradeWithMerchant");
static_assert(sizeof(UJunoConversationTaskNode_TradeWithMerchant) == 0x0001D8, "Wrong size on UJunoConversationTaskNode_TradeWithMerchant");
static_assert(offsetof(UJunoConversationTaskNode_TradeWithMerchant, TradeTextFormat_Single) == 0x000170, "Member 'UJunoConversationTaskNode_TradeWithMerchant::TradeTextFormat_Single' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_TradeWithMerchant, TradeTextFormat_Plural) == 0x000188, "Member 'UJunoConversationTaskNode_TradeWithMerchant::TradeTextFormat_Plural' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_TradeWithMerchant, NotEnoughForTradeTextFormat_Single) == 0x0001A0, "Member 'UJunoConversationTaskNode_TradeWithMerchant::NotEnoughForTradeTextFormat_Single' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_TradeWithMerchant, NotEnoughForTradeTextFormat_Plural) == 0x0001B8, "Member 'UJunoConversationTaskNode_TradeWithMerchant::NotEnoughForTradeTextFormat_Plural' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_TradeWithMerchant, MaxChoiceNodesToGenerate) == 0x0001D0, "Member 'UJunoConversationTaskNode_TradeWithMerchant::MaxChoiceNodesToGenerate' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoNPCConversationParticipantComponent
// 0x0098 (0x06C0 - 0x0628)
class UJunoNPCConversationParticipantComponent final : public UFortNPCConversationParticipantComponent
{
public:
	TMulticastInlineDelegate<void(TSoftObjectPtr<class UTexture2D>& Icon)> OnJunoConversationParticipantIconChangedDelegate;  // 0x0628(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              ParticipantIconSmall;                              // 0x0638(0x0020)(Net, Transient, RepNotify, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_658[0x68];                                     // 0x0658(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ParticipantIconSmall();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoNPCConversationParticipantComponent">();
	}
	static class UJunoNPCConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoNPCConversationParticipantComponent>();
	}
};
static_assert(alignof(UJunoNPCConversationParticipantComponent) == 0x000008, "Wrong alignment on UJunoNPCConversationParticipantComponent");
static_assert(sizeof(UJunoNPCConversationParticipantComponent) == 0x0006C0, "Wrong size on UJunoNPCConversationParticipantComponent");
static_assert(offsetof(UJunoNPCConversationParticipantComponent, OnJunoConversationParticipantIconChangedDelegate) == 0x000628, "Member 'UJunoNPCConversationParticipantComponent::OnJunoConversationParticipantIconChangedDelegate' has a wrong offset!");
static_assert(offsetof(UJunoNPCConversationParticipantComponent, ParticipantIconSmall) == 0x000638, "Member 'UJunoNPCConversationParticipantComponent::ParticipantIconSmall' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoChangeInventoryHelper
// 0x0010 (0x0038 - 0x0028)
class UJunoChangeInventoryHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInventoryChangedEvent(const struct FJunoItemSlot& ItemSlot, const EJunoItemChangeType ChangeType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoChangeInventoryHelper">();
	}
	static class UJunoChangeInventoryHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoChangeInventoryHelper>();
	}
};
static_assert(alignof(UJunoChangeInventoryHelper) == 0x000008, "Wrong alignment on UJunoChangeInventoryHelper");
static_assert(sizeof(UJunoChangeInventoryHelper) == 0x000038, "Wrong size on UJunoChangeInventoryHelper");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_CompleteQuestObjective
// 0x0028 (0x0198 - 0x0170)
class UJunoConversationTaskNode_CompleteQuestObjective final : public UFortConversationTaskNode
{
public:
	TSoftObjectPtr<class UFortQuestItemDefinition_Athena> QuestToProgress;                                   // 0x0170(0x0020)(Edit, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ObjectiveBackendName;                              // 0x0190(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> Editor_GetValidObjectives() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_CompleteQuestObjective">();
	}
	static class UJunoConversationTaskNode_CompleteQuestObjective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_CompleteQuestObjective>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_CompleteQuestObjective) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_CompleteQuestObjective");
static_assert(sizeof(UJunoConversationTaskNode_CompleteQuestObjective) == 0x000198, "Wrong size on UJunoConversationTaskNode_CompleteQuestObjective");
static_assert(offsetof(UJunoConversationTaskNode_CompleteQuestObjective, QuestToProgress) == 0x000170, "Member 'UJunoConversationTaskNode_CompleteQuestObjective::QuestToProgress' has a wrong offset!");
static_assert(offsetof(UJunoConversationTaskNode_CompleteQuestObjective, ObjectiveBackendName) == 0x000190, "Member 'UJunoConversationTaskNode_CompleteQuestObjective::ObjectiveBackendName' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_GrantQuest
// 0x0020 (0x0190 - 0x0170)
class UJunoConversationTaskNode_GrantQuest final : public UFortConversationTaskNode
{
public:
	TSoftObjectPtr<class UFortQuestItemDefinition_Athena> QuestToGrant;                                      // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_GrantQuest">();
	}
	static class UJunoConversationTaskNode_GrantQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_GrantQuest>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_GrantQuest) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_GrantQuest");
static_assert(sizeof(UJunoConversationTaskNode_GrantQuest) == 0x000190, "Wrong size on UJunoConversationTaskNode_GrantQuest");
static_assert(offsetof(UJunoConversationTaskNode_GrantQuest, QuestToGrant) == 0x000170, "Member 'UJunoConversationTaskNode_GrantQuest::QuestToGrant' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoConversationTaskNode_TurnInQuest
// 0x0020 (0x0190 - 0x0170)
class UJunoConversationTaskNode_TurnInQuest final : public UFortConversationTaskNode
{
public:
	TSoftObjectPtr<class UFortQuestItemDefinition_Athena> QuestToTurnIn;                                     // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoConversationTaskNode_TurnInQuest">();
	}
	static class UJunoConversationTaskNode_TurnInQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoConversationTaskNode_TurnInQuest>();
	}
};
static_assert(alignof(UJunoConversationTaskNode_TurnInQuest) == 0x000008, "Wrong alignment on UJunoConversationTaskNode_TurnInQuest");
static_assert(sizeof(UJunoConversationTaskNode_TurnInQuest) == 0x000190, "Wrong size on UJunoConversationTaskNode_TurnInQuest");
static_assert(offsetof(UJunoConversationTaskNode_TurnInQuest, QuestToTurnIn) == 0x000170, "Member 'UJunoConversationTaskNode_TurnInQuest::QuestToTurnIn' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerRequirement_HasCompletedNumQuestObjectives
// 0x0048 (0x0078 - 0x0030)
class UJunoControllerRequirement_HasCompletedNumQuestObjectives final : public UFortControllerRequirement
{
public:
	struct FSoftObjectPath                        QuestDefinition;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FThresholdTestConfig                   RequiredCount;                                     // 0x0048(0x0030)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_HasCompletedNumQuestObjectives">();
	}
	static class UJunoControllerRequirement_HasCompletedNumQuestObjectives* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_HasCompletedNumQuestObjectives>();
	}
};
static_assert(alignof(UJunoControllerRequirement_HasCompletedNumQuestObjectives) == 0x000008, "Wrong alignment on UJunoControllerRequirement_HasCompletedNumQuestObjectives");
static_assert(sizeof(UJunoControllerRequirement_HasCompletedNumQuestObjectives) == 0x000078, "Wrong size on UJunoControllerRequirement_HasCompletedNumQuestObjectives");
static_assert(offsetof(UJunoControllerRequirement_HasCompletedNumQuestObjectives, QuestDefinition) == 0x000030, "Member 'UJunoControllerRequirement_HasCompletedNumQuestObjectives::QuestDefinition' has a wrong offset!");
static_assert(offsetof(UJunoControllerRequirement_HasCompletedNumQuestObjectives, RequiredCount) == 0x000048, "Member 'UJunoControllerRequirement_HasCompletedNumQuestObjectives::RequiredCount' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoControllerRequirement_IsQuestActive
// 0x0018 (0x0048 - 0x0030)
class UJunoControllerRequirement_IsQuestActive final : public UFortControllerRequirement
{
public:
	struct FSoftObjectPath                        QuestDefinition;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerRequirement_IsQuestActive">();
	}
	static class UJunoControllerRequirement_IsQuestActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerRequirement_IsQuestActive>();
	}
};
static_assert(alignof(UJunoControllerRequirement_IsQuestActive) == 0x000008, "Wrong alignment on UJunoControllerRequirement_IsQuestActive");
static_assert(sizeof(UJunoControllerRequirement_IsQuestActive) == 0x000048, "Wrong size on UJunoControllerRequirement_IsQuestActive");
static_assert(offsetof(UJunoControllerRequirement_IsQuestActive, QuestDefinition) == 0x000030, "Member 'UJunoControllerRequirement_IsQuestActive::QuestDefinition' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoTokenReceiver
// 0x0000 (0x0028 - 0x0028)
class IJunoTokenReceiver final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTokenReceiver">();
	}
	static class IJunoTokenReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoTokenReceiver>();
	}
};
static_assert(alignof(IJunoTokenReceiver) == 0x000008, "Wrong alignment on IJunoTokenReceiver");
static_assert(sizeof(IJunoTokenReceiver) == 0x000028, "Wrong size on IJunoTokenReceiver");

// Class JunoAdventuresRuntime.JunoQuestGiverComponent
// 0x0030 (0x00D0 - 0x00A0)
class UJunoQuestGiverComponent final : public UGameFrameworkComponent
{
public:
	class FString                                 GrantableQuestID;                                  // 0x00A0(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  GrantableQuestTags;                                // 0x00B0(0x0020)(Edit, NativeAccessSpecifierPrivate)

public:
	void BindToQuestManagerDelegates();
	void HandleOnJunoQuestComplete(TScriptInterface<class IQuestInstanceInterface>* QuestInstance);
	void RollGrantableQuestID();

	class FString GetGrantableQuestID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQuestGiverComponent">();
	}
	static class UJunoQuestGiverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestGiverComponent>();
	}
};
static_assert(alignof(UJunoQuestGiverComponent) == 0x000008, "Wrong alignment on UJunoQuestGiverComponent");
static_assert(sizeof(UJunoQuestGiverComponent) == 0x0000D0, "Wrong size on UJunoQuestGiverComponent");
static_assert(offsetof(UJunoQuestGiverComponent, GrantableQuestID) == 0x0000A0, "Member 'UJunoQuestGiverComponent::GrantableQuestID' has a wrong offset!");
static_assert(offsetof(UJunoQuestGiverComponent, GrantableQuestTags) == 0x0000B0, "Member 'UJunoQuestGiverComponent::GrantableQuestTags' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoQuestSpawnPointComponent
// 0x0000 (0x00A0 - 0x00A0)
class UJunoQuestSpawnPointComponent final : public UGameFrameworkComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQuestSpawnPointComponent">();
	}
	static class UJunoQuestSpawnPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestSpawnPointComponent>();
	}
};
static_assert(alignof(UJunoQuestSpawnPointComponent) == 0x000008, "Wrong alignment on UJunoQuestSpawnPointComponent");
static_assert(sizeof(UJunoQuestSpawnPointComponent) == 0x0000A0, "Wrong size on UJunoQuestSpawnPointComponent");

// Class JunoAdventuresRuntime.JunoTokenHandlerAIComponent
// 0x0010 (0x00B8 - 0x00A8)
class UJunoTokenHandlerAIComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveToken(const struct FGameplayTag& JunoToken);

	const struct FGameplayTagContainer GetSavedTokens() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTokenHandlerAIComponent">();
	}
	static class UJunoTokenHandlerAIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTokenHandlerAIComponent>();
	}
};
static_assert(alignof(UJunoTokenHandlerAIComponent) == 0x000008, "Wrong alignment on UJunoTokenHandlerAIComponent");
static_assert(sizeof(UJunoTokenHandlerAIComponent) == 0x0000B8, "Wrong size on UJunoTokenHandlerAIComponent");

// Class JunoAdventuresRuntime.JunoQuestPoolDataAsset
// 0x0018 (0x0048 - 0x0030)
class UJunoQuestPoolDataAsset final : public UDataAsset
{
public:
	TArray<struct FJunoQuestPoolDataAssetEntry>   QuestEntries;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           QuestPoolTag;                                      // 0x0040(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQuestPoolDataAsset">();
	}
	static class UJunoQuestPoolDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestPoolDataAsset>();
	}
};
static_assert(alignof(UJunoQuestPoolDataAsset) == 0x000008, "Wrong alignment on UJunoQuestPoolDataAsset");
static_assert(sizeof(UJunoQuestPoolDataAsset) == 0x000048, "Wrong size on UJunoQuestPoolDataAsset");
static_assert(offsetof(UJunoQuestPoolDataAsset, QuestEntries) == 0x000030, "Member 'UJunoQuestPoolDataAsset::QuestEntries' has a wrong offset!");
static_assert(offsetof(UJunoQuestPoolDataAsset, QuestPoolTag) == 0x000040, "Member 'UJunoQuestPoolDataAsset::QuestPoolTag' has a wrong offset!");

// Class JunoAdventuresRuntime.JunoQuestDatabaseComponent
// 0x00B0 (0x01A8 - 0x00F8)
class UJunoQuestDatabaseComponent final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0xA0];                                      // 0x00F8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoQuestPoolDataAsset*>        QuestPoolAssets;                                   // 0x0198(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
