#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoProceduralWorld

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "Engine_structs.hpp"
#include "NetCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MassRepresentation_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "MassEntity_structs.hpp"
#include "StructUtils_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "Landscape_structs.hpp"
#include "PCG_structs.hpp"
#include "WorldConditions_structs.hpp"


namespace SDK
{

// Enum JunoProceduralWorld.EJunoGetMergedCaveDataRegistryDataResult
// NumValues: 0x0002
enum class EJunoGetMergedCaveDataRegistryDataResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorShellType
// NumValues: 0x0005
enum class EJunoCaveGeneratorShellType : uint8
{
	Room                                     = 0,
	Connector                                = 1,
	Entrance                                 = 2,
	Hero                                     = 3,
	FeatureRoom                              = 4,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorShellSize
// NumValues: 0x0004
enum class EJunoCaveGeneratorShellSize : uint8
{
	Small                                    = 0,
	Medium                                   = 1,
	Large                                    = 2,
	Hallway                                  = 3,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorShellTags
// NumValues: 0x0006
enum class EJunoCaveGeneratorShellTags : uint8
{
	BearCave                                 = 0,
	WolfCave                                 = 1,
	TreasureCave                             = 2,
	PirateCave                               = 3,
	AnimalDen                                = 4,
	BossRoom                                 = 5,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorLayoutTags
// NumValues: 0x0001
enum class EJunoCaveGeneratorLayoutTags : uint8
{
	OroMine                                  = 0,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorPCGType
// NumValues: 0x0007
enum class EJunoCaveGeneratorPCGType : uint8
{
	GemsAndOre                               = 0,
	GemsAndOre_HighValue                     = 1,
	Mushroom                                 = 2,
	Plants                                   = 3,
	Ceiling                                  = 4,
	Clutter                                  = 5,
	Rare                                     = 6,
};

// Enum JunoProceduralWorld.EAddChainResult
// NumValues: 0x0006
enum class EAddChainResult : uint8
{
	Success                                  = 0,
	NoMatchingShell                          = 1,
	InvalidAttachIndex                       = 2,
	NoExitsLeft                              = 3,
	CannotFitShell                           = 4,
	NoShellsGenerated                        = 5,
};

// Enum JunoProceduralWorld.EJunoCaveTheme_DEPRECATED
// NumValues: 0x0005
enum class EJunoCaveTheme_DEPRECATED : uint8
{
	Grassland                                = 0,
	DarkForest                               = 1,
	Tropical                                 = 2,
	Alpine                                   = 3,
	Desert                                   = 4,
};

// Enum JunoProceduralWorld.EJunoCreateCaveResult
// NumValues: 0x0003
enum class EJunoCreateCaveResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	Disabled                                 = 2,
};

// Enum JunoProceduralWorld.EJunoQueryCaveDataResult
// NumValues: 0x0004
enum class EJunoQueryCaveDataResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	Cached                                   = 2,
	NoEntry                                  = 3,
};

// Enum JunoProceduralWorld.EJunoQueryCaveSurfaceDataStateResult
// NumValues: 0x0004
enum class EJunoQueryCaveSurfaceDataStateResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	Cached                                   = 2,
	NoEntry                                  = 3,
};

// Enum JunoProceduralWorld.EJunoGetCaveSurfaceDataForEntranceResult
// NumValues: 0x0004
enum class EJunoGetCaveSurfaceDataForEntranceResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	IsACave                                  = 2,
	NotACave                                 = 3,
};

// Enum JunoProceduralWorld.EJunoGetCaveShellInstanceDataResult
// NumValues: 0x0002
enum class EJunoGetCaveShellInstanceDataResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoGetBestCaveResult
// NumValues: 0x0002
enum class EJunoGetBestCaveResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoCalculateCaveDistanceResult
// NumValues: 0x0003
enum class EJunoCalculateCaveDistanceResult : uint8
{
	Success                                  = 0,
	ParentIDsNotCorrect                      = 1,
	ShellsAreNotConnected                    = 2,
};

// Enum JunoProceduralWorld.EJunoGetCaveDataCollectionsFromRegistryResult
// NumValues: 0x0002
enum class EJunoGetCaveDataCollectionsFromRegistryResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoIAVolumeShape
// NumValues: 0x0002
enum class EJunoIAVolumeShape : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
};

// Enum JunoProceduralWorld.EJunoPCGVolumeSource
// NumValues: 0x0002
enum class EJunoPCGVolumeSource : uint8
{
	Transient                                = 0,
	Persistent                               = 1,
};

// Enum JunoProceduralWorld.EJunoFindNextMatchingPOIResourceResult
// NumValues: 0x0002
enum class EJunoFindNextMatchingPOIResourceResult : uint8
{
	Found                                    = 0,
	NotFound                                 = 1,
};

// Enum JunoProceduralWorld.EJunoCreateLevelResult
// NumValues: 0x0002
enum class EJunoCreateLevelResult : uint8
{
	Success                                  = 0,
	Failed                                   = 1,
};

// Enum JunoProceduralWorld.EJunoCompareTagSetsResult
// NumValues: 0x0003
enum class EJunoCompareTagSetsResult : uint8
{
	NoMatch                                  = 0,
	PartialMatch                             = 1,
	FullMatch                                = 2,
};

// Enum JunoProceduralWorld.EJunoResolveWorldSoftObjectPathResult
// NumValues: 0x0003
enum class EJunoResolveWorldSoftObjectPathResult : uint8
{
	Success                                  = 0,
	NotAWorldObject                          = 1,
	InvalidPath                              = 2,
};

// Enum JunoProceduralWorld.EJunoLevelInstanceMode
// NumValues: 0x0003
enum class EJunoLevelInstanceMode : uint8
{
	Disabled                                 = 0,
	StreamingWP                              = 1,
	CellInjection                            = 2,
};

// Enum JunoProceduralWorld.EJunoWorldRegistryType
// NumValues: 0x0003
enum class EJunoWorldRegistryType : uint8
{
	Invalid                                  = 0,
	POI                                      = 1,
	Enemy                                    = 2,
};

// Enum JunoProceduralWorld.EJunoGetWorldTileTransformResult
// NumValues: 0x0002
enum class EJunoGetWorldTileTransformResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoGetWorldTileBoundsResult
// NumValues: 0x0002
enum class EJunoGetWorldTileBoundsResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoTileStatus
// NumValues: 0x0006
enum class EJunoTileStatus : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Deprecated                               = 2,
	Instantiated                             = 3,
	Reserved                                 = 4,
	OutOfBounds                              = 5,
};

// Enum JunoProceduralWorld.EJunoTileGenerationType
// NumValues: 0x0002
enum class EJunoTileGenerationType : uint8
{
	Unknown                                  = 0,
	Cooked                                   = 1,
};

// Enum JunoProceduralWorld.EJunoWorldTilePOIType
// NumValues: 0x0004
enum class EJunoWorldTilePOIType : uint8
{
	Overworld                                = 0,
	Cave                                     = 1,
	CaveEntrance                             = 2,
	Bridge                                   = 3,
};

// Enum JunoProceduralWorld.EJunoPOISlotState
// NumValues: 0x0005
enum class EJunoPOISlotState : uint8
{
	Normal                                   = 0,
	Unused                                   = 1,
	Cosmetic                                 = 2,
	CaveEntrance                             = 3,
	UnusedNearWorldStart                     = 4,
};

// Enum JunoProceduralWorld.EJunoWorldTileInjectedLevelType
// NumValues: 0x0002
enum class EJunoWorldTileInjectedLevelType : uint8
{
	POI                                      = 0,
	Cave                                     = 1,
};

// Enum JunoProceduralWorld.EPushFrontierResult
// NumValues: 0x0009
enum class EPushFrontierResult : uint8
{
	Continue                                 = 0,
	Success                                  = 1,
	Fail                                     = 2,
	OutOfFrontierNodes                       = 3,
	NoNewFrontierCreated                     = 4,
	ReachedMaxCost                           = 5,
	ReachedMaxSteps                          = 6,
	ReachedDestination                       = 7,
	NoValidResult                            = 8,
};

// Enum JunoProceduralWorld.EPathfinderNodeState
// NumValues: 0x0004
enum class EPathfinderNodeState : uint8
{
	Normal                                   = 0,
	Snap                                     = 1,
	Warp                                     = 2,
	Invalid                                  = 3,
};

// Enum JunoProceduralWorld.EJunoRepresentation
// NumValues: 0x0003
enum class EJunoRepresentation : uint8
{
	None                                     = 0,
	Actor                                    = 1,
	Instance                                 = 2,
};

// Enum JunoProceduralWorld.EJunoPOISize
// NumValues: 0x0009
enum class EJunoPOISize : uint8
{
	None                                     = 0,
	JPOI_1x1                                 = 1,
	JPOI_2x2                                 = 2,
	JPOI_3x3                                 = 3,
	JPOI_4x4                                 = 4,
	JPOI_5x5                                 = 5,
	JPOI_8x8                                 = 8,
	JPOI_10x10                               = 10,
	JPOI_11x11                               = 11,
};

// Enum JunoProceduralWorld.PCGJunoApplyMaskNodeMode
// NumValues: 0x0004
enum class EPCGJunoApplyMaskNodeMode : uint8
{
	Subtract                                 = 0,
	Intersect                                = 1,
	SubtractSmaller                          = 2,
	SubtractLarger                           = 3,
};

// Enum JunoProceduralWorld.ELandmassRiverTier
// NumValues: 0x0001
enum class ELandmassRiverTier : uint8
{
	Default                                  = 0,
};

// Enum JunoProceduralWorld.EQueryPOIStateResult
// NumValues: 0x0004
enum class EQueryPOIStateResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	Cached                                   = 2,
	NoEntry                                  = 3,
};

// Enum JunoProceduralWorld.EGeneratePOIResult
// NumValues: 0x0002
enum class EGeneratePOIResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoMarkSlotPOIUnusedResult
// NumValues: 0x0002
enum class EJunoMarkSlotPOIUnusedResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoSetSlotPOIMetaDataResult
// NumValues: 0x0002
enum class EJunoSetSlotPOIMetaDataResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EJunoGetMatchingPOIsFromDataRegistryResult
// NumValues: 0x0002
enum class EJunoGetMatchingPOIsFromDataRegistryResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
};

// Enum JunoProceduralWorld.EVerticalDirection
// NumValues: 0x0003
enum class EVerticalDirection : uint8
{
	Both                                     = 0,
	DownwardOnly                             = 1,
	UpwardOnly                               = 2,
};

// Enum JunoProceduralWorld.ELandmassRoadTier
// NumValues: 0x0008
enum class ELandmassRoadTier : uint8
{
	Default                                  = 0,
	Dirt                                     = 1,
	Rural                                    = 2,
	Metropolitan                             = 3,
	Suburban                                 = 4,
	Highway                                  = 5,
	BreadCrumbs                              = 6,
	Hidden                                   = 7,
};

// Enum JunoProceduralWorld.ERouteGenerationState
// NumValues: 0x0003
enum class ERouteGenerationState : uint8
{
	Inactive                                 = 0,
	Active                                   = 1,
	Dormant                                  = 2,
};

// Enum JunoProceduralWorld.ERouteAvoidancePrimitiveType
// NumValues: 0x0003
enum class ERouteAvoidancePrimitiveType : uint8
{
	Disc                                     = 0,
	Curve                                    = 1,
	ProceduralRoutes                         = 2,
};

// Enum JunoProceduralWorld.EProceduralRouteGuideSetSelectMethod
// NumValues: 0x0002
enum class EProceduralRouteGuideSetSelectMethod : uint8
{
	UseTileId                                = 0,
	UseTileIndex                             = 1,
};

// Enum JunoProceduralWorld.EProceduralRiverAnchorType
// NumValues: 0x0004
enum class EProceduralRiverAnchorType : uint8
{
	Source                                   = 0,
	Lake                                     = 1,
	Coastline                                = 2,
	DeepSea                                  = 3,
};

// Enum JunoProceduralWorld.PCGJunoFractalNoise2DMode
// NumValues: 0x0006
enum class EPCGJunoFractalNoise2DMode : uint32
{
	Perlin                                   = 0,
	Caustic                                  = 1,
	Voronoi                                  = 2,
	TiledVoronoi                             = 3,
	Brownian                                 = 4,
	EdgeMask                                 = 5,
};

// Enum JunoProceduralWorld.PCGJunoFractalNoise2DEdgeMode
// NumValues: 0x0003
enum class EPCGJunoFractalNoise2DEdgeMode : uint32
{
	Perlin                                   = 0,
	Caustic                                  = 1,
	Brownian                                 = 2,
};

// Enum JunoProceduralWorld.PCGJunoFractalDensityMode
// NumValues: 0x0004
enum class EPCGJunoFractalDensityMode : uint32
{
	Ignore                                   = 0,
	Set                                      = 1,
	Add                                      = 2,
	Multiply                                 = 3,
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorPCGResourceMap
// 0x0050 (0x0050 - 0x0000)
struct FJunoCaveGeneratorPCGResourceMap final
{
public:
	TMap<class FName, int32>                      ResourceWeight;                                    // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveGeneratorPCGResourceMap) == 0x000008, "Wrong alignment on FJunoCaveGeneratorPCGResourceMap");
static_assert(sizeof(FJunoCaveGeneratorPCGResourceMap) == 0x000050, "Wrong size on FJunoCaveGeneratorPCGResourceMap");
static_assert(offsetof(FJunoCaveGeneratorPCGResourceMap, ResourceWeight) == 0x000000, "Member 'FJunoCaveGeneratorPCGResourceMap::ResourceWeight' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoRandomTableKeysIterator
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FJunoRandomTableKeysIterator final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoRandomTableKeysIterator) == 0x000008, "Wrong alignment on FJunoRandomTableKeysIterator");
static_assert(sizeof(FJunoRandomTableKeysIterator) == 0x000018, "Wrong size on FJunoRandomTableKeysIterator");

// ScriptStruct JunoProceduralWorld.JunoBridgePOISelectorParams
// 0x0018 (0x0018 - 0x0000)
struct FJunoBridgePOISelectorParams final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RiverWidth;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoBridgePOISelectorParams) == 0x000008, "Wrong alignment on FJunoBridgePOISelectorParams");
static_assert(sizeof(FJunoBridgePOISelectorParams) == 0x000018, "Wrong size on FJunoBridgePOISelectorParams");
static_assert(offsetof(FJunoBridgePOISelectorParams, Guid) == 0x000000, "Member 'FJunoBridgePOISelectorParams::Guid' has a wrong offset!");
static_assert(offsetof(FJunoBridgePOISelectorParams, RiverWidth) == 0x000010, "Member 'FJunoBridgePOISelectorParams::RiverWidth' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorWorldsList
// 0x0010 (0x0010 - 0x0000)
struct FJunoCaveGeneratorWorldsList final
{
public:
	TArray<struct FSoftObjectPath>                Worlds;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveGeneratorWorldsList) == 0x000008, "Wrong alignment on FJunoCaveGeneratorWorldsList");
static_assert(sizeof(FJunoCaveGeneratorWorldsList) == 0x000010, "Wrong size on FJunoCaveGeneratorWorldsList");
static_assert(offsetof(FJunoCaveGeneratorWorldsList, Worlds) == 0x000000, "Member 'FJunoCaveGeneratorWorldsList::Worlds' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveTeleporterLink
// 0x00D0 (0x00D0 - 0x0000)
struct FJunoCaveTeleporterLink final
{
public:
	struct FTransform                             SurfaceTransform;                                  // 0x0000(0x0060)(Edit, BlueprintVisible, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             CaveTransform;                                     // 0x0060(0x0060)(Edit, BlueprintVisible, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AJunoTeleporter>            SurfaceTeleporterClass;                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AJunoTeleporter>            CaveTeleporterClass;                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveTeleporterLink) == 0x000010, "Wrong alignment on FJunoCaveTeleporterLink");
static_assert(sizeof(FJunoCaveTeleporterLink) == 0x0000D0, "Wrong size on FJunoCaveTeleporterLink");
static_assert(offsetof(FJunoCaveTeleporterLink, SurfaceTransform) == 0x000000, "Member 'FJunoCaveTeleporterLink::SurfaceTransform' has a wrong offset!");
static_assert(offsetof(FJunoCaveTeleporterLink, CaveTransform) == 0x000060, "Member 'FJunoCaveTeleporterLink::CaveTransform' has a wrong offset!");
static_assert(offsetof(FJunoCaveTeleporterLink, SurfaceTeleporterClass) == 0x0000C0, "Member 'FJunoCaveTeleporterLink::SurfaceTeleporterClass' has a wrong offset!");
static_assert(offsetof(FJunoCaveTeleporterLink, CaveTeleporterClass) == 0x0000C8, "Member 'FJunoCaveTeleporterLink::CaveTeleporterClass' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveShellInstanceData
// 0x0078 (0x0078 - 0x0000)
struct FJunoCaveShellInstanceData final
{
public:
	int32                                         ExitsUsedMask;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Depth;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Tier;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChainID;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCaveType                                 Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThemeName;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ThemeObject;                                       // 0x0018(0x0020)(Edit, BlueprintVisible, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BranchParentShellID;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EntranceZ;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiome                                    EntranceBiome;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TeleporterTargetPosition;                          // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveTeleporterLink>        Teleporters;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveShellInstanceData) == 0x000008, "Wrong alignment on FJunoCaveShellInstanceData");
static_assert(sizeof(FJunoCaveShellInstanceData) == 0x000078, "Wrong size on FJunoCaveShellInstanceData");
static_assert(offsetof(FJunoCaveShellInstanceData, ExitsUsedMask) == 0x000000, "Member 'FJunoCaveShellInstanceData::ExitsUsedMask' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, Depth) == 0x000004, "Member 'FJunoCaveShellInstanceData::Depth' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, Tier) == 0x000008, "Member 'FJunoCaveShellInstanceData::Tier' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, ChainID) == 0x00000C, "Member 'FJunoCaveShellInstanceData::ChainID' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, Type) == 0x000010, "Member 'FJunoCaveShellInstanceData::Type' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, ThemeName) == 0x000014, "Member 'FJunoCaveShellInstanceData::ThemeName' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, ThemeObject) == 0x000018, "Member 'FJunoCaveShellInstanceData::ThemeObject' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, BranchParentShellID) == 0x000038, "Member 'FJunoCaveShellInstanceData::BranchParentShellID' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, EntranceZ) == 0x000040, "Member 'FJunoCaveShellInstanceData::EntranceZ' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, EntranceBiome) == 0x000048, "Member 'FJunoCaveShellInstanceData::EntranceBiome' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, TeleporterTargetPosition) == 0x000050, "Member 'FJunoCaveShellInstanceData::TeleporterTargetPosition' has a wrong offset!");
static_assert(offsetof(FJunoCaveShellInstanceData, Teleporters) == 0x000068, "Member 'FJunoCaveShellInstanceData::Teleporters' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorResourceWorlds
// 0x0060 (0x0060 - 0x0000)
struct FJunoCaveGeneratorResourceWorlds final
{
public:
	TSet<EJunoBiome>                              ValidBiomes;                                       // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Worlds;                                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveGeneratorResourceWorlds) == 0x000008, "Wrong alignment on FJunoCaveGeneratorResourceWorlds");
static_assert(sizeof(FJunoCaveGeneratorResourceWorlds) == 0x000060, "Wrong size on FJunoCaveGeneratorResourceWorlds");
static_assert(offsetof(FJunoCaveGeneratorResourceWorlds, ValidBiomes) == 0x000000, "Member 'FJunoCaveGeneratorResourceWorlds::ValidBiomes' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorResourceWorlds, Worlds) == 0x000050, "Member 'FJunoCaveGeneratorResourceWorlds::Worlds' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoInstancedActorIterationContext
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FJunoInstancedActorIterationContext final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoInstancedActorIterationContext) == 0x000008, "Wrong alignment on FJunoInstancedActorIterationContext");
static_assert(sizeof(FJunoInstancedActorIterationContext) == 0x000070, "Wrong size on FJunoInstancedActorIterationContext");

// ScriptStruct JunoProceduralWorld.PCGJunoBiomeEntry
// 0x0028 (0x0028 - 0x0000)
struct FPCGJunoBiomeEntry final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Density;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              BiomeElements;                                     // 0x0008(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPCGJunoBiomeEntry) == 0x000008, "Wrong alignment on FPCGJunoBiomeEntry");
static_assert(sizeof(FPCGJunoBiomeEntry) == 0x000028, "Wrong size on FPCGJunoBiomeEntry");
static_assert(offsetof(FPCGJunoBiomeEntry, Name) == 0x000000, "Member 'FPCGJunoBiomeEntry::Name' has a wrong offset!");
static_assert(offsetof(FPCGJunoBiomeEntry, Density) == 0x000004, "Member 'FPCGJunoBiomeEntry::Density' has a wrong offset!");
static_assert(offsetof(FPCGJunoBiomeEntry, BiomeElements) == 0x000008, "Member 'FPCGJunoBiomeEntry::BiomeElements' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorPOIMarker
// 0x00B0 (0x00B0 - 0x0000)
struct FJunoCaveGeneratorPOIMarker final
{
public:
	TSet<EJunoPOISize>                            ValidSizes;                                        // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0050(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveGeneratorPOIMarker) == 0x000010, "Wrong alignment on FJunoCaveGeneratorPOIMarker");
static_assert(sizeof(FJunoCaveGeneratorPOIMarker) == 0x0000B0, "Wrong size on FJunoCaveGeneratorPOIMarker");
static_assert(offsetof(FJunoCaveGeneratorPOIMarker, ValidSizes) == 0x000000, "Member 'FJunoCaveGeneratorPOIMarker::ValidSizes' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorPOIMarker, Transform) == 0x000050, "Member 'FJunoCaveGeneratorPOIMarker::Transform' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoTerrainWaterInformation
// 0x00C0 (0x00C0 - 0x0000)
struct FJunoTerrainWaterInformation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterSurfaceHeight;                                // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TerrainHeight;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterDepth;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x64];                                      // 0x0024(0x0064)(Fixing Size After Last Property [ Dumper-7 ])
	EJunoBiomeHabitat                             WaterType;                                         // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Direction;                                         // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DirectionMaskIndex;                                // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasNearMiss;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFoundWater;                                       // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NearMissEstimatedDistance;                         // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWaterBody*                             FoundWaterBody;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoTerrainWaterInformation) == 0x000008, "Wrong alignment on FJunoTerrainWaterInformation");
static_assert(sizeof(FJunoTerrainWaterInformation) == 0x0000C0, "Wrong size on FJunoTerrainWaterInformation");
static_assert(offsetof(FJunoTerrainWaterInformation, Location) == 0x000000, "Member 'FJunoTerrainWaterInformation::Location' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, WaterSurfaceHeight) == 0x000018, "Member 'FJunoTerrainWaterInformation::WaterSurfaceHeight' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, TerrainHeight) == 0x00001C, "Member 'FJunoTerrainWaterInformation::TerrainHeight' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, WaterDepth) == 0x000020, "Member 'FJunoTerrainWaterInformation::WaterDepth' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, WaterType) == 0x000088, "Member 'FJunoTerrainWaterInformation::WaterType' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, Direction) == 0x000090, "Member 'FJunoTerrainWaterInformation::Direction' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, Distance) == 0x0000A8, "Member 'FJunoTerrainWaterInformation::Distance' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, DirectionMaskIndex) == 0x0000AC, "Member 'FJunoTerrainWaterInformation::DirectionMaskIndex' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, bWasNearMiss) == 0x0000B0, "Member 'FJunoTerrainWaterInformation::bWasNearMiss' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, bFoundWater) == 0x0000B1, "Member 'FJunoTerrainWaterInformation::bFoundWater' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, NearMissEstimatedDistance) == 0x0000B4, "Member 'FJunoTerrainWaterInformation::NearMissEstimatedDistance' has a wrong offset!");
static_assert(offsetof(FJunoTerrainWaterInformation, FoundWaterBody) == 0x0000B8, "Member 'FJunoTerrainWaterInformation::FoundWaterBody' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorShellData
// 0x01A0 (0x01A8 - 0x0008)
struct FJunoCaveGeneratorShellData final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        World;                                             // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<EJunoBiome>                              ValidBiomes;                                       // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<EJunoCaveGeneratorShellTags>             ShellTags;                                         // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EJunoCaveGeneratorShellType                   ShellType;                                         // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCaveGeneratorShellSize                   ShellSize;                                         // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinDepth;                                          // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDepth;                                          // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Version;                                           // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveGeneratorResourceWorlds> ResourceLevels;                                    // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                ShellBoundsSize;                                   // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ShellBoundsCenter;                                 // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ExitLocations;                                     // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumOfSpawners;                                     // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveGeneratorPOIMarker>    POIMarkers;                                        // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumOfAIPointProviders;                             // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EJunoCaveGeneratorLayoutTags, struct FJunoCaveGeneratorWorldsList> SupportedLayouts;                                  // 0x0150(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bHasFixedEntrance;                                 // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PersistenceVersion;                                // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJunoCaveGeneratorShellData) == 0x000008, "Wrong alignment on FJunoCaveGeneratorShellData");
static_assert(sizeof(FJunoCaveGeneratorShellData) == 0x0001A8, "Wrong size on FJunoCaveGeneratorShellData");
static_assert(offsetof(FJunoCaveGeneratorShellData, Name) == 0x000008, "Member 'FJunoCaveGeneratorShellData::Name' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, World) == 0x000010, "Member 'FJunoCaveGeneratorShellData::World' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ValidBiomes) == 0x000028, "Member 'FJunoCaveGeneratorShellData::ValidBiomes' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ShellTags) == 0x000078, "Member 'FJunoCaveGeneratorShellData::ShellTags' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ShellType) == 0x0000C8, "Member 'FJunoCaveGeneratorShellData::ShellType' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ShellSize) == 0x0000C9, "Member 'FJunoCaveGeneratorShellData::ShellSize' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, MinDepth) == 0x0000CC, "Member 'FJunoCaveGeneratorShellData::MinDepth' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, MaxDepth) == 0x0000D0, "Member 'FJunoCaveGeneratorShellData::MaxDepth' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, bEnabled) == 0x0000D4, "Member 'FJunoCaveGeneratorShellData::bEnabled' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, Version) == 0x0000D8, "Member 'FJunoCaveGeneratorShellData::Version' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ResourceLevels) == 0x0000E0, "Member 'FJunoCaveGeneratorShellData::ResourceLevels' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ShellBoundsSize) == 0x0000F0, "Member 'FJunoCaveGeneratorShellData::ShellBoundsSize' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ShellBoundsCenter) == 0x000108, "Member 'FJunoCaveGeneratorShellData::ShellBoundsCenter' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, ExitLocations) == 0x000120, "Member 'FJunoCaveGeneratorShellData::ExitLocations' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, NumOfSpawners) == 0x000130, "Member 'FJunoCaveGeneratorShellData::NumOfSpawners' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, POIMarkers) == 0x000138, "Member 'FJunoCaveGeneratorShellData::POIMarkers' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, NumOfAIPointProviders) == 0x000148, "Member 'FJunoCaveGeneratorShellData::NumOfAIPointProviders' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, SupportedLayouts) == 0x000150, "Member 'FJunoCaveGeneratorShellData::SupportedLayouts' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, bHasFixedEntrance) == 0x0001A0, "Member 'FJunoCaveGeneratorShellData::bHasFixedEntrance' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorShellData, PersistenceVersion) == 0x0001A4, "Member 'FJunoCaveGeneratorShellData::PersistenceVersion' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.SplineCurvesInfo
// 0x0018 (0x0018 - 0x0000)
struct FSplineCurvesInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PointsNum;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSplineCurvesInfo) == 0x000008, "Wrong alignment on FSplineCurvesInfo");
static_assert(sizeof(FSplineCurvesInfo) == 0x000018, "Wrong size on FSplineCurvesInfo");
static_assert(offsetof(FSplineCurvesInfo, Name) == 0x000000, "Member 'FSplineCurvesInfo::Name' has a wrong offset!");
static_assert(offsetof(FSplineCurvesInfo, PointsNum) == 0x000010, "Member 'FSplineCurvesInfo::PointsNum' has a wrong offset!");
static_assert(offsetof(FSplineCurvesInfo, Length) == 0x000014, "Member 'FSplineCurvesInfo::Length' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.SplineGuide
// 0x0120 (0x0120 - 0x0000)
struct FSplineGuide final
{
public:
	struct FSplineCurves                          SplineCurves;                                      // 0x0000(0x0070)(NativeAccessSpecifierPublic)
	bool                                          bIsClosedLoop;                                     // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0080(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSplineCurvesInfo                      SplineCurvesInfo;                                  // 0x00E0(0x0018)(Edit, EditConst, NativeAccessSpecifierPublic)
	bool                                          bAllowRandomYaw;                                   // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRandomScaleVariation;                        // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScaleVariation;                                    // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     GuideClass;                                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSplineGuide) == 0x000010, "Wrong alignment on FSplineGuide");
static_assert(sizeof(FSplineGuide) == 0x000120, "Wrong size on FSplineGuide");
static_assert(offsetof(FSplineGuide, SplineCurves) == 0x000000, "Member 'FSplineGuide::SplineCurves' has a wrong offset!");
static_assert(offsetof(FSplineGuide, bIsClosedLoop) == 0x000070, "Member 'FSplineGuide::bIsClosedLoop' has a wrong offset!");
static_assert(offsetof(FSplineGuide, Transform) == 0x000080, "Member 'FSplineGuide::Transform' has a wrong offset!");
static_assert(offsetof(FSplineGuide, SplineCurvesInfo) == 0x0000E0, "Member 'FSplineGuide::SplineCurvesInfo' has a wrong offset!");
static_assert(offsetof(FSplineGuide, bAllowRandomYaw) == 0x0000F8, "Member 'FSplineGuide::bAllowRandomYaw' has a wrong offset!");
static_assert(offsetof(FSplineGuide, bAllowRandomScaleVariation) == 0x0000F9, "Member 'FSplineGuide::bAllowRandomScaleVariation' has a wrong offset!");
static_assert(offsetof(FSplineGuide, ScaleVariation) == 0x000100, "Member 'FSplineGuide::ScaleVariation' has a wrong offset!");
static_assert(offsetof(FSplineGuide, GuideClass) == 0x000110, "Member 'FSplineGuide::GuideClass' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoWaterSplineInjectorParams
// 0x0140 (0x0140 - 0x0000)
struct FJunoWaterSplineInjectorParams final
{
public:
	struct FSplineGuide                           SplineGuide;                                       // 0x0000(0x0120)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRandomYaw;                                   // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRandomScale;                                 // 0x0125(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScaleRange;                                        // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoWaterSplineInjectorParams) == 0x000010, "Wrong alignment on FJunoWaterSplineInjectorParams");
static_assert(sizeof(FJunoWaterSplineInjectorParams) == 0x000140, "Wrong size on FJunoWaterSplineInjectorParams");
static_assert(offsetof(FJunoWaterSplineInjectorParams, SplineGuide) == 0x000000, "Member 'FJunoWaterSplineInjectorParams::SplineGuide' has a wrong offset!");
static_assert(offsetof(FJunoWaterSplineInjectorParams, Seed) == 0x000120, "Member 'FJunoWaterSplineInjectorParams::Seed' has a wrong offset!");
static_assert(offsetof(FJunoWaterSplineInjectorParams, bAllowRandomYaw) == 0x000124, "Member 'FJunoWaterSplineInjectorParams::bAllowRandomYaw' has a wrong offset!");
static_assert(offsetof(FJunoWaterSplineInjectorParams, bAllowRandomScale) == 0x000125, "Member 'FJunoWaterSplineInjectorParams::bAllowRandomScale' has a wrong offset!");
static_assert(offsetof(FJunoWaterSplineInjectorParams, ScaleRange) == 0x000128, "Member 'FJunoWaterSplineInjectorParams::ScaleRange' has a wrong offset!");

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorRule
// 0x0050 (0x0058 - 0x0008)
struct FJunoCaveGeneratorRule final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectionWeight;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DepthAttemptThreshold;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumberOfTeleporters;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinPrimaryChainLength;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPrimaryChainLength;                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PrimaryChainHallwayChance;                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinNumberOfSecondaryChains;                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumberOfSecondaryChains;                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinSecondaryChainLength;                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSecondaryChainLength;                           // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinStartingDepthOfSecondaryChains;                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxStartingDepthOfSecondaryChains;                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanSpawnOnSecondaryChains;                        // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondaryChainHallwayChance;                       // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumberOfPOIs;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePOISpawnChance;                                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPOIsInTeleporterRooms;                       // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoCaveGeneratorRule) == 0x000008, "Wrong alignment on FJunoCaveGeneratorRule");
static_assert(sizeof(FJunoCaveGeneratorRule) == 0x000058, "Wrong size on FJunoCaveGeneratorRule");
static_assert(offsetof(FJunoCaveGeneratorRule, Name) == 0x000008, "Member 'FJunoCaveGeneratorRule::Name' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, SelectionWeight) == 0x00000C, "Member 'FJunoCaveGeneratorRule::SelectionWeight' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, bEnabled) == 0x000010, "Member 'FJunoCaveGeneratorRule::bEnabled' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, DepthAttemptThreshold) == 0x000014, "Member 'FJunoCaveGeneratorRule::DepthAttemptThreshold' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MaxNumberOfTeleporters) == 0x000018, "Member 'FJunoCaveGeneratorRule::MaxNumberOfTeleporters' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MinPrimaryChainLength) == 0x00001C, "Member 'FJunoCaveGeneratorRule::MinPrimaryChainLength' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MaxPrimaryChainLength) == 0x000020, "Member 'FJunoCaveGeneratorRule::MaxPrimaryChainLength' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, PrimaryChainHallwayChance) == 0x000024, "Member 'FJunoCaveGeneratorRule::PrimaryChainHallwayChance' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MinNumberOfSecondaryChains) == 0x000028, "Member 'FJunoCaveGeneratorRule::MinNumberOfSecondaryChains' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MaxNumberOfSecondaryChains) == 0x00002C, "Member 'FJunoCaveGeneratorRule::MaxNumberOfSecondaryChains' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MinSecondaryChainLength) == 0x000030, "Member 'FJunoCaveGeneratorRule::MinSecondaryChainLength' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MaxSecondaryChainLength) == 0x000034, "Member 'FJunoCaveGeneratorRule::MaxSecondaryChainLength' has a wrong offset!");
static_assert(offsetof(FJunoCaveGeneratorRule, MinStartingDepthOfSecondaryChains) == 0x000038, "Member 'FJunoCaveGeneratorRule::MinStartingDepthOfSecondaryChains' has a wrong offset!");
