#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoFrontendUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function JunoFrontendUI.JunoWorldManagementViewModel.InitWorldData
// 0x0040 (0x0040 - 0x0000)
struct JunoWorldManagementViewModel_InitWorldData final
{
public:
	TSoftObjectPtr<class UDataTable>              InSettingDataTable;                                // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              InWorldImageDataTable;                             // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoWorldManagementViewModel_InitWorldData) == 0x000008, "Wrong alignment on JunoWorldManagementViewModel_InitWorldData");
static_assert(sizeof(JunoWorldManagementViewModel_InitWorldData) == 0x000040, "Wrong size on JunoWorldManagementViewModel_InitWorldData");
static_assert(offsetof(JunoWorldManagementViewModel_InitWorldData, InSettingDataTable) == 0x000000, "Member 'JunoWorldManagementViewModel_InitWorldData::InSettingDataTable' has a wrong offset!");
static_assert(offsetof(JunoWorldManagementViewModel_InitWorldData, InWorldImageDataTable) == 0x000020, "Member 'JunoWorldManagementViewModel_InitWorldData::InWorldImageDataTable' has a wrong offset!");

// Function JunoFrontendUI.JunoWorldManagementViewModel.StartMatchmakingInModeratorMode
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldManagementViewModel_StartMatchmakingInModeratorMode final
{
public:
	class FString                                 InWorldId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoWorldManagementViewModel_StartMatchmakingInModeratorMode) == 0x000008, "Wrong alignment on JunoWorldManagementViewModel_StartMatchmakingInModeratorMode");
static_assert(sizeof(JunoWorldManagementViewModel_StartMatchmakingInModeratorMode) == 0x000010, "Wrong size on JunoWorldManagementViewModel_StartMatchmakingInModeratorMode");
static_assert(offsetof(JunoWorldManagementViewModel_StartMatchmakingInModeratorMode, InWorldId) == 0x000000, "Member 'JunoWorldManagementViewModel_StartMatchmakingInModeratorMode::InWorldId' has a wrong offset!");

// Function JunoFrontendUI.JunoWorldManagementViewModel.GetIsCreateFlowSelected
// 0x0001 (0x0001 - 0x0000)
struct JunoWorldManagementViewModel_GetIsCreateFlowSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoWorldManagementViewModel_GetIsCreateFlowSelected) == 0x000001, "Wrong alignment on JunoWorldManagementViewModel_GetIsCreateFlowSelected");
static_assert(sizeof(JunoWorldManagementViewModel_GetIsCreateFlowSelected) == 0x000001, "Wrong size on JunoWorldManagementViewModel_GetIsCreateFlowSelected");
static_assert(offsetof(JunoWorldManagementViewModel_GetIsCreateFlowSelected, ReturnValue) == 0x000000, "Member 'JunoWorldManagementViewModel_GetIsCreateFlowSelected::ReturnValue' has a wrong offset!");

}

