#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"
#include "GameplayGraph_structs.hpp"


namespace SDK::Params
{

// Function JunoGameNative.JunoBuildingTrackedActorInterface.GetNetRelevanceDistanceOverride
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride) == 0x000004, "Wrong alignment on JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride");
static_assert(sizeof(JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride) == 0x000004, "Wrong size on JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride");
static_assert(offsetof(JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride, ReturnValue) == 0x000000, "Member 'JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoBuildingTrackedActorInterface.GetNumberOfRelevantActors
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors) == 0x000004, "Wrong alignment on JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors");
static_assert(sizeof(JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors) == 0x000004, "Wrong size on JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors");
static_assert(offsetof(JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors, ReturnValue) == 0x000000, "Member 'JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoBuildingTrackedActorInterface.ShouldBeTrackedByMetrics
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics) == 0x000001, "Wrong alignment on JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics");
static_assert(sizeof(JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics) == 0x000001, "Wrong size on JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics");
static_assert(offsetof(JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics, ReturnValue) == 0x000000, "Member 'JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyDrained
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained final
{
public:
	class UFortComponent_Energy*                  EnergyComponentDrained;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained) == 0x000008, "Wrong alignment on JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained");
static_assert(sizeof(JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained) == 0x000008, "Wrong size on JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained, EnergyComponentDrained) == 0x000000, "Member 'JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained::EnergyComponentDrained' has a wrong offset!");

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyFullyRecharged
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged final
{
public:
	class UFortComponent_Energy*                  EnergyComponentRecharged;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged) == 0x000008, "Wrong alignment on JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged");
static_assert(sizeof(JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged) == 0x000008, "Wrong size on JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged, EnergyComponentRecharged) == 0x000000, "Member 'JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged::EnergyComponentRecharged' has a wrong offset!");

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnPlayerHit
// 0x0110 (0x0110 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnPlayerHit final
{
public:
	class AActor*                                 HitPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitActor;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0028(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAbility_PlayerPushPhysicsObject_OnPlayerHit) == 0x000008, "Wrong alignment on JunoAbility_PlayerPushPhysicsObject_OnPlayerHit");
static_assert(sizeof(JunoAbility_PlayerPushPhysicsObject_OnPlayerHit) == 0x000110, "Wrong size on JunoAbility_PlayerPushPhysicsObject_OnPlayerHit");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_OnPlayerHit, HitPlayer) == 0x000000, "Member 'JunoAbility_PlayerPushPhysicsObject_OnPlayerHit::HitPlayer' has a wrong offset!");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_OnPlayerHit, HitActor) == 0x000008, "Member 'JunoAbility_PlayerPushPhysicsObject_OnPlayerHit::HitActor' has a wrong offset!");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_OnPlayerHit, NormalImpulse) == 0x000010, "Member 'JunoAbility_PlayerPushPhysicsObject_OnPlayerHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_OnPlayerHit, Hit) == 0x000028, "Member 'JunoAbility_PlayerPushPhysicsObject_OnPlayerHit::Hit' has a wrong offset!");

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.GetMontageToPlay
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay) == 0x000008, "Wrong alignment on JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay");
static_assert(sizeof(JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay) == 0x000008, "Wrong size on JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay");
static_assert(offsetof(JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay, ReturnValue) == 0x000000, "Member 'JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoPassiveResourcesGatheringComponent.OverrideGatheringRow
// 0x0018 (0x0018 - 0x0000)
struct JunoPassiveResourcesGatheringComponent_OverrideGatheringRow final
{
public:
	struct FDataTableRowHandle                    GatheringRow;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JunoPassiveResourcesGatheringComponent_OverrideGatheringRow) == 0x000008, "Wrong alignment on JunoPassiveResourcesGatheringComponent_OverrideGatheringRow");
static_assert(sizeof(JunoPassiveResourcesGatheringComponent_OverrideGatheringRow) == 0x000018, "Wrong size on JunoPassiveResourcesGatheringComponent_OverrideGatheringRow");
static_assert(offsetof(JunoPassiveResourcesGatheringComponent_OverrideGatheringRow, GatheringRow) == 0x000000, "Member 'JunoPassiveResourcesGatheringComponent_OverrideGatheringRow::GatheringRow' has a wrong offset!");
static_assert(offsetof(JunoPassiveResourcesGatheringComponent_OverrideGatheringRow, ReturnValue) == 0x000010, "Member 'JunoPassiveResourcesGatheringComponent_OverrideGatheringRow::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoAthenaCharacterItemOverrideDefinition.SetBaseAthenaCharacterItemDefinition
// 0x0020 (0x0020 - 0x0000)
struct JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition final
{
public:
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition;               // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition) == 0x000008, "Wrong alignment on JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition");
static_assert(sizeof(JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition) == 0x000020, "Wrong size on JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition");
static_assert(offsetof(JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition, InBaseAthenaCharacterItemDefinition) == 0x000000, "Member 'JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition::InBaseAthenaCharacterItemDefinition' has a wrong offset!");

// Function JunoGameNative.JunoAthenaDanceItemOverrideDefinition.SetBaseAthenaDanceItemDefinition
// 0x0020 (0x0020 - 0x0000)
struct JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition final
{
public:
	TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition;                   // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition) == 0x000008, "Wrong alignment on JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition");
static_assert(sizeof(JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition) == 0x000020, "Wrong size on JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition");
static_assert(offsetof(JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition, InBaseAthenaDanceItemDefinition) == 0x000000, "Member 'JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition::InBaseAthenaDanceItemDefinition' has a wrong offset!");

// Function JunoGameNative.JunoActorAttributeOverrideComponent.GetPrimaryLootTier
// 0x0004 (0x0004 - 0x0000)
struct JunoActorAttributeOverrideComponent_GetPrimaryLootTier final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoActorAttributeOverrideComponent_GetPrimaryLootTier) == 0x000004, "Wrong alignment on JunoActorAttributeOverrideComponent_GetPrimaryLootTier");
static_assert(sizeof(JunoActorAttributeOverrideComponent_GetPrimaryLootTier) == 0x000004, "Wrong size on JunoActorAttributeOverrideComponent_GetPrimaryLootTier");
static_assert(offsetof(JunoActorAttributeOverrideComponent_GetPrimaryLootTier, ReturnValue) == 0x000000, "Member 'JunoActorAttributeOverrideComponent_GetPrimaryLootTier::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoActorAttributeOverrideComponent.GetSecondaryLootTier
// 0x0004 (0x0004 - 0x0000)
struct JunoActorAttributeOverrideComponent_GetSecondaryLootTier final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoActorAttributeOverrideComponent_GetSecondaryLootTier) == 0x000004, "Wrong alignment on JunoActorAttributeOverrideComponent_GetSecondaryLootTier");
static_assert(sizeof(JunoActorAttributeOverrideComponent_GetSecondaryLootTier) == 0x000004, "Wrong size on JunoActorAttributeOverrideComponent_GetSecondaryLootTier");
static_assert(offsetof(JunoActorAttributeOverrideComponent_GetSecondaryLootTier, ReturnValue) == 0x000000, "Member 'JunoActorAttributeOverrideComponent_GetSecondaryLootTier::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoPlayerCampPawnComponent.HandleAwesomeLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged final
{
public:
	struct FJunoAwesomeLevelChangeData            ChangeData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged) == 0x000008, "Wrong alignment on JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged");
static_assert(sizeof(JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged) == 0x000018, "Wrong size on JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged");
static_assert(offsetof(JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged, ChangeData) == 0x000000, "Member 'JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged::ChangeData' has a wrong offset!");

// Function JunoGameNative.JunoAlterationCraftingComponent.HandleCraftingStateChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoAlterationCraftingComponent_HandleCraftingStateChanged final
{
public:
	struct FCraftingObjectStateChangedEvent       Event;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAlterationCraftingComponent_HandleCraftingStateChanged) == 0x000008, "Wrong alignment on JunoAlterationCraftingComponent_HandleCraftingStateChanged");
static_assert(sizeof(JunoAlterationCraftingComponent_HandleCraftingStateChanged) == 0x000028, "Wrong size on JunoAlterationCraftingComponent_HandleCraftingStateChanged");
static_assert(offsetof(JunoAlterationCraftingComponent_HandleCraftingStateChanged, Event) == 0x000000, "Member 'JunoAlterationCraftingComponent_HandleCraftingStateChanged::Event' has a wrong offset!");

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCheckValidItemType
// 0x0010 (0x0010 - 0x0000)
struct JunoAlterationCraftingComponent_OnCheckValidItemType final
{
public:
	class AFortPlayerController*                  Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JunoAlterationCraftingComponent_OnCheckValidItemType) == 0x000008, "Wrong alignment on JunoAlterationCraftingComponent_OnCheckValidItemType");
static_assert(sizeof(JunoAlterationCraftingComponent_OnCheckValidItemType) == 0x000010, "Wrong size on JunoAlterationCraftingComponent_OnCheckValidItemType");
static_assert(offsetof(JunoAlterationCraftingComponent_OnCheckValidItemType, Instigator) == 0x000000, "Member 'JunoAlterationCraftingComponent_OnCheckValidItemType::Instigator' has a wrong offset!");
static_assert(offsetof(JunoAlterationCraftingComponent_OnCheckValidItemType, ReturnValue) == 0x000008, "Member 'JunoAlterationCraftingComponent_OnCheckValidItemType::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCraftingSuccess
// 0x0030 (0x0030 - 0x0000)
struct JunoAlterationCraftingComponent_OnCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAlterationCraftingComponent_OnCraftingSuccess) == 0x000008, "Wrong alignment on JunoAlterationCraftingComponent_OnCraftingSuccess");
static_assert(sizeof(JunoAlterationCraftingComponent_OnCraftingSuccess) == 0x000030, "Wrong size on JunoAlterationCraftingComponent_OnCraftingSuccess");
static_assert(offsetof(JunoAlterationCraftingComponent_OnCraftingSuccess, Event) == 0x000000, "Member 'JunoAlterationCraftingComponent_OnCraftingSuccess::Event' has a wrong offset!");

// Function JunoGameNative.JunoAsyncAction_WaitForEventRouter.WaitForEventRouter
// 0x0010 (0x0010 - 0x0000)
struct JunoAsyncAction_WaitForEventRouter_WaitForEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoAsyncAction_WaitForEventRouter*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoAsyncAction_WaitForEventRouter_WaitForEventRouter) == 0x000008, "Wrong alignment on JunoAsyncAction_WaitForEventRouter_WaitForEventRouter");
static_assert(sizeof(JunoAsyncAction_WaitForEventRouter_WaitForEventRouter) == 0x000010, "Wrong size on JunoAsyncAction_WaitForEventRouter_WaitForEventRouter");
static_assert(offsetof(JunoAsyncAction_WaitForEventRouter_WaitForEventRouter, ContextActor) == 0x000000, "Member 'JunoAsyncAction_WaitForEventRouter_WaitForEventRouter::ContextActor' has a wrong offset!");
static_assert(offsetof(JunoAsyncAction_WaitForEventRouter_WaitForEventRouter, ReturnValue) == 0x000008, "Member 'JunoAsyncAction_WaitForEventRouter_WaitForEventRouter::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSelectionSpawnedByBuilderTool
// 0x0110 (0x0110 - 0x0000)
struct JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool final
{
public:
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoBuilderToolInteractionBehavior*    Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuilderToolSelectionSpawnParams   SelectionSpawnParameters;                          // 0x0010(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool) == 0x000010, "Wrong alignment on JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool");
static_assert(sizeof(JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool) == 0x000110, "Wrong size on JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool");
static_assert(offsetof(JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool, BuilderTool) == 0x000000, "Member 'JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool::BuilderTool' has a wrong offset!");
static_assert(offsetof(JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool, Behavior) == 0x000008, "Member 'JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool::Behavior' has a wrong offset!");
static_assert(offsetof(JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool, SelectionSpawnParameters) == 0x000010, "Member 'JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool::SelectionSpawnParameters' has a wrong offset!");

// Function JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSpawnedByBuilderTool
// 0x0010 (0x0010 - 0x0000)
struct JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool final
{
public:
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoBuilderToolInteractionBehavior*    Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool) == 0x000008, "Wrong alignment on JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool");
static_assert(sizeof(JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool) == 0x000010, "Wrong size on JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool");
static_assert(offsetof(JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool, BuilderTool) == 0x000000, "Member 'JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool::BuilderTool' has a wrong offset!");
static_assert(offsetof(JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool, Behavior) == 0x000008, "Member 'JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool::Behavior' has a wrong offset!");

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnectionLocations
// 0x01E0 (0x01E0 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingConnection                Connection;                                        // 0x0010(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations) == 0x000010, "Wrong alignment on JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations");
static_assert(sizeof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations) == 0x0001E0, "Wrong size on JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations, WorldContextObject) == 0x000000, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations::WorldContextObject' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations, Connection) == 0x000010, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations::Connection' has a wrong offset!");

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnections
// 0x0290 (0x0290 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Candidates;                                        // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Targets;                                           // 0x0058(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingConnection                ChosenConnection;                                  // 0x00B0(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnection>        Connections;                                       // 0x0280(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections) == 0x000010, "Wrong alignment on JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections");
static_assert(sizeof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections) == 0x000290, "Wrong size on JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections, WorldContextObject) == 0x000000, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections::WorldContextObject' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections, Candidates) == 0x000008, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections::Candidates' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections, Targets) == 0x000058, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections::Targets' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections, ChosenConnection) == 0x0000B0, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections::ChosenConnection' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections, Connections) == 0x000280, "Member 'JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections::Connections' has a wrong offset!");

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetAtomModelAssetUserData
// 0x0018 (0x0018 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAtomModelAssetUserData*>        ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData) == 0x000008, "Wrong alignment on JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData");
static_assert(sizeof(JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData) == 0x000018, "Wrong size on JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData, Object) == 0x000000, "Member 'JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData::Object' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData, ReturnValue) == 0x000008, "Member 'JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetKnobs
// 0x0060 (0x0060 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetKnobs final
{
public:
	struct FJunoBuildingConnectionPointsResult    Result;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnectionPoint>   ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingConnectivityBlueprintLibrary_GetKnobs) == 0x000008, "Wrong alignment on JunoBuildingConnectivityBlueprintLibrary_GetKnobs");
static_assert(sizeof(JunoBuildingConnectivityBlueprintLibrary_GetKnobs) == 0x000060, "Wrong size on JunoBuildingConnectivityBlueprintLibrary_GetKnobs");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_GetKnobs, Result) == 0x000000, "Member 'JunoBuildingConnectivityBlueprintLibrary_GetKnobs::Result' has a wrong offset!");
static_assert(offsetof(JunoBuildingConnectivityBlueprintLibrary_GetKnobs, ReturnValue) == 0x000050, "Member 'JunoBuildingConnectivityBlueprintLibrary_GetKnobs::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoBuildingProp.GetAssociatedItem
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingProp_GetAssociatedItem final
{
public:
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingProp_GetAssociatedItem) == 0x000008, "Wrong alignment on JunoBuildingProp_GetAssociatedItem");
static_assert(sizeof(JunoBuildingProp_GetAssociatedItem) == 0x000008, "Wrong size on JunoBuildingProp_GetAssociatedItem");
static_assert(offsetof(JunoBuildingProp_GetAssociatedItem, ReturnValue) == 0x000000, "Member 'JunoBuildingProp_GetAssociatedItem::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoBuildingPropTree.BlueprintCanDieInLifecyclePhase
// 0x0002 (0x0002 - 0x0000)
struct JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase final
{
public:
	uint8                                         CurrentPhaseIndex;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase) == 0x000001, "Wrong alignment on JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase");
static_assert(sizeof(JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase) == 0x000002, "Wrong size on JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase");
static_assert(offsetof(JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase, CurrentPhaseIndex) == 0x000000, "Member 'JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase::CurrentPhaseIndex' has a wrong offset!");
static_assert(offsetof(JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase, ReturnValue) == 0x000001, "Member 'JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampCenterComponent.HandleSmartObjectEvent
// 0x0038 (0x0038 - 0x0000)
struct JunoCampCenterComponent_HandleSmartObjectEvent final
{
public:
	struct FSmartObjectEventData                  SmartObjectEventData;                              // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampCenterComponent_HandleSmartObjectEvent) == 0x000008, "Wrong alignment on JunoCampCenterComponent_HandleSmartObjectEvent");
static_assert(sizeof(JunoCampCenterComponent_HandleSmartObjectEvent) == 0x000038, "Wrong size on JunoCampCenterComponent_HandleSmartObjectEvent");
static_assert(offsetof(JunoCampCenterComponent_HandleSmartObjectEvent, SmartObjectEventData) == 0x000000, "Member 'JunoCampCenterComponent_HandleSmartObjectEvent::SmartObjectEventData' has a wrong offset!");
static_assert(offsetof(JunoCampCenterComponent_HandleSmartObjectEvent, Actor) == 0x000030, "Member 'JunoCampCenterComponent_HandleSmartObjectEvent::Actor' has a wrong offset!");

// Function JunoGameNative.JunoCampCenterComponent.NotifyOwnerPlacedByBuilderTool
// 0x0008 (0x0008 - 0x0000)
struct JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool) == 0x000008, "Wrong alignment on JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool");
static_assert(sizeof(JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool) == 0x000008, "Wrong size on JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool");
static_assert(offsetof(JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool, FortPC) == 0x000000, "Member 'JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool::FortPC' has a wrong offset!");

// Function JunoGameNative.JunoCampCenterComponent.OnCampAwesomeLevelChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoCampCenterComponent_OnCampAwesomeLevelChanged final
{
public:
	struct FJunoEvent_CampAwesomeLevelChanged     Payload;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampCenterComponent_OnCampAwesomeLevelChanged) == 0x000008, "Wrong alignment on JunoCampCenterComponent_OnCampAwesomeLevelChanged");
static_assert(sizeof(JunoCampCenterComponent_OnCampAwesomeLevelChanged) == 0x000028, "Wrong size on JunoCampCenterComponent_OnCampAwesomeLevelChanged");
static_assert(offsetof(JunoCampCenterComponent_OnCampAwesomeLevelChanged, Payload) == 0x000000, "Member 'JunoCampCenterComponent_OnCampAwesomeLevelChanged::Payload' has a wrong offset!");

// Function JunoGameNative.JunoCampCenterComponent.OnCampAwesomePointModification
// 0x0038 (0x0038 - 0x0000)
struct JunoCampCenterComponent_OnCampAwesomePointModification final
{
public:
	struct FJunoEvent_CampAwesomePointsModified   Payload;                                           // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampCenterComponent_OnCampAwesomePointModification) == 0x000008, "Wrong alignment on JunoCampCenterComponent_OnCampAwesomePointModification");
static_assert(sizeof(JunoCampCenterComponent_OnCampAwesomePointModification) == 0x000038, "Wrong size on JunoCampCenterComponent_OnCampAwesomePointModification");
static_assert(offsetof(JunoCampCenterComponent_OnCampAwesomePointModification, Payload) == 0x000000, "Member 'JunoCampCenterComponent_OnCampAwesomePointModification::Payload' has a wrong offset!");

// Function JunoGameNative.JunoSyncTimeOfDayComponent.SetTimeOfDaySyncEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled final
{
public:
	bool                                          bNewTimeOfDaySyncEnabled;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled) == 0x000001, "Wrong alignment on JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled");
static_assert(sizeof(JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled) == 0x000001, "Wrong size on JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled");
static_assert(offsetof(JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled, bNewTimeOfDaySyncEnabled) == 0x000000, "Member 'JunoSyncTimeOfDayComponent_SetTimeOfDaySyncEnabled::bNewTimeOfDaySyncEnabled' has a wrong offset!");

// Function JunoGameNative.JunoSyncTimeOfDayComponent.GetTimeOfDaySyncEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled) == 0x000001, "Wrong alignment on JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled");
static_assert(sizeof(JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled) == 0x000001, "Wrong size on JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled");
static_assert(offsetof(JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled, ReturnValue) == 0x000000, "Member 'JunoSyncTimeOfDayComponent_GetTimeOfDaySyncEnabled::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampAtLocationAndReturnComponent
// 0x0030 (0x0030 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          WorldContextObject;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent");
static_assert(sizeof(JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent) == 0x000030, "Wrong size on JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent, ComponentClass) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent::ComponentClass' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent, WorldContextObject) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent::WorldContextObject' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent, Location) == 0x000010, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent::Location' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent, ReturnValue) == 0x000028, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindBindableLocalCampForActor) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindBindableLocalCampForActor");
static_assert(sizeof(JunoCampMembershipActorComponent_FindBindableLocalCampForActor) == 0x000010, "Wrong size on JunoCampMembershipActorComponent_FindBindableLocalCampForActor");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForActor, Actor) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForActor::Actor' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForActor, ReturnValue) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForActor::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActorAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent");
static_assert(sizeof(JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent) == 0x000018, "Wrong size on JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent, ComponentClass) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent::ComponentClass' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent, Actor) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent::Actor' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent, ReturnValue) == 0x000010, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForArea
// 0x0048 (0x0048 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForArea final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   AreaBox;                                           // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindBindableLocalCampForArea) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindBindableLocalCampForArea");
static_assert(sizeof(JunoCampMembershipActorComponent_FindBindableLocalCampForArea) == 0x000048, "Wrong size on JunoCampMembershipActorComponent_FindBindableLocalCampForArea");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForArea, Actor) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForArea::Actor' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForArea, AreaBox) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForArea::AreaBox' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForArea, ReturnValue) == 0x000040, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForArea::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForLocation
// 0x0028 (0x0028 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindBindableLocalCampForLocation) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindBindableLocalCampForLocation");
static_assert(sizeof(JunoCampMembershipActorComponent_FindBindableLocalCampForLocation) == 0x000028, "Wrong size on JunoCampMembershipActorComponent_FindBindableLocalCampForLocation");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForLocation, WorldContextObject) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForLocation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForLocation, Location) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForLocation::Location' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindBindableLocalCampForLocation, ReturnValue) == 0x000020, "Member 'JunoCampMembershipActorComponent_FindBindableLocalCampForLocation::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipActorComponentOnActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCampMembershipActorComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor");
static_assert(sizeof(JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor) == 0x000010, "Wrong size on JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor");
static_assert(offsetof(JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor, Owner) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor::Owner' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor, ReturnValue) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipComponentAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Owner;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent");
static_assert(sizeof(JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent) == 0x000018, "Wrong size on JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent");
static_assert(offsetof(JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent, ComponentClass) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent::ComponentClass' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent, Owner) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent::Owner' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent, ReturnValue) == 0x000010, "Member 'JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindOrCreateCampMembershipActorComponentOnActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCampMembershipActorComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor");
static_assert(sizeof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor) == 0x000010, "Wrong size on JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor");
static_assert(offsetof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor, Owner) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor::Owner' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor, ReturnValue) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindOrCreateCampMembershipActorComponentOnActor::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.FindOrCreateCampMembershipComponentAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Owner;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent");
static_assert(sizeof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent) == 0x000018, "Wrong size on JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent");
static_assert(offsetof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent, ComponentClass) == 0x000000, "Member 'JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent::ComponentClass' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent, Owner) == 0x000008, "Member 'JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent::Owner' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent, ReturnValue) == 0x000010, "Member 'JunoCampMembershipActorComponent_FindOrCreateCampMembershipComponentAndReturnComponent::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.HasCampAtBounds
// 0x0048 (0x0048 - 0x0000)
struct JunoCampMembershipActorComponent_HasCampAtBounds final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JunoCampMembershipActorComponent_HasCampAtBounds) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_HasCampAtBounds");
static_assert(sizeof(JunoCampMembershipActorComponent_HasCampAtBounds) == 0x000048, "Wrong size on JunoCampMembershipActorComponent_HasCampAtBounds");
static_assert(offsetof(JunoCampMembershipActorComponent_HasCampAtBounds, WorldContextObject) == 0x000000, "Member 'JunoCampMembershipActorComponent_HasCampAtBounds::WorldContextObject' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_HasCampAtBounds, Bounds) == 0x000008, "Member 'JunoCampMembershipActorComponent_HasCampAtBounds::Bounds' has a wrong offset!");
static_assert(offsetof(JunoCampMembershipActorComponent_HasCampAtBounds, ReturnValue) == 0x000040, "Member 'JunoCampMembershipActorComponent_HasCampAtBounds::ReturnValue' has a wrong offset!");

// Function JunoGameNative.JunoCampMembershipActorComponent.HasCampAtLocation
// 0x0028 (0x0028 - 0x0000)
struct JunoCampMembershipActorComponent_HasCampAtLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JunoCampMembershipActorComponent_HasCampAtLocation) == 0x000008, "Wrong alignment on JunoCampMembershipActorComponent_HasCampAtLocation");
