#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeysAndLocksUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function KeysAndLocksUI.KeyPlayerInfoWidget.HandleGameplayTagEvent
// 0x0008 (0x0008 - 0x0000)
struct KeyPlayerInfoWidget_HandleGameplayTagEvent final
{
public:
	struct FGameplayTag                           UpdatedTag;                                        // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TagCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeyPlayerInfoWidget_HandleGameplayTagEvent) == 0x000004, "Wrong alignment on KeyPlayerInfoWidget_HandleGameplayTagEvent");
static_assert(sizeof(KeyPlayerInfoWidget_HandleGameplayTagEvent) == 0x000008, "Wrong size on KeyPlayerInfoWidget_HandleGameplayTagEvent");
static_assert(offsetof(KeyPlayerInfoWidget_HandleGameplayTagEvent, UpdatedTag) == 0x000000, "Member 'KeyPlayerInfoWidget_HandleGameplayTagEvent::UpdatedTag' has a wrong offset!");
static_assert(offsetof(KeyPlayerInfoWidget_HandleGameplayTagEvent, TagCount) == 0x000004, "Member 'KeyPlayerInfoWidget_HandleGameplayTagEvent::TagCount' has a wrong offset!");

// Function KeysAndLocksUI.KeyPlayerInfoWidget.OnKeyStatusActivated
// 0x0010 (0x0010 - 0x0000)
struct KeyPlayerInfoWidget_OnKeyStatusActivated final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivated;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KeyPlayerInfoWidget_OnKeyStatusActivated) == 0x000008, "Wrong alignment on KeyPlayerInfoWidget_OnKeyStatusActivated");
static_assert(sizeof(KeyPlayerInfoWidget_OnKeyStatusActivated) == 0x000010, "Wrong size on KeyPlayerInfoWidget_OnKeyStatusActivated");
static_assert(offsetof(KeyPlayerInfoWidget_OnKeyStatusActivated, InPlayerState) == 0x000000, "Member 'KeyPlayerInfoWidget_OnKeyStatusActivated::InPlayerState' has a wrong offset!");
static_assert(offsetof(KeyPlayerInfoWidget_OnKeyStatusActivated, bActivated) == 0x000008, "Member 'KeyPlayerInfoWidget_OnKeyStatusActivated::bActivated' has a wrong offset!");

}

