#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LaserGameplayRuntime

#include "Basic.hpp"

#include "NetCore_structs.hpp"


namespace SDK
{

// Enum LaserGameplayRuntime.ELaserConnectionState
// NumValues: 0x0004
enum class ELaserConnectionState : uint8
{
	Off                                      = 0,
	TransitionOn                             = 1,
	On                                       = 2,
	TransitionOff                            = 3,
};

// ScriptStruct LaserGameplayRuntime.LaserOutletConnection
// 0x0002 (0x0002 - 0x0000)
struct FLaserOutletConnection final
{
public:
	uint8                                         PrimaryOutletIndex;                                // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         SecondaryOutletIndex;                              // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FLaserOutletConnection) == 0x000001, "Wrong alignment on FLaserOutletConnection");
static_assert(sizeof(FLaserOutletConnection) == 0x000002, "Wrong size on FLaserOutletConnection");
static_assert(offsetof(FLaserOutletConnection, PrimaryOutletIndex) == 0x000000, "Member 'FLaserOutletConnection::PrimaryOutletIndex' has a wrong offset!");
static_assert(offsetof(FLaserOutletConnection, SecondaryOutletIndex) == 0x000001, "Member 'FLaserOutletConnection::SecondaryOutletIndex' has a wrong offset!");

// ScriptStruct LaserGameplayRuntime.LaserGridConnectionEntry
// 0x000C (0x0018 - 0x000C)
struct FLaserGridConnectionEntry final : public FFastArraySerializerItem
{
public:
	struct FLaserOutletConnection                 OutletConnection;                                  // 0x000C(0x0002)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ELaserConnectionState                         State;                                             // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULaserCapsuleComponent*                 LaserCapsuleComponent;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, RepSkip, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FLaserGridConnectionEntry) == 0x000008, "Wrong alignment on FLaserGridConnectionEntry");
static_assert(sizeof(FLaserGridConnectionEntry) == 0x000018, "Wrong size on FLaserGridConnectionEntry");
static_assert(offsetof(FLaserGridConnectionEntry, OutletConnection) == 0x00000C, "Member 'FLaserGridConnectionEntry::OutletConnection' has a wrong offset!");
static_assert(offsetof(FLaserGridConnectionEntry, State) == 0x00000E, "Member 'FLaserGridConnectionEntry::State' has a wrong offset!");
static_assert(offsetof(FLaserGridConnectionEntry, LaserCapsuleComponent) == 0x000010, "Member 'FLaserGridConnectionEntry::LaserCapsuleComponent' has a wrong offset!");

// ScriptStruct LaserGameplayRuntime.LaserGridConnectionArray
// 0x0010 (0x0118 - 0x0108)
struct FLaserGridConnectionArray final : public FFastArraySerializer
{
public:
	TArray<struct FLaserGridConnectionEntry>      Entries;                                           // 0x0108(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLaserGridConnectionArray) == 0x000008, "Wrong alignment on FLaserGridConnectionArray");
static_assert(sizeof(FLaserGridConnectionArray) == 0x000118, "Wrong size on FLaserGridConnectionArray");
static_assert(offsetof(FLaserGridConnectionArray, Entries) == 0x000108, "Member 'FLaserGridConnectionArray::Entries' has a wrong offset!");

// ScriptStruct LaserGameplayRuntime.LaserGridOutletEntry
// 0x0004 (0x0010 - 0x000C)
struct FLaserGridOutletEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         InstanceIndex;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELaserConnectionState                         State;                                             // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLaserGridOutletEntry) == 0x000004, "Wrong alignment on FLaserGridOutletEntry");
static_assert(sizeof(FLaserGridOutletEntry) == 0x000010, "Wrong size on FLaserGridOutletEntry");
static_assert(offsetof(FLaserGridOutletEntry, InstanceIndex) == 0x00000C, "Member 'FLaserGridOutletEntry::InstanceIndex' has a wrong offset!");
static_assert(offsetof(FLaserGridOutletEntry, State) == 0x00000D, "Member 'FLaserGridOutletEntry::State' has a wrong offset!");

// ScriptStruct LaserGameplayRuntime.LaserGridOutletArray
// 0x0018 (0x0120 - 0x0108)
struct FLaserGridOutletArray final : public FFastArraySerializer
{
public:
	TArray<struct FLaserGridOutletEntry>          Entries;                                           // 0x0108(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLaserGridOutletArray) == 0x000008, "Wrong alignment on FLaserGridOutletArray");
static_assert(sizeof(FLaserGridOutletArray) == 0x000120, "Wrong size on FLaserGridOutletArray");
static_assert(offsetof(FLaserGridOutletArray, Entries) == 0x000108, "Member 'FLaserGridOutletArray::Entries' has a wrong offset!");

// ScriptStruct LaserGameplayRuntime.LaserGridPattern
// 0x0018 (0x0018 - 0x0000)
struct FLaserGridPattern final
{
public:
	TArray<struct FLaserOutletConnection>         OutletConnections;                                 // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLaserGridPattern) == 0x000008, "Wrong alignment on FLaserGridPattern");
static_assert(sizeof(FLaserGridPattern) == 0x000018, "Wrong size on FLaserGridPattern");
static_assert(offsetof(FLaserGridPattern, OutletConnections) == 0x000000, "Member 'FLaserGridPattern::OutletConnections' has a wrong offset!");
static_assert(offsetof(FLaserGridPattern, duration) == 0x000010, "Member 'FLaserGridPattern::duration' has a wrong offset!");

}

