#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LimeNative

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum LimeNative.ELimePawnEmotionalState
// NumValues: 0x0004
enum class ELimePawnEmotionalState : uint8
{
	Default                                  = 0,
	Happy                                    = 1,
	Sad                                      = 2,
	MAX                                      = 3,
};

// Enum LimeNative.EFortLimeUefnAnalyticsEvents
// NumValues: 0x0003
enum class EFortLimeUefnAnalyticsEvents : uint8
{
	None                                     = 0,
	UEFN_Heartbeat                           = 1,
	UEFN_ProjectSessionSummary               = 2,
};

// Enum LimeNative.EFortLimeGameplayAnalyticsEvents
// NumValues: 0x0003
enum class EFortLimeGameplayAnalyticsEvents : uint8
{
	None                                     = 0,
	Core_StartZone                           = 1,
	PlayerContextLocationPerMinute           = 2,
};

// Enum LimeNative.ELimePawnEmotionalStateMappingTest
// NumValues: 0x0002
enum class ELimePawnEmotionalStateMappingTest : uint32
{
	LessOrEqual                              = 0,
	GreaterOrEqual                           = 1,
};

// ScriptStruct LimeNative.LimeMoodStateData
// 0x0004 (0x0004 - 0x0000)
struct FLimeMoodStateData final
{
public:
	struct FGameplayTag                           MoodTag;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLimeMoodStateData) == 0x000004, "Wrong alignment on FLimeMoodStateData");
static_assert(sizeof(FLimeMoodStateData) == 0x000004, "Wrong size on FLimeMoodStateData");
static_assert(offsetof(FLimeMoodStateData, MoodTag) == 0x000000, "Member 'FLimeMoodStateData::MoodTag' has a wrong offset!");

// ScriptStruct LimeNative.LimeAnalyticsContext
// 0x0078 (0x0078 - 0x0000)
struct FLimeAnalyticsContext final
{
public:
	class FString                                 AnalyticsKeyString;                                // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AnalyticsValueString;                              // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ComponentClass;                                    // 0x0040(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           VariableNames;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         UefnAnalyticsEvents;                               // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         GameplayAnalyticsEvents;                           // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLimeAnalyticsContext) == 0x000008, "Wrong alignment on FLimeAnalyticsContext");
static_assert(sizeof(FLimeAnalyticsContext) == 0x000078, "Wrong size on FLimeAnalyticsContext");
static_assert(offsetof(FLimeAnalyticsContext, AnalyticsKeyString) == 0x000000, "Member 'FLimeAnalyticsContext::AnalyticsKeyString' has a wrong offset!");
static_assert(offsetof(FLimeAnalyticsContext, AnalyticsValueString) == 0x000010, "Member 'FLimeAnalyticsContext::AnalyticsValueString' has a wrong offset!");
static_assert(offsetof(FLimeAnalyticsContext, ActorClass) == 0x000020, "Member 'FLimeAnalyticsContext::ActorClass' has a wrong offset!");
static_assert(offsetof(FLimeAnalyticsContext, ComponentClass) == 0x000040, "Member 'FLimeAnalyticsContext::ComponentClass' has a wrong offset!");
static_assert(offsetof(FLimeAnalyticsContext, VariableNames) == 0x000060, "Member 'FLimeAnalyticsContext::VariableNames' has a wrong offset!");
static_assert(offsetof(FLimeAnalyticsContext, UefnAnalyticsEvents) == 0x000070, "Member 'FLimeAnalyticsContext::UefnAnalyticsEvents' has a wrong offset!");
static_assert(offsetof(FLimeAnalyticsContext, GameplayAnalyticsEvents) == 0x000071, "Member 'FLimeAnalyticsContext::GameplayAnalyticsEvents' has a wrong offset!");

// ScriptStruct LimeNative.LimePawnComponentOverrideProperty
// 0x0010 (0x0010 - 0x0000)
struct FLimePawnComponentOverrideProperty final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLimePawnComponentOverrideProperty) == 0x000008, "Wrong alignment on FLimePawnComponentOverrideProperty");
static_assert(sizeof(FLimePawnComponentOverrideProperty) == 0x000010, "Wrong size on FLimePawnComponentOverrideProperty");
static_assert(offsetof(FLimePawnComponentOverrideProperty, Name) == 0x000000, "Member 'FLimePawnComponentOverrideProperty::Name' has a wrong offset!");
static_assert(offsetof(FLimePawnComponentOverrideProperty, Montage) == 0x000008, "Member 'FLimePawnComponentOverrideProperty::Montage' has a wrong offset!");

// ScriptStruct LimeNative.LimePawnComponentOverride
// 0x0018 (0x0018 - 0x0000)
struct FLimePawnComponentOverride final
{
public:
	class FName                                   ObjClass;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLimePawnComponentOverrideProperty> Properties;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLimePawnComponentOverride) == 0x000008, "Wrong alignment on FLimePawnComponentOverride");
static_assert(sizeof(FLimePawnComponentOverride) == 0x000018, "Wrong size on FLimePawnComponentOverride");
static_assert(offsetof(FLimePawnComponentOverride, ObjClass) == 0x000000, "Member 'FLimePawnComponentOverride::ObjClass' has a wrong offset!");
static_assert(offsetof(FLimePawnComponentOverride, Properties) == 0x000008, "Member 'FLimePawnComponentOverride::Properties' has a wrong offset!");

// ScriptStruct LimeNative.LimeEmotionalStateData
// 0x0010 (0x0010 - 0x0000)
struct FLimeEmotionalStateData final
{
public:
	ELimePawnEmotionalState                       EmotionalState;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EmotionPercent;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmotionSetRate;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          ForceRepCounter;                                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLimeEmotionalStateData) == 0x000004, "Wrong alignment on FLimeEmotionalStateData");
static_assert(sizeof(FLimeEmotionalStateData) == 0x000010, "Wrong size on FLimeEmotionalStateData");
static_assert(offsetof(FLimeEmotionalStateData, EmotionalState) == 0x000000, "Member 'FLimeEmotionalStateData::EmotionalState' has a wrong offset!");
static_assert(offsetof(FLimeEmotionalStateData, EmotionPercent) == 0x000004, "Member 'FLimeEmotionalStateData::EmotionPercent' has a wrong offset!");
static_assert(offsetof(FLimeEmotionalStateData, EmotionSetRate) == 0x000008, "Member 'FLimeEmotionalStateData::EmotionSetRate' has a wrong offset!");
static_assert(offsetof(FLimeEmotionalStateData, ForceRepCounter) == 0x00000C, "Member 'FLimeEmotionalStateData::ForceRepCounter' has a wrong offset!");

// ScriptStruct LimeNative.LimeEvent_PawnEmotion
// 0x0010 (0x0010 - 0x0000)
struct FLimeEvent_PawnEmotion final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELimePawnEmotionalState                       CurrentEmotionalState;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EmotionPercent;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLimeEvent_PawnEmotion) == 0x000008, "Wrong alignment on FLimeEvent_PawnEmotion");
static_assert(sizeof(FLimeEvent_PawnEmotion) == 0x000010, "Wrong size on FLimeEvent_PawnEmotion");
static_assert(offsetof(FLimeEvent_PawnEmotion, Pawn) == 0x000000, "Member 'FLimeEvent_PawnEmotion::Pawn' has a wrong offset!");
static_assert(offsetof(FLimeEvent_PawnEmotion, CurrentEmotionalState) == 0x000008, "Member 'FLimeEvent_PawnEmotion::CurrentEmotionalState' has a wrong offset!");
static_assert(offsetof(FLimeEvent_PawnEmotion, EmotionPercent) == 0x00000C, "Member 'FLimeEvent_PawnEmotion::EmotionPercent' has a wrong offset!");

// ScriptStruct LimeNative.LimePawnEmotionalStateMappingFromAwesomeLevel
// 0x000C (0x000C - 0x0000)
struct FLimePawnEmotionalStateMappingFromAwesomeLevel final
{
public:
	ELimePawnEmotionalState                       EmotionalState;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumericalTestValue;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELimePawnEmotionalStateMappingTest            NumericalTestMode;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLimePawnEmotionalStateMappingFromAwesomeLevel) == 0x000004, "Wrong alignment on FLimePawnEmotionalStateMappingFromAwesomeLevel");
static_assert(sizeof(FLimePawnEmotionalStateMappingFromAwesomeLevel) == 0x00000C, "Wrong size on FLimePawnEmotionalStateMappingFromAwesomeLevel");
static_assert(offsetof(FLimePawnEmotionalStateMappingFromAwesomeLevel, EmotionalState) == 0x000000, "Member 'FLimePawnEmotionalStateMappingFromAwesomeLevel::EmotionalState' has a wrong offset!");
static_assert(offsetof(FLimePawnEmotionalStateMappingFromAwesomeLevel, NumericalTestValue) == 0x000004, "Member 'FLimePawnEmotionalStateMappingFromAwesomeLevel::NumericalTestValue' has a wrong offset!");
static_assert(offsetof(FLimePawnEmotionalStateMappingFromAwesomeLevel, NumericalTestMode) == 0x000008, "Member 'FLimePawnEmotionalStateMappingFromAwesomeLevel::NumericalTestMode' has a wrong offset!");

}

