#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LinedNotebook_MobileTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Button_TopNavBar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LinedNotebook_MobileTab.LinedNotebook_MobileTab_C
// 0x0010 (0x1890 - 0x1880)
class ULinedNotebook_MobileTab_C final : public UWBP_UIKit_Button_TopNavBar_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_LinedNotebook_MobileTab_C;          // 0x1878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture2D*                             SelectedIcon;                                      // 0x1880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             DeselectedIcon;                                    // 0x1888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_LinedNotebook_MobileTab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LinedNotebook_MobileTab_C">();
	}
	static class ULinedNotebook_MobileTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinedNotebook_MobileTab_C>();
	}
};
static_assert(alignof(ULinedNotebook_MobileTab_C) == 0x000010, "Wrong alignment on ULinedNotebook_MobileTab_C");
static_assert(sizeof(ULinedNotebook_MobileTab_C) == 0x001890, "Wrong size on ULinedNotebook_MobileTab_C");
static_assert(offsetof(ULinedNotebook_MobileTab_C, UberGraphFrame_LinedNotebook_MobileTab_C) == 0x001878, "Member 'ULinedNotebook_MobileTab_C::UberGraphFrame_LinedNotebook_MobileTab_C' has a wrong offset!");
static_assert(offsetof(ULinedNotebook_MobileTab_C, SelectedIcon) == 0x001880, "Member 'ULinedNotebook_MobileTab_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(ULinedNotebook_MobileTab_C, DeselectedIcon) == 0x001888, "Member 'ULinedNotebook_MobileTab_C::DeselectedIcon' has a wrong offset!");

}

