#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LinedNotebookTabAudio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LinedNotebookTabAudio.LinedNotebookTabAudio_C
// 0x0038 (0x0060 - 0x0028)
class ULinedNotebookTabAudio_C final : public UFortPersistentTabObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundBase*                             SFX_Loop;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SFX_Component;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TapClickedSound;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EE_TabClosed;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Music;                                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Music_Component;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LinedNotebookTabAudio(int32 EntryPoint);
	void OnTabDestroyed();
	void OnTabEntered();
	void OnTabExited();
	void OnTabInitialized();
	void StartNormalLobbyMusic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LinedNotebookTabAudio_C">();
	}
	static class ULinedNotebookTabAudio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinedNotebookTabAudio_C>();
	}
};
static_assert(alignof(ULinedNotebookTabAudio_C) == 0x000008, "Wrong alignment on ULinedNotebookTabAudio_C");
static_assert(sizeof(ULinedNotebookTabAudio_C) == 0x000060, "Wrong size on ULinedNotebookTabAudio_C");
static_assert(offsetof(ULinedNotebookTabAudio_C, UberGraphFrame) == 0x000028, "Member 'ULinedNotebookTabAudio_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULinedNotebookTabAudio_C, SFX_Loop) == 0x000030, "Member 'ULinedNotebookTabAudio_C::SFX_Loop' has a wrong offset!");
static_assert(offsetof(ULinedNotebookTabAudio_C, SFX_Component) == 0x000038, "Member 'ULinedNotebookTabAudio_C::SFX_Component' has a wrong offset!");
static_assert(offsetof(ULinedNotebookTabAudio_C, TapClickedSound) == 0x000040, "Member 'ULinedNotebookTabAudio_C::TapClickedSound' has a wrong offset!");
static_assert(offsetof(ULinedNotebookTabAudio_C, EE_TabClosed) == 0x000048, "Member 'ULinedNotebookTabAudio_C::EE_TabClosed' has a wrong offset!");
static_assert(offsetof(ULinedNotebookTabAudio_C, Music) == 0x000050, "Member 'ULinedNotebookTabAudio_C::Music' has a wrong offset!");
static_assert(offsetof(ULinedNotebookTabAudio_C, Music_Component) == 0x000058, "Member 'ULinedNotebookTabAudio_C::Music_Component' has a wrong offset!");

}

