#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalUserSettingTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocalUserSettingTitle.LocalUserSettingTitle_C
// 0x0030 (0x1520 - 0x14F0)
class ULocalUserSettingTitle_C final : public UFortLocalUserSettingTitleButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x1500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ExpandDirectionTick;                               // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_EntryContent;                                   // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_LocalUserSettingTitle(int32 EntryPoint);
	void OnExpansionChanged(bool bIsExpanded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalUserSettingTitle_C">();
	}
	static class ULocalUserSettingTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalUserSettingTitle_C>();
	}
};
static_assert(alignof(ULocalUserSettingTitle_C) == 0x000010, "Wrong alignment on ULocalUserSettingTitle_C");
static_assert(sizeof(ULocalUserSettingTitle_C) == 0x001520, "Wrong size on ULocalUserSettingTitle_C");
static_assert(offsetof(ULocalUserSettingTitle_C, UberGraphFrame) == 0x0014F0, "Member 'ULocalUserSettingTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, OnExpansion) == 0x0014F8, "Member 'ULocalUserSettingTitle_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, OnHover) == 0x001500, "Member 'ULocalUserSettingTitle_C::OnHover' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, ExpandDirectionTick) == 0x001508, "Member 'ULocalUserSettingTitle_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingTitle_C, SB_EntryContent) == 0x001510, "Member 'ULocalUserSettingTitle_C::SB_EntryContent' has a wrong offset!");

}

