#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Patches_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Patches_Axe_AnimBP.M_MED_Patches_Axe_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x011F (0x0120 - 0x0001)
struct M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_4;                                // 0x0008(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_5;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_6;                                  // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SubInput;                            // 0x00C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00F0(0x0030)()
};
static_assert(alignof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000120, "Wrong size on M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_4) == 0x000008, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_4' has a wrong offset!");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_5) == 0x000020, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_5' has a wrong offset!");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_6) == 0x000024, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_6' has a wrong offset!");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SubInput) == 0x0000C0, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000F0, "Member 'M_MED_Patches_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

}

