#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_HighTower_Radish_Pet_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_HighTower_Radish_Pet_PostProcess_AnimBP.M_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x023F (0x0240 - 0x0001)
struct M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_22;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_23;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_24;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x00F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x0120(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody_2;                         // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody_1;                         // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody;                           // 0x0210(0x0030)()
};
static_assert(alignof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000240, "Wrong size on M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_22) == 0x000004, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_22' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_23) == 0x000008, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_23' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_24) == 0x000010, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_24' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000C0, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x0000F0, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000120, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000150, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RigidBody_2) == 0x000180, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x0001B0, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RigidBody_1) == 0x0001E0, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RigidBody) == 0x000210, "Member 'M_MED_HighTower_Radish_Pet_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RigidBody' has a wrong offset!");

}

