#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuButton_Large

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenuButton_Large.MainMenuButton_Large_C.ExecuteUbergraph_MainMenuButton_Large
// 0x0018 (0x0018 - 0x0000)
struct MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large) == 0x000008, "Wrong alignment on MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large");
static_assert(sizeof(MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large) == 0x000018, "Wrong size on MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large");
static_assert(offsetof(MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large, EntryPoint) == 0x000000, "Member 'MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'MainMenuButton_Large_C_ExecuteUbergraph_MainMenuButton_Large::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

