#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemoryUsageQueries

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct MemoryUsageQueries.CollectionInfo
// 0x0038 (0x0038 - 0x0000)
struct FCollectionInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Includes;                                          // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Excludes;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BudgetMB;                                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCollectionInfo) == 0x000008, "Wrong alignment on FCollectionInfo");
static_assert(sizeof(FCollectionInfo) == 0x000038, "Wrong size on FCollectionInfo");
static_assert(offsetof(FCollectionInfo, Name) == 0x000000, "Member 'FCollectionInfo::Name' has a wrong offset!");
static_assert(offsetof(FCollectionInfo, Includes) == 0x000010, "Member 'FCollectionInfo::Includes' has a wrong offset!");
static_assert(offsetof(FCollectionInfo, Excludes) == 0x000020, "Member 'FCollectionInfo::Excludes' has a wrong offset!");
static_assert(offsetof(FCollectionInfo, BudgetMB) == 0x000030, "Member 'FCollectionInfo::BudgetMB' has a wrong offset!");

}

