#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct MenuScreen_Athena.MenuScreen_Athena_C.AnimBlueprintGeneratedConstantData
// 0x274F (0x2750 - 0x0001)
struct MenuScreen_Athena::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1628;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1629;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1630;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1631;                               // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1632;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1633;                               // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1634;                               // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1635;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1636;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1637;                              // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1638;                              // 0x0038(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1639;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1640;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1641;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1642;                              // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1643;                              // 0x0068(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1644;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1645;                              // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1646;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1647;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1648;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1649;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1650;                               // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBiasClampConstants          __StructProperty_1651;                             // 0x00A4(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1652;                              // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1653;                               // 0x00D4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1654;                               // 0x00D5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1655;                               // 0x00D6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_1656;                              // 0x00D8(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1657;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1658;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1659;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1660;                               // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1661;                                 // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1662;                               // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1663;                               // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1664;                               // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1665;                              // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_1666;                             // 0x0120(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0138(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK_2;                             // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_5;                          // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_4;                          // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_3;                          // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                              // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_2;                          // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK_1;                             // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_1;                          // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone;                            // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                        // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;                   // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve;                         // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_16;                    // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                        // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                        // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;                   // 0x0500(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;                   // 0x0530(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_15;                    // 0x0560(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x0590(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;                    // 0x05C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK;                               // 0x05F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0620(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_56;                 // 0x0650(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_55;                 // 0x0680(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_54;                 // 0x06B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_53;                 // 0x06E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_52;                 // 0x0710(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_34;                  // 0x0740(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_33;                  // 0x0770(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_32;                  // 0x07A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;                      // 0x07D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_13;                     // 0x0800(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_51;                 // 0x0830(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_50;                 // 0x0860(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_49;                 // 0x0890(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_48;                 // 0x08C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_47;                 // 0x08F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_46;                 // 0x0920(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_45;                 // 0x0950(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_44;                 // 0x0980(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_43;                 // 0x09B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_42;                 // 0x09E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                         // 0x0A10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_31;                  // 0x0A40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_30;                  // 0x0A70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_29;                  // 0x0AA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_28;                  // 0x0AD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_27;                  // 0x0B00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_26;                  // 0x0B30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;                      // 0x0B60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_12;                     // 0x0B90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_14;                    // 0x0BC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_13;                    // 0x0BF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_41;                 // 0x0C20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;                      // 0x0C50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_40;                 // 0x0C80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_39;                 // 0x0CB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_38;                 // 0x0CE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_37;                 // 0x0D10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_25;                  // 0x0D40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_24;                  // 0x0D70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_23;                  // 0x0DA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_36;                 // 0x0DD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;                      // 0x0E00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_11;                     // 0x0E30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_35;                 // 0x0E60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_34;                 // 0x0E90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_33;                 // 0x0EC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_32;                 // 0x0EF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_22;                  // 0x0F20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_21;                  // 0x0F50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_31;                 // 0x0F80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_20;                  // 0x0FB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;                      // 0x0FE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_10;                     // 0x1010(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_12;                    // 0x1040(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_30;                 // 0x1070(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_11;                    // 0x10A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;                      // 0x10D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_9;                      // 0x1100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_10;                    // 0x1130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x1160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_29;                 // 0x1190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                      // 0x11C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_8;                      // 0x11F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_9;                     // 0x1220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_8;                     // 0x1250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;                   // 0x1280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_7;                     // 0x12B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_28;                 // 0x12E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_6;                     // 0x1310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_27;                 // 0x1340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_26;                 // 0x1370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                       // 0x13A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_5;                     // 0x13D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_25;                 // 0x1400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_24;                 // 0x1430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_19;                  // 0x1460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;                     // 0x1490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_23;                 // 0x14C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_22;                 // 0x14F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                       // 0x1520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_7;                      // 0x1550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;                   // 0x1580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;                   // 0x15B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;                   // 0x15E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;                   // 0x1610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;                    // 0x1640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_18;                  // 0x1670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_17;                  // 0x16A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_16;                  // 0x16D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                       // 0x1700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;                      // 0x1730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_15;                  // 0x1760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x1790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_21;                 // 0x17C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_20;                 // 0x17F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_19;                 // 0x1820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_18;                 // 0x1850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_17;                 // 0x1880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_14;                  // 0x18B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_13;                  // 0x18E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_12;                  // 0x1910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                       // 0x1940(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;                      // 0x1970(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_16;                 // 0x19A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_15;                 // 0x19D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_14;                 // 0x1A00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_13;                 // 0x1A30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_12;                 // 0x1A60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_11;                  // 0x1A90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_10;                  // 0x1AC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_9;                   // 0x1AF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                       // 0x1B20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                      // 0x1B50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;                     // 0x1B80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                     // 0x1BB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_11;                 // 0x1BE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x1C10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_10;                 // 0x1C40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_9;                  // 0x1C70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_8;                  // 0x1CA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_7;                  // 0x1CD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_8;                   // 0x1D00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_7;                   // 0x1D30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_6;                  // 0x1D60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_6;                   // 0x1D90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x1DC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                      // 0x1DF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_5;                  // 0x1E20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_4;                  // 0x1E50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;                  // 0x1E80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;                  // 0x1EB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_5;                   // 0x1EE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_4;                   // 0x1F10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_3;                   // 0x1F40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x1F70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x1FA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                      // 0x1FD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x2000(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x2030(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x2060(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x2090(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                      // 0x20C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;                    // 0x20F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x2120(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;                    // 0x2150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                     // 0x2180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                     // 0x21B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x21E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                              // 0x2210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;                    // 0x2240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_3;                    // 0x2270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_2;                    // 0x22A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x22D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x2300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x2330(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x2360(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_2;                   // 0x2390(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;                   // 0x23C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_1;                    // 0x23F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt;                      // 0x2420(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x2450(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x2480(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x24B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x24E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                     // 0x2510(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x2540(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x2570(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                              // 0x25A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                     // 0x25D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x2600(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x2630(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x2660(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x2690(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x26C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x26F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x2720(0x0030)()
};
static_assert(alignof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on MenuScreen_Athena::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData) == 0x002750, "Wrong size on MenuScreen_Athena::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1628) == 0x000004, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1628' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1629) == 0x000008, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1629' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1630) == 0x00000C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1630' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ByteProperty_1631) == 0x000010, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ByteProperty_1631' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1632) == 0x000014, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1632' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1633) == 0x000018, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1633' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ByteProperty_1634) == 0x000019, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ByteProperty_1634' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1635) == 0x00001C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1635' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1636) == 0x000020, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1636' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1637) == 0x000028, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1637' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1638) == 0x000038, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1638' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1639) == 0x000048, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1639' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1640) == 0x00004C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1640' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1641) == 0x000050, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1641' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1642) == 0x000058, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1642' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1643) == 0x000068, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1643' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1644) == 0x000078, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1644' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __FloatProperty_1645) == 0x00007C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__FloatProperty_1645' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1646) == 0x000080, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1646' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __IntProperty_1647) == 0x000084, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__IntProperty_1647' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1648) == 0x000088, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1648' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1649) == 0x000090, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1649' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __BoolProperty_1650) == 0x0000A0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__BoolProperty_1650' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __StructProperty_1651) == 0x0000A4, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__StructProperty_1651' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __FloatProperty_1652) == 0x0000D0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__FloatProperty_1652' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1653) == 0x0000D4, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1653' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ByteProperty_1654) == 0x0000D5, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ByteProperty_1654' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1655) == 0x0000D6, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1655' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1656) == 0x0000D8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1656' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1657) == 0x0000E8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1657' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1658) == 0x0000EC, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1658' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __IntProperty_1659) == 0x0000F0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__IntProperty_1659' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __BlendProfile_1660) == 0x0000F8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__BlendProfile_1660' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __CurveFloat_1661) == 0x000100, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__CurveFloat_1661' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __BoolProperty_1662) == 0x000108, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__BoolProperty_1662' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1663) == 0x000109, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1663' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1664) == 0x00010A, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1664' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1665) == 0x000110, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1665' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __StructProperty_1666) == 0x000120, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__StructProperty_1666' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000138, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001B8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LegIK_2) == 0x0001D0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LegIK_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_5) == 0x000200, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_5' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_4) == 0x000230, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_4' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_3) == 0x000260, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_3) == 0x000290, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_2) == 0x0002C0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LegIK_1) == 0x0002F0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LegIK_1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_1) == 0x000320, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone) == 0x000350, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_3) == 0x000380, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_17) == 0x0003B0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve) == 0x0003E0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_16) == 0x000410, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_16' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x000440, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000470, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x0004A0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x0004D0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_16) == 0x000500, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_15) == 0x000530, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_15) == 0x000560, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_15' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000590, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x0005C0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LegIK) == 0x0005F0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LegIK' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000620, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_56) == 0x000650, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_56' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_55) == 0x000680, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_55' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_54) == 0x0006B0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_54' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_53) == 0x0006E0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_53' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_52) == 0x000710, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_52' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_34) == 0x000740, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_34' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_33) == 0x000770, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_33' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_32) == 0x0007A0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_32' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_16) == 0x0007D0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_16' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_13) == 0x000800, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_13' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_51) == 0x000830, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_51' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_50) == 0x000860, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_50' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_49) == 0x000890, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_49' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_48) == 0x0008C0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_48' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_47) == 0x0008F0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_47' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_46) == 0x000920, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_46' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_45) == 0x000950, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_45' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_44) == 0x000980, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_44' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_43) == 0x0009B0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_43' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_42) == 0x0009E0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_42' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TwoWayBlend) == 0x000A10, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_31) == 0x000A40, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_31' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_30) == 0x000A70, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_30' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_29) == 0x000AA0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_29' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_28) == 0x000AD0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_28' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_27) == 0x000B00, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_27' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_26) == 0x000B30, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_26' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_15) == 0x000B60, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_15' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_12) == 0x000B90, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_12' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_14) == 0x000BC0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_14' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_13) == 0x000BF0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_13' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_41) == 0x000C20, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_41' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_14) == 0x000C50, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_14' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_40) == 0x000C80, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_40' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_39) == 0x000CB0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_39' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_38) == 0x000CE0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_38' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_37) == 0x000D10, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_37' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_25) == 0x000D40, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_25' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_24) == 0x000D70, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_24' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_23) == 0x000DA0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_23' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_36) == 0x000DD0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_36' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_13) == 0x000E00, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_13' has a wrong offset!");
