#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshCosmetics

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "MeshCosmetics_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "CustomizableObject_classes.hpp"


namespace SDK
{

// Class MeshCosmetics.MeshCosmeticsOption_ApplyAssembledMeshSchema
// 0x0000 (0x0030 - 0x0030)
class UMeshCosmeticsOption_ApplyAssembledMeshSchema final : public UFortCosmeticFlowOption
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsOption_ApplyAssembledMeshSchema">();
	}
	static class UMeshCosmeticsOption_ApplyAssembledMeshSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsOption_ApplyAssembledMeshSchema>();
	}
};
static_assert(alignof(UMeshCosmeticsOption_ApplyAssembledMeshSchema) == 0x000008, "Wrong alignment on UMeshCosmeticsOption_ApplyAssembledMeshSchema");
static_assert(sizeof(UMeshCosmeticsOption_ApplyAssembledMeshSchema) == 0x000030, "Wrong size on UMeshCosmeticsOption_ApplyAssembledMeshSchema");

// Class MeshCosmetics.MeshCosmeticsOption_ApplyCustomizableObject
// 0x0000 (0x0030 - 0x0030)
class UMeshCosmeticsOption_ApplyCustomizableObject final : public UFortCosmeticFlowOption
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsOption_ApplyCustomizableObject">();
	}
	static class UMeshCosmeticsOption_ApplyCustomizableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsOption_ApplyCustomizableObject>();
	}
};
static_assert(alignof(UMeshCosmeticsOption_ApplyCustomizableObject) == 0x000008, "Wrong alignment on UMeshCosmeticsOption_ApplyCustomizableObject");
static_assert(sizeof(UMeshCosmeticsOption_ApplyCustomizableObject) == 0x000030, "Wrong size on UMeshCosmeticsOption_ApplyCustomizableObject");

// Class MeshCosmetics.MeshCosmeticsStep_ChooseParameters
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_ChooseParameters final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_ChooseParameters">();
	}
	static class UMeshCosmeticsStep_ChooseParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_ChooseParameters>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_ChooseParameters) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_ChooseParameters");
static_assert(sizeof(UMeshCosmeticsStep_ChooseParameters) == 0x000058, "Wrong size on UMeshCosmeticsStep_ChooseParameters");

// Class MeshCosmetics.MeshCosmeticsStep_CommitChosenParams
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_CommitChosenParams final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_CommitChosenParams">();
	}
	static class UMeshCosmeticsStep_CommitChosenParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_CommitChosenParams>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_CommitChosenParams) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_CommitChosenParams");
static_assert(sizeof(UMeshCosmeticsStep_CommitChosenParams) == 0x000058, "Wrong size on UMeshCosmeticsStep_CommitChosenParams");

// Class MeshCosmetics.MeshCosmeticsStep_CompileCustomizableObjects
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_CompileCustomizableObjects final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_CompileCustomizableObjects">();
	}
	static class UMeshCosmeticsStep_CompileCustomizableObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_CompileCustomizableObjects>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_CompileCustomizableObjects) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_CompileCustomizableObjects");
static_assert(sizeof(UMeshCosmeticsStep_CompileCustomizableObjects) == 0x000058, "Wrong size on UMeshCosmeticsStep_CompileCustomizableObjects");

// Class MeshCosmetics.MeshCosmeticsStep_ComponentRemoval
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_ComponentRemoval final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_ComponentRemoval">();
	}
	static class UMeshCosmeticsStep_ComponentRemoval* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_ComponentRemoval>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_ComponentRemoval) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_ComponentRemoval");
static_assert(sizeof(UMeshCosmeticsStep_ComponentRemoval) == 0x000058, "Wrong size on UMeshCosmeticsStep_ComponentRemoval");

// Class MeshCosmetics.MeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams
// 0x0010 (0x0038 - 0x0028)
class UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams final : public UFortCosmeticItemAdditionalData
{
public:
	TArray<class FName>                           MaterialOnlyParameterNames;                        // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams">();
	}
	static class UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams>();
	}
};
static_assert(alignof(UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams) == 0x000008, "Wrong alignment on UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams");
static_assert(sizeof(UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams) == 0x000038, "Wrong size on UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams");
static_assert(offsetof(UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams, MaterialOnlyParameterNames) == 0x000028, "Member 'UMeshCosmeticsAdditionalData_SpecifyMaterialOnlyParams::MaterialOnlyParameterNames' has a wrong offset!");

// Class MeshCosmetics.MeshCosmeticsStep_HandleGeneratedMesh
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_HandleGeneratedMesh final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_HandleGeneratedMesh">();
	}
	static class UMeshCosmeticsStep_HandleGeneratedMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_HandleGeneratedMesh>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_HandleGeneratedMesh) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_HandleGeneratedMesh");
static_assert(sizeof(UMeshCosmeticsStep_HandleGeneratedMesh) == 0x000058, "Wrong size on UMeshCosmeticsStep_HandleGeneratedMesh");

// Class MeshCosmetics.MeshCosmeticsStep_PlaceComponent
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_PlaceComponent final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_PlaceComponent">();
	}
	static class UMeshCosmeticsStep_PlaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_PlaceComponent>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_PlaceComponent) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_PlaceComponent");
static_assert(sizeof(UMeshCosmeticsStep_PlaceComponent) == 0x000058, "Wrong size on UMeshCosmeticsStep_PlaceComponent");

// Class MeshCosmetics.MeshCosmeticsStep_RemoveCustomizableSkeletalComponents
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsStep_RemoveCustomizableSkeletalComponents">();
	}
	static class UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents>();
	}
};
static_assert(alignof(UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents) == 0x000008, "Wrong alignment on UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents");
static_assert(sizeof(UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents) == 0x000058, "Wrong size on UMeshCosmeticsStep_RemoveCustomizableSkeletalComponents");

// Class MeshCosmetics.MeshCosmeticsVariance_ApplyParameters
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsVariance_ApplyParameters final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsVariance_ApplyParameters">();
	}
	static class UMeshCosmeticsVariance_ApplyParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsVariance_ApplyParameters>();
	}
};
static_assert(alignof(UMeshCosmeticsVariance_ApplyParameters) == 0x000008, "Wrong alignment on UMeshCosmeticsVariance_ApplyParameters");
static_assert(sizeof(UMeshCosmeticsVariance_ApplyParameters) == 0x000058, "Wrong size on UMeshCosmeticsVariance_ApplyParameters");

// Class MeshCosmetics.MeshCosmeticsVariance_CompileObjects
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsVariance_CompileObjects final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsVariance_CompileObjects">();
	}
	static class UMeshCosmeticsVariance_CompileObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsVariance_CompileObjects>();
	}
};
static_assert(alignof(UMeshCosmeticsVariance_CompileObjects) == 0x000008, "Wrong alignment on UMeshCosmeticsVariance_CompileObjects");
static_assert(sizeof(UMeshCosmeticsVariance_CompileObjects) == 0x000058, "Wrong size on UMeshCosmeticsVariance_CompileObjects");

// Class MeshCosmetics.MeshCosmeticsVariance_ManageComponents
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsVariance_ManageComponents final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsVariance_ManageComponents">();
	}
	static class UMeshCosmeticsVariance_ManageComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsVariance_ManageComponents>();
	}
};
static_assert(alignof(UMeshCosmeticsVariance_ManageComponents) == 0x000008, "Wrong alignment on UMeshCosmeticsVariance_ManageComponents");
static_assert(sizeof(UMeshCosmeticsVariance_ManageComponents) == 0x000058, "Wrong size on UMeshCosmeticsVariance_ManageComponents");

// Class MeshCosmetics.MeshCosmeticsVariance_ProcessVariantAssets
// 0x0000 (0x0058 - 0x0058)
class UMeshCosmeticsVariance_ProcessVariantAssets final : public UFortCosmeticStep
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsVariance_ProcessVariantAssets">();
	}
	static class UMeshCosmeticsVariance_ProcessVariantAssets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsVariance_ProcessVariantAssets>();
	}
};
static_assert(alignof(UMeshCosmeticsVariance_ProcessVariantAssets) == 0x000008, "Wrong alignment on UMeshCosmeticsVariance_ProcessVariantAssets");
static_assert(sizeof(UMeshCosmeticsVariance_ProcessVariantAssets) == 0x000058, "Wrong size on UMeshCosmeticsVariance_ProcessVariantAssets");

// Class MeshCosmetics.MeshCosmeticsApparelItemDefinition
// 0x0028 (0x0768 - 0x0740)
class UMeshCosmeticsApparelItemDefinition final : public UFortApparelItemDefinition
{
public:
	struct FCosmeticSlotSelector                  SlotValidWithin;                                   // 0x0740(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_742[0x6];                                      // 0x0742(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FApparelCustomizableItemReference      Parameter;                                         // 0x0748(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsApparelItemDefinition">();
	}
	static class UMeshCosmeticsApparelItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsApparelItemDefinition>();
	}
};
static_assert(alignof(UMeshCosmeticsApparelItemDefinition) == 0x000008, "Wrong alignment on UMeshCosmeticsApparelItemDefinition");
static_assert(sizeof(UMeshCosmeticsApparelItemDefinition) == 0x000768, "Wrong size on UMeshCosmeticsApparelItemDefinition");
static_assert(offsetof(UMeshCosmeticsApparelItemDefinition, SlotValidWithin) == 0x000740, "Member 'UMeshCosmeticsApparelItemDefinition::SlotValidWithin' has a wrong offset!");
static_assert(offsetof(UMeshCosmeticsApparelItemDefinition, Parameter) == 0x000748, "Member 'UMeshCosmeticsApparelItemDefinition::Parameter' has a wrong offset!");

// Class MeshCosmetics.FortCustomizableObjectParameterVariant
// 0x0010 (0x0090 - 0x0080)
class UFortCustomizableObjectParameterVariant final : public UFortCosmeticVariantBackedByArray
{
public:
	TArray<struct FCustomizableObjectParamsVariantDef> ParameterOptions;                                  // 0x0080(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static void ApplyVariants(class AActor* Actor, const struct FFortAthenaLoadout& Loadout);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCustomizableObjectParameterVariant">();
	}
	static class UFortCustomizableObjectParameterVariant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCustomizableObjectParameterVariant>();
	}
};
static_assert(alignof(UFortCustomizableObjectParameterVariant) == 0x000008, "Wrong alignment on UFortCustomizableObjectParameterVariant");
static_assert(sizeof(UFortCustomizableObjectParameterVariant) == 0x000090, "Wrong size on UFortCustomizableObjectParameterVariant");
static_assert(offsetof(UFortCustomizableObjectParameterVariant, ParameterOptions) == 0x000080, "Member 'UFortCustomizableObjectParameterVariant::ParameterOptions' has a wrong offset!");

// Class MeshCosmetics.FortCustomizableObjectSprayVariant
// 0x0258 (0x02D8 - 0x0080)
class UFortCustomizableObjectSprayVariant final : public UFortCosmeticVariant
{
public:
	struct FGameplayTag                           ActiveSelectionTag;                                // 0x0080(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EnabledParamName;                                  // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ProjectorParamName;                                // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TextureParamName;                                  // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 SaturationParamName;                               // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 WearParamName;                                     // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ScaleParamName;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      TagQueryForShouldOverrideCODefaultsWithFixedLocationParameters; // 0x00E8(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FCustomizableObjectSprayVariantFixedProperties FixedSprayLocation;                                // 0x0130(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCustomizableObjectSprayVariantSelectablePayload DefaultSprayCustomization;                         // 0x0198(0x00B8)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FCustomizableObjectSprayVariantPayloadClamps SprayNumericConstraints;                           // 0x0250(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         TextureBaseScale;                                  // 0x0280(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizableObjectSprayVariantSlotImageProperties SpraySlotImageProperties;                          // 0x0288(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCustomizableObjectSprayVariant">();
	}
	static class UFortCustomizableObjectSprayVariant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCustomizableObjectSprayVariant>();
	}
};
static_assert(alignof(UFortCustomizableObjectSprayVariant) == 0x000008, "Wrong alignment on UFortCustomizableObjectSprayVariant");
static_assert(sizeof(UFortCustomizableObjectSprayVariant) == 0x0002D8, "Wrong size on UFortCustomizableObjectSprayVariant");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, ActiveSelectionTag) == 0x000080, "Member 'UFortCustomizableObjectSprayVariant::ActiveSelectionTag' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, EnabledParamName) == 0x000088, "Member 'UFortCustomizableObjectSprayVariant::EnabledParamName' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, ProjectorParamName) == 0x000098, "Member 'UFortCustomizableObjectSprayVariant::ProjectorParamName' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, TextureParamName) == 0x0000A8, "Member 'UFortCustomizableObjectSprayVariant::TextureParamName' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, SaturationParamName) == 0x0000B8, "Member 'UFortCustomizableObjectSprayVariant::SaturationParamName' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, WearParamName) == 0x0000C8, "Member 'UFortCustomizableObjectSprayVariant::WearParamName' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, ScaleParamName) == 0x0000D8, "Member 'UFortCustomizableObjectSprayVariant::ScaleParamName' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, TagQueryForShouldOverrideCODefaultsWithFixedLocationParameters) == 0x0000E8, "Member 'UFortCustomizableObjectSprayVariant::TagQueryForShouldOverrideCODefaultsWithFixedLocationParameters' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, FixedSprayLocation) == 0x000130, "Member 'UFortCustomizableObjectSprayVariant::FixedSprayLocation' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, DefaultSprayCustomization) == 0x000198, "Member 'UFortCustomizableObjectSprayVariant::DefaultSprayCustomization' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, SprayNumericConstraints) == 0x000250, "Member 'UFortCustomizableObjectSprayVariant::SprayNumericConstraints' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, TextureBaseScale) == 0x000280, "Member 'UFortCustomizableObjectSprayVariant::TextureBaseScale' has a wrong offset!");
static_assert(offsetof(UFortCustomizableObjectSprayVariant, SpraySlotImageProperties) == 0x000288, "Member 'UFortCustomizableObjectSprayVariant::SpraySlotImageProperties' has a wrong offset!");

// Class MeshCosmetics.GameFeatureAction_MeshCosmeticsCompileSchemaDepenencies
// 0x0000 (0x0028 - 0x0028)
class UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies final : public UGameFeatureAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_MeshCosmeticsCompileSchemaDepenencies">();
	}
	static class UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies>();
	}
};
static_assert(alignof(UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies) == 0x000008, "Wrong alignment on UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies");
static_assert(sizeof(UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies) == 0x000028, "Wrong size on UGameFeatureAction_MeshCosmeticsCompileSchemaDepenencies");

// Class MeshCosmetics.MeshCosmeticTagInterface
// 0x0000 (0x0028 - 0x0028)
class IMeshCosmeticTagInterface final : public IInterface
{
public:
	void OnPostCustomizationAnimGameplayTags_BP(const struct FGameplayTagContainer& GameplayTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticTagInterface">();
	}
	static class IMeshCosmeticTagInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMeshCosmeticTagInterface>();
	}
};
static_assert(alignof(IMeshCosmeticTagInterface) == 0x000008, "Wrong alignment on IMeshCosmeticTagInterface");
static_assert(sizeof(IMeshCosmeticTagInterface) == 0x000028, "Wrong size on IMeshCosmeticTagInterface");

// Class MeshCosmetics.FortCustomizableInstanceLODManagement
// 0x0000 (0x0028 - 0x0028)
class UFortCustomizableInstanceLODManagement final : public UCustomizableInstanceLODManagementBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCustomizableInstanceLODManagement">();
	}
	static class UFortCustomizableInstanceLODManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCustomizableInstanceLODManagement>();
	}
};
static_assert(alignof(UFortCustomizableInstanceLODManagement) == 0x000008, "Wrong alignment on UFortCustomizableInstanceLODManagement");
static_assert(sizeof(UFortCustomizableInstanceLODManagement) == 0x000028, "Wrong size on UFortCustomizableInstanceLODManagement");

// Class MeshCosmetics.MeshCosmeticsLayoutSchema
// 0x00A0 (0x03C8 - 0x0328)
class UMeshCosmeticsLayoutSchema final : public UFortApparelLayoutItemDefinition
{
public:
	TMap<struct FCosmeticSlotSelector, struct FCosmeticsLayoutSlot> SlotDataConfig;                                    // 0x0328(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FCosmeticSlotSelector, TSoftObjectPtr<class UCustomizableObject>> SlottedCustomizableObjects;                        // 0x0378(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsLayoutSchema">();
	}
	static class UMeshCosmeticsLayoutSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsLayoutSchema>();
	}
};
static_assert(alignof(UMeshCosmeticsLayoutSchema) == 0x000008, "Wrong alignment on UMeshCosmeticsLayoutSchema");
static_assert(sizeof(UMeshCosmeticsLayoutSchema) == 0x0003C8, "Wrong size on UMeshCosmeticsLayoutSchema");
static_assert(offsetof(UMeshCosmeticsLayoutSchema, SlotDataConfig) == 0x000328, "Member 'UMeshCosmeticsLayoutSchema::SlotDataConfig' has a wrong offset!");
static_assert(offsetof(UMeshCosmeticsLayoutSchema, SlottedCustomizableObjects) == 0x000378, "Member 'UMeshCosmeticsLayoutSchema::SlottedCustomizableObjects' has a wrong offset!");

// Class MeshCosmetics.MeshCosmeticsAppliedSchemaData
// 0x0020 (0x0048 - 0x0028)
class UMeshCosmeticsAppliedSchemaData final : public UFortCosmeticItemAdditionalData
{
public:
	TSoftObjectPtr<class UMeshCosmeticsLayoutSchema> SchemaAsset;                                       // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsAppliedSchemaData">();
	}
	static class UMeshCosmeticsAppliedSchemaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsAppliedSchemaData>();
	}
};
static_assert(alignof(UMeshCosmeticsAppliedSchemaData) == 0x000008, "Wrong alignment on UMeshCosmeticsAppliedSchemaData");
static_assert(sizeof(UMeshCosmeticsAppliedSchemaData) == 0x000048, "Wrong size on UMeshCosmeticsAppliedSchemaData");
static_assert(offsetof(UMeshCosmeticsAppliedSchemaData, SchemaAsset) == 0x000028, "Member 'UMeshCosmeticsAppliedSchemaData::SchemaAsset' has a wrong offset!");

// Class MeshCosmetics.MeshCosmeticsSupportedSchemaData
// 0x0010 (0x0038 - 0x0028)
class UMeshCosmeticsSupportedSchemaData final : public UFortCosmeticItemAdditionalData
{
public:
	TArray<TSoftObjectPtr<class UMeshCosmeticsLayoutSchema>> SupportedSchemas;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsSupportedSchemaData">();
	}
	static class UMeshCosmeticsSupportedSchemaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmeticsSupportedSchemaData>();
	}
};
static_assert(alignof(UMeshCosmeticsSupportedSchemaData) == 0x000008, "Wrong alignment on UMeshCosmeticsSupportedSchemaData");
static_assert(sizeof(UMeshCosmeticsSupportedSchemaData) == 0x000038, "Wrong size on UMeshCosmeticsSupportedSchemaData");
static_assert(offsetof(UMeshCosmeticsSupportedSchemaData, SupportedSchemas) == 0x000028, "Member 'UMeshCosmeticsSupportedSchemaData::SupportedSchemas' has a wrong offset!");

}

