#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MidMatchRiftPoiGameplayRuntime

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiCheatManager.SpawnMidmatchPoiFurthestLocation
// 0x0018 (0x0018 - 0x0000)
struct MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation) == 0x000008, "Wrong alignment on MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation");
static_assert(sizeof(MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation) == 0x000018, "Wrong size on MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation");
static_assert(offsetof(MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation, Location) == 0x000000, "Member 'MidmatchRiftPoiCheatManager_SpawnMidmatchPoiFurthestLocation::Location' has a wrong offset!");

// Function MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiCheatManager.SpawnMidmatchPoiNearestLocation
// 0x0018 (0x0018 - 0x0000)
struct MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation) == 0x000008, "Wrong alignment on MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation");
static_assert(sizeof(MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation) == 0x000018, "Wrong size on MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation");
static_assert(offsetof(MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation, Location) == 0x000000, "Member 'MidmatchRiftPoiCheatManager_SpawnMidmatchPoiNearestLocation::Location' has a wrong offset!");

// Function MidMatchRiftPoiGameplayRuntime.MidMatchRiftPoiManagerActor.SetDynamicLandBrush
// 0x00C0 (0x00C0 - 0x0000)
struct MidMatchRiftPoiManagerActor_SetDynamicLandBrush final
{
public:
	struct FSlateBrush                            LandIcon;                                          // 0x0000(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidMatchRiftPoiManagerActor_SetDynamicLandBrush) == 0x000010, "Wrong alignment on MidMatchRiftPoiManagerActor_SetDynamicLandBrush");
static_assert(sizeof(MidMatchRiftPoiManagerActor_SetDynamicLandBrush) == 0x0000C0, "Wrong size on MidMatchRiftPoiManagerActor_SetDynamicLandBrush");
static_assert(offsetof(MidMatchRiftPoiManagerActor_SetDynamicLandBrush, LandIcon) == 0x000000, "Member 'MidMatchRiftPoiManagerActor_SetDynamicLandBrush::LandIcon' has a wrong offset!");

// Function MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiSpawnIndicator.TeleportVehicleActor
// 0x0020 (0x0020 - 0x0000)
struct MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor final
{
public:
	class AActor*                                 VehicleActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TeleportLocation;                                  // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor) == 0x000008, "Wrong alignment on MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor");
static_assert(sizeof(MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor) == 0x000020, "Wrong size on MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor");
static_assert(offsetof(MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor, VehicleActor) == 0x000000, "Member 'MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor::VehicleActor' has a wrong offset!");
static_assert(offsetof(MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor, TeleportLocation) == 0x000008, "Member 'MidmatchRiftPoiSpawnIndicator_TeleportVehicleActor::TeleportLocation' has a wrong offset!");

// Function MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiSpawnIndicator.IsActorInDataLayerInstance
// 0x0018 (0x0018 - 0x0000)
struct MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UDataLayerInstance*               DataLayerInstance;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance) == 0x000008, "Wrong alignment on MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance");
static_assert(sizeof(MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance) == 0x000018, "Wrong size on MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance");
static_assert(offsetof(MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance, Actor) == 0x000000, "Member 'MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance::Actor' has a wrong offset!");
static_assert(offsetof(MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance, DataLayerInstance) == 0x000008, "Member 'MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance::DataLayerInstance' has a wrong offset!");
static_assert(offsetof(MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance, ReturnValue) == 0x000010, "Member 'MidmatchRiftPoiSpawnIndicator_IsActorInDataLayerInstance::ReturnValue' has a wrong offset!");

}

