#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilkshakeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MilkshakeRuntime.MilkshakeControllerComponent.RegisterEarthquake
// 0x0008 (0x0008 - 0x0000)
struct MilkshakeControllerComponent_RegisterEarthquake final
{
public:
	class AMilkshakeEarthquakeActor*              Earthquake;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MilkshakeControllerComponent_RegisterEarthquake) == 0x000008, "Wrong alignment on MilkshakeControllerComponent_RegisterEarthquake");
static_assert(sizeof(MilkshakeControllerComponent_RegisterEarthquake) == 0x000008, "Wrong size on MilkshakeControllerComponent_RegisterEarthquake");
static_assert(offsetof(MilkshakeControllerComponent_RegisterEarthquake, Earthquake) == 0x000000, "Member 'MilkshakeControllerComponent_RegisterEarthquake::Earthquake' has a wrong offset!");

// Function MilkshakeRuntime.MilkshakeControllerComponent.UnregisterEarthquake
// 0x0008 (0x0008 - 0x0000)
struct MilkshakeControllerComponent_UnregisterEarthquake final
{
public:
	class AMilkshakeEarthquakeActor*              Earthquake;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MilkshakeControllerComponent_UnregisterEarthquake) == 0x000008, "Wrong alignment on MilkshakeControllerComponent_UnregisterEarthquake");
static_assert(sizeof(MilkshakeControllerComponent_UnregisterEarthquake) == 0x000008, "Wrong size on MilkshakeControllerComponent_UnregisterEarthquake");
static_assert(offsetof(MilkshakeControllerComponent_UnregisterEarthquake, Earthquake) == 0x000000, "Member 'MilkshakeControllerComponent_UnregisterEarthquake::Earthquake' has a wrong offset!");

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.GetNormalizedMagnitudeAtLocation
// 0x0020 (0x0020 - 0x0000)
struct MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation) == 0x000008, "Wrong alignment on MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation");
static_assert(sizeof(MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation) == 0x000020, "Wrong size on MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation");
static_assert(offsetof(MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation, Location) == 0x000000, "Member 'MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation::Location' has a wrong offset!");
static_assert(offsetof(MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation, ReturnValue) == 0x000018, "Member 'MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation::ReturnValue' has a wrong offset!");

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.OnActorRemovedFromAsyncOverlappedActors
// 0x0008 (0x0008 - 0x0000)
struct MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors final
{
public:
	class AActor*                                 RemovedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors) == 0x000008, "Wrong alignment on MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors");
static_assert(sizeof(MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors) == 0x000008, "Wrong size on MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors");
static_assert(offsetof(MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors, RemovedActor) == 0x000000, "Member 'MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors::RemovedActor' has a wrong offset!");

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.TickEarthquakePhysicsActorForces
// 0x0004 (0x0004 - 0x0000)
struct MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces) == 0x000004, "Wrong alignment on MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces");
static_assert(sizeof(MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces) == 0x000004, "Wrong size on MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces");
static_assert(offsetof(MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces, DeltaSeconds) == 0x000000, "Member 'MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces::DeltaSeconds' has a wrong offset!");

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.GetRadius
// 0x0004 (0x0004 - 0x0000)
struct MilkshakeEarthquakeActor_GetRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MilkshakeEarthquakeActor_GetRadius) == 0x000004, "Wrong alignment on MilkshakeEarthquakeActor_GetRadius");
static_assert(sizeof(MilkshakeEarthquakeActor_GetRadius) == 0x000004, "Wrong size on MilkshakeEarthquakeActor_GetRadius");
static_assert(offsetof(MilkshakeEarthquakeActor_GetRadius, ReturnValue) == 0x000000, "Member 'MilkshakeEarthquakeActor_GetRadius::ReturnValue' has a wrong offset!");

// Function MilkshakeRuntime.MilkshakeFieldSystemActor.SetStrength
// 0x0004 (0x0004 - 0x0000)
struct MilkshakeFieldSystemActor_SetStrength final
{
public:
	float                                         InStrength;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MilkshakeFieldSystemActor_SetStrength) == 0x000004, "Wrong alignment on MilkshakeFieldSystemActor_SetStrength");
static_assert(sizeof(MilkshakeFieldSystemActor_SetStrength) == 0x000004, "Wrong size on MilkshakeFieldSystemActor_SetStrength");
static_assert(offsetof(MilkshakeFieldSystemActor_SetStrength, InStrength) == 0x000000, "Member 'MilkshakeFieldSystemActor_SetStrength::InStrength' has a wrong offset!");

}

