#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniTagIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MiniTagIcon.MiniTagIcon_C.ExecuteUbergraph_MiniTagIcon
// 0x00F0 (0x00F0 - 0x0000)
struct MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00C0)()
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x00DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon) == 0x000010, "Wrong alignment on MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon");
static_assert(sizeof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon) == 0x0000F0, "Wrong size on MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, EntryPoint) == 0x000000, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x0000D0, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000D8, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x0000DC, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000E4, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000E8, "Member 'MiniTagIcon_C_ExecuteUbergraph_MiniTagIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function MiniTagIcon.MiniTagIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MiniTagIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniTagIcon_C_PreConstruct) == 0x000001, "Wrong alignment on MiniTagIcon_C_PreConstruct");
static_assert(sizeof(MiniTagIcon_C_PreConstruct) == 0x000001, "Wrong size on MiniTagIcon_C_PreConstruct");
static_assert(offsetof(MiniTagIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MiniTagIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

