#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MotionTrajectory.CharacterTrajectoryComponent.OnMovementUpdated
// 0x0038 (0x0038 - 0x0000)
struct CharacterTrajectoryComponent_OnMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OldLocation;                                       // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterTrajectoryComponent_OnMovementUpdated) == 0x000008, "Wrong alignment on CharacterTrajectoryComponent_OnMovementUpdated");
static_assert(sizeof(CharacterTrajectoryComponent_OnMovementUpdated) == 0x000038, "Wrong size on CharacterTrajectoryComponent_OnMovementUpdated");
static_assert(offsetof(CharacterTrajectoryComponent_OnMovementUpdated, DeltaSeconds) == 0x000000, "Member 'CharacterTrajectoryComponent_OnMovementUpdated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CharacterTrajectoryComponent_OnMovementUpdated, OldLocation) == 0x000008, "Member 'CharacterTrajectoryComponent_OnMovementUpdated::OldLocation' has a wrong offset!");
static_assert(offsetof(CharacterTrajectoryComponent_OnMovementUpdated, OldVelocity) == 0x000020, "Member 'CharacterTrajectoryComponent_OnMovementUpdated::OldVelocity' has a wrong offset!");

}

