#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotorcycleRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MotorcycleRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class MotorcycleRuntime.FortMotorcycleVehicleAnimInstance
// 0x0070 (0x0690 - 0x0620)
#pragma pack(push, 0x1)
class alignas(0x10) UFortMotorcycleVehicleAnimInstance : public UFortVehicleAnimInstance
{
public:
	class AFortMotorcycleVehicle*                 MotorcycleVehicle;                                 // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               SwingArmRotation;                                  // 0x0620(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsInInventoryMode;                                // 0x0638(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance_MotorcycleDriver* DriverAnimInstance;                                // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBikeParked;                                     // 0x0648(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBikeOn;                                         // 0x0649(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBikeStopping;                                   // 0x064A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReversing;                                      // 0x064B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalSpeed;                                        // 0x064C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSurfaceWater;                                   // 0x0650(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_651[0x3];                                      // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditiveAlpha;                                     // 0x0654(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRevving;                                        // 0x0658(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccelAlpha;                                        // 0x065C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsThrottling;                                     // 0x0660(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHonking;                                        // 0x0661(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSoloJumpTrickOutro;                             // 0x0662(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpTrickNone;                                  // 0x0663(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakeLeverAlpha;                                   // 0x0664(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitFromLocomotion;                         // 0x0668(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFromRevvingToThrottle;                   // 0x0669(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayThrottleAnim;                           // 0x066A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateTransitionRuleToMovingLoop;                  // 0x066B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEarlyOutFromMovingStart;                          // 0x066C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldStop;                                       // 0x066D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReverse;                                    // 0x066E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReverseStop;                                // 0x066F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldStopThrottling;                             // 0x0670(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromJumpTrick;                                  // 0x0671(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSoloJumpTrick;                                  // 0x0672(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldJump;                                       // 0x0673(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0674(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMotorcycleAirTrickType                   AirTrickType;                                      // 0x0675(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLandingInPlace;                                 // 0x0676(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFallingToMoving;                         // 0x0677(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpChargeFactor;                                  // 0x0678(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardSpeed;                                      // 0x067C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoppie;                                          // 0x0680(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBraking;                                        // 0x0681(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldBrake;                                      // 0x0682(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEarlyOutBrakingOutro;                             // 0x0683(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldJumpTrick;                                  // 0x0684(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateTransitionRuleToReverseLoop;                 // 0x0685(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReverseNoFeet;                                  // 0x0686(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_687[0x1];                                      // 0x0687(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CollectConditionsFromDriver();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMotorcycleVehicleAnimInstance">();
	}
	static class UFortMotorcycleVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMotorcycleVehicleAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UFortMotorcycleVehicleAnimInstance) == 0x000010, "Wrong alignment on UFortMotorcycleVehicleAnimInstance");
static_assert(sizeof(UFortMotorcycleVehicleAnimInstance) == 0x000690, "Wrong size on UFortMotorcycleVehicleAnimInstance");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, MotorcycleVehicle) == 0x000618, "Member 'UFortMotorcycleVehicleAnimInstance::MotorcycleVehicle' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, SwingArmRotation) == 0x000620, "Member 'UFortMotorcycleVehicleAnimInstance::SwingArmRotation' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsInInventoryMode) == 0x000638, "Member 'UFortMotorcycleVehicleAnimInstance::bIsInInventoryMode' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, DriverAnimInstance) == 0x000640, "Member 'UFortMotorcycleVehicleAnimInstance::DriverAnimInstance' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBikeParked) == 0x000648, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBikeParked' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBikeOn) == 0x000649, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBikeOn' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBikeStopping) == 0x00064A, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBikeStopping' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsReversing) == 0x00064B, "Member 'UFortMotorcycleVehicleAnimInstance::bIsReversing' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, TotalSpeed) == 0x00064C, "Member 'UFortMotorcycleVehicleAnimInstance::TotalSpeed' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsSurfaceWater) == 0x000650, "Member 'UFortMotorcycleVehicleAnimInstance::bIsSurfaceWater' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, AdditiveAlpha) == 0x000654, "Member 'UFortMotorcycleVehicleAnimInstance::AdditiveAlpha' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsRevving) == 0x000658, "Member 'UFortMotorcycleVehicleAnimInstance::bIsRevving' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, AccelAlpha) == 0x00065C, "Member 'UFortMotorcycleVehicleAnimInstance::AccelAlpha' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsThrottling) == 0x000660, "Member 'UFortMotorcycleVehicleAnimInstance::bIsThrottling' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsHonking) == 0x000661, "Member 'UFortMotorcycleVehicleAnimInstance::bIsHonking' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsSoloJumpTrickOutro) == 0x000662, "Member 'UFortMotorcycleVehicleAnimInstance::bIsSoloJumpTrickOutro' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsJumpTrickNone) == 0x000663, "Member 'UFortMotorcycleVehicleAnimInstance::bIsJumpTrickNone' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, BrakeLeverAlpha) == 0x000664, "Member 'UFortMotorcycleVehicleAnimInstance::BrakeLeverAlpha' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldExitFromLocomotion) == 0x000668, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldExitFromLocomotion' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateRuleFromRevvingToThrottle) == 0x000669, "Member 'UFortMotorcycleVehicleAnimInstance::bStateRuleFromRevvingToThrottle' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldPlayThrottleAnim) == 0x00066A, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldPlayThrottleAnim' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateTransitionRuleToMovingLoop) == 0x00066B, "Member 'UFortMotorcycleVehicleAnimInstance::bStateTransitionRuleToMovingLoop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bEarlyOutFromMovingStart) == 0x00066C, "Member 'UFortMotorcycleVehicleAnimInstance::bEarlyOutFromMovingStart' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldStop) == 0x00066D, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldStop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldReverse) == 0x00066E, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldReverse' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldReverseStop) == 0x00066F, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldReverseStop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldStopThrottling) == 0x000670, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldStopThrottling' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsFromJumpTrick) == 0x000671, "Member 'UFortMotorcycleVehicleAnimInstance::bIsFromJumpTrick' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsSoloJumpTrick) == 0x000672, "Member 'UFortMotorcycleVehicleAnimInstance::bIsSoloJumpTrick' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldJump) == 0x000673, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldJump' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsMoving) == 0x000674, "Member 'UFortMotorcycleVehicleAnimInstance::bIsMoving' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, AirTrickType) == 0x000675, "Member 'UFortMotorcycleVehicleAnimInstance::AirTrickType' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsLandingInPlace) == 0x000676, "Member 'UFortMotorcycleVehicleAnimInstance::bIsLandingInPlace' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateRuleFallingToMoving) == 0x000677, "Member 'UFortMotorcycleVehicleAnimInstance::bStateRuleFallingToMoving' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, JumpChargeFactor) == 0x000678, "Member 'UFortMotorcycleVehicleAnimInstance::JumpChargeFactor' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, ForwardSpeed) == 0x00067C, "Member 'UFortMotorcycleVehicleAnimInstance::ForwardSpeed' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStoppie) == 0x000680, "Member 'UFortMotorcycleVehicleAnimInstance::bStoppie' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBraking) == 0x000681, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBraking' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldBrake) == 0x000682, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldBrake' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bEarlyOutBrakingOutro) == 0x000683, "Member 'UFortMotorcycleVehicleAnimInstance::bEarlyOutBrakingOutro' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldJumpTrick) == 0x000684, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldJumpTrick' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateTransitionRuleToReverseLoop) == 0x000685, "Member 'UFortMotorcycleVehicleAnimInstance::bStateTransitionRuleToReverseLoop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsReverseNoFeet) == 0x000686, "Member 'UFortMotorcycleVehicleAnimInstance::bIsReverseNoFeet' has a wrong offset!");

// Class MotorcycleRuntime.FortPlayerAnimInstance_MotorcycleRider
// 0x0410 (0x0880 - 0x0470)
class UFortPlayerAnimInstance_MotorcycleRider : public UFortBaseLayerAnimInstance
{
public:
	class AFortMotorcycleVehicle*                 Motorcycle;                                        // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortMotorcycleVehicleAnimInstance*     MotorcycleAnimInstance;                            // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAnimInput_Motorcycle              MotorcycleInput;                                   // 0x0478(0x0054)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldVelocity;                                     // 0x04D8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalVelocity;                                     // 0x04F0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightHandIKAlpha;                                  // 0x0508(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftHandIKAlpha;                                   // 0x050C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed2D;                                           // 0x0510(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCardinalDirection                        LocomotionCardinalDirection;                       // 0x0514(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCardinalDirection                        PrePivotCardinalDirection;                         // 0x0515(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShouldPlayJogPivotTransition : 1;                 // 0x0516(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPivotTransitionDoOnceTriggered : 1;               // 0x0516(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsJumping : 1;                                    // 0x0516(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsReloading : 1;                                  // 0x0516(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_517[0x1];                                      // 0x0517(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RiderCatchupRotation;                              // 0x0518(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_530[0x8];                                      // 0x0530(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RiderZDisplacement;                                // 0x0538(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementDampUpFactor;                     // 0x053C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementDampDownFactor;                   // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementLandingFallDistanceThreshold;     // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderMinDisplacement;                              // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderMaxDisplacement;                              // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementRampPerSecond;                    // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderRotationInterpSpeed;                          // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAnimInput_VelocityImpact          VelocityImpact;                                    // 0x0558(0x00F0)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ImpactDisplacement;                                // 0x0648(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AbsSteerAngle;                                     // 0x0660(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanAngle;                                         // 0x0664(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallDistanceValue;                                 // 0x0668(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTraceLocation;                                 // 0x0670(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootTraceSideOffset;                               // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFootLocationDistance;                           // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFootTrace;                                     // 0x0690(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAir;                                            // 0x0691(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInRollAngleThreshold;                           // 0x0692(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDriveStarting;                                  // 0x0693(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalLeftOffset;                                   // 0x0698(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPosLeft;                                      // 0x06B0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LocalRotLeftOffset;                                // 0x06C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               WorldRotLeft;                                      // 0x06E0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LocalRightOffset;                                  // 0x06F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPosRight;                                     // 0x0710(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LocalRotRightOffset;                               // 0x0728(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               WorldRotRight;                                     // 0x0740(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsSteeringRotating;                               // 0x0758(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStopped;                                        // 0x0759(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIdle;                                           // 0x075A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75B[0x1];                                      // 0x075B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleSpeedKmh;                                      // 0x075C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSlowingDown;                                    // 0x0760(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrivingFast;                                    // 0x0761(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurningRightHard;                               // 0x0762(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurningLeftHard;                                // 0x0763(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBraking;                                        // 0x0764(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_765[0x1];                                      // 0x0765(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsBoosting;                                       // 0x0766(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpTrick;                                      // 0x0767(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpPlayRate;                                      // 0x0768(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpFlipping;                                   // 0x076C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldEnableAO;                                   // 0x076D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBodyDragging;                                   // 0x076E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76F[0x1];                                      // 0x076F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallDistanceJumpingThreshold;                      // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallDistanceJumpTrickThreshold;                    // 0x0774(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollAngleThreshold;                                // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartSpeedThreshold;                               // 0x077C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlowingSpeedThreshold;                             // 0x0780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FastSpeedThreshold;                                // 0x0784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakingDeltaThreshold;                             // 0x0788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteerHardAngleThreshold;                           // 0x078C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundTraceUpOffset;                               // 0x0790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundTraceLength;                                 // 0x0794(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              JumpPlayRateInRange;                               // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              JumpPlayRateOutRange;                              // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpChargeFactor;                                  // 0x07B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargingJump;                                   // 0x07BC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMotorcycleJumping;                              // 0x07BD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotorcycleLaunchedJump;                           // 0x07BE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWheelie;                                          // 0x07BF(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoppie;                                          // 0x07C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMotorcycleAirTrickType                   AirTrickType;                                      // 0x07C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpingAndNotRolling;                           // 0x07C2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGroundAndNotRolling;                          // 0x07C3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGroundAndBoosting;                            // 0x07C4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayPivotOnGroundAndNotBoosting;                  // 0x07C5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPowerSliding;                                   // 0x07C6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C7[0x1];                                      // 0x07C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PowerSlideSteeringAngleThreshold;                  // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PowerSlideSpeedThreshold;                          // 0x07CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D0[0x8];                                      // 0x07D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LandStartPosInRange;                               // 0x07D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LandStartPosOutRange;                              // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandStartPosition;                                 // 0x07F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPawnStandUp;                                // 0x07FC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSmoothingYaw;                                   // 0x07FD(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7FE[0x2];                                      // 0x07FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimPitch;                                          // 0x0800(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYaw;                                            // 0x0804(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawLastFrame;                                   // 0x0808(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawSmoothed;                                    // 0x080C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BodyAimYaw;                                        // 0x0810(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NegativeBodyAimYaw;                                // 0x0814(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardSpeed;                                      // 0x0818(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousForwardSpeed;                              // 0x081C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalSpeed;                                        // 0x0820(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReversing;                                      // 0x0824(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0825(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x0826(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingConsumable;                                // 0x0827(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               IntroCachedTime;                                   // 0x0828(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StoppieLandTime;                                   // 0x083C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayHitReact;                               // 0x0840(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingMontage;                                 // 0x0841(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_842[0x2];                                      // 0x0842(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VehiclePitch;                                      // 0x0844(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleRoll;                                       // 0x0848(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               MeleeTwistRot;                                     // 0x0850(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStateTransitionRuleToMovingLoop;                  // 0x0868(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpperBodyAdditiveAlpha;                            // 0x086C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperBodyAdditiveStrength;                         // 0x0870(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovingNoisePlayRate;                               // 0x0874(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFemale;                                         // 0x0878(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AnimNotify_JumpEntered();
	void CalculateNoiseAlpha();
	void CollapsedAimYawSmoothed(float DeltaSeconds);
	void HandleCancelChargingJump();
	void HandleChargingJump(const float InJumpChargeFactor);
	void HandleFinishAirTrick();
	void HandleJump(const float InJumpChargeFactor);
	void HandleReleaseStoppie();
	void HandleReleaseWheelie();
	void HandleStartAirTrick(const EFortMotorcycleAirTrickType TrickType);
	void HandleStartChargingJump();
	void HandleStartStoppie();
	void HandleStartWheelie();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_MotorcycleRider">();
	}
	static class UFortPlayerAnimInstance_MotorcycleRider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_MotorcycleRider>();
	}
};
static_assert(alignof(UFortPlayerAnimInstance_MotorcycleRider) == 0x000010, "Wrong alignment on UFortPlayerAnimInstance_MotorcycleRider");
static_assert(sizeof(UFortPlayerAnimInstance_MotorcycleRider) == 0x000880, "Wrong size on UFortPlayerAnimInstance_MotorcycleRider");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, Motorcycle) == 0x000468, "Member 'UFortPlayerAnimInstance_MotorcycleRider::Motorcycle' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, MotorcycleAnimInstance) == 0x000470, "Member 'UFortPlayerAnimInstance_MotorcycleRider::MotorcycleAnimInstance' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, MotorcycleInput) == 0x000478, "Member 'UFortPlayerAnimInstance_MotorcycleRider::MotorcycleInput' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FortPlayerPawn) == 0x0004D0, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, WorldVelocity) == 0x0004D8, "Member 'UFortPlayerAnimInstance_MotorcycleRider::WorldVelocity' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LocalVelocity) == 0x0004F0, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LocalVelocity' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RightHandIKAlpha) == 0x000508, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RightHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LeftHandIKAlpha) == 0x00050C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LeftHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, Speed2D) == 0x000510, "Member 'UFortPlayerAnimInstance_MotorcycleRider::Speed2D' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LocomotionCardinalDirection) == 0x000514, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LocomotionCardinalDirection' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, PrePivotCardinalDirection) == 0x000515, "Member 'UFortPlayerAnimInstance_MotorcycleRider::PrePivotCardinalDirection' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderCatchupRotation) == 0x000518, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderCatchupRotation' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderZDisplacement) == 0x000538, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderZDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementDampUpFactor) == 0x00053C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementDampUpFactor' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementDampDownFactor) == 0x000540, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementDampDownFactor' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementLandingFallDistanceThreshold) == 0x000544, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementLandingFallDistanceThreshold' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderMinDisplacement) == 0x000548, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderMinDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderMaxDisplacement) == 0x00054C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderMaxDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementRampPerSecond) == 0x000550, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementRampPerSecond' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderRotationInterpSpeed) == 0x000554, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderRotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, VelocityImpact) == 0x000558, "Member 'UFortPlayerAnimInstance_MotorcycleRider::VelocityImpact' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, ImpactDisplacement) == 0x000648, "Member 'UFortPlayerAnimInstance_MotorcycleRider::ImpactDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, AbsSteerAngle) == 0x000660, "Member 'UFortPlayerAnimInstance_MotorcycleRider::AbsSteerAngle' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LeanAngle) == 0x000664, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LeanAngle' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FallDistanceValue) == 0x000668, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FallDistanceValue' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FootTraceLocation) == 0x000670, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FootTraceLocation' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FootTraceSideOffset) == 0x000688, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FootTraceSideOffset' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, MaxFootLocationDistance) == 0x00068C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::MaxFootLocationDistance' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bHasFootTrace) == 0x000690, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bHasFootTrace' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bInAir) == 0x000691, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bInAir' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bIsInRollAngleThreshold) == 0x000692, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bIsInRollAngleThreshold' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bIsDriveStarting) == 0x000693, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bIsDriveStarting' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LocalLeftOffset) == 0x000698, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LocalLeftOffset' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, WorldPosLeft) == 0x0006B0, "Member 'UFortPlayerAnimInstance_MotorcycleRider::WorldPosLeft' has a wrong offset!");
