#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mover

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Mover_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Mover.TurnGeneratorInterface.GetTurn
// 0x0200 (0x0200 - 0x0000)
struct TurnGeneratorInterface_GetTurn final
{
public:
	struct FRotator                               TargetOrientation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverTickStartData                    FullStartState;                                    // 0x0018(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverDefaultSyncState                 MoverState;                                        // 0x0050(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0140(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ProposedMove;                                      // 0x0150(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UMoverBlackboard*                       SimBlackboard;                                     // 0x01D8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x01E0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TurnGeneratorInterface_GetTurn) == 0x000010, "Wrong alignment on TurnGeneratorInterface_GetTurn");
static_assert(sizeof(TurnGeneratorInterface_GetTurn) == 0x000200, "Wrong size on TurnGeneratorInterface_GetTurn");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, TargetOrientation) == 0x000000, "Member 'TurnGeneratorInterface_GetTurn::TargetOrientation' has a wrong offset!");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, FullStartState) == 0x000018, "Member 'TurnGeneratorInterface_GetTurn::FullStartState' has a wrong offset!");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, MoverState) == 0x000050, "Member 'TurnGeneratorInterface_GetTurn::MoverState' has a wrong offset!");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, TimeStep) == 0x000140, "Member 'TurnGeneratorInterface_GetTurn::TimeStep' has a wrong offset!");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, ProposedMove) == 0x000150, "Member 'TurnGeneratorInterface_GetTurn::ProposedMove' has a wrong offset!");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, SimBlackboard) == 0x0001D8, "Member 'TurnGeneratorInterface_GetTurn::SimBlackboard' has a wrong offset!");
static_assert(offsetof(TurnGeneratorInterface_GetTurn, ReturnValue) == 0x0001E0, "Member 'TurnGeneratorInterface_GetTurn::ReturnValue' has a wrong offset!");

// Function Mover.MoverBasePawn.GetMoverComponent
// 0x0008 (0x0008 - 0x0000)
struct MoverBasePawn_GetMoverComponent final
{
public:
	class UMoverComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverBasePawn_GetMoverComponent) == 0x000008, "Wrong alignment on MoverBasePawn_GetMoverComponent");
static_assert(sizeof(MoverBasePawn_GetMoverComponent) == 0x000008, "Wrong size on MoverBasePawn_GetMoverComponent");
static_assert(offsetof(MoverBasePawn_GetMoverComponent, ReturnValue) == 0x000000, "Member 'MoverBasePawn_GetMoverComponent::ReturnValue' has a wrong offset!");

// Function Mover.MoverDataModelBlueprintLibrary.GetLocationFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetLocationFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoverDataModelBlueprintLibrary_GetLocationFromSyncState) == 0x000010, "Wrong alignment on MoverDataModelBlueprintLibrary_GetLocationFromSyncState");
static_assert(sizeof(MoverDataModelBlueprintLibrary_GetLocationFromSyncState) == 0x000110, "Wrong size on MoverDataModelBlueprintLibrary_GetLocationFromSyncState");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetLocationFromSyncState, SyncState) == 0x000000, "Member 'MoverDataModelBlueprintLibrary_GetLocationFromSyncState::SyncState' has a wrong offset!");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetLocationFromSyncState, ReturnValue) == 0x0000F0, "Member 'MoverDataModelBlueprintLibrary_GetLocationFromSyncState::ReturnValue' has a wrong offset!");

// Function Mover.MoverDataModelBlueprintLibrary.GetMoveDirectionIntentFromInputs
// 0x0088 (0x0088 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs final
{
public:
	struct FKinematicDefaultInputs                Inputs;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs) == 0x000008, "Wrong alignment on MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs");
static_assert(sizeof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs) == 0x000088, "Wrong size on MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs, Inputs) == 0x000000, "Member 'MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs::Inputs' has a wrong offset!");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs, ReturnValue) == 0x000070, "Member 'MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromInputs::ReturnValue' has a wrong offset!");

// Function Mover.MoverDataModelBlueprintLibrary.GetMoveDirectionIntentFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState) == 0x000010, "Wrong alignment on MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState");
static_assert(sizeof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState) == 0x000110, "Wrong size on MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState, SyncState) == 0x000000, "Member 'MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState::SyncState' has a wrong offset!");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState, ReturnValue) == 0x0000F0, "Member 'MoverDataModelBlueprintLibrary_GetMoveDirectionIntentFromSyncState::ReturnValue' has a wrong offset!");

// Function Mover.MoverDataModelBlueprintLibrary.GetOrientationFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetOrientationFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoverDataModelBlueprintLibrary_GetOrientationFromSyncState) == 0x000010, "Wrong alignment on MoverDataModelBlueprintLibrary_GetOrientationFromSyncState");
static_assert(sizeof(MoverDataModelBlueprintLibrary_GetOrientationFromSyncState) == 0x000110, "Wrong size on MoverDataModelBlueprintLibrary_GetOrientationFromSyncState");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetOrientationFromSyncState, SyncState) == 0x000000, "Member 'MoverDataModelBlueprintLibrary_GetOrientationFromSyncState::SyncState' has a wrong offset!");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetOrientationFromSyncState, ReturnValue) == 0x0000F0, "Member 'MoverDataModelBlueprintLibrary_GetOrientationFromSyncState::ReturnValue' has a wrong offset!");

// Function Mover.MoverDataModelBlueprintLibrary.GetVelocityFromSyncState
// 0x0110 (0x0110 - 0x0000)
struct MoverDataModelBlueprintLibrary_GetVelocityFromSyncState final
{
public:
	struct FMoverDefaultSyncState                 SyncState;                                         // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoverDataModelBlueprintLibrary_GetVelocityFromSyncState) == 0x000010, "Wrong alignment on MoverDataModelBlueprintLibrary_GetVelocityFromSyncState");
static_assert(sizeof(MoverDataModelBlueprintLibrary_GetVelocityFromSyncState) == 0x000110, "Wrong size on MoverDataModelBlueprintLibrary_GetVelocityFromSyncState");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetVelocityFromSyncState, SyncState) == 0x000000, "Member 'MoverDataModelBlueprintLibrary_GetVelocityFromSyncState::SyncState' has a wrong offset!");
static_assert(offsetof(MoverDataModelBlueprintLibrary_GetVelocityFromSyncState, ReturnValue) == 0x0000F0, "Member 'MoverDataModelBlueprintLibrary_GetVelocityFromSyncState::ReturnValue' has a wrong offset!");

// Function Mover.MoverDebugComponent.OnHistoryTrackingRollback
// 0x0020 (0x0020 - 0x0000)
struct MoverDebugComponent_OnHistoryTrackingRollback final
{
public:
	struct FMoverTimeStep                         NewTimeStep;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         InvalidatedTimeStep;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDebugComponent_OnHistoryTrackingRollback) == 0x000004, "Wrong alignment on MoverDebugComponent_OnHistoryTrackingRollback");
static_assert(sizeof(MoverDebugComponent_OnHistoryTrackingRollback) == 0x000020, "Wrong size on MoverDebugComponent_OnHistoryTrackingRollback");
static_assert(offsetof(MoverDebugComponent_OnHistoryTrackingRollback, NewTimeStep) == 0x000000, "Member 'MoverDebugComponent_OnHistoryTrackingRollback::NewTimeStep' has a wrong offset!");
static_assert(offsetof(MoverDebugComponent_OnHistoryTrackingRollback, InvalidatedTimeStep) == 0x000010, "Member 'MoverDebugComponent_OnHistoryTrackingRollback::InvalidatedTimeStep' has a wrong offset!");

// Function Mover.MoverDebugComponent.OnMovementSimRollback
// 0x0020 (0x0020 - 0x0000)
struct MoverDebugComponent_OnMovementSimRollback final
{
public:
	struct FMoverTimeStep                         NewTimeStep;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         InvalidatedTimeStep;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDebugComponent_OnMovementSimRollback) == 0x000004, "Wrong alignment on MoverDebugComponent_OnMovementSimRollback");
static_assert(sizeof(MoverDebugComponent_OnMovementSimRollback) == 0x000020, "Wrong size on MoverDebugComponent_OnMovementSimRollback");
static_assert(offsetof(MoverDebugComponent_OnMovementSimRollback, NewTimeStep) == 0x000000, "Member 'MoverDebugComponent_OnMovementSimRollback::NewTimeStep' has a wrong offset!");
static_assert(offsetof(MoverDebugComponent_OnMovementSimRollback, InvalidatedTimeStep) == 0x000010, "Member 'MoverDebugComponent_OnMovementSimRollback::InvalidatedTimeStep' has a wrong offset!");

// Function Mover.MoverDebugComponent.OnMovementSimTick
// 0x0010 (0x0010 - 0x0000)
struct MoverDebugComponent_OnMovementSimTick final
{
public:
	struct FMoverTimeStep                         TimeStep;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDebugComponent_OnMovementSimTick) == 0x000004, "Wrong alignment on MoverDebugComponent_OnMovementSimTick");
static_assert(sizeof(MoverDebugComponent_OnMovementSimTick) == 0x000010, "Wrong size on MoverDebugComponent_OnMovementSimTick");
static_assert(offsetof(MoverDebugComponent_OnMovementSimTick, TimeStep) == 0x000000, "Member 'MoverDebugComponent_OnMovementSimTick::TimeStep' has a wrong offset!");

// Function Mover.MoverDebugComponent.SetHistoryTracking
// 0x0008 (0x0008 - 0x0000)
struct MoverDebugComponent_SetHistoryTracking final
{
public:
	float                                         SecondsToTrack;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplesPerSecond;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDebugComponent_SetHistoryTracking) == 0x000004, "Wrong alignment on MoverDebugComponent_SetHistoryTracking");
static_assert(sizeof(MoverDebugComponent_SetHistoryTracking) == 0x000008, "Wrong size on MoverDebugComponent_SetHistoryTracking");
static_assert(offsetof(MoverDebugComponent_SetHistoryTracking, SecondsToTrack) == 0x000000, "Member 'MoverDebugComponent_SetHistoryTracking::SecondsToTrack' has a wrong offset!");
static_assert(offsetof(MoverDebugComponent_SetHistoryTracking, SamplesPerSecond) == 0x000004, "Member 'MoverDebugComponent_SetHistoryTracking::SamplesPerSecond' has a wrong offset!");

// Function Mover.MoverDebugComponent.GetFutureTrajectory
// 0x0018 (0x0018 - 0x0000)
struct MoverDebugComponent_GetFutureTrajectory final
{
public:
	float                                         FutureSeconds;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplesPerSecond;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTrajectorySampleInfo>          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDebugComponent_GetFutureTrajectory) == 0x000008, "Wrong alignment on MoverDebugComponent_GetFutureTrajectory");
static_assert(sizeof(MoverDebugComponent_GetFutureTrajectory) == 0x000018, "Wrong size on MoverDebugComponent_GetFutureTrajectory");
static_assert(offsetof(MoverDebugComponent_GetFutureTrajectory, FutureSeconds) == 0x000000, "Member 'MoverDebugComponent_GetFutureTrajectory::FutureSeconds' has a wrong offset!");
static_assert(offsetof(MoverDebugComponent_GetFutureTrajectory, SamplesPerSecond) == 0x000004, "Member 'MoverDebugComponent_GetFutureTrajectory::SamplesPerSecond' has a wrong offset!");
static_assert(offsetof(MoverDebugComponent_GetFutureTrajectory, ReturnValue) == 0x000008, "Member 'MoverDebugComponent_GetFutureTrajectory::ReturnValue' has a wrong offset!");

// Function Mover.MoverDebugComponent.GetPastTrajectory
// 0x0010 (0x0010 - 0x0000)
struct MoverDebugComponent_GetPastTrajectory final
{
public:
	TArray<struct FTrajectorySampleInfo>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverDebugComponent_GetPastTrajectory) == 0x000008, "Wrong alignment on MoverDebugComponent_GetPastTrajectory");
static_assert(sizeof(MoverDebugComponent_GetPastTrajectory) == 0x000010, "Wrong size on MoverDebugComponent_GetPastTrajectory");
static_assert(offsetof(MoverDebugComponent_GetPastTrajectory, ReturnValue) == 0x000000, "Member 'MoverDebugComponent_GetPastTrajectory::ReturnValue' has a wrong offset!");

// Function Mover.MoverInputProducerInterface.ProduceInput
// 0x0020 (0x0020 - 0x0000)
struct MoverInputProducerInterface_ProduceInput final
{
public:
	int32                                         SimTimeMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoverInputCmdContext                  InputCmdResult;                                    // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoverInputProducerInterface_ProduceInput) == 0x000008, "Wrong alignment on MoverInputProducerInterface_ProduceInput");
static_assert(sizeof(MoverInputProducerInterface_ProduceInput) == 0x000020, "Wrong size on MoverInputProducerInterface_ProduceInput");
static_assert(offsetof(MoverInputProducerInterface_ProduceInput, SimTimeMs) == 0x000000, "Member 'MoverInputProducerInterface_ProduceInput::SimTimeMs' has a wrong offset!");
static_assert(offsetof(MoverInputProducerInterface_ProduceInput, InputCmdResult) == 0x000008, "Member 'MoverInputProducerInterface_ProduceInput::InputCmdResult' has a wrong offset!");

// Function Mover.MoverDataCollectionLibrary.K2_AddDataToCollection
// 0x0020 (0x0020 - 0x0000)
struct MoverDataCollectionLibrary_K2_AddDataToCollection final
{
public:
	struct FMoverDataCollection                   Collection;                                        // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         SourceAsRawBytes;                                  // 0x0018(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoverDataCollectionLibrary_K2_AddDataToCollection) == 0x000008, "Wrong alignment on MoverDataCollectionLibrary_K2_AddDataToCollection");
static_assert(sizeof(MoverDataCollectionLibrary_K2_AddDataToCollection) == 0x000020, "Wrong size on MoverDataCollectionLibrary_K2_AddDataToCollection");
static_assert(offsetof(MoverDataCollectionLibrary_K2_AddDataToCollection, Collection) == 0x000000, "Member 'MoverDataCollectionLibrary_K2_AddDataToCollection::Collection' has a wrong offset!");
static_assert(offsetof(MoverDataCollectionLibrary_K2_AddDataToCollection, SourceAsRawBytes) == 0x000018, "Member 'MoverDataCollectionLibrary_K2_AddDataToCollection::SourceAsRawBytes' has a wrong offset!");

// Function Mover.MoverDataCollectionLibrary.K2_GetDataFromCollection
// 0x0028 (0x0028 - 0x0000)
struct MoverDataCollectionLibrary_K2_GetDataFromCollection final
{
public:
	bool                                          DidSucceed;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoverDataCollection                   Collection;                                        // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         TargetAsRawBytes;                                  // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoverDataCollectionLibrary_K2_GetDataFromCollection) == 0x000008, "Wrong alignment on MoverDataCollectionLibrary_K2_GetDataFromCollection");
static_assert(sizeof(MoverDataCollectionLibrary_K2_GetDataFromCollection) == 0x000028, "Wrong size on MoverDataCollectionLibrary_K2_GetDataFromCollection");
static_assert(offsetof(MoverDataCollectionLibrary_K2_GetDataFromCollection, DidSucceed) == 0x000000, "Member 'MoverDataCollectionLibrary_K2_GetDataFromCollection::DidSucceed' has a wrong offset!");
static_assert(offsetof(MoverDataCollectionLibrary_K2_GetDataFromCollection, Collection) == 0x000008, "Member 'MoverDataCollectionLibrary_K2_GetDataFromCollection::Collection' has a wrong offset!");
static_assert(offsetof(MoverDataCollectionLibrary_K2_GetDataFromCollection, TargetAsRawBytes) == 0x000020, "Member 'MoverDataCollectionLibrary_K2_GetDataFromCollection::TargetAsRawBytes' has a wrong offset!");

// Function Mover.BaseMovementMode.K2_OnRegistered
// 0x0004 (0x0004 - 0x0000)
struct BaseMovementMode_K2_OnRegistered final
{
public:
	class FName                                   ModeName;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseMovementMode_K2_OnRegistered) == 0x000004, "Wrong alignment on BaseMovementMode_K2_OnRegistered");
static_assert(sizeof(BaseMovementMode_K2_OnRegistered) == 0x000004, "Wrong size on BaseMovementMode_K2_OnRegistered");
static_assert(offsetof(BaseMovementMode_K2_OnRegistered, ModeName) == 0x000000, "Member 'BaseMovementMode_K2_OnRegistered::ModeName' has a wrong offset!");

// Function Mover.BaseMovementMode.K2_OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct BaseMovementMode_K2_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      ReturnValue;                                       // 0x00E0(0x0070)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseMovementMode_K2_OnSimulationTick) == 0x000008, "Wrong alignment on BaseMovementMode_K2_OnSimulationTick");
static_assert(sizeof(BaseMovementMode_K2_OnSimulationTick) == 0x000150, "Wrong size on BaseMovementMode_K2_OnSimulationTick");
static_assert(offsetof(BaseMovementMode_K2_OnSimulationTick, Params_0) == 0x000000, "Member 'BaseMovementMode_K2_OnSimulationTick::Params_0' has a wrong offset!");
static_assert(offsetof(BaseMovementMode_K2_OnSimulationTick, ReturnValue) == 0x0000E0, "Member 'BaseMovementMode_K2_OnSimulationTick::ReturnValue' has a wrong offset!");

// Function Mover.BaseMovementMode.GetBlackboard
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_GetBlackboard final
{
public:
	const class UMoverBlackboard*                 ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseMovementMode_GetBlackboard) == 0x000008, "Wrong alignment on BaseMovementMode_GetBlackboard");
static_assert(sizeof(BaseMovementMode_GetBlackboard) == 0x000008, "Wrong size on BaseMovementMode_GetBlackboard");
static_assert(offsetof(BaseMovementMode_GetBlackboard, ReturnValue) == 0x000000, "Member 'BaseMovementMode_GetBlackboard::ReturnValue' has a wrong offset!");

// Function Mover.BaseMovementMode.GetBlackboard_Mutable
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_GetBlackboard_Mutable final
{
public:
	class UMoverBlackboard*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseMovementMode_GetBlackboard_Mutable) == 0x000008, "Wrong alignment on BaseMovementMode_GetBlackboard_Mutable");
static_assert(sizeof(BaseMovementMode_GetBlackboard_Mutable) == 0x000008, "Wrong size on BaseMovementMode_GetBlackboard_Mutable");
static_assert(offsetof(BaseMovementMode_GetBlackboard_Mutable, ReturnValue) == 0x000000, "Member 'BaseMovementMode_GetBlackboard_Mutable::ReturnValue' has a wrong offset!");

// Function Mover.BaseMovementMode.GetMoverComponent
// 0x0008 (0x0008 - 0x0000)
struct BaseMovementMode_GetMoverComponent final
{
public:
	class UMoverComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseMovementMode_GetMoverComponent) == 0x000008, "Wrong alignment on BaseMovementMode_GetMoverComponent");
static_assert(sizeof(BaseMovementMode_GetMoverComponent) == 0x000008, "Wrong size on BaseMovementMode_GetMoverComponent");
static_assert(offsetof(BaseMovementMode_GetMoverComponent, ReturnValue) == 0x000000, "Member 'BaseMovementMode_GetMoverComponent::ReturnValue' has a wrong offset!");

// Function Mover.BaseMovementMode.K2_OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct BaseMovementMode_K2_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          ReturnValue;                                       // 0x0048(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseMovementMode_K2_OnGenerateMove) == 0x000008, "Wrong alignment on BaseMovementMode_K2_OnGenerateMove");
static_assert(sizeof(BaseMovementMode_K2_OnGenerateMove) == 0x0000D0, "Wrong size on BaseMovementMode_K2_OnGenerateMove");
static_assert(offsetof(BaseMovementMode_K2_OnGenerateMove, StartState) == 0x000000, "Member 'BaseMovementMode_K2_OnGenerateMove::StartState' has a wrong offset!");
static_assert(offsetof(BaseMovementMode_K2_OnGenerateMove, TimeStep) == 0x000038, "Member 'BaseMovementMode_K2_OnGenerateMove::TimeStep' has a wrong offset!");
static_assert(offsetof(BaseMovementMode_K2_OnGenerateMove, ReturnValue) == 0x000048, "Member 'BaseMovementMode_K2_OnGenerateMove::ReturnValue' has a wrong offset!");

// Function Mover.FallingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct FallingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FallingMode_OnSimulationTick) == 0x000008, "Wrong alignment on FallingMode_OnSimulationTick");
static_assert(sizeof(FallingMode_OnSimulationTick) == 0x000150, "Wrong size on FallingMode_OnSimulationTick");
static_assert(offsetof(FallingMode_OnSimulationTick, Params_0) == 0x000000, "Member 'FallingMode_OnSimulationTick::Params_0' has a wrong offset!");
static_assert(offsetof(FallingMode_OnSimulationTick, OutputState) == 0x0000E0, "Member 'FallingMode_OnSimulationTick::OutputState' has a wrong offset!");

// Function Mover.FallingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct FallingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FallingMode_OnGenerateMove) == 0x000008, "Wrong alignment on FallingMode_OnGenerateMove");
static_assert(sizeof(FallingMode_OnGenerateMove) == 0x0000D0, "Wrong size on FallingMode_OnGenerateMove");
static_assert(offsetof(FallingMode_OnGenerateMove, StartState) == 0x000000, "Member 'FallingMode_OnGenerateMove::StartState' has a wrong offset!");
static_assert(offsetof(FallingMode_OnGenerateMove, TimeStep) == 0x000038, "Member 'FallingMode_OnGenerateMove::TimeStep' has a wrong offset!");
static_assert(offsetof(FallingMode_OnGenerateMove, OutProposedMove) == 0x000048, "Member 'FallingMode_OnGenerateMove::OutProposedMove' has a wrong offset!");

// Function Mover.FallingMode.ProcessLanded
// 0x01F0 (0x01F0 - 0x0000)
struct FallingMode_ProcessLanded final
{
public:
	struct FFloorCheckResult                      FloorResult;                                       // 0x0000(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x00F8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRelativeBaseInfo                      BaseInfo;                                          // 0x0110(0x0070)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      TickEndData;                                       // 0x0180(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FallingMode_ProcessLanded) == 0x000010, "Wrong alignment on FallingMode_ProcessLanded");
static_assert(sizeof(FallingMode_ProcessLanded) == 0x0001F0, "Wrong size on FallingMode_ProcessLanded");
static_assert(offsetof(FallingMode_ProcessLanded, FloorResult) == 0x000000, "Member 'FallingMode_ProcessLanded::FloorResult' has a wrong offset!");
static_assert(offsetof(FallingMode_ProcessLanded, Velocity) == 0x0000F8, "Member 'FallingMode_ProcessLanded::Velocity' has a wrong offset!");
static_assert(offsetof(FallingMode_ProcessLanded, BaseInfo) == 0x000110, "Member 'FallingMode_ProcessLanded::BaseInfo' has a wrong offset!");
static_assert(offsetof(FallingMode_ProcessLanded, TickEndData) == 0x000180, "Member 'FallingMode_ProcessLanded::TickEndData' has a wrong offset!");

// Function Mover.FlyingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct FlyingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlyingMode_OnSimulationTick) == 0x000008, "Wrong alignment on FlyingMode_OnSimulationTick");
static_assert(sizeof(FlyingMode_OnSimulationTick) == 0x000150, "Wrong size on FlyingMode_OnSimulationTick");
static_assert(offsetof(FlyingMode_OnSimulationTick, Params_0) == 0x000000, "Member 'FlyingMode_OnSimulationTick::Params_0' has a wrong offset!");
static_assert(offsetof(FlyingMode_OnSimulationTick, OutputState) == 0x0000E0, "Member 'FlyingMode_OnSimulationTick::OutputState' has a wrong offset!");

// Function Mover.FlyingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct FlyingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlyingMode_OnGenerateMove) == 0x000008, "Wrong alignment on FlyingMode_OnGenerateMove");
static_assert(sizeof(FlyingMode_OnGenerateMove) == 0x0000D0, "Wrong size on FlyingMode_OnGenerateMove");
static_assert(offsetof(FlyingMode_OnGenerateMove, StartState) == 0x000000, "Member 'FlyingMode_OnGenerateMove::StartState' has a wrong offset!");
static_assert(offsetof(FlyingMode_OnGenerateMove, TimeStep) == 0x000038, "Member 'FlyingMode_OnGenerateMove::TimeStep' has a wrong offset!");
static_assert(offsetof(FlyingMode_OnGenerateMove, OutProposedMove) == 0x000048, "Member 'FlyingMode_OnGenerateMove::OutProposedMove' has a wrong offset!");

// Function Mover.SwimmingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct SwimmingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SwimmingMode_OnSimulationTick) == 0x000008, "Wrong alignment on SwimmingMode_OnSimulationTick");
static_assert(sizeof(SwimmingMode_OnSimulationTick) == 0x000150, "Wrong size on SwimmingMode_OnSimulationTick");
static_assert(offsetof(SwimmingMode_OnSimulationTick, Params_0) == 0x000000, "Member 'SwimmingMode_OnSimulationTick::Params_0' has a wrong offset!");
static_assert(offsetof(SwimmingMode_OnSimulationTick, OutputState) == 0x0000E0, "Member 'SwimmingMode_OnSimulationTick::OutputState' has a wrong offset!");

// Function Mover.SwimmingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct SwimmingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SwimmingMode_OnGenerateMove) == 0x000008, "Wrong alignment on SwimmingMode_OnGenerateMove");
static_assert(sizeof(SwimmingMode_OnGenerateMove) == 0x0000D0, "Wrong size on SwimmingMode_OnGenerateMove");
static_assert(offsetof(SwimmingMode_OnGenerateMove, StartState) == 0x000000, "Member 'SwimmingMode_OnGenerateMove::StartState' has a wrong offset!");
static_assert(offsetof(SwimmingMode_OnGenerateMove, TimeStep) == 0x000038, "Member 'SwimmingMode_OnGenerateMove::TimeStep' has a wrong offset!");
static_assert(offsetof(SwimmingMode_OnGenerateMove, OutProposedMove) == 0x000048, "Member 'SwimmingMode_OnGenerateMove::OutProposedMove' has a wrong offset!");

// Function Mover.WalkingMode.OnSimulationTick
// 0x0150 (0x0150 - 0x0000)
struct WalkingMode_OnSimulationTick final
{
public:
	struct FSimulationTickParams                  Params_0;                                          // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMoverTickEndData                      OutputState;                                       // 0x00E0(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WalkingMode_OnSimulationTick) == 0x000008, "Wrong alignment on WalkingMode_OnSimulationTick");
static_assert(sizeof(WalkingMode_OnSimulationTick) == 0x000150, "Wrong size on WalkingMode_OnSimulationTick");
static_assert(offsetof(WalkingMode_OnSimulationTick, Params_0) == 0x000000, "Member 'WalkingMode_OnSimulationTick::Params_0' has a wrong offset!");
static_assert(offsetof(WalkingMode_OnSimulationTick, OutputState) == 0x0000E0, "Member 'WalkingMode_OnSimulationTick::OutputState' has a wrong offset!");

// Function Mover.WalkingMode.OnGenerateMove
// 0x00D0 (0x00D0 - 0x0000)
struct WalkingMode_OnGenerateMove final
{
public:
	struct FMoverTickStartData                    StartState;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMoverTimeStep                         TimeStep;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FProposedMove                          OutProposedMove;                                   // 0x0048(0x0088)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(WalkingMode_OnGenerateMove) == 0x000008, "Wrong alignment on WalkingMode_OnGenerateMove");
static_assert(sizeof(WalkingMode_OnGenerateMove) == 0x0000D0, "Wrong size on WalkingMode_OnGenerateMove");
static_assert(offsetof(WalkingMode_OnGenerateMove, StartState) == 0x000000, "Member 'WalkingMode_OnGenerateMove::StartState' has a wrong offset!");
static_assert(offsetof(WalkingMode_OnGenerateMove, TimeStep) == 0x000038, "Member 'WalkingMode_OnGenerateMove::TimeStep' has a wrong offset!");
static_assert(offsetof(WalkingMode_OnGenerateMove, OutProposedMove) == 0x000048, "Member 'WalkingMode_OnGenerateMove::OutProposedMove' has a wrong offset!");

// Function Mover.MovementBaseUtils.GetMovementBaseTransform
// 0x0060 (0x0060 - 0x0000)
struct MovementBaseUtils_GetMovementBaseTransform final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  OutQuat;                                           // 0x0030(0x0020)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovementBaseUtils_GetMovementBaseTransform) == 0x000010, "Wrong alignment on MovementBaseUtils_GetMovementBaseTransform");
static_assert(sizeof(MovementBaseUtils_GetMovementBaseTransform) == 0x000060, "Wrong size on MovementBaseUtils_GetMovementBaseTransform");
static_assert(offsetof(MovementBaseUtils_GetMovementBaseTransform, MovementBase) == 0x000000, "Member 'MovementBaseUtils_GetMovementBaseTransform::MovementBase' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_GetMovementBaseTransform, BoneName) == 0x000008, "Member 'MovementBaseUtils_GetMovementBaseTransform::BoneName' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_GetMovementBaseTransform, OutLocation) == 0x000010, "Member 'MovementBaseUtils_GetMovementBaseTransform::OutLocation' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_GetMovementBaseTransform, OutQuat) == 0x000030, "Member 'MovementBaseUtils_GetMovementBaseTransform::OutQuat' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_GetMovementBaseTransform, ReturnValue) == 0x000050, "Member 'MovementBaseUtils_GetMovementBaseTransform::ReturnValue' has a wrong offset!");

// Function Mover.MovementBaseUtils.IsADynamicBase
// 0x0010 (0x0010 - 0x0000)
struct MovementBaseUtils_IsADynamicBase final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovementBaseUtils_IsADynamicBase) == 0x000008, "Wrong alignment on MovementBaseUtils_IsADynamicBase");
static_assert(sizeof(MovementBaseUtils_IsADynamicBase) == 0x000010, "Wrong size on MovementBaseUtils_IsADynamicBase");
static_assert(offsetof(MovementBaseUtils_IsADynamicBase, MovementBase) == 0x000000, "Member 'MovementBaseUtils_IsADynamicBase::MovementBase' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_IsADynamicBase, ReturnValue) == 0x000008, "Member 'MovementBaseUtils_IsADynamicBase::ReturnValue' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformBasedDirectionToWorld
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformBasedDirectionToWorld final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalDirection;                                    // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutDirectionWorldSpace;                            // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovementBaseUtils_TransformBasedDirectionToWorld) == 0x000008, "Wrong alignment on MovementBaseUtils_TransformBasedDirectionToWorld");
static_assert(sizeof(MovementBaseUtils_TransformBasedDirectionToWorld) == 0x000048, "Wrong size on MovementBaseUtils_TransformBasedDirectionToWorld");
static_assert(offsetof(MovementBaseUtils_TransformBasedDirectionToWorld, MovementBase) == 0x000000, "Member 'MovementBaseUtils_TransformBasedDirectionToWorld::MovementBase' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedDirectionToWorld, BoneName) == 0x000008, "Member 'MovementBaseUtils_TransformBasedDirectionToWorld::BoneName' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedDirectionToWorld, LocalDirection) == 0x000010, "Member 'MovementBaseUtils_TransformBasedDirectionToWorld::LocalDirection' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedDirectionToWorld, OutDirectionWorldSpace) == 0x000028, "Member 'MovementBaseUtils_TransformBasedDirectionToWorld::OutDirectionWorldSpace' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedDirectionToWorld, ReturnValue) == 0x000040, "Member 'MovementBaseUtils_TransformBasedDirectionToWorld::ReturnValue' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformBasedLocationToWorld
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformBasedLocationToWorld final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalLocation;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocationWorldSpace;                             // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovementBaseUtils_TransformBasedLocationToWorld) == 0x000008, "Wrong alignment on MovementBaseUtils_TransformBasedLocationToWorld");
static_assert(sizeof(MovementBaseUtils_TransformBasedLocationToWorld) == 0x000048, "Wrong size on MovementBaseUtils_TransformBasedLocationToWorld");
static_assert(offsetof(MovementBaseUtils_TransformBasedLocationToWorld, MovementBase) == 0x000000, "Member 'MovementBaseUtils_TransformBasedLocationToWorld::MovementBase' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedLocationToWorld, BoneName) == 0x000008, "Member 'MovementBaseUtils_TransformBasedLocationToWorld::BoneName' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedLocationToWorld, LocalLocation) == 0x000010, "Member 'MovementBaseUtils_TransformBasedLocationToWorld::LocalLocation' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedLocationToWorld, OutLocationWorldSpace) == 0x000028, "Member 'MovementBaseUtils_TransformBasedLocationToWorld::OutLocationWorldSpace' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedLocationToWorld, ReturnValue) == 0x000040, "Member 'MovementBaseUtils_TransformBasedLocationToWorld::ReturnValue' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformBasedRotatorToWorld
// 0x0048 (0x0048 - 0x0000)
struct MovementBaseUtils_TransformBasedRotatorToWorld final
{
public:
	const class UPrimitiveComponent*              MovementBase;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               LocalRotator;                                      // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutWorldSpaceRotator;                              // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovementBaseUtils_TransformBasedRotatorToWorld) == 0x000008, "Wrong alignment on MovementBaseUtils_TransformBasedRotatorToWorld");
static_assert(sizeof(MovementBaseUtils_TransformBasedRotatorToWorld) == 0x000048, "Wrong size on MovementBaseUtils_TransformBasedRotatorToWorld");
static_assert(offsetof(MovementBaseUtils_TransformBasedRotatorToWorld, MovementBase) == 0x000000, "Member 'MovementBaseUtils_TransformBasedRotatorToWorld::MovementBase' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedRotatorToWorld, BoneName) == 0x000008, "Member 'MovementBaseUtils_TransformBasedRotatorToWorld::BoneName' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedRotatorToWorld, LocalRotator) == 0x000010, "Member 'MovementBaseUtils_TransformBasedRotatorToWorld::LocalRotator' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedRotatorToWorld, OutWorldSpaceRotator) == 0x000028, "Member 'MovementBaseUtils_TransformBasedRotatorToWorld::OutWorldSpaceRotator' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformBasedRotatorToWorld, ReturnValue) == 0x000040, "Member 'MovementBaseUtils_TransformBasedRotatorToWorld::ReturnValue' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformDirectionToLocal
// 0x0050 (0x0050 - 0x0000)
struct MovementBaseUtils_TransformDirectionToLocal final
{
public:
	struct FQuat                                  BaseQuat;                                          // 0x0000(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldSpaceDirection;                               // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocalDirection;                                 // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovementBaseUtils_TransformDirectionToLocal) == 0x000010, "Wrong alignment on MovementBaseUtils_TransformDirectionToLocal");
static_assert(sizeof(MovementBaseUtils_TransformDirectionToLocal) == 0x000050, "Wrong size on MovementBaseUtils_TransformDirectionToLocal");
static_assert(offsetof(MovementBaseUtils_TransformDirectionToLocal, BaseQuat) == 0x000000, "Member 'MovementBaseUtils_TransformDirectionToLocal::BaseQuat' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformDirectionToLocal, WorldSpaceDirection) == 0x000020, "Member 'MovementBaseUtils_TransformDirectionToLocal::WorldSpaceDirection' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformDirectionToLocal, OutLocalDirection) == 0x000038, "Member 'MovementBaseUtils_TransformDirectionToLocal::OutLocalDirection' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformDirectionToWorld
// 0x0050 (0x0050 - 0x0000)
struct MovementBaseUtils_TransformDirectionToWorld final
{
public:
	struct FQuat                                  BaseQuat;                                          // 0x0000(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalDirection;                                    // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutDirectionWorldSpace;                            // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovementBaseUtils_TransformDirectionToWorld) == 0x000010, "Wrong alignment on MovementBaseUtils_TransformDirectionToWorld");
static_assert(sizeof(MovementBaseUtils_TransformDirectionToWorld) == 0x000050, "Wrong size on MovementBaseUtils_TransformDirectionToWorld");
static_assert(offsetof(MovementBaseUtils_TransformDirectionToWorld, BaseQuat) == 0x000000, "Member 'MovementBaseUtils_TransformDirectionToWorld::BaseQuat' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformDirectionToWorld, LocalDirection) == 0x000020, "Member 'MovementBaseUtils_TransformDirectionToWorld::LocalDirection' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformDirectionToWorld, OutDirectionWorldSpace) == 0x000038, "Member 'MovementBaseUtils_TransformDirectionToWorld::OutDirectionWorldSpace' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformLocationToLocal
// 0x0070 (0x0070 - 0x0000)
struct MovementBaseUtils_TransformLocationToLocal final
{
public:
	struct FVector                                BasePos;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  BaseQuat;                                          // 0x0020(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldSpaceLocation;                                // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocalLocation;                                  // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovementBaseUtils_TransformLocationToLocal) == 0x000010, "Wrong alignment on MovementBaseUtils_TransformLocationToLocal");
static_assert(sizeof(MovementBaseUtils_TransformLocationToLocal) == 0x000070, "Wrong size on MovementBaseUtils_TransformLocationToLocal");
static_assert(offsetof(MovementBaseUtils_TransformLocationToLocal, BasePos) == 0x000000, "Member 'MovementBaseUtils_TransformLocationToLocal::BasePos' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformLocationToLocal, BaseQuat) == 0x000020, "Member 'MovementBaseUtils_TransformLocationToLocal::BaseQuat' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformLocationToLocal, WorldSpaceLocation) == 0x000040, "Member 'MovementBaseUtils_TransformLocationToLocal::WorldSpaceLocation' has a wrong offset!");
static_assert(offsetof(MovementBaseUtils_TransformLocationToLocal, OutLocalLocation) == 0x000058, "Member 'MovementBaseUtils_TransformLocationToLocal::OutLocalLocation' has a wrong offset!");

// Function Mover.MovementBaseUtils.TransformLocationToWorld
// 0x0070 (0x0070 - 0x0000)
struct MovementBaseUtils_TransformLocationToWorld final
{
public:
	struct FVector                                BasePos;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
