#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultipleSubscriptionAlertModal

#include "Basic.hpp"

#include "CrewUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MultipleSubscriptionAlertModal.MultipleSubscriptionAlertModal_C
// 0x0048 (0x0528 - 0x04E0)
class UMultipleSubscriptionAlertModal_C final : public UCrewMultiSubscriptionAlertModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Containment;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ContentSZ;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundBottomBar;                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightbox_HitTestBlocker;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PrimaryScrollBox;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TouchClose;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Check;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MoreInfo;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MultipleSubscriptionAlertModal(int32 EntryPoint);
	void OnSetHowToCancelURL(const class FString& MoreInfoUrl);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MultipleSubscriptionAlertModal_C">();
	}
	static class UMultipleSubscriptionAlertModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultipleSubscriptionAlertModal_C>();
	}
};
static_assert(alignof(UMultipleSubscriptionAlertModal_C) == 0x000008, "Wrong alignment on UMultipleSubscriptionAlertModal_C");
static_assert(sizeof(UMultipleSubscriptionAlertModal_C) == 0x000528, "Wrong size on UMultipleSubscriptionAlertModal_C");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, UberGraphFrame) == 0x0004E0, "Member 'UMultipleSubscriptionAlertModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, Containment) == 0x0004E8, "Member 'UMultipleSubscriptionAlertModal_C::Containment' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, ContentSZ) == 0x0004F0, "Member 'UMultipleSubscriptionAlertModal_C::ContentSZ' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, Image_BackgroundBottomBar) == 0x0004F8, "Member 'UMultipleSubscriptionAlertModal_C::Image_BackgroundBottomBar' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, Lightbox_HitTestBlocker) == 0x000500, "Member 'UMultipleSubscriptionAlertModal_C::Lightbox_HitTestBlocker' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, PrimaryScrollBox) == 0x000508, "Member 'UMultipleSubscriptionAlertModal_C::PrimaryScrollBox' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, SafeZone_TouchClose) == 0x000510, "Member 'UMultipleSubscriptionAlertModal_C::SafeZone_TouchClose' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, Text_Check) == 0x000518, "Member 'UMultipleSubscriptionAlertModal_C::Text_Check' has a wrong offset!");
static_assert(offsetof(UMultipleSubscriptionAlertModal_C, Text_MoreInfo) == 0x000520, "Member 'UMultipleSubscriptionAlertModal_C::Text_MoreInfo' has a wrong offset!");

}

