#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiActionConfirmationMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function MultiActionConfirmationMenu.MultiActionConfirmationMenu_C.ExecuteUbergraph_MultiActionConfirmationMenu
// 0x0010 (0x0010 - 0x0000)
struct MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu) == 0x000008, "Wrong alignment on MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu");
static_assert(sizeof(MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu) == 0x000010, "Wrong size on MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu");
static_assert(offsetof(MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu, EntryPoint) == 0x000000, "Member 'MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'MultiActionConfirmationMenu_C_ExecuteUbergraph_MultiActionConfirmationMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MultiActionConfirmationMenu.MultiActionConfirmationMenu_C.UpdateText
// 0x0020 (0x0020 - 0x0000)
struct MultiActionConfirmationMenu_C_UpdateText final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiActionConfirmationMenu_C_UpdateText) == 0x000008, "Wrong alignment on MultiActionConfirmationMenu_C_UpdateText");
static_assert(sizeof(MultiActionConfirmationMenu_C_UpdateText) == 0x000020, "Wrong size on MultiActionConfirmationMenu_C_UpdateText");
static_assert(offsetof(MultiActionConfirmationMenu_C_UpdateText, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'MultiActionConfirmationMenu_C_UpdateText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiActionConfirmationMenu_C_UpdateText, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'MultiActionConfirmationMenu_C_UpdateText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

