#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusterConsumablesUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function MusterConsumablesUI.EnergyDrinkStaminaBarOverlayWidget.OnPlayerDeadStateChanged
// 0x0010 (0x0010 - 0x0000)
struct EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDead;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged) == 0x000008, "Wrong alignment on EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged");
static_assert(sizeof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged) == 0x000010, "Wrong size on EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged");
static_assert(offsetof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged, PlayerState) == 0x000000, "Member 'EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged, bIsDead) == 0x000008, "Member 'EnergyDrinkStaminaBarOverlayWidget_OnPlayerDeadStateChanged::bIsDead' has a wrong offset!");

// Function MusterConsumablesUI.EnergyDrinkStaminaBarOverlayWidget.OnPlayerStateSet
// 0x0008 (0x0008 - 0x0000)
struct EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet) == 0x000008, "Wrong alignment on EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet");
static_assert(sizeof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet) == 0x000008, "Wrong size on EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet");
static_assert(offsetof(EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet, InPlayerState) == 0x000000, "Member 'EnergyDrinkStaminaBarOverlayWidget_OnPlayerStateSet::InPlayerState' has a wrong offset!");

}

