#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "NevadaRuntime_structs.hpp"


namespace SDK
{

// Class NevadaUI.FortNevadaVehicleReticle
// 0x00A8 (0x05D8 - 0x0530)
class UFortNevadaVehicleReticle final : public UFortAthenaVehicleDashboardWidget
{
public:
	TSubclassOf<class UNevadaTargetIndicator>     NevadaTargetIndicatorClass;                        // 0x0530(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNevadaTargetIndicator*                 TargetIndicator;                                   // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaVehicle*                     OwningNevadaVehicle;                               // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x0550(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnBatteryChanged(float BatteryLevel);
	void OnEnergyCannonEnabledChanged(const bool bEnabled);
	void OnEnergyCanonFired(const float Cooldown);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(const float Cooldown);
	void OnTractorBeamDetached();
	void OnTractorBeamEnabledChanged(const bool bEnabled);
	void OnVehicleStateChanged(const ENevadaFlightStates VehicleState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicleReticle">();
	}
	static class UFortNevadaVehicleReticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNevadaVehicleReticle>();
	}
};
static_assert(alignof(UFortNevadaVehicleReticle) == 0x000008, "Wrong alignment on UFortNevadaVehicleReticle");
static_assert(sizeof(UFortNevadaVehicleReticle) == 0x0005D8, "Wrong size on UFortNevadaVehicleReticle");
static_assert(offsetof(UFortNevadaVehicleReticle, NevadaTargetIndicatorClass) == 0x000530, "Member 'UFortNevadaVehicleReticle::NevadaTargetIndicatorClass' has a wrong offset!");
static_assert(offsetof(UFortNevadaVehicleReticle, TargetIndicator) == 0x000538, "Member 'UFortNevadaVehicleReticle::TargetIndicator' has a wrong offset!");
static_assert(offsetof(UFortNevadaVehicleReticle, OwningNevadaVehicle) == 0x000540, "Member 'UFortNevadaVehicleReticle::OwningNevadaVehicle' has a wrong offset!");
static_assert(offsetof(UFortNevadaVehicleReticle, IndicatorPool) == 0x000550, "Member 'UFortNevadaVehicleReticle::IndicatorPool' has a wrong offset!");

// Class NevadaUI.NevadaTargetIndicator
// 0x0000 (0x03D0 - 0x03D0)
class UNevadaTargetIndicator final : public UFortActorIndicatorWidget
{
public:
	void OnTractorBeamActivated(const bool bActivated);
	void OnTractorBeamAttached(const bool bAttached);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NevadaTargetIndicator">();
	}
	static class UNevadaTargetIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNevadaTargetIndicator>();
	}
};
static_assert(alignof(UNevadaTargetIndicator) == 0x000008, "Wrong alignment on UNevadaTargetIndicator");
static_assert(sizeof(UNevadaTargetIndicator) == 0x0003D0, "Wrong size on UNevadaTargetIndicator");

}

