#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroFlow_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NitroFlow_Axe_AnimBP.NitroFlow_Axe_AnimBP_C
// 0x0130 (0x0850 - 0x0720)
class UNitroFlow_Axe_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0758(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0808(0x0048)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_NitroFlow_Axe_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NitroFlow_Axe_AnimBP_C">();
	}
	static class UNitroFlow_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroFlow_Axe_AnimBP_C>();
	}
};
static_assert(alignof(UNitroFlow_Axe_AnimBP_C) == 0x000010, "Wrong alignment on UNitroFlow_Axe_AnimBP_C");
static_assert(sizeof(UNitroFlow_Axe_AnimBP_C) == 0x000850, "Wrong size on UNitroFlow_Axe_AnimBP_C");
static_assert(offsetof(UNitroFlow_Axe_AnimBP_C, UberGraphFrame) == 0x000720, "Member 'UNitroFlow_Axe_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNitroFlow_Axe_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000728, "Member 'UNitroFlow_Axe_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNitroFlow_Axe_AnimBP_C, AnimBlueprintExtension_Base) == 0x000730, "Member 'UNitroFlow_Axe_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNitroFlow_Axe_AnimBP_C, AnimGraphNode_Root) == 0x000738, "Member 'UNitroFlow_Axe_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNitroFlow_Axe_AnimBP_C, AnimGraphNode_SubInput) == 0x000758, "Member 'UNitroFlow_Axe_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UNitroFlow_Axe_AnimBP_C, AnimGraphNode_Slot) == 0x000808, "Member 'UNitroFlow_Axe_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

