#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCStatusWidgetBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NPCStatusWidgetBar.NPCStatusWidgetBar_C
// 0x00F8 (0x03B8 - 0x02C0)
class UNPCStatusWidgetBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               BarSizeBox;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BarBG;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CastShadow;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarDelta;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarFill;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FillColor1;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor2;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Delta1;                                            // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Delta2;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor1_75Percent;                              // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor2_75Percent;                              // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor1_50Percent;                              // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor2_50Percent;                              // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor1_25Percent;                              // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor2_25Percent;                              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor1_100Percent;                             // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FillColor2_100Percent;                             // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DifferentProgressColors;                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPCStatusWidgetBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetHealthBarColorDependingHealth(double CurrentPercentage);
	void SetNumPips(int32 NumPips);
	void SetPercent(double Value);
	void SetPercentInstant(double Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCStatusWidgetBar_C">();
	}
	static class UNPCStatusWidgetBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCStatusWidgetBar_C>();
	}
};
static_assert(alignof(UNPCStatusWidgetBar_C) == 0x000008, "Wrong alignment on UNPCStatusWidgetBar_C");
static_assert(sizeof(UNPCStatusWidgetBar_C) == 0x0003B8, "Wrong size on UNPCStatusWidgetBar_C");
static_assert(offsetof(UNPCStatusWidgetBar_C, UberGraphFrame) == 0x0002C0, "Member 'UNPCStatusWidgetBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, BarSizeBox) == 0x0002C8, "Member 'UNPCStatusWidgetBar_C::BarSizeBox' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Image_BarBG) == 0x0002D0, "Member 'UNPCStatusWidgetBar_C::Image_BarBG' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Image_CastShadow) == 0x0002D8, "Member 'UNPCStatusWidgetBar_C::Image_CastShadow' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, ProgressBarDelta) == 0x0002E0, "Member 'UNPCStatusWidgetBar_C::ProgressBarDelta' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, ProgressBarFill) == 0x0002E8, "Member 'UNPCStatusWidgetBar_C::ProgressBarFill' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor1) == 0x0002F0, "Member 'UNPCStatusWidgetBar_C::FillColor1' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor2) == 0x000300, "Member 'UNPCStatusWidgetBar_C::FillColor2' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Delta1) == 0x000310, "Member 'UNPCStatusWidgetBar_C::Delta1' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, Delta2) == 0x000320, "Member 'UNPCStatusWidgetBar_C::Delta2' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor1_75Percent) == 0x000330, "Member 'UNPCStatusWidgetBar_C::FillColor1_75Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor2_75Percent) == 0x000340, "Member 'UNPCStatusWidgetBar_C::FillColor2_75Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor1_50Percent) == 0x000350, "Member 'UNPCStatusWidgetBar_C::FillColor1_50Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor2_50Percent) == 0x000360, "Member 'UNPCStatusWidgetBar_C::FillColor2_50Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor1_25Percent) == 0x000370, "Member 'UNPCStatusWidgetBar_C::FillColor1_25Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor2_25Percent) == 0x000380, "Member 'UNPCStatusWidgetBar_C::FillColor2_25Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor1_100Percent) == 0x000390, "Member 'UNPCStatusWidgetBar_C::FillColor1_100Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, FillColor2_100Percent) == 0x0003A0, "Member 'UNPCStatusWidgetBar_C::FillColor2_100Percent' has a wrong offset!");
static_assert(offsetof(UNPCStatusWidgetBar_C, DifferentProgressColors) == 0x0003B0, "Member 'UNPCStatusWidgetBar_C::DifferentProgressColors' has a wrong offset!");

}

