#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemMcp

#include "Basic.hpp"

#include "OnlineSubsystemMcp_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemMcp.IARCLocaleMappingUtil
// 0x0020 (0x0048 - 0x0028)
class UIARCLocaleMappingUtil final : public UObject
{
public:
	TArray<struct FOnlineIARCLocaleMapping>       LocaleMappings;                                    // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FString                                 DefaultLocale;                                     // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IARCLocaleMappingUtil">();
	}
	static class UIARCLocaleMappingUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIARCLocaleMappingUtil>();
	}
};
static_assert(alignof(UIARCLocaleMappingUtil) == 0x000008, "Wrong alignment on UIARCLocaleMappingUtil");
static_assert(sizeof(UIARCLocaleMappingUtil) == 0x000048, "Wrong size on UIARCLocaleMappingUtil");
static_assert(offsetof(UIARCLocaleMappingUtil, LocaleMappings) == 0x000028, "Member 'UIARCLocaleMappingUtil::LocaleMappings' has a wrong offset!");
static_assert(offsetof(UIARCLocaleMappingUtil, DefaultLocale) == 0x000038, "Member 'UIARCLocaleMappingUtil::DefaultLocale' has a wrong offset!");

// Class OnlineSubsystemMcp.OnlineISOConversionUtil
// 0x0020 (0x0048 - 0x0028)
class UOnlineISOConversionUtil final : public UObject
{
public:
	TArray<struct FOnlineISOLanguageInfo>         Languages;                                         // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FOnlineISORegionInfo>           Regions;                                           // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineISOConversionUtil">();
	}
	static class UOnlineISOConversionUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineISOConversionUtil>();
	}
};
static_assert(alignof(UOnlineISOConversionUtil) == 0x000008, "Wrong alignment on UOnlineISOConversionUtil");
static_assert(sizeof(UOnlineISOConversionUtil) == 0x000048, "Wrong size on UOnlineISOConversionUtil");
static_assert(offsetof(UOnlineISOConversionUtil, Languages) == 0x000028, "Member 'UOnlineISOConversionUtil::Languages' has a wrong offset!");
static_assert(offsetof(UOnlineISOConversionUtil, Regions) == 0x000038, "Member 'UOnlineISOConversionUtil::Regions' has a wrong offset!");

}

