#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenu

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenu.OptionsMenu_C.BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature) == 0x000010, "Wrong size on OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature, TabID) == 0x000000, "Member 'OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature::TabID' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature, TabButton) == 0x000008, "Member 'OptionsMenu_C_BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature::TabButton' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.DialogResult_826C59EC4C294BC872A644878B35A13B
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B) == 0x000004, "Wrong alignment on OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B");
static_assert(sizeof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B) == 0x000008, "Wrong size on OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B");
static_assert(offsetof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B, Result) == 0x000000, "Member 'OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B::Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B, ResultName) == 0x000004, "Member 'OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B::ResultName' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.DialogResult_B31FF5BD4C0772716F27509EA83B418E
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E) == 0x000004, "Wrong alignment on OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E");
static_assert(sizeof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E) == 0x000008, "Wrong size on OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E");
static_assert(offsetof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E, Result) == 0x000000, "Member 'OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E::Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E, ResultName) == 0x000004, "Member 'OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E::ResultName' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.ExecuteUbergraph_OptionsMenu
// 0x0310 (0x0310 - 0x0000)
struct OptionsMenu_C_ExecuteUbergraph_OptionsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTabVideoOptions_New_C*                 K2Node_DynamicCast_AsTab_Video_Options_New;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00BC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00CC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class FText>& ScreenLabels)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_CustomEvent_ScreenLabels;                   // 0x0100(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0118(0x0018)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0050)(HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3;      // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A8(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01D8(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0240(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1; // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue_1;           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3_1;    // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x029C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable_1;                              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_TabButton;              // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTabButton_Legacy_C*                K2Node_DynamicCast_AsIcon_Tab_Button_Legacy;       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x02D8(0x0020)()
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result_1;                       // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName_1;                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bOverride)>               K2Node_CreateDelegate_OutputDelegate_6;            // 0x0300(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOverride;                      // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000008, "Wrong alignment on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(sizeof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000310, "Wrong size on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, EntryPoint) == 0x000000, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue_2) == 0x000018, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetSubGame_ReturnValue) == 0x000020, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_name_Variable) == 0x000024, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_name_Variable_1) == 0x00002C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Array_Index_Variable) == 0x000030, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000048, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0000A0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x0000A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Video_Options_New) == 0x0000B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Video_Options_New' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsVisible_ReturnValue) == 0x0000B9, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000BC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_byte_Variable) == 0x0000C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Loop_Counter_Variable) == 0x0000DC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_name_Variable_2) == 0x0000E0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E4, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F4, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_ScreenLabels) == 0x000100, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_ScreenLabels' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Variable) == 0x000110, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Get_Item) == 0x000118, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetChildAt_ReturnValue) == 0x000130, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3) == 0x000188, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeArray_Array) == 0x000198, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Format_ReturnValue) == 0x0001A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001C0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue) == 0x0001C4, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000228, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeArray_Array_1) == 0x000230, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Format_ReturnValue_1) == 0x000240, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue_1) == 0x000258, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000260, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000268, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue) == 0x000269, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1) == 0x000270, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue_1) == 0x000278, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x00027C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Result) == 0x000280, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_ResultName) == 0x000284, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetWidgetAtIndex_ReturnValue_1) == 0x000288, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetWidgetAtIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3_1) == 0x000290, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_2) == 0x000298, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x00029C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_byte_Variable_1) == 0x0002A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_name_Variable_3) == 0x0002AC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_TabId) == 0x0002B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_TabButton) == 0x0002B8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x0002C0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsIcon_Tab_Button_Legacy) == 0x0002C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsIcon_Tab_Button_Legacy' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_3) == 0x0002D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D1, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0002D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsMobileGame_ReturnValue) == 0x0002F8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Result_1) == 0x0002F9, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_ResultName_1) == 0x0002FC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_ResultName_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x000300, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_bOverride) == 0x00030C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_bOverride' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue_2) == 0x00030D, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Handle Tab Gamepad Config Action Handler States_SAVE
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE) == 0x000008, "Wrong alignment on OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE");
static_assert(sizeof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE) == 0x000028, "Wrong size on OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, Temp_byte_Variable_1) == 0x000002, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, K2Node_Select_Default) == 0x000008, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3) == 0x000018, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleTabGamePadActionsNeedBinds
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_HandleTabGamePadActionsNeedBinds final
{
public:
	TArray<class FText>                           ScreenLabels;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenu_C_HandleTabGamePadActionsNeedBinds) == 0x000008, "Wrong alignment on OptionsMenu_C_HandleTabGamePadActionsNeedBinds");
static_assert(sizeof(OptionsMenu_C_HandleTabGamePadActionsNeedBinds) == 0x000010, "Wrong size on OptionsMenu_C_HandleTabGamePadActionsNeedBinds");
static_assert(offsetof(OptionsMenu_C_HandleTabGamePadActionsNeedBinds, ScreenLabels) == 0x000000, "Member 'OptionsMenu_C_HandleTabGamePadActionsNeedBinds::ScreenLabels' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.On Override Reset Modal
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_On_Override_Reset_Modal final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_On_Override_Reset_Modal) == 0x000001, "Wrong alignment on OptionsMenu_C_On_Override_Reset_Modal");
static_assert(sizeof(OptionsMenu_C_On_Override_Reset_Modal) == 0x000001, "Wrong size on OptionsMenu_C_On_Override_Reset_Modal");
static_assert(offsetof(OptionsMenu_C_On_Override_Reset_Modal, bOverride) == 0x000000, "Member 'OptionsMenu_C_On_Override_Reset_Modal::bOverride' has a wrong offset!");

}

