#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParentalControlsCabinEmailManagementWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ParentalControlsCabinEmailManagementWidget.ParentalControlsCabinEmailManagementWidget_C
// 0x0048 (0x03A0 - 0x0358)
class UParentalControlsCabinEmailManagementWidget_C final : public UFortCabinEmailManagementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               CabinEmailManagement;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DisplayNameEntrySpinner;                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DisplayNameEntrySpinner_1;                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_EmailEntry_NotBind;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SendingEmail;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SentEmail;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ParentEmailWrapper;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EmailResult;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ParentalControlsCabinEmailManagementWidget(int32 EntryPoint);
	void OnChangeEmailEditMode(bool bIsInEditMode);
	void OnScreenStateChange(ECabinEmailViewState NewState);
	void OnShowFailureReason(const class FText& ErrorText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ParentalControlsCabinEmailManagementWidget_C">();
	}
	static class UParentalControlsCabinEmailManagementWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParentalControlsCabinEmailManagementWidget_C>();
	}
};
static_assert(alignof(UParentalControlsCabinEmailManagementWidget_C) == 0x000008, "Wrong alignment on UParentalControlsCabinEmailManagementWidget_C");
static_assert(sizeof(UParentalControlsCabinEmailManagementWidget_C) == 0x0003A0, "Wrong size on UParentalControlsCabinEmailManagementWidget_C");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, UberGraphFrame) == 0x000358, "Member 'UParentalControlsCabinEmailManagementWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, CabinEmailManagement) == 0x000360, "Member 'UParentalControlsCabinEmailManagementWidget_C::CabinEmailManagement' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, Image_DisplayNameEntrySpinner) == 0x000368, "Member 'UParentalControlsCabinEmailManagementWidget_C::Image_DisplayNameEntrySpinner' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, Image_DisplayNameEntrySpinner_1) == 0x000370, "Member 'UParentalControlsCabinEmailManagementWidget_C::Image_DisplayNameEntrySpinner_1' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, Overlay_EmailEntry_NotBind) == 0x000378, "Member 'UParentalControlsCabinEmailManagementWidget_C::Overlay_EmailEntry_NotBind' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, Overlay_SendingEmail) == 0x000380, "Member 'UParentalControlsCabinEmailManagementWidget_C::Overlay_SendingEmail' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, Overlay_SentEmail) == 0x000388, "Member 'UParentalControlsCabinEmailManagementWidget_C::Overlay_SentEmail' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, ParentEmailWrapper) == 0x000390, "Member 'UParentalControlsCabinEmailManagementWidget_C::ParentEmailWrapper' has a wrong offset!");
static_assert(offsetof(UParentalControlsCabinEmailManagementWidget_C, Text_EmailResult) == 0x000398, "Member 'UParentalControlsCabinEmailManagementWidget_C::Text_EmailResult' has a wrong offset!");

}

