#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyDisplayManagerBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetupStaticMeshVisuals
// 0x0160 (0x0160 - 0x0000)
struct PartyDisplayManagerBP_C_SetupStaticMeshVisuals final
{
public:
	class UStaticMesh*                            NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_SetupStaticMeshVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals) == 0x000160, "Wrong size on PartyDisplayManagerBP_C_SetupStaticMeshVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, NewMesh) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::NewMesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_GetItemDefinitionToShow_ItemDefinition) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_GetItemDefinitionToShow_ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000070, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_SetStaticMesh_ReturnValue) == 0x000158, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.UpdatePreviewMeshTransforms
// 0x0160 (0x0160 - 0x0000)
struct PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms final
{
public:
	struct FTransform                             CallFunc_GetPreviewMeshWorldTransform_ReturnValue; // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms");
static_assert(sizeof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms) == 0x000160, "Wrong size on PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_GetPreviewMeshWorldTransform_ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_GetPreviewMeshWorldTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000060, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000150, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetupSkeletalMeshVisuals
// 0x0160 (0x0160 - 0x0000)
struct PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals final
{
public:
	class USkeletalMesh*                          NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals) == 0x000160, "Wrong size on PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, NewMesh) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::NewMesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, CallFunc_GetItemDefinitionToShow_ItemDefinition) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::CallFunc_GetItemDefinitionToShow_ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000070, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ShowItem
// 0x0018 (0x0018 - 0x0000)
struct PartyDisplayManagerBP_C_ShowItem final
{
public:
	const class UFortItem*                        ItemToView;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  RequestID;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ShowItem) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_ShowItem");
static_assert(sizeof(PartyDisplayManagerBP_C_ShowItem) == 0x000018, "Wrong size on PartyDisplayManagerBP_C_ShowItem");
static_assert(offsetof(PartyDisplayManagerBP_C_ShowItem, ItemToView) == 0x000000, "Member 'PartyDisplayManagerBP_C_ShowItem::ItemToView' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ShowItem, RequestID) == 0x000008, "Member 'PartyDisplayManagerBP_C_ShowItem::RequestID' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetUIOverrideVisuals
// 0x00D0 (0x00D0 - 0x0000)
struct PartyDisplayManagerBP_C_SetUIOverrideVisuals final
{
public:
	class UTexture2D*                             Large_Texture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Rarity;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0018(0x0080)()
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue_1;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue_2;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue_3;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_3;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetUIOverrideVisuals) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_SetUIOverrideVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetUIOverrideVisuals) == 0x0000D0, "Wrong size on PartyDisplayManagerBP_C_SetUIOverrideVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Large_Texture) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Large_Texture' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Item) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Item' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Rarity) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Rarity' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_BPGetRarityData_ReturnValue) == 0x000018, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_GetPersistentName_ReturnValue) == 0x000098, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue) == 0x0000A8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000B8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue_1) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue_2) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x0000C4, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue_2) == 0x0000C5, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue_3) == 0x0000C8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue_3) == 0x0000CC, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue_3' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.Set Character Parts Visibility
// 0x0001 (0x0001 - 0x0000)
struct PartyDisplayManagerBP_C_Set_Character_Parts_Visibility final
{
public:
	bool                                          NewVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_Set_Character_Parts_Visibility) == 0x000001, "Wrong alignment on PartyDisplayManagerBP_C_Set_Character_Parts_Visibility");
static_assert(sizeof(PartyDisplayManagerBP_C_Set_Character_Parts_Visibility) == 0x000001, "Wrong size on PartyDisplayManagerBP_C_Set_Character_Parts_Visibility");
static_assert(offsetof(PartyDisplayManagerBP_C_Set_Character_Parts_Visibility, NewVisible) == 0x000000, "Member 'PartyDisplayManagerBP_C_Set_Character_Parts_Visibility::NewVisible' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ResOutPawnFromLobby
// 0x0010 (0x0010 - 0x0000)
struct PartyDisplayManagerBP_C_ResOutPawnFromLobby final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartyIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ResOutPawnFromLobby) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_ResOutPawnFromLobby");
static_assert(sizeof(PartyDisplayManagerBP_C_ResOutPawnFromLobby) == 0x000010, "Wrong size on PartyDisplayManagerBP_C_ResOutPawnFromLobby");
static_assert(offsetof(PartyDisplayManagerBP_C_ResOutPawnFromLobby, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_ResOutPawnFromLobby::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResOutPawnFromLobby, PartyIndex) == 0x000008, "Member 'PartyDisplayManagerBP_C_ResOutPawnFromLobby::PartyIndex' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ResetVisuals
// 0x0160 (0x0160 - 0x0000)
struct PartyDisplayManagerBP_C_ResetVisuals final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0xD];                                        // 0x0003(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ResetVisuals) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_ResetVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_ResetVisuals) == 0x000160, "Wrong size on PartyDisplayManagerBP_C_ResetVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000070, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_SetStaticMesh_ReturnValue) == 0x000158, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.RestoreTeleportMIDsInProgress
// 0x0060 (0x0060 - 0x0000)
struct PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress final
{
public:
	const class AFortPlayerPawn*                  Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue; // 0x0020(0x0030)(HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortPartyMemberLocation                      CallFunc_GetPartyMemberLocation_LocationOut;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberLocation_ReturnValue;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress");
static_assert(sizeof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress) == 0x000060, "Wrong size on PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex) == 0x000008, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue) == 0x00000C, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000010, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_IsValid_ReturnValue_1) == 0x00001A, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue) == 0x000020, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberLocation_LocationOut) == 0x000058, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberLocation_LocationOut' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberLocation_ReturnValue) == 0x000059, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ResetPreScaleLocations
// 0x03A0 (0x03A0 - 0x0000)
struct PartyDisplayManagerBP_C_ResetPreScaleLocations final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x01D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x02B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PartyDisplayManagerBP_C_ResetPreScaleLocations) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_ResetPreScaleLocations");
static_assert(sizeof(PartyDisplayManagerBP_C_ResetPreScaleLocations) == 0x0003A0, "Wrong size on PartyDisplayManagerBP_C_ResetPreScaleLocations");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000E8, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0001D0, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x0002B8, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PartyDisplayManagerBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ReceiveTick) == 0x000004, "Wrong alignment on PartyDisplayManagerBP_C_ReceiveTick");
static_assert(sizeof(PartyDisplayManagerBP_C_ReceiveTick) == 0x000004, "Wrong size on PartyDisplayManagerBP_C_ReceiveTick");
static_assert(offsetof(PartyDisplayManagerBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PartyDisplayManagerBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.OnPlayerPawnAddedToLobby
// 0x0008 (0x0008 - 0x0000)
struct PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby");
static_assert(sizeof(PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby) == 0x000008, "Wrong size on PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby");
static_assert(offsetof(PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_OnPlayerPawnAddedToLobby::Pawn' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.PartyMemberInProgressCheck
// 0x0078 (0x0078 - 0x0000)
struct PartyDisplayManagerBP_C_PartyMemberInProgressCheck final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyInProgressEnabled_ReturnValue;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue; // 0x0040(0x0030)(HasGetValueTypeHash)
	EFortPartyMemberLocation                      CallFunc_GetPartyMemberLocation_LocationOut;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberLocation_ReturnValue;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_PartyMemberInProgressCheck");
static_assert(sizeof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck) == 0x000078, "Wrong size on PartyDisplayManagerBP_C_PartyMemberInProgressCheck");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, PlayerIndex) == 0x000008, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::PlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex) == 0x00000C, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000018, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000028, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_IsPartyInProgressEnabled_ReturnValue) == 0x000030, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_IsPartyInProgressEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue) == 0x000040, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberLocation_LocationOut) == 0x000070, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberLocation_LocationOut' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberLocation_ReturnValue) == 0x000071, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, K2Node_SwitchEnum_CmpSuccess) == 0x000072, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.HandlePartyMemberInProgressDisplayChanges
// 0x00D8 (0x00D8 - 0x0000)
struct PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsCascade_Particle_System_Component; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_3; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_4; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_5; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_6; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_7; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_8; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_9; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_10; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_11; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges");
static_assert(sizeof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges) == 0x0000D8, "Wrong size on PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000008, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_GetChildrenComponents_Children) == 0x000018, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Temp_int_Array_Index_Variable) == 0x000028, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Array_Get_Item) == 0x000030, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsCascade_Particle_System_Component) == 0x000038, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsCascade_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsPrimitive_Component) == 0x000048, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_GetNumMaterials_ReturnValue) == 0x000054, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Temp_int_Variable) == 0x000068, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_GetMaterial_ReturnValue) == 0x000070, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000078, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000081, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000084, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000088, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000090, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x00009C, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_2) == 0x0000A0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_3) == 0x0000A4, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_4) == 0x0000A8, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_5) == 0x0000AC, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_6) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_7) == 0x0000B4, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_8) == 0x0000B8, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_9) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_10) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_11) == 0x0000C4, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetWeaponPlacementTransform
// 0x01F0 (0x01F0 - 0x0000)
struct PartyDisplayManagerBP_C_GetWeaponPlacementTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00C0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0xF];                                      // 0x0121(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0130(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0190(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_GetWeaponPlacementTransform");
static_assert(sizeof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform) == 0x0001F0, "Wrong size on PartyDisplayManagerBP_C_GetWeaponPlacementTransform");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_GetTransform_ReturnValue) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_GetTransform_ReturnValue_1) == 0x000130, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_ComposeTransforms_ReturnValue) == 0x000190, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.HandleLoadingAssetsForItemCompleted
// 0x0028 (0x0028 - 0x0000)
struct PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted final
{
public:
