#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PedestalGroup_Primary

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PedestalGroup_Primary.PedestalGroup_Primary_C
// 0x0020 (0x02E8 - 0x02C8)
class APedestalGroup_Primary_C final : public AAthenaSquadPedestalGroup
{
public:
	class UChildActorComponent*                   CAC_Pedestal3;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CAC_Pedestal2;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CAC_Pedestal1;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CAC_Pedestal0;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PedestalGroup_Primary_C">();
	}
	static class APedestalGroup_Primary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APedestalGroup_Primary_C>();
	}
};
static_assert(alignof(APedestalGroup_Primary_C) == 0x000008, "Wrong alignment on APedestalGroup_Primary_C");
static_assert(sizeof(APedestalGroup_Primary_C) == 0x0002E8, "Wrong size on APedestalGroup_Primary_C");
static_assert(offsetof(APedestalGroup_Primary_C, CAC_Pedestal3) == 0x0002C8, "Member 'APedestalGroup_Primary_C::CAC_Pedestal3' has a wrong offset!");
static_assert(offsetof(APedestalGroup_Primary_C, CAC_Pedestal2) == 0x0002D0, "Member 'APedestalGroup_Primary_C::CAC_Pedestal2' has a wrong offset!");
static_assert(offsetof(APedestalGroup_Primary_C, CAC_Pedestal1) == 0x0002D8, "Member 'APedestalGroup_Primary_C::CAC_Pedestal1' has a wrong offset!");
static_assert(offsetof(APedestalGroup_Primary_C, CAC_Pedestal0) == 0x0002E0, "Member 'APedestalGroup_Primary_C::CAC_Pedestal0' has a wrong offset!");

}

