#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureFNEventsOverlay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PictureInPictureDescriptors_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C.ExecuteUbergraph_PictureInPictureFNEventsOverlay
// 0x0688 (0x0688 - 0x0000)
struct PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPiPPartnerSource                      CallFunc_GetCurrentSource_ReturnValue;             // 0x0008(0x01F0)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPiPPartnerSource                      CallFunc_GetCurrentSource_ReturnValue_1;           // 0x0200(0x01F0)(ContainsInstancedReference)
	class FName                                   Temp_name_Variable;                                // 0x03F0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortGameModeFrontEnd*                  K2Node_DynamicCast_AsFort_Game_Mode_Front_End;     // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0414(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0450(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x04C8(0x0078)(ConstParm)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0550(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0554(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorNumber;                    // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 ErrorType, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0570(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0588(0x0050)(HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2[0x2];                                      // 0x05E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x05E4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ErrorType, const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x05E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x05F4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_5;                              // 0x0604(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0610(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0660(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0670(0x0018)()
};
static_assert(alignof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay) == 0x000008, "Wrong alignment on PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay");
static_assert(sizeof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay) == 0x000688, "Wrong size on PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, EntryPoint) == 0x000000, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_3) == 0x000007, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_GetCurrentSource_ReturnValue) == 0x000008, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_GetCurrentSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_4) == 0x0001F8, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_5) == 0x0001F9, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_GetCurrentSource_ReturnValue_1) == 0x000200, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_GetCurrentSource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, Temp_name_Variable) == 0x0003F0, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0003F8, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_GetGameMode_ReturnValue) == 0x000400, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_DynamicCast_AsFort_Game_Mode_Front_End) == 0x000408, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_DynamicCast_AsFort_Game_Mode_Front_End' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_DynamicCast_bSuccess) == 0x000410, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_Event_MyGeometry) == 0x000414, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_Event_MouseEvent_1) == 0x000450, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_Event_MouseEvent) == 0x0004C8, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsActivated_ReturnValue) == 0x000540, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_Not_PreBool_ReturnValue) == 0x000541, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_6) == 0x000542, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_7) == 0x000543, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_GetContext_ReturnValue) == 0x000548, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, Temp_name_Variable_1) == 0x000550, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, Temp_name_Variable_2) == 0x000554, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_CustomEvent_ErrorNumber) == 0x000558, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_CustomEvent_ErrorNumber' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_CustomEvent_ErrorMessage) == 0x000560, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_CreateDelegate_OutputDelegate) == 0x000570, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000580, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_MakeStruct_FormatArgumentData) == 0x000588, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_GetContext_ReturnValue_1) == 0x0005D8, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_8) == 0x0005E0, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_9) == 0x0005E1, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, Temp_name_Variable_3) == 0x0005E4, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x0005E8, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, Temp_name_Variable_4) == 0x0005F4, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_GetContext_ReturnValue_2) == 0x0005F8, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_IsValid_ReturnValue_10) == 0x000600, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, Temp_name_Variable_5) == 0x000604, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000608, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_Not_PreBool_ReturnValue_1) == 0x000609, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_MakeStruct_FormatArgumentData_1) == 0x000610, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, K2Node_MakeArray_Array) == 0x000660, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay, CallFunc_Format_ReturnValue) == 0x000670, "Member 'PictureInPictureFNEventsOverlay_C_ExecuteUbergraph_PictureInPictureFNEventsOverlay::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct PictureInPictureFNEventsOverlay_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PictureInPictureFNEventsOverlay_C_OnMouseEnter) == 0x000008, "Wrong alignment on PictureInPictureFNEventsOverlay_C_OnMouseEnter");
static_assert(sizeof(PictureInPictureFNEventsOverlay_C_OnMouseEnter) == 0x0000B0, "Wrong size on PictureInPictureFNEventsOverlay_C_OnMouseEnter");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'PictureInPictureFNEventsOverlay_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'PictureInPictureFNEventsOverlay_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct PictureInPictureFNEventsOverlay_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PictureInPictureFNEventsOverlay_C_OnMouseLeave) == 0x000008, "Wrong alignment on PictureInPictureFNEventsOverlay_C_OnMouseLeave");
static_assert(sizeof(PictureInPictureFNEventsOverlay_C_OnMouseLeave) == 0x000078, "Wrong size on PictureInPictureFNEventsOverlay_C_OnMouseLeave");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'PictureInPictureFNEventsOverlay_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C.Set PIP Location
// 0x0060 (0x0060 - 0x0000)
struct PictureInPictureFNEventsOverlay_C_Set_PIP_Location final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            K2Node_Select_Default_2;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location) == 0x000008, "Wrong alignment on PictureInPictureFNEventsOverlay_C_Set_PIP_Location");
static_assert(sizeof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location) == 0x000060, "Wrong size on PictureInPictureFNEventsOverlay_C_Set_PIP_Location");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_bool_Variable) == 0x000000, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_byte_Variable) == 0x000001, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_byte_Variable_1) == 0x000002, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_bool_Variable_1) == 0x000003, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_byte_Variable_2) == 0x000004, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_byte_Variable_3) == 0x000005, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_struct_Variable) == 0x000008, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_struct_Variable_1) == 0x000018, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, Temp_bool_Variable_2) == 0x000028, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000030, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue) == 0x000038, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000040, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, K2Node_Select_Default) == 0x000048, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, K2Node_Select_Default_1) == 0x000058, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_Set_PIP_Location, K2Node_Select_Default_2) == 0x000059, "Member 'PictureInPictureFNEventsOverlay_C_Set_PIP_Location::K2Node_Select_Default_2' has a wrong offset!");

// Function PictureInPictureFNEventsOverlay.PictureInPictureFNEventsOverlay_C.ShowError
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureFNEventsOverlay_C_ShowError final
{
public:
	int32                                         ErrorNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage_0;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PictureInPictureFNEventsOverlay_C_ShowError) == 0x000008, "Wrong alignment on PictureInPictureFNEventsOverlay_C_ShowError");
static_assert(sizeof(PictureInPictureFNEventsOverlay_C_ShowError) == 0x000018, "Wrong size on PictureInPictureFNEventsOverlay_C_ShowError");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ShowError, ErrorNumber) == 0x000000, "Member 'PictureInPictureFNEventsOverlay_C_ShowError::ErrorNumber' has a wrong offset!");
static_assert(offsetof(PictureInPictureFNEventsOverlay_C_ShowError, ErrorMessage_0) == 0x000008, "Member 'PictureInPictureFNEventsOverlay_C_ShowError::ErrorMessage_0' has a wrong offset!");

}

