#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimEventScreenEventVaultWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VaultWorld_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C
// 0x0070 (0x03C0 - 0x0350)
class APilgrimEventScreenEventVaultWorld_C final : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PilgrimEventScreenEventVaultWorld_C; // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   floor;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ItemDetails_X_Offset_68C3898D424BEACDFEB5559E091141D8; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ItemDetails__Direction_68C3898D424BEACDFEB5559E091141D8; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ItemDetails;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Floor_Visibility_FloorMask_B8DF0E7548B0B3258911ACA2E59C4ED5; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Floor_Visibility__Direction_B8DF0E7548B0B3258911ACA2E59C4ED5; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Floor_Visibility;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Effects_SetStreaks_B72E13E64AF840AB5A739E8485EAFB0C; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Background_Effects__Direction_B72E13E64AF840AB5A739E8485EAFB0C; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Background_Effects;                                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_630B799D41239619956D94A08501493D; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Pre_TransitionOffset_630B799D41239619956D94A08501493D; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_630B799D41239619956D94A08501493D; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_630B799D41239619956D94A08501493D; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_fx_Transition_fade_0417507846315C71198827A55A7AB86E; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Pre_Transition_Offset_0417507846315C71198827A55A7AB86E; // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Backward_0417507846315C71198827A55A7AB86E; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionBackward__Direction_0417507846315C71198827A55A7AB86E; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionBackward;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Background_Effects__FinishedFunc();
	void Background_Effects__UpdateFunc();
	void ExecuteUbergraph_PilgrimEventScreenEventVaultWorld(int32 EntryPoint);
	void Floor_Visibility__FinishedFunc();
	void Floor_Visibility__UpdateFunc();
	void ItemDetails__FinishedFunc();
	void ItemDetails__UpdateFunc();
	void OnInitialBackgroundTransition();
	void OnSetupBackground(const class UTexture2D* LoadedBackgroundTexture, const struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnTransitionBackground(bool bPlayForward, EBackgroundIntensityLevel IntensityTransition);
	void OnTransitionItemDetails(const bool bShowItemDetails);
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnUpdateMaterialIndex(int32 MaterialIndex);
	void ReceiveBeginPlay();
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, struct FVaultWorldBackgroundData& BackgroundInfo, class UMaterialInstanceDynamic* Mid);
	void TransitionBackgroundBackward(double Backward, double PreTransitionOffset, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void TransitionBackgroundForward(double Forward, double PreTransitionOffset, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void TransitionBackward__FinishedFunc();
	void TransitionBackward__UpdateFunc();
	void TransitionForward__FinishedFunc();
	void TransitionForward__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PilgrimEventScreenEventVaultWorld_C">();
	}
	static class APilgrimEventScreenEventVaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APilgrimEventScreenEventVaultWorld_C>();
	}
};
static_assert(alignof(APilgrimEventScreenEventVaultWorld_C) == 0x000008, "Wrong alignment on APilgrimEventScreenEventVaultWorld_C");
static_assert(sizeof(APilgrimEventScreenEventVaultWorld_C) == 0x0003C0, "Wrong size on APilgrimEventScreenEventVaultWorld_C");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, UberGraphFrame_PilgrimEventScreenEventVaultWorld_C) == 0x000350, "Member 'APilgrimEventScreenEventVaultWorld_C::UberGraphFrame_PilgrimEventScreenEventVaultWorld_C' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, floor) == 0x000358, "Member 'APilgrimEventScreenEventVaultWorld_C::floor' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, ItemDetails_X_Offset_68C3898D424BEACDFEB5559E091141D8) == 0x000360, "Member 'APilgrimEventScreenEventVaultWorld_C::ItemDetails_X_Offset_68C3898D424BEACDFEB5559E091141D8' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, ItemDetails__Direction_68C3898D424BEACDFEB5559E091141D8) == 0x000364, "Member 'APilgrimEventScreenEventVaultWorld_C::ItemDetails__Direction_68C3898D424BEACDFEB5559E091141D8' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, ItemDetails) == 0x000368, "Member 'APilgrimEventScreenEventVaultWorld_C::ItemDetails' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, Floor_Visibility_FloorMask_B8DF0E7548B0B3258911ACA2E59C4ED5) == 0x000370, "Member 'APilgrimEventScreenEventVaultWorld_C::Floor_Visibility_FloorMask_B8DF0E7548B0B3258911ACA2E59C4ED5' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, Floor_Visibility__Direction_B8DF0E7548B0B3258911ACA2E59C4ED5) == 0x000374, "Member 'APilgrimEventScreenEventVaultWorld_C::Floor_Visibility__Direction_B8DF0E7548B0B3258911ACA2E59C4ED5' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, Floor_Visibility) == 0x000378, "Member 'APilgrimEventScreenEventVaultWorld_C::Floor_Visibility' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, Background_Effects_SetStreaks_B72E13E64AF840AB5A739E8485EAFB0C) == 0x000380, "Member 'APilgrimEventScreenEventVaultWorld_C::Background_Effects_SetStreaks_B72E13E64AF840AB5A739E8485EAFB0C' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, Background_Effects__Direction_B72E13E64AF840AB5A739E8485EAFB0C) == 0x000384, "Member 'APilgrimEventScreenEventVaultWorld_C::Background_Effects__Direction_B72E13E64AF840AB5A739E8485EAFB0C' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, Background_Effects) == 0x000388, "Member 'APilgrimEventScreenEventVaultWorld_C::Background_Effects' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionForward_FX_Transition_Fade_630B799D41239619956D94A08501493D) == 0x000390, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionForward_FX_Transition_Fade_630B799D41239619956D94A08501493D' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionForward_Pre_TransitionOffset_630B799D41239619956D94A08501493D) == 0x000394, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionForward_Pre_TransitionOffset_630B799D41239619956D94A08501493D' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionForward_Forward_630B799D41239619956D94A08501493D) == 0x000398, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionForward_Forward_630B799D41239619956D94A08501493D' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionForward__Direction_630B799D41239619956D94A08501493D) == 0x00039C, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionForward__Direction_630B799D41239619956D94A08501493D' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionForward) == 0x0003A0, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionForward' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionBackward_fx_Transition_fade_0417507846315C71198827A55A7AB86E) == 0x0003A8, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionBackward_fx_Transition_fade_0417507846315C71198827A55A7AB86E' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionBackward_Pre_Transition_Offset_0417507846315C71198827A55A7AB86E) == 0x0003AC, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionBackward_Pre_Transition_Offset_0417507846315C71198827A55A7AB86E' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionBackward_Backward_0417507846315C71198827A55A7AB86E) == 0x0003B0, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionBackward_Backward_0417507846315C71198827A55A7AB86E' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionBackward__Direction_0417507846315C71198827A55A7AB86E) == 0x0003B4, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionBackward__Direction_0417507846315C71198827A55A7AB86E' has a wrong offset!");
static_assert(offsetof(APilgrimEventScreenEventVaultWorld_C, TransitionBackward) == 0x0003B8, "Member 'APilgrimEventScreenEventVaultWorld_C::TransitionBackward' has a wrong offset!");

}

