#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreRuntime

#include "Basic.hpp"

#include "PilgrimCoreRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "Harmonix_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "CommonInput_structs.hpp"
#include "MetasoundEngine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PlayspaceSystem_structs.hpp"
#include "FMCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.OnBar
// 0x0004 (0x0004 - 0x0000)
struct NetworkedMusicClockManager_OnBar final
{
public:
	int32                                         BarNumber;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkedMusicClockManager_OnBar) == 0x000004, "Wrong alignment on NetworkedMusicClockManager_OnBar");
static_assert(sizeof(NetworkedMusicClockManager_OnBar) == 0x000004, "Wrong size on NetworkedMusicClockManager_OnBar");
static_assert(offsetof(NetworkedMusicClockManager_OnBar, BarNumber) == 0x000000, "Member 'NetworkedMusicClockManager_OnBar::BarNumber' has a wrong offset!");

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.OnBeat
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_OnBeat final
{
public:
	int32                                         BeatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkedMusicClockManager_OnBeat) == 0x000004, "Wrong alignment on NetworkedMusicClockManager_OnBeat");
static_assert(sizeof(NetworkedMusicClockManager_OnBeat) == 0x000008, "Wrong size on NetworkedMusicClockManager_OnBeat");
static_assert(offsetof(NetworkedMusicClockManager_OnBeat, BeatNumber) == 0x000000, "Member 'NetworkedMusicClockManager_OnBeat::BeatNumber' has a wrong offset!");
static_assert(offsetof(NetworkedMusicClockManager_OnBeat, BeatInBar) == 0x000004, "Member 'NetworkedMusicClockManager_OnBeat::BeatInBar' has a wrong offset!");

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.PlayServerAuthoritativeSong
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_PlayServerAuthoritativeSong final
{
public:
	class UPilgrimSongMetadata*                   SongToPlay;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkedMusicClockManager_PlayServerAuthoritativeSong) == 0x000008, "Wrong alignment on NetworkedMusicClockManager_PlayServerAuthoritativeSong");
static_assert(sizeof(NetworkedMusicClockManager_PlayServerAuthoritativeSong) == 0x000008, "Wrong size on NetworkedMusicClockManager_PlayServerAuthoritativeSong");
static_assert(offsetof(NetworkedMusicClockManager_PlayServerAuthoritativeSong, SongToPlay) == 0x000000, "Member 'NetworkedMusicClockManager_PlayServerAuthoritativeSong::SongToPlay' has a wrong offset!");

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.SetClientAudioComponentsToUse
// 0x0010 (0x0010 - 0x0000)
struct NetworkedMusicClockManager_SetClientAudioComponentsToUse final
{
public:
	class UAudioComponent*                        InMetasoundPlayer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        InMetasoundMixer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkedMusicClockManager_SetClientAudioComponentsToUse) == 0x000008, "Wrong alignment on NetworkedMusicClockManager_SetClientAudioComponentsToUse");
static_assert(sizeof(NetworkedMusicClockManager_SetClientAudioComponentsToUse) == 0x000010, "Wrong size on NetworkedMusicClockManager_SetClientAudioComponentsToUse");
static_assert(offsetof(NetworkedMusicClockManager_SetClientAudioComponentsToUse, InMetasoundPlayer) == 0x000000, "Member 'NetworkedMusicClockManager_SetClientAudioComponentsToUse::InMetasoundPlayer' has a wrong offset!");
static_assert(offsetof(NetworkedMusicClockManager_SetClientAudioComponentsToUse, InMetasoundMixer) == 0x000008, "Member 'NetworkedMusicClockManager_SetClientAudioComponentsToUse::InMetasoundMixer' has a wrong offset!");

// Function PilgrimCoreRuntime.NetworkedMusicClockManager.GetOwnedMusicClock
// 0x0008 (0x0008 - 0x0000)
struct NetworkedMusicClockManager_GetOwnedMusicClock final
{
public:
	class UMusicClockComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NetworkedMusicClockManager_GetOwnedMusicClock) == 0x000008, "Wrong alignment on NetworkedMusicClockManager_GetOwnedMusicClock");
static_assert(sizeof(NetworkedMusicClockManager_GetOwnedMusicClock) == 0x000008, "Wrong size on NetworkedMusicClockManager_GetOwnedMusicClock");
static_assert(offsetof(NetworkedMusicClockManager_GetOwnedMusicClock, ReturnValue) == 0x000000, "Member 'NetworkedMusicClockManager_GetOwnedMusicClock::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBars.WaitForBars
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForBars_WaitForBars final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BarsToWaitFor;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopFor;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForBars*        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAbilityTask_WaitForBars_WaitForBars) == 0x000008, "Wrong alignment on PilgrimAbilityTask_WaitForBars_WaitForBars");
static_assert(sizeof(PilgrimAbilityTask_WaitForBars_WaitForBars) == 0x000018, "Wrong size on PilgrimAbilityTask_WaitForBars_WaitForBars");
static_assert(offsetof(PilgrimAbilityTask_WaitForBars_WaitForBars, OwningAbility) == 0x000000, "Member 'PilgrimAbilityTask_WaitForBars_WaitForBars::OwningAbility' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForBars_WaitForBars, BarsToWaitFor) == 0x000008, "Member 'PilgrimAbilityTask_WaitForBars_WaitForBars::BarsToWaitFor' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForBars_WaitForBars, LoopFor) == 0x00000C, "Member 'PilgrimAbilityTask_WaitForBars_WaitForBars::LoopFor' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForBars_WaitForBars, ReturnValue) == 0x000010, "Member 'PilgrimAbilityTask_WaitForBars_WaitForBars::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBeats.WaitForBeats
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForBeats_WaitForBeats final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatsToWaitFor;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopFor;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForBeats*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAbilityTask_WaitForBeats_WaitForBeats) == 0x000008, "Wrong alignment on PilgrimAbilityTask_WaitForBeats_WaitForBeats");
static_assert(sizeof(PilgrimAbilityTask_WaitForBeats_WaitForBeats) == 0x000018, "Wrong size on PilgrimAbilityTask_WaitForBeats_WaitForBeats");
static_assert(offsetof(PilgrimAbilityTask_WaitForBeats_WaitForBeats, OwningAbility) == 0x000000, "Member 'PilgrimAbilityTask_WaitForBeats_WaitForBeats::OwningAbility' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForBeats_WaitForBeats, BeatsToWaitFor) == 0x000008, "Member 'PilgrimAbilityTask_WaitForBeats_WaitForBeats::BeatsToWaitFor' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForBeats_WaitForBeats, LoopFor) == 0x00000C, "Member 'PilgrimAbilityTask_WaitForBeats_WaitForBeats::LoopFor' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForBeats_WaitForBeats, ReturnValue) == 0x000010, "Member 'PilgrimAbilityTask_WaitForBeats_WaitForBeats::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection.WaitForSection
// 0x0028 (0x0028 - 0x0000)
struct PilgrimAbilityTask_WaitForSection_WaitForSection final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldWaitForNextSection;                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SectionName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimAbilityTask_WaitForSection*     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAbilityTask_WaitForSection_WaitForSection) == 0x000008, "Wrong alignment on PilgrimAbilityTask_WaitForSection_WaitForSection");
static_assert(sizeof(PilgrimAbilityTask_WaitForSection_WaitForSection) == 0x000028, "Wrong size on PilgrimAbilityTask_WaitForSection_WaitForSection");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_WaitForSection, OwningAbility) == 0x000000, "Member 'PilgrimAbilityTask_WaitForSection_WaitForSection::OwningAbility' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_WaitForSection, bShouldWaitForNextSection) == 0x000008, "Member 'PilgrimAbilityTask_WaitForSection_WaitForSection::bShouldWaitForNextSection' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_WaitForSection, SectionName) == 0x000010, "Member 'PilgrimAbilityTask_WaitForSection_WaitForSection::SectionName' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_WaitForSection, ReturnValue) == 0x000020, "Member 'PilgrimAbilityTask_WaitForSection_WaitForSection::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection.OnSectionEvent
// 0x0018 (0x0018 - 0x0000)
struct PilgrimAbilityTask_WaitForSection_OnSectionEvent final
{
public:
	class FString                                 SectionName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionStartMs;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionLengthMs;                                   // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAbilityTask_WaitForSection_OnSectionEvent) == 0x000008, "Wrong alignment on PilgrimAbilityTask_WaitForSection_OnSectionEvent");
static_assert(sizeof(PilgrimAbilityTask_WaitForSection_OnSectionEvent) == 0x000018, "Wrong size on PilgrimAbilityTask_WaitForSection_OnSectionEvent");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_OnSectionEvent, SectionName) == 0x000000, "Member 'PilgrimAbilityTask_WaitForSection_OnSectionEvent::SectionName' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_OnSectionEvent, SectionStartMs) == 0x000010, "Member 'PilgrimAbilityTask_WaitForSection_OnSectionEvent::SectionStartMs' has a wrong offset!");
static_assert(offsetof(PilgrimAbilityTask_WaitForSection_OnSectionEvent, SectionLengthMs) == 0x000014, "Member 'PilgrimAbilityTask_WaitForSection_OnSectionEvent::SectionLengthMs' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimActorPool.InitPool
// 0x0010 (0x0010 - 0x0000)
struct PilgrimActorPool_InitPool final
{
public:
	struct FPilgrimActorPoolParams                PilgrimActorPoolParams;                            // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimActorPool_InitPool) == 0x000008, "Wrong alignment on PilgrimActorPool_InitPool");
static_assert(sizeof(PilgrimActorPool_InitPool) == 0x000010, "Wrong size on PilgrimActorPool_InitPool");
static_assert(offsetof(PilgrimActorPool_InitPool, PilgrimActorPoolParams) == 0x000000, "Member 'PilgrimActorPool_InitPool::PilgrimActorPoolParams' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimActorPool.TryReturnItem
// 0x0010 (0x0010 - 0x0000)
struct PilgrimActorPool_TryReturnItem final
{
public:
	class AActor*                                 ActorToPutBack;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PilgrimActorPool_TryReturnItem) == 0x000008, "Wrong alignment on PilgrimActorPool_TryReturnItem");
static_assert(sizeof(PilgrimActorPool_TryReturnItem) == 0x000010, "Wrong size on PilgrimActorPool_TryReturnItem");
static_assert(offsetof(PilgrimActorPool_TryReturnItem, ActorToPutBack) == 0x000000, "Member 'PilgrimActorPool_TryReturnItem::ActorToPutBack' has a wrong offset!");
static_assert(offsetof(PilgrimActorPool_TryReturnItem, ReturnValue) == 0x000008, "Member 'PilgrimActorPool_TryReturnItem::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimActorPool.GetNumAvailableItems
// 0x0004 (0x0004 - 0x0000)
struct PilgrimActorPool_GetNumAvailableItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimActorPool_GetNumAvailableItems) == 0x000004, "Wrong alignment on PilgrimActorPool_GetNumAvailableItems");
static_assert(sizeof(PilgrimActorPool_GetNumAvailableItems) == 0x000004, "Wrong size on PilgrimActorPool_GetNumAvailableItems");
static_assert(offsetof(PilgrimActorPool_GetNumAvailableItems, ReturnValue) == 0x000000, "Member 'PilgrimActorPool_GetNumAvailableItems::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimActorPool.GetNumInUseItems
// 0x0004 (0x0004 - 0x0000)
struct PilgrimActorPool_GetNumInUseItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimActorPool_GetNumInUseItems) == 0x000004, "Wrong alignment on PilgrimActorPool_GetNumInUseItems");
static_assert(sizeof(PilgrimActorPool_GetNumInUseItems) == 0x000004, "Wrong size on PilgrimActorPool_GetNumInUseItems");
static_assert(offsetof(PilgrimActorPool_GetNumInUseItems, ReturnValue) == 0x000000, "Member 'PilgrimActorPool_GetNumInUseItems::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestLeaderboard.PilgrimRequestLeaderboard
// 0x0048 (0x0048 - 0x0000)
struct PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpotlightGroup;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimLeaderboardType                       LeaderboardType;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFriendsOnly;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredOnRequestingPlayer;                       // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Page;                                              // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSpotlightCompetition;                           // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCache;                                         // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimAsyncAction_RequestLeaderboard* ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard) == 0x000008, "Wrong alignment on PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard");
static_assert(sizeof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard) == 0x000048, "Wrong size on PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, WorldContextObject) == 0x000000, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::WorldContextObject' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, SongShortName) == 0x000008, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::SongShortName' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, SpotlightGroup) == 0x000010, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::SpotlightGroup' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, LeaderboardType) == 0x000020, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::LeaderboardType' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, RequestingPlayer) == 0x000028, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::RequestingPlayer' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, bFriendsOnly) == 0x000030, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::bFriendsOnly' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, bCenteredOnRequestingPlayer) == 0x000031, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::bCenteredOnRequestingPlayer' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, Page) == 0x000034, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::Page' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, bIsSpotlightCompetition) == 0x000038, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::bIsSpotlightCompetition' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, bUseCache) == 0x000039, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::bUseCache' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard, ReturnValue) == 0x000040, "Member 'PilgrimAsyncAction_RequestLeaderboard_PilgrimRequestLeaderboard::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestPersonalBest.PilgrimRequestPersonalBest
// 0x0060 (0x0060 - 0x0000)
struct PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerAccountId;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             InstrumentType;                                    // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BandSize;                                          // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SetlistIndex;                                      // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCache;                                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimAsyncAction_RequestPersonalBest* ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest) == 0x000008, "Wrong alignment on PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest");
static_assert(sizeof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest) == 0x000060, "Wrong size on PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, WorldContextObject) == 0x000000, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::WorldContextObject' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, RequestingPlayer) == 0x000008, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::RequestingPlayer' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, PlayerAccountId) == 0x000010, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::PlayerAccountId' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, SongShortName) == 0x000040, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::SongShortName' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, InstrumentType) == 0x000044, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::InstrumentType' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, BandSize) == 0x000048, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::BandSize' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, SetlistIndex) == 0x00004C, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::SetlistIndex' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, bUseCache) == 0x000050, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::bUseCache' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest, ReturnValue) == 0x000058, "Member 'PilgrimAsyncAction_RequestPersonalBest_PilgrimRequestPersonalBest::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimAsyncAction_RequestPlayerFeed.PilgrimRequestPlayerFeed
// 0x00A0 (0x00A0 - 0x0000)
struct PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  RequestingPlayer;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SongQuery;                                         // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSongShortNameMatcher                  SongShortNameMatcher;                              // 0x0058(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EPilgrimLeaderboardType>               Leaderboards;                                      // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FUniqueNetIdRepl>               FriendIds;                                         // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPilgrimPlayerFeedSortType                    SortType;                                          // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllScores;                                        // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequirePlayerScore;                               // 0x0092(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimAsyncAction_RequestPlayerFeed*  ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed) == 0x000008, "Wrong alignment on PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed");
static_assert(sizeof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed) == 0x0000A0, "Wrong size on PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, WorldContextObject) == 0x000000, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::WorldContextObject' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, RequestingPlayer) == 0x000008, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::RequestingPlayer' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, SongQuery) == 0x000010, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::SongQuery' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, SongShortNameMatcher) == 0x000058, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::SongShortNameMatcher' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, Leaderboards) == 0x000070, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::Leaderboards' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, FriendIds) == 0x000080, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::FriendIds' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, SortType) == 0x000090, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::SortType' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, bAllScores) == 0x000091, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::bAllScores' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, bRequirePlayerScore) == 0x000092, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::bRequirePlayerScore' has a wrong offset!");
static_assert(offsetof(PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed, ReturnValue) == 0x000098, "Member 'PilgrimAsyncAction_RequestPlayerFeed_PilgrimRequestPlayerFeed::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimBeatMarker.SetupNumLanes
// 0x0004 (0x0004 - 0x0000)
struct PilgrimBeatMarker_SetupNumLanes final
{
public:
	int32                                         NumLanes;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimBeatMarker_SetupNumLanes) == 0x000004, "Wrong alignment on PilgrimBeatMarker_SetupNumLanes");
static_assert(sizeof(PilgrimBeatMarker_SetupNumLanes) == 0x000004, "Wrong size on PilgrimBeatMarker_SetupNumLanes");
static_assert(offsetof(PilgrimBeatMarker_SetupNumLanes, NumLanes) == 0x000000, "Member 'PilgrimBeatMarker_SetupNumLanes::NumLanes' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimBeatValidatedAbility.OnBeatAbilityActivated
// 0x0001 (0x0001 - 0x0000)
struct PilgrimBeatValidatedAbility_OnBeatAbilityActivated final
{
public:
	bool                                          bOnBeat;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimBeatValidatedAbility_OnBeatAbilityActivated) == 0x000001, "Wrong alignment on PilgrimBeatValidatedAbility_OnBeatAbilityActivated");
static_assert(sizeof(PilgrimBeatValidatedAbility_OnBeatAbilityActivated) == 0x000001, "Wrong size on PilgrimBeatValidatedAbility_OnBeatAbilityActivated");
static_assert(offsetof(PilgrimBeatValidatedAbility_OnBeatAbilityActivated, bOnBeat) == 0x000000, "Member 'PilgrimBeatValidatedAbility_OnBeatAbilityActivated::bOnBeat' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetSelectedGeneralControllerPreset
// 0x0010 (0x0010 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset final
{
public:
	class FString                                 NewSelectedGeneralControllerPreset;                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset) == 0x000008, "Wrong alignment on PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset");
static_assert(sizeof(PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset) == 0x000010, "Wrong size on PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset");
static_assert(offsetof(PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset, NewSelectedGeneralControllerPreset) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_SetSelectedGeneralControllerPreset::NewSelectedGeneralControllerPreset' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetTrackBackgroundOpacity
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity final
{
public:
	float                                         NewOpacity;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity) == 0x000004, "Wrong alignment on PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity");
static_assert(sizeof(PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity) == 0x000004, "Wrong size on PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity");
static_assert(offsetof(PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity, NewOpacity) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_SetTrackBackgroundOpacity::NewOpacity' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetTrackSpeedMultiplier
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier final
{
public:
	float                                         NewMultiplier;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier) == 0x000004, "Wrong alignment on PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier");
static_assert(sizeof(PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier) == 0x000004, "Wrong size on PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier");
static_assert(offsetof(PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier, NewMultiplier) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_SetTrackSpeedMultiplier::NewMultiplier' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.SetUseAlternative5LaneTouchLayout
// 0x0001 (0x0001 - 0x0000)
struct PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout final
{
public:
	bool                                          NewUseAlternative5LaneTouchLayout;                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout) == 0x000001, "Wrong alignment on PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout");
static_assert(sizeof(PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout) == 0x000001, "Wrong size on PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout");
static_assert(offsetof(PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout, NewUseAlternative5LaneTouchLayout) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_SetUseAlternative5LaneTouchLayout::NewUseAlternative5LaneTouchLayout' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetSelectedGeneralControllerPreset
// 0x0010 (0x0010 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset) == 0x000008, "Wrong alignment on PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset");
static_assert(sizeof(PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset) == 0x000010, "Wrong size on PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset");
static_assert(offsetof(PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset, ReturnValue) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_GetSelectedGeneralControllerPreset::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetTrackBackgroundOpacity
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity) == 0x000004, "Wrong alignment on PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity");
static_assert(sizeof(PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity) == 0x000004, "Wrong size on PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity");
static_assert(offsetof(PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity, ReturnValue) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_GetTrackBackgroundOpacity::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetTrackSpeedMultiplier
// 0x0004 (0x0004 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier) == 0x000004, "Wrong alignment on PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier");
static_assert(sizeof(PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier) == 0x000004, "Wrong size on PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier");
static_assert(offsetof(PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier, ReturnValue) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_GetTrackSpeedMultiplier::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimClientSettingRecordPartition.GetUseAlternative5LaneTouchLayout
// 0x0001 (0x0001 - 0x0000)
struct PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout) == 0x000001, "Wrong alignment on PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout");
static_assert(sizeof(PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout) == 0x000001, "Wrong size on PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout");
static_assert(offsetof(PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout, ReturnValue) == 0x000000, "Member 'PilgrimClientSettingRecordPartition_GetUseAlternative5LaneTouchLayout::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCoreBandStateComponent.GetCurrentSong
// 0x0008 (0x0008 - 0x0000)
struct PilgrimCoreBandStateComponent_GetCurrentSong final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCoreBandStateComponent_GetCurrentSong) == 0x000008, "Wrong alignment on PilgrimCoreBandStateComponent_GetCurrentSong");
static_assert(sizeof(PilgrimCoreBandStateComponent_GetCurrentSong) == 0x000008, "Wrong size on PilgrimCoreBandStateComponent_GetCurrentSong");
static_assert(offsetof(PilgrimCoreBandStateComponent_GetCurrentSong, ReturnValue) == 0x000000, "Member 'PilgrimCoreBandStateComponent_GetCurrentSong::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCoreBandStateComponent.GetNextSong
// 0x0008 (0x0008 - 0x0000)
struct PilgrimCoreBandStateComponent_GetNextSong final
{
public:
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCoreBandStateComponent_GetNextSong) == 0x000008, "Wrong alignment on PilgrimCoreBandStateComponent_GetNextSong");
static_assert(sizeof(PilgrimCoreBandStateComponent_GetNextSong) == 0x000008, "Wrong size on PilgrimCoreBandStateComponent_GetNextSong");
static_assert(offsetof(PilgrimCoreBandStateComponent_GetNextSong, ReturnValue) == 0x000000, "Member 'PilgrimCoreBandStateComponent_GetNextSong::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCoreBandStateComponent.GetSongAtIndex
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCoreBandStateComponent_GetSongAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimSongMetadata*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCoreBandStateComponent_GetSongAtIndex) == 0x000008, "Wrong alignment on PilgrimCoreBandStateComponent_GetSongAtIndex");
static_assert(sizeof(PilgrimCoreBandStateComponent_GetSongAtIndex) == 0x000010, "Wrong size on PilgrimCoreBandStateComponent_GetSongAtIndex");
static_assert(offsetof(PilgrimCoreBandStateComponent_GetSongAtIndex, Index_0) == 0x000000, "Member 'PilgrimCoreBandStateComponent_GetSongAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(PilgrimCoreBandStateComponent_GetSongAtIndex, ReturnValue) == 0x000008, "Member 'PilgrimCoreBandStateComponent_GetSongAtIndex::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetPilgrimCorePlayerStateComponent
// 0x0010 (0x0010 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimCorePlayerStateComponent*       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent) == 0x000008, "Wrong alignment on PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent");
static_assert(sizeof(PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent) == 0x000010, "Wrong size on PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent, PlayerState) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent::PlayerState' has a wrong offset!");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent, ReturnValue) == 0x000008, "Member 'PilgrimCorePlayerStateComponent_GetPilgrimCorePlayerStateComponent::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_InstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice final
{
public:
	EPilgrimTrackType                             PrevInstrument;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice");
static_assert(sizeof(PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice");
static_assert(offsetof(PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice, PrevInstrument) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_OnRep_InstrumentChoice::PrevInstrument' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_IsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_IsReady final
{
public:
	bool                                          bPrevIsReady;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_OnRep_IsReady) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_OnRep_IsReady");
static_assert(sizeof(PilgrimCorePlayerStateComponent_OnRep_IsReady) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_OnRep_IsReady");
static_assert(offsetof(PilgrimCorePlayerStateComponent_OnRep_IsReady, bPrevIsReady) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_OnRep_IsReady::bPrevIsReady' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.OnRep_SongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_OnRep_SongDifficulty final
{
public:
	EPilgrimSongDifficulty                        PrevDifficulty;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_OnRep_SongDifficulty) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_OnRep_SongDifficulty");
static_assert(sizeof(PilgrimCorePlayerStateComponent_OnRep_SongDifficulty) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_OnRep_SongDifficulty");
static_assert(offsetof(PilgrimCorePlayerStateComponent_OnRep_SongDifficulty, PrevDifficulty) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_OnRep_SongDifficulty::PrevDifficulty' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.ServerSetIsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_ServerSetIsReady final
{
public:
	bool                                          bInIsReady;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_ServerSetIsReady) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_ServerSetIsReady");
static_assert(sizeof(PilgrimCorePlayerStateComponent_ServerSetIsReady) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_ServerSetIsReady");
static_assert(offsetof(PilgrimCorePlayerStateComponent_ServerSetIsReady, bInIsReady) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_ServerSetIsReady::bInIsReady' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.ServerSetIsUsingPlasticInstruments
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments final
{
public:
	bool                                          bIsPlasticAvailable;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments");
static_assert(sizeof(PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments");
static_assert(offsetof(PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments, bIsPlasticAvailable) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_ServerSetIsUsingPlasticInstruments::bIsPlasticAvailable' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.SetInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_SetInstrumentChoice final
{
public:
	EPilgrimTrackType                             Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_SetInstrumentChoice) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_SetInstrumentChoice");
static_assert(sizeof(PilgrimCorePlayerStateComponent_SetInstrumentChoice) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_SetInstrumentChoice");
static_assert(offsetof(PilgrimCorePlayerStateComponent_SetInstrumentChoice, Instrument) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_SetInstrumentChoice::Instrument' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.SetSongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_SetSongDifficulty final
{
public:
	EPilgrimSongDifficulty                        Difficulty;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_SetSongDifficulty) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_SetSongDifficulty");
static_assert(sizeof(PilgrimCorePlayerStateComponent_SetSongDifficulty) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_SetSongDifficulty");
static_assert(offsetof(PilgrimCorePlayerStateComponent_SetSongDifficulty, Difficulty) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_SetSongDifficulty::Difficulty' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetInstrumentChoice final
{
public:
	EPilgrimTrackType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_GetInstrumentChoice) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_GetInstrumentChoice");
static_assert(sizeof(PilgrimCorePlayerStateComponent_GetInstrumentChoice) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_GetInstrumentChoice");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetInstrumentChoice, ReturnValue) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_GetInstrumentChoice::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetIsPlasticInstrumentAvailable
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable");
static_assert(sizeof(PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable, ReturnValue) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_GetIsPlasticInstrumentAvailable::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetIsReady
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetIsReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_GetIsReady) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_GetIsReady");
static_assert(sizeof(PilgrimCorePlayerStateComponent_GetIsReady) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_GetIsReady");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetIsReady, ReturnValue) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_GetIsReady::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetSongDifficulty
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetSongDifficulty final
{
public:
	EPilgrimSongDifficulty                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_GetSongDifficulty) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_GetSongDifficulty");
static_assert(sizeof(PilgrimCorePlayerStateComponent_GetSongDifficulty) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_GetSongDifficulty");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetSongDifficulty, ReturnValue) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_GetSongDifficulty::ReturnValue' has a wrong offset!");

// Function PilgrimCoreRuntime.PilgrimCorePlayerStateComponent.GetTrackTypeForGameplay
// 0x0001 (0x0001 - 0x0000)
struct PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay final
{
public:
	EPilgrimTrackType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay) == 0x000001, "Wrong alignment on PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay");
static_assert(sizeof(PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay) == 0x000001, "Wrong size on PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay");
static_assert(offsetof(PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay, ReturnValue) == 0x000000, "Member 'PilgrimCorePlayerStateComponent_GetTrackTypeForGameplay::ReturnValue' has a wrong offset!");

