#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "HarmonixMidi_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum PilgrimCoreRuntime.EPilgrimTrackLane
// NumValues: 0x0008
enum class EPilgrimTrackLane : uint8
{
	TrackLaneNone                            = 0,
	TrackLane0                               = 1,
	TrackLane1                               = 2,
	TrackLane2                               = 4,
	TrackLane3                               = 8,
	TrackLane4                               = 16,
	TrackLane5                               = 32,
	NumTrackLanes                            = 6,
};

// Enum PilgrimCoreRuntime.EBeatMarkerType
// NumValues: 0x0003
enum class EBeatMarkerType : uint8
{
	None                                     = 0,
	OnBeat                                   = 1,
	OnDownbeat                               = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimTrackType
// NumValues: 0x000A
enum class EPilgrimTrackType : uint8
{
	TrackGuitar                              = 0,
	TrackBass                                = 1,
	TrackVocals                              = 2,
	TrackDrum                                = 3,
	TrackPlasticGuitar                       = 4,
	TrackPlasticBass                         = 5,
	TrackPlasticDrum                         = 6,
	TrackEvents                              = 7,
	TrackNone                                = 8,
	NumTrackTypes                            = 8,
};

// Enum PilgrimCoreRuntime.EOverdriveScoringState
// NumValues: 0x0003
enum class EOverdriveScoringState : uint8
{
	None                                     = 0,
	FailedSection                            = 1,
	ActiveSection                            = 2,
};

// Enum PilgrimCoreRuntime.EMusicBattleProjectileType
// NumValues: 0x0005
enum class EMusicBattleProjectileType : uint8
{
	None                                     = 0,
	BeamSuccess                              = 1,
	BeamFailure                              = 2,
	BeamClash                                = 3,
	BothMiss                                 = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimSongDifficulty
// NumValues: 0x0006
enum class EPilgrimSongDifficulty : uint8
{
	DifficultyEasy                           = 0,
	DifficultyMedium                         = 1,
	DifficultyHard                           = 2,
	DifficultyExpert                         = 3,
	None                                     = 4,
	NumDifficulties                          = 5,
};

// Enum PilgrimCoreRuntime.EPilgrimSongPlayMethod
// NumValues: 0x0003
enum class EPilgrimSongPlayMethod : uint8
{
	Invalid                                  = 0,
	Streaming                                = 1,
	LocalMetasounds                          = 2,
};

// Enum PilgrimCoreRuntime.EMusicBattleEndReason
// NumValues: 0x0005
enum class EMusicBattleEndReason : uint8
{
	NoReason                                 = 0,
	CompletedNormally                        = 1,
	HardStopAndSkipPostGame                  = 2,
	HardStopAndContinueFlow                  = 3,
	RestartingSong                           = 4,
};

// Enum PilgrimCoreRuntime.EMusicBattleClientUpdate
// NumValues: 0x0004
enum class EMusicBattleClientUpdate : uint8
{
	SongFinished                             = 0,
	TearDownFinished                         = 1,
	StopAndSkipPostGame                      = 2,
	StopAndRestartSong                       = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimTimedInputType
// NumValues: 0x0003
enum class EPilgrimTimedInputType : uint8
{
	None                                     = 0,
	Lane                                     = 1,
	DeployOverdrive                          = 2,
};

// Enum PilgrimCoreRuntime.EMusicBattleType
// NumValues: 0x0005
enum class EMusicBattleType : uint8
{
	None                                     = 0,
	SinglePlayerLocalVs                      = 1,
	MultiplayerVs                            = 2,
	SinglePlayerSparks                       = 3,
	TeamQuickplay                            = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimLeaderboardType
// NumValues: 0x0008
enum class EPilgrimLeaderboardType : uint8
{
	SoloGuitar                               = 0,
	SoloBass                                 = 1,
	SoloVocals                               = 2,
	SoloDrum                                 = 3,
	BandDuo                                  = 4,
	BandTrio                                 = 5,
	BandQuad                                 = 6,
	Invalid                                  = 7,
};

// Enum PilgrimCoreRuntime.EPilgrimPlayerFeedSortType
// NumValues: 0x0004
enum class EPilgrimPlayerFeedSortType : uint8
{
	NewestScore                              = 0,
	OldestScore                              = 1,
	HighestScore                             = 2,
	LowestScore                              = 3,
};

// Enum PilgrimCoreRuntime.ESongShortNameMatchType
// NumValues: 0x0004
enum class ESongShortNameMatchType : uint8
{
	AlwaysMatch                              = 0,
	MatchAny                                 = 1,
	MatchAll                                 = 2,
	MatchNone                                = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimCantAddSongReason
// NumValues: 0x0007
enum class EPilgrimCantAddSongReason : uint8
{
	None                                     = 0,
	SetlistLocked                            = 1,
	SongAlreadyAdded                         = 2,
	PlayerHasAddedMaxSongs                   = 3,
	InvalidSongShortName                     = 4,
	MissingSong                              = 5,
	SongNotAvailable                         = 6,
};

// Enum PilgrimCoreRuntime.EPilgrimPlayerHistoryScoreParam
// NumValues: 0x0003
enum class EPilgrimPlayerHistoryScoreParam : uint8
{
	AllScores                                = 0,
	HigherScores                             = 1,
	LowerScores                              = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimStreamerStatus
// NumValues: 0x0007
enum class EPilgrimStreamerStatus : uint8
{
	Idle                                     = 0,
	DownloadingMidi                          = 1,
	Preparing                                = 2,
	Opening                                  = 3,
	Ready                                    = 4,
	Streaming                                = 5,
	Errored                                  = 6,
};

// Enum PilgrimCoreRuntime.EPilgrimStateMachineMessage
// NumValues: 0x0005
enum class EPilgrimStateMachineMessage : uint8
{
	None                                     = 0,
	Solo_PlayPreviousSong                    = 1,
	Solo_PlayNextSong                        = 2,
	Solo_LeaveStage                          = 3,
	Multiplayer_LeaveStage                   = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimAnalyticsSongEndReason
// NumValues: 0x0003
enum class EPilgrimAnalyticsSongEndReason : uint8
{
	SongFinished                             = 0,
	SongRestarted                            = 1,
	PlayerDisconnected                       = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimAnalyticsSongAccessScope
// NumValues: 0x0004
enum class EPilgrimAnalyticsSongAccessScope : uint8
{
	None                                     = 0,
	Player                                   = 1,
	Party                                    = 2,
	All                                      = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimAnalyticsResultsReturn
// NumValues: 0x0004
enum class EPilgrimAnalyticsResultsReturn : uint8
{
	None                                     = 0,
	LeaveToLobby                             = 1,
	LeaveStage                               = 2,
	LeaveStage_Timer                         = 3,
};

// Enum PilgrimCoreRuntime.EPresetLanesDifficulty
// NumValues: 0x0002
enum class EPresetLanesDifficulty : uint8
{
	General                                  = 4,
	Expert                                   = 5,
};

// Enum PilgrimCoreRuntime.EPilgrimGemInputState
// NumValues: 0x0004
enum class EPilgrimGemInputState : uint8
{
	GemHit                                   = 0,
	UserSwingAndMiss                         = 1,
	GemPassed                                = 2,
	NumGemInputStates                        = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimPersonalBestType
// NumValues: 0x0004
enum class EPilgrimPersonalBestType : uint8
{
	SoloScore                                = 0,
	BandScore                                = 1,
	SpotlightScore                           = 2,
	Invalid                                  = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimAccumulateStarsMessageType
// NumValues: 0x0003
enum class EPilgrimAccumulateStarsMessageType : uint8
{
	BandStars                                = 0,
	SoloStars                                = 1,
	Count                                    = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimAccumulateStarTypes
// NumValues: 0x0003
enum class EPilgrimAccumulateStarTypes : uint8
{
	None                                     = 0,
	Regular                                  = 1,
	Golden                                   = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimNoteEventMessageIncrementType
// NumValues: 0x0003
enum class EPilgrimNoteEventMessageIncrementType : uint8
{
	ByTime                                   = 0,
	ByValue                                  = 1,
	Count                                    = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimScoreEventMessageType
// NumValues: 0x0003
enum class EPilgrimScoreEventMessageType : uint8
{
	BandScore                                = 0,
	SoloScore                                = 1,
	Count                                    = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimScoreEventMessageIncrementType
// NumValues: 0x0004
enum class EPilgrimScoreEventMessageIncrementType : uint8
{
	ByScore                                  = 0,
	ByStars                                  = 1,
	ByValue                                  = 2,
	Count                                    = 3,
};

// Enum PilgrimCoreRuntime.EScoringMistakeType
// NumValues: 0x0002
enum class EScoringMistakeType : uint8
{
	Miss                                     = 0,
	Pass                                     = 1,
};

// Enum PilgrimCoreRuntime.EPilgrimScoringMode
// NumValues: 0x0002
enum class EPilgrimScoringMode : uint8
{
	IncludeModifiers                         = 0,
	ExcludeModifiers                         = 1,
};

// Enum PilgrimCoreRuntime.EPilgrimScoringTarget
// NumValues: 0x0006
enum class EPilgrimScoringTarget : uint8
{
	None                                     = 0,
	BaseGem                                  = 1,
	StreakMultiplier                         = 2,
	OverdriveMultiplier                      = 3,
	SustainPerBeat                           = 4,
	AccuracyMultiplier                       = 5,
};

// Enum PilgrimCoreRuntime.EPilgrimSongSortMethod
// NumValues: 0x0003
enum class EPilgrimSongSortMethod : uint8
{
	Artist                                   = 0,
	Title                                    = 1,
	Year                                     = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimSongSortDirection
// NumValues: 0x0002
enum class EPilgrimSongSortDirection : uint8
{
	Ascending                                = 0,
	Descending                               = 1,
};

// Enum PilgrimCoreRuntime.EWidgetTouchKbmControllerTransitionType
// NumValues: 0x0004
enum class EWidgetTouchKbmControllerTransitionType : uint8
{
	Opacity                                  = 0,
	Collapse                                 = 1,
	DoNothing                                = 2,
	Count                                    = 3,
};

// Enum PilgrimCoreRuntime.EComboType
// NumValues: 0x0003
enum class EComboType : uint8
{
	None                                     = 0,
	Full                                     = 1,
	Perfect                                  = 2,
};

// ScriptStruct PilgrimCoreRuntime.TrackItemInfo
// 0x0030 (0x0030 - 0x0000)
struct FTrackItemInfo final
{
public:
	int32                                         StartTick;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndTick;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumScorables;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Ms;                                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DurationMs;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DurationTicks;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             Track;                                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackLane                             Lane;                                              // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBeatMarkerType                               BeatType;                                          // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrackItemIndex;                                    // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverdriveGem;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverdriveSectionNum;                               // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEndOfOverdriveSection;                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHitOnPress;                                  // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHitOnRelease;                                // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSustain;                                        // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTrackItemInfo) == 0x000004, "Wrong alignment on FTrackItemInfo");
static_assert(sizeof(FTrackItemInfo) == 0x000030, "Wrong size on FTrackItemInfo");
static_assert(offsetof(FTrackItemInfo, StartTick) == 0x000000, "Member 'FTrackItemInfo::StartTick' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, EndTick) == 0x000004, "Member 'FTrackItemInfo::EndTick' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, NumScorables) == 0x000008, "Member 'FTrackItemInfo::NumScorables' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, Ms) == 0x00000C, "Member 'FTrackItemInfo::Ms' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, DurationMs) == 0x000010, "Member 'FTrackItemInfo::DurationMs' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, DurationTicks) == 0x000014, "Member 'FTrackItemInfo::DurationTicks' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, Track) == 0x000018, "Member 'FTrackItemInfo::Track' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, Lane) == 0x000019, "Member 'FTrackItemInfo::Lane' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, BeatType) == 0x00001A, "Member 'FTrackItemInfo::BeatType' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, TrackItemIndex) == 0x00001C, "Member 'FTrackItemInfo::TrackItemIndex' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, IsOverdriveGem) == 0x000020, "Member 'FTrackItemInfo::IsOverdriveGem' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, OverdriveSectionNum) == 0x000024, "Member 'FTrackItemInfo::OverdriveSectionNum' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, IsEndOfOverdriveSection) == 0x000028, "Member 'FTrackItemInfo::IsEndOfOverdriveSection' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, bAllowHitOnPress) == 0x000029, "Member 'FTrackItemInfo::bAllowHitOnPress' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, bAllowHitOnRelease) == 0x00002A, "Member 'FTrackItemInfo::bAllowHitOnRelease' has a wrong offset!");
static_assert(offsetof(FTrackItemInfo, bIsSustain) == 0x00002B, "Member 'FTrackItemInfo::bIsSustain' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimLeaderboardScoreData
// 0x0020 (0x0020 - 0x0000)
struct FPilgrimLeaderboardScoreData final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StarsEarned;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Accuracy;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFullCombo;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimSongDifficulty                        Difficulty;                                        // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPilgrimTrackType>                     InstrumentsPlayed;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimLeaderboardScoreData) == 0x000008, "Wrong alignment on FPilgrimLeaderboardScoreData");
static_assert(sizeof(FPilgrimLeaderboardScoreData) == 0x000020, "Wrong size on FPilgrimLeaderboardScoreData");
static_assert(offsetof(FPilgrimLeaderboardScoreData, Score) == 0x000000, "Member 'FPilgrimLeaderboardScoreData::Score' has a wrong offset!");
static_assert(offsetof(FPilgrimLeaderboardScoreData, StarsEarned) == 0x000004, "Member 'FPilgrimLeaderboardScoreData::StarsEarned' has a wrong offset!");
static_assert(offsetof(FPilgrimLeaderboardScoreData, Accuracy) == 0x000008, "Member 'FPilgrimLeaderboardScoreData::Accuracy' has a wrong offset!");
static_assert(offsetof(FPilgrimLeaderboardScoreData, bFullCombo) == 0x00000C, "Member 'FPilgrimLeaderboardScoreData::bFullCombo' has a wrong offset!");
static_assert(offsetof(FPilgrimLeaderboardScoreData, Difficulty) == 0x00000D, "Member 'FPilgrimLeaderboardScoreData::Difficulty' has a wrong offset!");
static_assert(offsetof(FPilgrimLeaderboardScoreData, InstrumentsPlayed) == 0x000010, "Member 'FPilgrimLeaderboardScoreData::InstrumentsPlayed' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimPlayerSessionHistory
// 0x0038 (0x0038 - 0x0000)
struct FPilgrimPlayerSessionHistory final
{
public:
	class FString                                 SessionId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              EndTime;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimLeaderboardScoreData           TrackedStats;                                      // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimPlayerSessionHistory) == 0x000008, "Wrong alignment on FPilgrimPlayerSessionHistory");
static_assert(sizeof(FPilgrimPlayerSessionHistory) == 0x000038, "Wrong size on FPilgrimPlayerSessionHistory");
static_assert(offsetof(FPilgrimPlayerSessionHistory, SessionId) == 0x000000, "Member 'FPilgrimPlayerSessionHistory::SessionId' has a wrong offset!");
static_assert(offsetof(FPilgrimPlayerSessionHistory, EndTime) == 0x000010, "Member 'FPilgrimPlayerSessionHistory::EndTime' has a wrong offset!");
static_assert(offsetof(FPilgrimPlayerSessionHistory, TrackedStats) == 0x000018, "Member 'FPilgrimPlayerSessionHistory::TrackedStats' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimGameProgress
// 0x006C (0x006C - 0x0000)
struct FPilgrimGameProgress final
{
public:
	int32                                         NumHits;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumMisses;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPasses;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFullCombo;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPerfectCombo;                                  // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentTick;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NoteStreak;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentScore;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentModifierBonus;                              // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentStar;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextStarProgress;                                  // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StreakScoreMultiplier;                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NotesPastLastMultiplier;                           // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NotesToNextMultiplier;                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentHealth;                                     // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverdriveActive;                                 // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentOverdrive;                                  // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentOverdriveSectionNum;                        // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandScoreContribution;                             // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandModifierBonusContribution;                     // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOverdriveScoringState                        OverdriveScoringState;                             // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxScore;                                          // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAtMaxStreak;                                    // 0x0054(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentSustainScore;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentChordScore;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverdriveTime;                                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPerfects;                                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x4];                                       // 0x0068(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPilgrimGameProgress) == 0x000004, "Wrong alignment on FPilgrimGameProgress");
static_assert(sizeof(FPilgrimGameProgress) == 0x00006C, "Wrong size on FPilgrimGameProgress");
static_assert(offsetof(FPilgrimGameProgress, NumHits) == 0x000000, "Member 'FPilgrimGameProgress::NumHits' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NumMisses) == 0x000004, "Member 'FPilgrimGameProgress::NumMisses' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NumPasses) == 0x000008, "Member 'FPilgrimGameProgress::NumPasses' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, bHasFullCombo) == 0x00000C, "Member 'FPilgrimGameProgress::bHasFullCombo' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, bHasPerfectCombo) == 0x00000D, "Member 'FPilgrimGameProgress::bHasPerfectCombo' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentTick) == 0x000010, "Member 'FPilgrimGameProgress::CurrentTick' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NoteStreak) == 0x000014, "Member 'FPilgrimGameProgress::NoteStreak' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentScore) == 0x000018, "Member 'FPilgrimGameProgress::CurrentScore' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentModifierBonus) == 0x00001C, "Member 'FPilgrimGameProgress::CurrentModifierBonus' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentStar) == 0x000020, "Member 'FPilgrimGameProgress::CurrentStar' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NextStarProgress) == 0x000024, "Member 'FPilgrimGameProgress::NextStarProgress' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, StreakScoreMultiplier) == 0x000028, "Member 'FPilgrimGameProgress::StreakScoreMultiplier' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NotesPastLastMultiplier) == 0x00002C, "Member 'FPilgrimGameProgress::NotesPastLastMultiplier' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NotesToNextMultiplier) == 0x000030, "Member 'FPilgrimGameProgress::NotesToNextMultiplier' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentHealth) == 0x000034, "Member 'FPilgrimGameProgress::CurrentHealth' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, IsOverdriveActive) == 0x000038, "Member 'FPilgrimGameProgress::IsOverdriveActive' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentOverdrive) == 0x00003C, "Member 'FPilgrimGameProgress::CurrentOverdrive' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentOverdriveSectionNum) == 0x000040, "Member 'FPilgrimGameProgress::CurrentOverdriveSectionNum' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, BandScoreContribution) == 0x000044, "Member 'FPilgrimGameProgress::BandScoreContribution' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, BandModifierBonusContribution) == 0x000048, "Member 'FPilgrimGameProgress::BandModifierBonusContribution' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, OverdriveScoringState) == 0x00004C, "Member 'FPilgrimGameProgress::OverdriveScoringState' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, MaxScore) == 0x000050, "Member 'FPilgrimGameProgress::MaxScore' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, bIsAtMaxStreak) == 0x000054, "Member 'FPilgrimGameProgress::bIsAtMaxStreak' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentSustainScore) == 0x000058, "Member 'FPilgrimGameProgress::CurrentSustainScore' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, CurrentChordScore) == 0x00005C, "Member 'FPilgrimGameProgress::CurrentChordScore' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, OverdriveTime) == 0x000060, "Member 'FPilgrimGameProgress::OverdriveTime' has a wrong offset!");
static_assert(offsetof(FPilgrimGameProgress, NumPerfects) == 0x000064, "Member 'FPilgrimGameProgress::NumPerfects' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_MBI_EventBase
// 0x0008 (0x0008 - 0x0000)
struct FPilgrimEvent_MBI_EventBase
{
public:
	TWeakObjectPtr<class APilgrimMusicBattleInstance> MusicBattleInstance;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_MBI_EventBase) == 0x000004, "Wrong alignment on FPilgrimEvent_MBI_EventBase");
static_assert(sizeof(FPilgrimEvent_MBI_EventBase) == 0x000008, "Wrong size on FPilgrimEvent_MBI_EventBase");
static_assert(offsetof(FPilgrimEvent_MBI_EventBase, MusicBattleInstance) == 0x000000, "Member 'FPilgrimEvent_MBI_EventBase::MusicBattleInstance' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimMusicBattlePlayerState
// 0x00B8 (0x00B8 - 0x0000)
struct FPilgrimMusicBattlePlayerState final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Team;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InstrumentTags;                                    // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimGameProgress>           ScoreUpdateHistory;                                // 0x0030(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexProcessed;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexReceived;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimGameProgress                   PilgrimGameProgress;                               // 0x0048(0x006C)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPilgrimMusicBattlePlayerState) == 0x000008, "Wrong alignment on FPilgrimMusicBattlePlayerState");
static_assert(sizeof(FPilgrimMusicBattlePlayerState) == 0x0000B8, "Wrong size on FPilgrimMusicBattlePlayerState");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, PlayerState) == 0x000000, "Member 'FPilgrimMusicBattlePlayerState::PlayerState' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, Team) == 0x000008, "Member 'FPilgrimMusicBattlePlayerState::Team' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, TrackType) == 0x000009, "Member 'FPilgrimMusicBattlePlayerState::TrackType' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, InstrumentTags) == 0x000010, "Member 'FPilgrimMusicBattlePlayerState::InstrumentTags' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, ScoreUpdateHistory) == 0x000030, "Member 'FPilgrimMusicBattlePlayerState::ScoreUpdateHistory' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, LastPlayableIndexProcessed) == 0x000040, "Member 'FPilgrimMusicBattlePlayerState::LastPlayableIndexProcessed' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, LastPlayableIndexReceived) == 0x000044, "Member 'FPilgrimMusicBattlePlayerState::LastPlayableIndexReceived' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattlePlayerState, PilgrimGameProgress) == 0x000048, "Member 'FPilgrimMusicBattlePlayerState::PilgrimGameProgress' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimBandState
// 0x002C (0x002C - 0x0000)
struct FPilgrimBandState final
{
public:
	float                                         BandHealth;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandScore;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandModifierBonus;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentScoreFromOverdrive;                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalScoreFromOverdrive;                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BandStar;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextBandStarProgress;                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandVarietyBonus;                                  // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseBandScore;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BandMultiplier;                                    // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllPlayersHaveMaxStreak;                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllPlayersHaveOverdriveReady;                     // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllPlayersHaveOverdriveActive;                    // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyPlayersHaveOverdriveActive;                    // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimBandState) == 0x000004, "Wrong alignment on FPilgrimBandState");
static_assert(sizeof(FPilgrimBandState) == 0x00002C, "Wrong size on FPilgrimBandState");
static_assert(offsetof(FPilgrimBandState, BandHealth) == 0x000000, "Member 'FPilgrimBandState::BandHealth' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, BandScore) == 0x000004, "Member 'FPilgrimBandState::BandScore' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, BandModifierBonus) == 0x000008, "Member 'FPilgrimBandState::BandModifierBonus' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, CurrentScoreFromOverdrive) == 0x00000C, "Member 'FPilgrimBandState::CurrentScoreFromOverdrive' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, TotalScoreFromOverdrive) == 0x000010, "Member 'FPilgrimBandState::TotalScoreFromOverdrive' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, BandStar) == 0x000014, "Member 'FPilgrimBandState::BandStar' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, NextBandStarProgress) == 0x000018, "Member 'FPilgrimBandState::NextBandStarProgress' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, BandVarietyBonus) == 0x00001C, "Member 'FPilgrimBandState::BandVarietyBonus' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, BaseBandScore) == 0x000020, "Member 'FPilgrimBandState::BaseBandScore' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, BandMultiplier) == 0x000024, "Member 'FPilgrimBandState::BandMultiplier' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, bAllPlayersHaveMaxStreak) == 0x000028, "Member 'FPilgrimBandState::bAllPlayersHaveMaxStreak' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, bAllPlayersHaveOverdriveReady) == 0x000029, "Member 'FPilgrimBandState::bAllPlayersHaveOverdriveReady' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, bAllPlayersHaveOverdriveActive) == 0x00002A, "Member 'FPilgrimBandState::bAllPlayersHaveOverdriveActive' has a wrong offset!");
static_assert(offsetof(FPilgrimBandState, bAnyPlayersHaveOverdriveActive) == 0x00002B, "Member 'FPilgrimBandState::bAnyPlayersHaveOverdriveActive' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimMusicBattleData
// 0x0048 (0x0048 - 0x0000)
struct FPilgrimMusicBattleData final
{
public:
	TArray<struct FPilgrimMusicBattlePlayerState> MusicBattleStates;                                 // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexProcessed;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexReceived;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimBandState                      BandState;                                         // 0x0018(0x002C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPilgrimMusicBattleData) == 0x000008, "Wrong alignment on FPilgrimMusicBattleData");
static_assert(sizeof(FPilgrimMusicBattleData) == 0x000048, "Wrong size on FPilgrimMusicBattleData");
static_assert(offsetof(FPilgrimMusicBattleData, MusicBattleStates) == 0x000000, "Member 'FPilgrimMusicBattleData::MusicBattleStates' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattleData, LastPlayableIndexProcessed) == 0x000010, "Member 'FPilgrimMusicBattleData::LastPlayableIndexProcessed' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattleData, LastPlayableIndexReceived) == 0x000014, "Member 'FPilgrimMusicBattleData::LastPlayableIndexReceived' has a wrong offset!");
static_assert(offsetof(FPilgrimMusicBattleData, BandState) == 0x000018, "Member 'FPilgrimMusicBattleData::BandState' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_MBI_CVarEnableTraversalChanged
// 0x0001 (0x0001 - 0x0000)
struct FPilgrimEvent_MBI_CVarEnableTraversalChanged final
{
public:
	bool                                          EnabledTraversal;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_MBI_CVarEnableTraversalChanged) == 0x000001, "Wrong alignment on FPilgrimEvent_MBI_CVarEnableTraversalChanged");
static_assert(sizeof(FPilgrimEvent_MBI_CVarEnableTraversalChanged) == 0x000001, "Wrong size on FPilgrimEvent_MBI_CVarEnableTraversalChanged");
static_assert(offsetof(FPilgrimEvent_MBI_CVarEnableTraversalChanged, EnabledTraversal) == 0x000000, "Member 'FPilgrimEvent_MBI_CVarEnableTraversalChanged::EnabledTraversal' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimTrackTypesStateMembership
// 0x00A0 (0x00A0 - 0x0000)
struct FPilgrimTrackTypesStateMembership final
{
public:
	TSet<EPilgrimTrackType>                       TrackTypesInState;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSet<EPilgrimTrackType>                       TrackTypesNotInState;                              // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimTrackTypesStateMembership) == 0x000008, "Wrong alignment on FPilgrimTrackTypesStateMembership");
static_assert(sizeof(FPilgrimTrackTypesStateMembership) == 0x0000A0, "Wrong size on FPilgrimTrackTypesStateMembership");
static_assert(offsetof(FPilgrimTrackTypesStateMembership, TrackTypesInState) == 0x000000, "Member 'FPilgrimTrackTypesStateMembership::TrackTypesInState' has a wrong offset!");
static_assert(offsetof(FPilgrimTrackTypesStateMembership, TrackTypesNotInState) == 0x000050, "Member 'FPilgrimTrackTypesStateMembership::TrackTypesNotInState' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_BandState_OverdriveReadyTrackTypesChanged
// 0x00A0 (0x00A0 - 0x0000)
struct FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged final
{
public:
	struct FPilgrimTrackTypesStateMembership      Membership;                                        // 0x0000(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged) == 0x000008, "Wrong alignment on FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged");
static_assert(sizeof(FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged) == 0x0000A0, "Wrong size on FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged");
static_assert(offsetof(FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged, Membership) == 0x000000, "Member 'FPilgrimEvent_BandState_OverdriveReadyTrackTypesChanged::Membership' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.MusicBattleSinglePlayerOptions
// 0x0008 (0x0008 - 0x0000)
struct FMusicBattleSinglePlayerOptions final
{
public:
	bool                                          bOpponentFiresBack;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OpponentGemSuccessRate;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMusicBattleSinglePlayerOptions) == 0x000004, "Wrong alignment on FMusicBattleSinglePlayerOptions");
static_assert(sizeof(FMusicBattleSinglePlayerOptions) == 0x000008, "Wrong size on FMusicBattleSinglePlayerOptions");
static_assert(offsetof(FMusicBattleSinglePlayerOptions, bOpponentFiresBack) == 0x000000, "Member 'FMusicBattleSinglePlayerOptions::bOpponentFiresBack' has a wrong offset!");
static_assert(offsetof(FMusicBattleSinglePlayerOptions, OpponentGemSuccessRate) == 0x000004, "Member 'FMusicBattleSinglePlayerOptions::OpponentGemSuccessRate' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_BandState_OverdriveReadyChanged
// 0x0010 (0x0010 - 0x0000)
struct FPilgrimEvent_BandState_OverdriveReadyChanged final
{
public:
	bool                                          IsReady;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        ForPlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_BandState_OverdriveReadyChanged) == 0x000008, "Wrong alignment on FPilgrimEvent_BandState_OverdriveReadyChanged");
static_assert(sizeof(FPilgrimEvent_BandState_OverdriveReadyChanged) == 0x000010, "Wrong size on FPilgrimEvent_BandState_OverdriveReadyChanged");
static_assert(offsetof(FPilgrimEvent_BandState_OverdriveReadyChanged, IsReady) == 0x000000, "Member 'FPilgrimEvent_BandState_OverdriveReadyChanged::IsReady' has a wrong offset!");
static_assert(offsetof(FPilgrimEvent_BandState_OverdriveReadyChanged, ForPlayer) == 0x000008, "Member 'FPilgrimEvent_BandState_OverdriveReadyChanged::ForPlayer' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_BandState_AllMaxStreakChanged
// 0x0001 (0x0001 - 0x0000)
struct FPilgrimEvent_BandState_AllMaxStreakChanged final
{
public:
	bool                                          bAllPlayersHaveMaxStreak;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_BandState_AllMaxStreakChanged) == 0x000001, "Wrong alignment on FPilgrimEvent_BandState_AllMaxStreakChanged");
static_assert(sizeof(FPilgrimEvent_BandState_AllMaxStreakChanged) == 0x000001, "Wrong size on FPilgrimEvent_BandState_AllMaxStreakChanged");
static_assert(offsetof(FPilgrimEvent_BandState_AllMaxStreakChanged, bAllPlayersHaveMaxStreak) == 0x000000, "Member 'FPilgrimEvent_BandState_AllMaxStreakChanged::bAllPlayersHaveMaxStreak' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_Base
// 0x0014 (0x0014 - 0x0000)
struct FPilgrimEvent_Midi_Base
{
public:
	EPilgrimTrackType                             TrackType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AtMidiTick;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndsAtMidiTick;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UPilgrimGame>            PilgrimGameContext;                                // 0x000C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_Midi_Base) == 0x000004, "Wrong alignment on FPilgrimEvent_Midi_Base");
static_assert(sizeof(FPilgrimEvent_Midi_Base) == 0x000014, "Wrong size on FPilgrimEvent_Midi_Base");
static_assert(offsetof(FPilgrimEvent_Midi_Base, TrackType) == 0x000000, "Member 'FPilgrimEvent_Midi_Base::TrackType' has a wrong offset!");
static_assert(offsetof(FPilgrimEvent_Midi_Base, AtMidiTick) == 0x000004, "Member 'FPilgrimEvent_Midi_Base::AtMidiTick' has a wrong offset!");
static_assert(offsetof(FPilgrimEvent_Midi_Base, EndsAtMidiTick) == 0x000008, "Member 'FPilgrimEvent_Midi_Base::EndsAtMidiTick' has a wrong offset!");
static_assert(offsetof(FPilgrimEvent_Midi_Base, PilgrimGameContext) == 0x00000C, "Member 'FPilgrimEvent_Midi_Base::PilgrimGameContext' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_TextBase
// 0x0024 (0x0038 - 0x0014)
struct FPilgrimEvent_Midi_TextBase : public FPilgrimEvent_Midi_Base
{
public:
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EventString;                                       // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         EventPayload;                                      // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimEvent_Midi_TextBase) == 0x000008, "Wrong alignment on FPilgrimEvent_Midi_TextBase");
static_assert(sizeof(FPilgrimEvent_Midi_TextBase) == 0x000038, "Wrong size on FPilgrimEvent_Midi_TextBase");
static_assert(offsetof(FPilgrimEvent_Midi_TextBase, EventString) == 0x000018, "Member 'FPilgrimEvent_Midi_TextBase::EventString' has a wrong offset!");
static_assert(offsetof(FPilgrimEvent_Midi_TextBase, EventPayload) == 0x000028, "Member 'FPilgrimEvent_Midi_TextBase::EventPayload' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_TextVocals
// 0x0000 (0x0038 - 0x0038)
struct FPilgrimEvent_Midi_TextVocals : public FPilgrimEvent_Midi_TextBase
{
};
static_assert(alignof(FPilgrimEvent_Midi_TextVocals) == 0x000008, "Wrong alignment on FPilgrimEvent_Midi_TextVocals");
static_assert(sizeof(FPilgrimEvent_Midi_TextVocals) == 0x000038, "Wrong size on FPilgrimEvent_Midi_TextVocals");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_TextVocals_Start
// 0x0000 (0x0038 - 0x0038)
struct FPilgrimEvent_Midi_TextVocals_Start final : public FPilgrimEvent_Midi_TextVocals
{
};
static_assert(alignof(FPilgrimEvent_Midi_TextVocals_Start) == 0x000008, "Wrong alignment on FPilgrimEvent_Midi_TextVocals_Start");
static_assert(sizeof(FPilgrimEvent_Midi_TextVocals_Start) == 0x000038, "Wrong size on FPilgrimEvent_Midi_TextVocals_Start");

// ScriptStruct PilgrimCoreRuntime.PilgrimPlayerFeedSongSummary
// 0x0018 (0x0018 - 0x0000)
struct FPilgrimPlayerFeedSongSummary final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 EntryIndexes;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPilgrimPlayerFeedSongSummary) == 0x000008, "Wrong alignment on FPilgrimPlayerFeedSongSummary");
static_assert(sizeof(FPilgrimPlayerFeedSongSummary) == 0x000018, "Wrong size on FPilgrimPlayerFeedSongSummary");
static_assert(offsetof(FPilgrimPlayerFeedSongSummary, SongShortName) == 0x000000, "Member 'FPilgrimPlayerFeedSongSummary::SongShortName' has a wrong offset!");
static_assert(offsetof(FPilgrimPlayerFeedSongSummary, EntryIndexes) == 0x000008, "Member 'FPilgrimPlayerFeedSongSummary::EntryIndexes' has a wrong offset!");

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Scoring_FullComboLost
// 0x0010 (0x0010 - 0x0000)
struct FPilgrimEvent_Scoring_FullComboLost final
{
public:
