#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimEventScreenEventVaultWorld

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.ExecuteUbergraph_PilgrimEventScreenEventVaultWorld
// 0x00E8 (0x00E8 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayForward;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBackgroundIntensityLevel                     K2Node_Event_IntensityTransition;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UTexture2D*                       K2Node_Event_LoadedBackgroundTexture;              // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVaultWorldBackgroundData              K2Node_Event_BackgroundInfo;                       // 0x0010(0x0058)(ConstParm)
	bool                                          K2Node_Event_bShowFloor;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowEffects;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowItemDetails;                     // 0x006A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MaterialIndex;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundForward_PreTransitionOffset_ImplicitCast; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundForward_PreTransitionOffset_ImplicitCast_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundForward_Forward_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundForward_Forward_ImplicitCast_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundBackward_FXTransitionFade_ImplicitCast; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundBackward_FXTransitionFade_ImplicitCast_1; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundBackward_PreTransitionOffset_ImplicitCast; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundBackward_PreTransitionOffset_ImplicitCast_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundBackward_Backward_ImplicitCast; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TransitionBackgroundBackward_Backward_ImplicitCast_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld) == 0x000008, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld) == 0x0000E8, "Wrong size on PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, EntryPoint) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::EntryPoint' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_bPlayForward) == 0x000004, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_bPlayForward' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_IntensityTransition) == 0x000005, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_IntensityTransition' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_Not_PreBool_ReturnValue_1) == 0x000007, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_LoadedBackgroundTexture) == 0x000008, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_LoadedBackgroundTexture' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_BackgroundInfo) == 0x000010, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_BackgroundInfo' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_bShowFloor) == 0x000068, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_bShowFloor' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_bShowEffects) == 0x000069, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_bShowEffects' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_bShowItemDetails) == 0x00006A, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_bShowItemDetails' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_Not_PreBool_ReturnValue_2) == 0x00006B, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, K2Node_Event_MaterialIndex) == 0x00006C, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::K2Node_Event_MaterialIndex' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000070, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_SelectFloat_ReturnValue) == 0x000078, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast) == 0x000080, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast_1) == 0x000088, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundForward_PreTransitionOffset_ImplicitCast) == 0x000090, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundForward_PreTransitionOffset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundForward_PreTransitionOffset_ImplicitCast_1) == 0x000098, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundForward_PreTransitionOffset_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundForward_Forward_ImplicitCast) == 0x0000A0, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundForward_Forward_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundForward_Forward_ImplicitCast_1) == 0x0000A8, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundForward_Forward_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundBackward_FXTransitionFade_ImplicitCast) == 0x0000B0, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundBackward_FXTransitionFade_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundBackward_FXTransitionFade_ImplicitCast_1) == 0x0000B8, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundBackward_FXTransitionFade_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundBackward_PreTransitionOffset_ImplicitCast) == 0x0000C0, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundBackward_PreTransitionOffset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundBackward_PreTransitionOffset_ImplicitCast_1) == 0x0000C8, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundBackward_PreTransitionOffset_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundBackward_Backward_ImplicitCast) == 0x0000D0, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundBackward_Backward_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_TransitionBackgroundBackward_Backward_ImplicitCast_1) == 0x0000D8, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_TransitionBackgroundBackward_Backward_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000E0, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000E4, "Member 'PilgrimEventScreenEventVaultWorld_C_ExecuteUbergraph_PilgrimEventScreenEventVaultWorld::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.OnSetupBackground
// 0x0060 (0x0060 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_OnSetupBackground final
{
public:
	const class UTexture2D*                       LoadedBackgroundTexture;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVaultWorldBackgroundData              BackgroundInfo;                                    // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_OnSetupBackground) == 0x000008, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_OnSetupBackground");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_OnSetupBackground) == 0x000060, "Wrong size on PilgrimEventScreenEventVaultWorld_C_OnSetupBackground");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnSetupBackground, LoadedBackgroundTexture) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_OnSetupBackground::LoadedBackgroundTexture' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnSetupBackground, BackgroundInfo) == 0x000008, "Member 'PilgrimEventScreenEventVaultWorld_C_OnSetupBackground::BackgroundInfo' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.OnTransitionBackground
// 0x0002 (0x0002 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground final
{
public:
	bool                                          bPlayForward;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBackgroundIntensityLevel                     IntensityTransition;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground) == 0x000001, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground) == 0x000002, "Wrong size on PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground, bPlayForward) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground::bPlayForward' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground, IntensityTransition) == 0x000001, "Member 'PilgrimEventScreenEventVaultWorld_C_OnTransitionBackground::IntensityTransition' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.OnTransitionItemDetails
// 0x0001 (0x0001 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails final
{
public:
	bool                                          bShowItemDetails;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails) == 0x000001, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails) == 0x000001, "Wrong size on PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails, bShowItemDetails) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_OnTransitionItemDetails::bShowItemDetails' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.OnUpdateDisplay
// 0x0002 (0x0002 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay final
{
public:
	bool                                          bShowFloor;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowEffects;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay) == 0x000001, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay) == 0x000002, "Wrong size on PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay, bShowFloor) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay::bShowFloor' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay, bShowEffects) == 0x000001, "Member 'PilgrimEventScreenEventVaultWorld_C_OnUpdateDisplay::bShowEffects' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.OnUpdateMaterialIndex
// 0x0004 (0x0004 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex) == 0x000004, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex) == 0x000004, "Wrong size on PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex, MaterialIndex) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_OnUpdateMaterialIndex::MaterialIndex' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.SetupBackgroundMaterial
// 0x00A0 (0x00A0 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial final
{
public:
	class UTexture2D*                             TextureBackground;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FVaultWorldBackgroundData              BackgroundInfo;                                    // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial) == 0x000008, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial) == 0x0000A0, "Wrong size on PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, TextureBackground) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::TextureBackground' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, BackgroundInfo) == 0x000008, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::BackgroundInfo' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Mid) == 0x000060, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Mid' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable) == 0x000068, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_1) == 0x000070, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable) == 0x000074, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_2) == 0x000078, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_3) == 0x00007C, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_1) == 0x000080, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default) == 0x000084, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_1) == 0x000088, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_4) == 0x00008C, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_name_Variable_5) == 0x000090, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, Temp_bool_Variable_2) == 0x000094, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial, K2Node_Select_Default_2) == 0x000098, "Member 'PilgrimEventScreenEventVaultWorld_C_SetupBackgroundMaterial::K2Node_Select_Default_2' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.TransitionBackgroundBackward
// 0x0088 (0x0088 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward final
{
public:
	double                                        Backward;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreTransitionOffset;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FXTransitionFade;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_6;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_7;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward) == 0x000008, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward) == 0x000088, "Wrong size on PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, Backward) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::Backward' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, PreTransitionOffset) == 0x000008, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::PreTransitionOffset' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, FXTransitionFade) == 0x000010, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::FXTransitionFade' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, Mid) == 0x000018, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::Mid' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_1) == 0x000028, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_2) == 0x000030, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_3) == 0x000038, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_4) == 0x000040, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_5) == 0x000048, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_6) == 0x000050, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_Lerp_ReturnValue_7) == 0x000058, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000064, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000068, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00006C, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000070, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000074, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000078, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x00007C, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000080, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x000084, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundBackward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.TransitionBackgroundForward
// 0x0088 (0x0088 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward final
{
public:
	double                                        Forward;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreTransitionOffset;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FXTransitionFade;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_5;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_6;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_7;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward) == 0x000008, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward) == 0x000088, "Wrong size on PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, Forward) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::Forward' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, PreTransitionOffset) == 0x000008, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::PreTransitionOffset' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, FXTransitionFade) == 0x000010, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::FXTransitionFade' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, Mid) == 0x000018, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::Mid' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_1) == 0x000028, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_2) == 0x000030, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_3) == 0x000038, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_4) == 0x000040, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_5) == 0x000048, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_6) == 0x000050, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_Lerp_ReturnValue_7) == 0x000058, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000064, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000068, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00006C, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000070, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000074, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000078, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x00007C, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000080, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x000084, "Member 'PilgrimEventScreenEventVaultWorld_C_TransitionBackgroundForward::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");

// Function PilgrimEventScreenEventVaultWorld.PilgrimEventScreenEventVaultWorld_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct PilgrimEventScreenEventVaultWorld_C_UserConstructionScript final
{
public:
	class AFortStaticMeshActor*                   K2Node_DynamicCast_AsFort_Static_Mesh_Actor;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PilgrimEventScreenEventVaultWorld_C_UserConstructionScript) == 0x000008, "Wrong alignment on PilgrimEventScreenEventVaultWorld_C_UserConstructionScript");
static_assert(sizeof(PilgrimEventScreenEventVaultWorld_C_UserConstructionScript) == 0x000010, "Wrong size on PilgrimEventScreenEventVaultWorld_C_UserConstructionScript");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_UserConstructionScript, K2Node_DynamicCast_AsFort_Static_Mesh_Actor) == 0x000000, "Member 'PilgrimEventScreenEventVaultWorld_C_UserConstructionScript::K2Node_DynamicCast_AsFort_Static_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(PilgrimEventScreenEventVaultWorld_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'PilgrimEventScreenEventVaultWorld_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

