#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimQPSharedRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum PilgrimQPSharedRuntime.EPilgrimQuickplayState
// NumValues: 0x0009
enum class EPilgrimQuickplayState : uint8
{
	Invalid                                  = 0,
	Loading                                  = 1,
	Pregame                                  = 2,
	Preintro                                 = 3,
	Intro                                    = 4,
	SongGameplay                             = 5,
	Outro                                    = 6,
	SongResults                              = 7,
	SetResults                               = 8,
};

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_Base
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FPilgrimEvent_QuickplayState_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EPilgrimQuickplayState                        StateId;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPilgrimEvent_QuickplayState_Base) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_Base");
static_assert(sizeof(FPilgrimEvent_QuickplayState_Base) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_Base");
static_assert(offsetof(FPilgrimEvent_QuickplayState_Base, StateId) == 0x000008, "Member 'FPilgrimEvent_QuickplayState_Base::StateId' has a wrong offset!");

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_Began
// 0x0000 (0x0010 - 0x0010)
struct FPilgrimEvent_QuickplayState_Began : public FPilgrimEvent_QuickplayState_Base
{
};
static_assert(alignof(FPilgrimEvent_QuickplayState_Began) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_Began");
static_assert(sizeof(FPilgrimEvent_QuickplayState_Began) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_Began");

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_BeganClient
// 0x0000 (0x0010 - 0x0010)
struct FPilgrimEvent_QuickplayState_BeganClient final : public FPilgrimEvent_QuickplayState_Began
{
};
static_assert(alignof(FPilgrimEvent_QuickplayState_BeganClient) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_BeganClient");
static_assert(sizeof(FPilgrimEvent_QuickplayState_BeganClient) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_BeganClient");

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_BeganServer
// 0x0000 (0x0010 - 0x0010)
struct FPilgrimEvent_QuickplayState_BeganServer final : public FPilgrimEvent_QuickplayState_Began
{
};
static_assert(alignof(FPilgrimEvent_QuickplayState_BeganServer) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_BeganServer");
static_assert(sizeof(FPilgrimEvent_QuickplayState_BeganServer) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_BeganServer");

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_Ended
// 0x0000 (0x0010 - 0x0010)
struct FPilgrimEvent_QuickplayState_Ended : public FPilgrimEvent_QuickplayState_Base
{
};
static_assert(alignof(FPilgrimEvent_QuickplayState_Ended) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_Ended");
static_assert(sizeof(FPilgrimEvent_QuickplayState_Ended) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_Ended");

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_EndedClient
// 0x0000 (0x0010 - 0x0010)
struct FPilgrimEvent_QuickplayState_EndedClient final : public FPilgrimEvent_QuickplayState_Ended
{
};
static_assert(alignof(FPilgrimEvent_QuickplayState_EndedClient) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_EndedClient");
static_assert(sizeof(FPilgrimEvent_QuickplayState_EndedClient) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_EndedClient");

// ScriptStruct PilgrimQPSharedRuntime.PilgrimEvent_QuickplayState_EndedServer
// 0x0000 (0x0010 - 0x0010)
struct FPilgrimEvent_QuickplayState_EndedServer final : public FPilgrimEvent_QuickplayState_Ended
{
};
static_assert(alignof(FPilgrimEvent_QuickplayState_EndedServer) == 0x000008, "Wrong alignment on FPilgrimEvent_QuickplayState_EndedServer");
static_assert(sizeof(FPilgrimEvent_QuickplayState_EndedServer) == 0x000010, "Wrong size on FPilgrimEvent_QuickplayState_EndedServer");

}

