#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PinModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PinModal.PinModal_C
// 0x0178 (0x0798 - 0x0620)
class UPinModal_C final : public UFortPinModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bad;                                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_INPUTBOX;                                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_WIREFRAME2;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_AboutRatings;                               // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Close_1;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CabinLayout;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       CabinSwitcher;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DefaultLayout;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Good;                                              // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GradientForFlipping;                               // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_0;                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_1;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_2;                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_3;                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_4;                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_5;                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_6;                           // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_7;                           // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_8;                           // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       Hidden_PasscodeButton_9;                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              InfoSwitcher;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_0;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_1;                                  // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_2;                                  // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_3;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_4;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_5;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_6;                                  // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_7;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_8;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPinCodeButton_C*                       PasscodeButton_9;                                  // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGate_PurchaseInfo_C*       PurchaseInfo;                                      // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_UnlockInfo;                           // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              StateSwitcher;                                     // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubHeaderText;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Waiting;                                           // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPinModalValidityState                        Preview_Pin_State;                                 // 0x0758(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x3];                                      // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RequestingColor;                                   // 0x075C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SuccessColor;                                      // 0x076C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InvalidColor;                                      // 0x077C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      CachedGameActivity;                                // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__PinModal_Button_AboutRatings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__PinModal_Button_Close_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnDeactivated();
	TArray<class UFortPinButton*> CollectPinButtons();
	void ExecuteUbergraph_PinModal(int32 EntryPoint);
	void OnSetPinState(const EPinModalValidityState PinModalState);
	void OnShowCabinModeLayout(bool bIsInCabinMode);
	void PreConstruct(bool IsDesignTime);
	void Set_Visual_States(EPinModalValidityState Pin_States);
	void SetPinButtonNumbers();
	void SetupPurchaseRequest(const class UFortStoreFrontOfferInfo* OfferInfo);
	void SetupSqueegeeWidgets(class UFortGameActivity* GameActivity);
	void UpdateAboutRatingsButtonVisibility(class UFortGameActivity* GameActivity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PinModal_C">();
	}
	static class UPinModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPinModal_C>();
	}
};
static_assert(alignof(UPinModal_C) == 0x000008, "Wrong alignment on UPinModal_C");
static_assert(sizeof(UPinModal_C) == 0x000798, "Wrong size on UPinModal_C");
static_assert(offsetof(UPinModal_C, UberGraphFrame) == 0x000620, "Member 'UPinModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Bad) == 0x000628, "Member 'UPinModal_C::Bad' has a wrong offset!");
static_assert(offsetof(UPinModal_C, BG_INPUTBOX) == 0x000630, "Member 'UPinModal_C::BG_INPUTBOX' has a wrong offset!");
static_assert(offsetof(UPinModal_C, BG_WIREFRAME2) == 0x000638, "Member 'UPinModal_C::BG_WIREFRAME2' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Border) == 0x000640, "Member 'UPinModal_C::Border' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Button_AboutRatings) == 0x000648, "Member 'UPinModal_C::Button_AboutRatings' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Button_Close_1) == 0x000650, "Member 'UPinModal_C::Button_Close_1' has a wrong offset!");
static_assert(offsetof(UPinModal_C, CabinLayout) == 0x000658, "Member 'UPinModal_C::CabinLayout' has a wrong offset!");
static_assert(offsetof(UPinModal_C, CabinSwitcher) == 0x000660, "Member 'UPinModal_C::CabinSwitcher' has a wrong offset!");
static_assert(offsetof(UPinModal_C, DefaultLayout) == 0x000668, "Member 'UPinModal_C::DefaultLayout' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Good) == 0x000670, "Member 'UPinModal_C::Good' has a wrong offset!");
static_assert(offsetof(UPinModal_C, GradientForFlipping) == 0x000678, "Member 'UPinModal_C::GradientForFlipping' has a wrong offset!");
static_assert(offsetof(UPinModal_C, HeaderText) == 0x000680, "Member 'UPinModal_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_0) == 0x000688, "Member 'UPinModal_C::Hidden_PasscodeButton_0' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_1) == 0x000690, "Member 'UPinModal_C::Hidden_PasscodeButton_1' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_2) == 0x000698, "Member 'UPinModal_C::Hidden_PasscodeButton_2' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_3) == 0x0006A0, "Member 'UPinModal_C::Hidden_PasscodeButton_3' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_4) == 0x0006A8, "Member 'UPinModal_C::Hidden_PasscodeButton_4' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_5) == 0x0006B0, "Member 'UPinModal_C::Hidden_PasscodeButton_5' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_6) == 0x0006B8, "Member 'UPinModal_C::Hidden_PasscodeButton_6' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_7) == 0x0006C0, "Member 'UPinModal_C::Hidden_PasscodeButton_7' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_8) == 0x0006C8, "Member 'UPinModal_C::Hidden_PasscodeButton_8' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Hidden_PasscodeButton_9) == 0x0006D0, "Member 'UPinModal_C::Hidden_PasscodeButton_9' has a wrong offset!");
static_assert(offsetof(UPinModal_C, InfoSwitcher) == 0x0006D8, "Member 'UPinModal_C::InfoSwitcher' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_0) == 0x0006E0, "Member 'UPinModal_C::PasscodeButton_0' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_1) == 0x0006E8, "Member 'UPinModal_C::PasscodeButton_1' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_2) == 0x0006F0, "Member 'UPinModal_C::PasscodeButton_2' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_3) == 0x0006F8, "Member 'UPinModal_C::PasscodeButton_3' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_4) == 0x000700, "Member 'UPinModal_C::PasscodeButton_4' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_5) == 0x000708, "Member 'UPinModal_C::PasscodeButton_5' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_6) == 0x000710, "Member 'UPinModal_C::PasscodeButton_6' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_7) == 0x000718, "Member 'UPinModal_C::PasscodeButton_7' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_8) == 0x000720, "Member 'UPinModal_C::PasscodeButton_8' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PasscodeButton_9) == 0x000728, "Member 'UPinModal_C::PasscodeButton_9' has a wrong offset!");
static_assert(offsetof(UPinModal_C, PurchaseInfo) == 0x000730, "Member 'UPinModal_C::PurchaseInfo' has a wrong offset!");
static_assert(offsetof(UPinModal_C, SqueegeeSlot_UnlockInfo) == 0x000738, "Member 'UPinModal_C::SqueegeeSlot_UnlockInfo' has a wrong offset!");
static_assert(offsetof(UPinModal_C, StateSwitcher) == 0x000740, "Member 'UPinModal_C::StateSwitcher' has a wrong offset!");
static_assert(offsetof(UPinModal_C, SubHeaderText) == 0x000748, "Member 'UPinModal_C::SubHeaderText' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Waiting) == 0x000750, "Member 'UPinModal_C::Waiting' has a wrong offset!");
static_assert(offsetof(UPinModal_C, Preview_Pin_State) == 0x000758, "Member 'UPinModal_C::Preview_Pin_State' has a wrong offset!");
static_assert(offsetof(UPinModal_C, RequestingColor) == 0x00075C, "Member 'UPinModal_C::RequestingColor' has a wrong offset!");
static_assert(offsetof(UPinModal_C, SuccessColor) == 0x00076C, "Member 'UPinModal_C::SuccessColor' has a wrong offset!");
static_assert(offsetof(UPinModal_C, InvalidColor) == 0x00077C, "Member 'UPinModal_C::InvalidColor' has a wrong offset!");
static_assert(offsetof(UPinModal_C, CachedGameActivity) == 0x000790, "Member 'UPinModal_C::CachedGameActivity' has a wrong offset!");

}

