#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPSelectableRadialEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PiPSelectableRadialEntry.PiPSelectableRadialEntry_C
// 0x0030 (0x1570 - 0x1540)
class UPiPSelectableRadialEntry_C final : public UFortRadialPickerEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultSelectedColor;                              // 0x1550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultUnselectedColor;                            // 0x1560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void BP_UpdateSelectionColor(bool Selected_0);
	void ExecuteUbergraph_PiPSelectableRadialEntry(int32 EntryPoint);
	void OnAvailabilityChanged(bool bIsAvailable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PiPSelectableRadialEntry_C">();
	}
	static class UPiPSelectableRadialEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPiPSelectableRadialEntry_C>();
	}
};
static_assert(alignof(UPiPSelectableRadialEntry_C) == 0x000010, "Wrong alignment on UPiPSelectableRadialEntry_C");
static_assert(sizeof(UPiPSelectableRadialEntry_C) == 0x001570, "Wrong size on UPiPSelectableRadialEntry_C");
static_assert(offsetof(UPiPSelectableRadialEntry_C, UberGraphFrame) == 0x001540, "Member 'UPiPSelectableRadialEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPiPSelectableRadialEntry_C, Selected) == 0x001548, "Member 'UPiPSelectableRadialEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UPiPSelectableRadialEntry_C, DefaultSelectedColor) == 0x001550, "Member 'UPiPSelectableRadialEntry_C::DefaultSelectedColor' has a wrong offset!");
static_assert(offsetof(UPiPSelectableRadialEntry_C, DefaultUnselectedColor) == 0x001560, "Member 'UPiPSelectableRadialEntry_C::DefaultUnselectedColor' has a wrong offset!");

}

