#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Sprint_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Player_Sprint_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_Sprint_AnimBP.Player_Sprint_AnimBP_C
// 0x1170 (0x1840 - 0x06D0)
class UPlayer_Sprint_AnimBP_C final : public UFortSprintAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x06D8(0x002C)(HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0708(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0710(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0718(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0788(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x07B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x07D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0820(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0868(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x08B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x08D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0918(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0960(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x09A8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x09C8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x09F0(0x00C8)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x0AB8(0x00B0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0B68(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x0BD8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x0CA0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0D68(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0DB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0DF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0E40(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0E88(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0ED0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0F18(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0FE0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x10A8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x10F0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x11B8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1200(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1228(0x00F0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1318(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1388(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x13F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1440(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1468(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1490(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x14D8(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x15C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x15E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x16B0(0x0078)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1728(0x0118)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_Sprint_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_Sprint_AnimBP_C">();
	}
	static class UPlayer_Sprint_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_Sprint_AnimBP_C>();
	}
};
static_assert(alignof(UPlayer_Sprint_AnimBP_C) == 0x000010, "Wrong alignment on UPlayer_Sprint_AnimBP_C");
static_assert(sizeof(UPlayer_Sprint_AnimBP_C) == 0x001840, "Wrong size on UPlayer_Sprint_AnimBP_C");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, UberGraphFrame) == 0x0006D0, "Member 'UPlayer_Sprint_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, __AnimBlueprintMutables) == 0x0006D8, "Member 'UPlayer_Sprint_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000708, "Member 'UPlayer_Sprint_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimBlueprintExtension_Base) == 0x000710, "Member 'UPlayer_Sprint_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_Root) == 0x000718, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000738, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000760, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000788, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0007B0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0007D8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000820, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000868, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0008B0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x0008D0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000918, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000960, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0009A8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0009C8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0009F0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_RotateRootBone) == 0x000AB8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000B68, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_4) == 0x000BD8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_3) == 0x000CA0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000D68, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000DB0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000DF8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000E40, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000E88, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000ED0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x000F18, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x000FE0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0010A8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x0010F0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_Slot_1) == 0x0011B8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x001200, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_LayeredBoneBlend_1) == 0x001228, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001318, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x001388, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0013F8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001440, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001468, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_Slot) == 0x001490, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0014D8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_StateResult) == 0x0015C8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_StateMachine) == 0x0015E8, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0016B0, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayer_Sprint_AnimBP_C, AnimGraphNode_Inertialization) == 0x001728, "Member 'UPlayer_Sprint_AnimBP_C::AnimGraphNode_Inertialization' has a wrong offset!");

}

