#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_PropertiesDebug_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0127 (0x0128 - 0x0001)
struct Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_4;                                  // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_5;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_6;                                // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_7;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0030(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose;                        // 0x00F8(0x0030)()
};
static_assert(alignof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000128, "Wrong size on Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_4) == 0x000004, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_4' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_5) == 0x000008, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_5' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_6) == 0x000010, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_6' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_7) == 0x000028, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_7' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000030, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B0, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000C8, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose) == 0x0000F8, "Member 'Player_PropertiesDebug_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose' has a wrong offset!");

}

