#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_DBNOCarried_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Player_DBNOCarried_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C
// 0x2080 (0x25F0 - 0x0570)
class UPlayer_DBNOCarried_AnimBP_C final : public UFortPlayerDBNOCarriedAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0578(0x004C)(HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05D8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x05F8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0618(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0740(0x0128)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x0868(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x08B0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x08F8(0x00C8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x09C0(0x0260)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0C20(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0C40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0C68(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x0C90(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0CD0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0CF0(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x0D60(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x0E28(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0EF0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0F60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1050(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1078(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x10C0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x1188(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x11D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x11F0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x1238(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1280(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x12F0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x13B8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1400(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x14C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1510(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x1530(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1570(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x15B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x1600(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x1648(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x1688(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x16D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1718(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1738(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1780(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1848(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1890(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x1958(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1998(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x19E0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x1A28(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x1A68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1AB0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x1AF8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1B40(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x1B88(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1BC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1C10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1C58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1CA0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x1CE8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1D28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1D70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1D90(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1DD8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1EA0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1EE8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1F08(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1FD0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x1FF0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2030(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2050(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2118(0x0020)()
	uint8                                         Pad_2138[0x8];                                     // 0x2138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x2140(0x02A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x23E0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2428(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2470(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x24B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2500(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2578(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x25A0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x25C8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_DBNOCarried_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_DBNOCarried_AnimBP_C">();
	}
	static class UPlayer_DBNOCarried_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_DBNOCarried_AnimBP_C>();
	}
};
static_assert(alignof(UPlayer_DBNOCarried_AnimBP_C) == 0x000010, "Wrong alignment on UPlayer_DBNOCarried_AnimBP_C");
static_assert(sizeof(UPlayer_DBNOCarried_AnimBP_C) == 0x0025F0, "Wrong size on UPlayer_DBNOCarried_AnimBP_C");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, UberGraphFrame) == 0x000570, "Member 'UPlayer_DBNOCarried_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, __AnimBlueprintMutables) == 0x000578, "Member 'UPlayer_DBNOCarried_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0005C8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimBlueprintExtension_Base) == 0x0005D0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_Root) == 0x0005D8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0005F8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000618, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000740, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_16) == 0x000868, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_15) == 0x0008B0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_8) == 0x0008F8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_8' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TwoBoneIK) == 0x0009C0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000C20, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000C40, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000C68, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_7) == 0x000C90, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_7) == 0x000CD0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000CF0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_7) == 0x000D60, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_6) == 0x000E28, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000EF0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000F60, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000F88, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000FB0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000FD8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x001000, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001028, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult) == 0x001050, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_14) == 0x001078, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_5) == 0x0010C0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_13) == 0x001188, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_6) == 0x0011D0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x0011F0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_12) == 0x001238, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_12' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x001280, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_4) == 0x0012F0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x0013B8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_3) == 0x001400, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x0014C8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001510, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_6) == 0x001530, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x001570, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_11) == 0x0015B8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_11' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_10) == 0x001600, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_10' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_5) == 0x001648, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_9) == 0x001688, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_9' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0016D0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_4) == 0x001718, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x001738, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x001780, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001848, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x001890, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_4) == 0x001958, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001998, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_8) == 0x0019E0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_3) == 0x001A28, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_7) == 0x001A68, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001AB0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_6) == 0x001AF8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x001B40, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_2) == 0x001B88, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x001BC8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x001C10, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001C58, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001CA0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_1) == 0x001CE8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001D28, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_3) == 0x001D70, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001D90, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x001DD8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001EA0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_2) == 0x001EE8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x001F08, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_1) == 0x001FD0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x001FF0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult) == 0x002030, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_StateMachine) == 0x002050, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002118, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_Trail) == 0x002140, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_Slot_1) == 0x0023E0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_Slot) == 0x002428, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x002470, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0024B8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002500, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002578, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0025A0, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNOCarried_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0025C8, "Member 'UPlayer_DBNOCarried_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");

}

