#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FreeFlying_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x059F (0x05A0 - 0x0001)
struct Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_195;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_196;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_197;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_198;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_199;                               // 0x0020(0x0010)(BlueprintVisible)
	struct FInputScaleBiasClampConstants          __StructProperty_200;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_201;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_202;                                  // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_203;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_204;                                // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_205;                                // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_206;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_207;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_208;                               // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_209;                                // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_210;                                // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_211;                                // 0x0092(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_212;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_213;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_214;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_215;                              // 0x00A0(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;                   // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x02A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x02D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x0300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x0330(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0360(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                     // 0x0390(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x03C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x03F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0420(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0450(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x0480(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x04B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x04E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x0510(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0540(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0570(0x0030)()
};
static_assert(alignof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0005A0, "Wrong size on Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_195) == 0x000004, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_195' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_196) == 0x000008, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_196' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_197) == 0x00000C, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_197' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_198) == 0x000010, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_198' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_199) == 0x000020, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_199' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_200) == 0x000030, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_200' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_201) == 0x000060, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_201' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_202) == 0x000068, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_202' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_203) == 0x000070, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_203' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_204) == 0x000071, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_204' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_205) == 0x000072, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_205' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_206) == 0x000078, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_206' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_207) == 0x000088, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_207' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_208) == 0x00008C, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_208' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_209) == 0x000090, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_209' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_210) == 0x000091, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_210' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_211) == 0x000092, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_211' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_212) == 0x000094, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_212' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_213) == 0x000098, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_213' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_214) == 0x00009C, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_214' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_215) == 0x0000A0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_215' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000150, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000180, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_1) == 0x0001B0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_7) == 0x0001E0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_6) == 0x000210, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x000240, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x000270, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x0002A0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x0002D0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000300, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_1) == 0x000330, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000360, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum) == 0x000390, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0003C0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0003F0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000420, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000450, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000480, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0004B0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0004E0, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000510, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000540, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000570, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0047 (0x0048 - 0x0001)
struct Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_5;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_6;                                 // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_7;                                  // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000048, "Wrong size on Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __ArrayProperty_0) == 0x000008, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__ArrayProperty_0' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000018, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000019, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x00001C, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000020, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_5) == 0x000024, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_5' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __ArrayProperty_6) == 0x000028, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__ArrayProperty_6' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000038, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x000039, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00003C, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000040, "Member 'Player_FreeFlying_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");

}

