#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_BuildingPose_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Player_BuildingPose_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C
// 0x04E0 (0x0960 - 0x0480)
class UPlayer_BuildingPose_AnimBP_C final : public UFortPlayerBuildingAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_BuildingPose_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0488(0x0005)(HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0490(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0498(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04A0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x04C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0538(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0560(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x05A8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x05F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0638(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0680(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x06C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0710(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0758(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0778(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0808(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0850(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0870(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0898(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_BuildingPose_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_BuildingPose_AnimBP_C">();
	}
	static class UPlayer_BuildingPose_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_BuildingPose_AnimBP_C>();
	}
};
static_assert(alignof(UPlayer_BuildingPose_AnimBP_C) == 0x000010, "Wrong alignment on UPlayer_BuildingPose_AnimBP_C");
static_assert(sizeof(UPlayer_BuildingPose_AnimBP_C) == 0x000960, "Wrong size on UPlayer_BuildingPose_AnimBP_C");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, UberGraphFrame) == 0x000480, "Member 'UPlayer_BuildingPose_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, __AnimBlueprintMutables) == 0x000488, "Member 'UPlayer_BuildingPose_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000490, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimBlueprintExtension_Base) == 0x000498, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_Root) == 0x0004A0, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0004C0, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0004E8, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000510, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000538, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000560, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x0005A8, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_BlendListByEnum_1) == 0x0005F0, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000638, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000680, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x0006C8, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000710, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000758, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000778, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0007C0, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000808, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_StateResult) == 0x000850, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000870, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayer_BuildingPose_AnimBP_C, AnimGraphNode_StateMachine) == 0x000898, "Member 'UPlayer_BuildingPose_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

