#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUIDirector

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PlayerAugmentsUIDirector.PlayerAugmentsUIDirector_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct PlayerAugmentsUIDirector_C_CustomEvent final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerAugmentsUIDirector_C_CustomEvent) == 0x000001, "Wrong alignment on PlayerAugmentsUIDirector_C_CustomEvent");
static_assert(sizeof(PlayerAugmentsUIDirector_C_CustomEvent) == 0x000001, "Wrong size on PlayerAugmentsUIDirector_C_CustomEvent");
static_assert(offsetof(PlayerAugmentsUIDirector_C_CustomEvent, bIsVisible) == 0x000000, "Member 'PlayerAugmentsUIDirector_C_CustomEvent::bIsVisible' has a wrong offset!");

// Function PlayerAugmentsUIDirector.PlayerAugmentsUIDirector_C.ExecuteUbergraph_PlayerAugmentsUIDirector
// 0x0060 (0x0060 - 0x0000)
struct PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EHudVisibilityState IsVisible)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsVisible)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningLocalPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortLiveBroadcastController*           K2Node_DynamicCast_AsFort_Live_Broadcast_Controller; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           K2Node_CustomEvent_IsVisible;                      // 0x0056(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsVisible;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector) == 0x000008, "Wrong alignment on PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector");
static_assert(sizeof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector) == 0x000060, "Wrong size on PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, EntryPoint) == 0x000000, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000004, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_GetValueAsBool_ReturnValue) == 0x000028, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_InEditorOrPIE_ReturnValue) == 0x000029, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_GetOwningLocalPlayerController_ReturnValue) == 0x000030, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_GetOwningLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_IsUsingTouch_ReturnValue) == 0x000038, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000040, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_DynamicCast_AsFort_Live_Broadcast_Controller) == 0x000048, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_DynamicCast_AsFort_Live_Broadcast_Controller' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_IsInZone_ReturnValue) == 0x000051, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_IsMobileGame_ReturnValue) == 0x000053, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_BooleanAND_ReturnValue_1) == 0x000054, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, CallFunc_BooleanOR_ReturnValue) == 0x000055, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_CustomEvent_IsVisible) == 0x000056, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_SwitchEnum_CmpSuccess) == 0x000057, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector, K2Node_CustomEvent_bIsVisible) == 0x000058, "Member 'PlayerAugmentsUIDirector_C_ExecuteUbergraph_PlayerAugmentsUIDirector::K2Node_CustomEvent_bIsVisible' has a wrong offset!");

// Function PlayerAugmentsUIDirector.PlayerAugmentsUIDirector_C.On HUD VIsibility Changed
// 0x0001 (0x0001 - 0x0000)
struct PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed final
{
public:
	EHudVisibilityState                           IsVisible;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed) == 0x000001, "Wrong alignment on PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed");
static_assert(sizeof(PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed) == 0x000001, "Wrong size on PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed");
static_assert(offsetof(PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed, IsVisible) == 0x000000, "Member 'PlayerAugmentsUIDirector_C_On_HUD_VIsibility_Changed::IsVisible' has a wrong offset!");

}

