#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FirstPersonAdditives_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Player_FirstPersonAdditives_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C
// 0x03A0 (0x19D0 - 0x1630)
class UPlayer_FirstPersonAdditives_AnimBP_C final : public UFortFirstPersonAdditivesAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_FirstPersonAdditives_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1638(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_1644[0x4];                                     // 0x1644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1648(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1650(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1658(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x16A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x16C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1710(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1758(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x17C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x17E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1830(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1850(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1918(0x00B0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP_AnimGraphNode_TransitionResult_2DFC4A284AA1789B129744ABAA2802AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP_AnimGraphNode_TransitionResult_CA37B2124D1A2CCFDF726E8464D5ED6B();
	void ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_FirstPersonAdditives_AnimBP_C">();
	}
	static class UPlayer_FirstPersonAdditives_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_FirstPersonAdditives_AnimBP_C>();
	}
};
static_assert(alignof(UPlayer_FirstPersonAdditives_AnimBP_C) == 0x000010, "Wrong alignment on UPlayer_FirstPersonAdditives_AnimBP_C");
static_assert(sizeof(UPlayer_FirstPersonAdditives_AnimBP_C) == 0x0019D0, "Wrong size on UPlayer_FirstPersonAdditives_AnimBP_C");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, UberGraphFrame) == 0x001630, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, __AnimBlueprintMutables) == 0x001638, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x001648, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimBlueprintExtension_Base) == 0x001650, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_Root) == 0x001658, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001678, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0016A0, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0016C8, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001710, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x001758, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0017C8, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0017E8, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_StateResult) == 0x001830, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_StateMachine) == 0x001850, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPlayer_FirstPersonAdditives_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001918, "Member 'UPlayer_FirstPersonAdditives_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

