#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerToastWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PowerToastWidget.PowerToastWidget_C.ExecuteUbergraph_PowerToastWidget
// 0x0178 (0x0178 - 0x0000)
struct PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDisplayTime_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget) == 0x000008, "Wrong alignment on PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget");
static_assert(sizeof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget) == 0x000178, "Wrong size on PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, EntryPoint) == 0x000000, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetDisplayTime_bOutDisplayTimeOverridden) == 0x000004, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetDisplayTime_bOutDisplayTimeOverridden' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetDisplayTime_ReturnValue) == 0x000008, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetDisplayTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_MyGeometry) == 0x000028, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000150, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000158, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000160, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000168, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetVisibility_ReturnValue) == 0x000170, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct PowerToastWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PowerToastWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on PowerToastWidget_C_OnMouseEnter");
static_assert(sizeof(PowerToastWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on PowerToastWidget_C_OnMouseEnter");
static_assert(offsetof(PowerToastWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'PowerToastWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'PowerToastWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct PowerToastWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PowerToastWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on PowerToastWidget_C_OnMouseLeave");
static_assert(sizeof(PowerToastWidget_C_OnMouseLeave) == 0x000078, "Wrong size on PowerToastWidget_C_OnMouseLeave");
static_assert(offsetof(PowerToastWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'PowerToastWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

