#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PriceChangeAcknowledgeModal

#include "Basic.hpp"

#include "CrewUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PriceChangeAcknowledgeModal.PriceChangeAcknowledgeModal_C
// 0x00B0 (0x0648 - 0x0598)
class UPriceChangeAcknowledgeModal_C final : public UCrewPriceChangeAcknowledgeModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Dismiss;                                           // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowUp;                                            // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UPriceChangeAcknowledgeTextEntry_C*     BodyText_1;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Material_1;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PriceChangeAcknowledgeCheckBox_C*   BP_PriceChangeAcknowledgeCheckBox;                 // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Column1Header;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Column2Header;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Column3Header;                                     // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ContentSZ;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       EntryBox_PriceChangeTable;                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaScrollBox*                       ScrollBox_PriceChangeTable;                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height_1;                                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxHeader;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Check;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MoreInfo;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Disabled_Reason;                                   // 0x0620(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             ScreenAppearWhoosh;                                // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DismissWhoosh;                                     // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__PriceChangeAcknowledgeModal_BP_PriceChangeAcknowledgeCheckBox_K2Node_ComponentBoundEvent_0_CommonSelectedStateChangedBase__DelegateSignature(class UCommonButtonBase* Button, bool Selected);
	void BP_OnActivated();
	void ExecuteUbergraph_PriceChangeAcknowledgeModal(int32 EntryPoint);
	void On_Exit_Modal();
	void OnModalBackout();
	void OnSetPriceChangeAcknowledgeBodyTable(const TArray<struct FCrewTableRow>& PriceChangeByRegionRows);
	void OnSetPriceChangeAcknowledgeBodyText(const class FText& BodyText);
	void OnSetPriceChangeAcknowledgeCancelSubscriptionButtonText(const class FText& CancelSubscriptionButtonText);
	void OnSetPriceChangeAcknowledgeCheckboxText(const class FText& CheckboxText);
	void OnSetPriceChangeAcknowledgeConfirmButtonText(const class FText& ConfirmButtonText);
	void OnSetPriceChangeAcknowledgeMoreInfoText(const class FText& ConfirmButtonText);
	void OnSetPriceChangeAcknowledgeMoreInfoUrl(const class FText& MoreInfoUrl);
	void OnSetPriceChangeAcknowledgeTitle(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PriceChangeAcknowledgeModal_C">();
	}
	static class UPriceChangeAcknowledgeModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriceChangeAcknowledgeModal_C>();
	}
};
static_assert(alignof(UPriceChangeAcknowledgeModal_C) == 0x000008, "Wrong alignment on UPriceChangeAcknowledgeModal_C");
static_assert(sizeof(UPriceChangeAcknowledgeModal_C) == 0x000648, "Wrong size on UPriceChangeAcknowledgeModal_C");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, UberGraphFrame) == 0x000598, "Member 'UPriceChangeAcknowledgeModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Dismiss) == 0x0005A0, "Member 'UPriceChangeAcknowledgeModal_C::Dismiss' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, ShowUp) == 0x0005A8, "Member 'UPriceChangeAcknowledgeModal_C::ShowUp' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, BodyText_1) == 0x0005B0, "Member 'UPriceChangeAcknowledgeModal_C::BodyText_1' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Border_Material_1) == 0x0005B8, "Member 'UPriceChangeAcknowledgeModal_C::Border_Material_1' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, BP_PriceChangeAcknowledgeCheckBox) == 0x0005C0, "Member 'UPriceChangeAcknowledgeModal_C::BP_PriceChangeAcknowledgeCheckBox' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Column1Header) == 0x0005C8, "Member 'UPriceChangeAcknowledgeModal_C::Column1Header' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Column2Header) == 0x0005D0, "Member 'UPriceChangeAcknowledgeModal_C::Column2Header' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Column3Header) == 0x0005D8, "Member 'UPriceChangeAcknowledgeModal_C::Column3Header' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, ContentSZ) == 0x0005E0, "Member 'UPriceChangeAcknowledgeModal_C::ContentSZ' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, EntryBox_PriceChangeTable) == 0x0005E8, "Member 'UPriceChangeAcknowledgeModal_C::EntryBox_PriceChangeTable' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, ScrollBox_PriceChangeTable) == 0x0005F0, "Member 'UPriceChangeAcknowledgeModal_C::ScrollBox_PriceChangeTable' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, SizeBox_Height_1) == 0x0005F8, "Member 'UPriceChangeAcknowledgeModal_C::SizeBox_Height_1' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, SizeBoxHeader) == 0x000600, "Member 'UPriceChangeAcknowledgeModal_C::SizeBoxHeader' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Text_Check) == 0x000608, "Member 'UPriceChangeAcknowledgeModal_C::Text_Check' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Text_MoreInfo) == 0x000610, "Member 'UPriceChangeAcknowledgeModal_C::Text_MoreInfo' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Text_Title) == 0x000618, "Member 'UPriceChangeAcknowledgeModal_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, Disabled_Reason) == 0x000620, "Member 'UPriceChangeAcknowledgeModal_C::Disabled_Reason' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, ScreenAppearWhoosh) == 0x000638, "Member 'UPriceChangeAcknowledgeModal_C::ScreenAppearWhoosh' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeModal_C, DismissWhoosh) == 0x000640, "Member 'UPriceChangeAcknowledgeModal_C::DismissWhoosh' has a wrong offset!");

}

