#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PriceChangeRegionListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PriceChangeRegionListEntry.PriceChangeRegionListEntry_C
// 0x0048 (0x0308 - 0x02C0)
class UPriceChangeRegionListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Material_1;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Column1Text;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Column2Text;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Column3Text;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height_1;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_PriceChangeRegionListEntry(int32 EntryPoint);
	void SetItem(const struct FCrewTableRow& CrewTableRow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PriceChangeRegionListEntry_C">();
	}
	static class UPriceChangeRegionListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriceChangeRegionListEntry_C>();
	}
};
static_assert(alignof(UPriceChangeRegionListEntry_C) == 0x000008, "Wrong alignment on UPriceChangeRegionListEntry_C");
static_assert(sizeof(UPriceChangeRegionListEntry_C) == 0x000308, "Wrong size on UPriceChangeRegionListEntry_C");
static_assert(offsetof(UPriceChangeRegionListEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UPriceChangeRegionListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPriceChangeRegionListEntry_C, Border_Material_1) == 0x0002C8, "Member 'UPriceChangeRegionListEntry_C::Border_Material_1' has a wrong offset!");
static_assert(offsetof(UPriceChangeRegionListEntry_C, Column1Text) == 0x0002D0, "Member 'UPriceChangeRegionListEntry_C::Column1Text' has a wrong offset!");
static_assert(offsetof(UPriceChangeRegionListEntry_C, Column2Text) == 0x0002D8, "Member 'UPriceChangeRegionListEntry_C::Column2Text' has a wrong offset!");
static_assert(offsetof(UPriceChangeRegionListEntry_C, Column3Text) == 0x0002E0, "Member 'UPriceChangeRegionListEntry_C::Column3Text' has a wrong offset!");
static_assert(offsetof(UPriceChangeRegionListEntry_C, SizeBox_Height_1) == 0x0002E8, "Member 'UPriceChangeRegionListEntry_C::SizeBox_Height_1' has a wrong offset!");
static_assert(offsetof(UPriceChangeRegionListEntry_C, Text) == 0x0002F0, "Member 'UPriceChangeRegionListEntry_C::Text' has a wrong offset!");

}

