#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PriceChangeAcknowledgeTextEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PriceChangeAcknowledgeTextEntry.PriceChangeAcknowledgeTextEntry_C
// 0x0028 (0x02E8 - 0x02C0)
class UPriceChangeAcknowledgeTextEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   Description;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_PriceChangeAcknowledgeTextEntry(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PriceChangeAcknowledgeTextEntry_C">();
	}
	static class UPriceChangeAcknowledgeTextEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriceChangeAcknowledgeTextEntry_C>();
	}
};
static_assert(alignof(UPriceChangeAcknowledgeTextEntry_C) == 0x000008, "Wrong alignment on UPriceChangeAcknowledgeTextEntry_C");
static_assert(sizeof(UPriceChangeAcknowledgeTextEntry_C) == 0x0002E8, "Wrong size on UPriceChangeAcknowledgeTextEntry_C");
static_assert(offsetof(UPriceChangeAcknowledgeTextEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UPriceChangeAcknowledgeTextEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeTextEntry_C, Description) == 0x0002C8, "Member 'UPriceChangeAcknowledgeTextEntry_C::Description' has a wrong offset!");
static_assert(offsetof(UPriceChangeAcknowledgeTextEntry_C, Text) == 0x0002D0, "Member 'UPriceChangeAcknowledgeTextEntry_C::Text' has a wrong offset!");

}

