#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralLayeringAnimInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProceduralLayeringAnimInterface.ProceduralLayeringAnimInterface_C.ProceduralAdditivePose
// 0x0040 (0x0040 - 0x0000)
struct ProceduralLayeringAnimInterface_C_ProceduralAdditivePose final
{
public:
	struct FPoseLink                              InSourceLocomotionPose;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InMotionMatchingPose;                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InProceduralLayeredPose;                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ProceduralAdditivePose_0;                          // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ProceduralLayeringAnimInterface_C_ProceduralAdditivePose) == 0x000008, "Wrong alignment on ProceduralLayeringAnimInterface_C_ProceduralAdditivePose");
static_assert(sizeof(ProceduralLayeringAnimInterface_C_ProceduralAdditivePose) == 0x000040, "Wrong size on ProceduralLayeringAnimInterface_C_ProceduralAdditivePose");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralAdditivePose, InSourceLocomotionPose) == 0x000000, "Member 'ProceduralLayeringAnimInterface_C_ProceduralAdditivePose::InSourceLocomotionPose' has a wrong offset!");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralAdditivePose, InMotionMatchingPose) == 0x000010, "Member 'ProceduralLayeringAnimInterface_C_ProceduralAdditivePose::InMotionMatchingPose' has a wrong offset!");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralAdditivePose, InProceduralLayeredPose) == 0x000020, "Member 'ProceduralLayeringAnimInterface_C_ProceduralAdditivePose::InProceduralLayeredPose' has a wrong offset!");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralAdditivePose, ProceduralAdditivePose_0) == 0x000030, "Member 'ProceduralLayeringAnimInterface_C_ProceduralAdditivePose::ProceduralAdditivePose_0' has a wrong offset!");

// Function ProceduralLayeringAnimInterface.ProceduralLayeringAnimInterface_C.ProceduralLayeredPose
// 0x0030 (0x0030 - 0x0000)
struct ProceduralLayeringAnimInterface_C_ProceduralLayeredPose final
{
public:
	struct FPoseLink                              InLocomotionPose;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPassThroughPose;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ProceduralLayeredPose_0;                           // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ProceduralLayeringAnimInterface_C_ProceduralLayeredPose) == 0x000008, "Wrong alignment on ProceduralLayeringAnimInterface_C_ProceduralLayeredPose");
static_assert(sizeof(ProceduralLayeringAnimInterface_C_ProceduralLayeredPose) == 0x000030, "Wrong size on ProceduralLayeringAnimInterface_C_ProceduralLayeredPose");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralLayeredPose, InLocomotionPose) == 0x000000, "Member 'ProceduralLayeringAnimInterface_C_ProceduralLayeredPose::InLocomotionPose' has a wrong offset!");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralLayeredPose, InPassThroughPose) == 0x000010, "Member 'ProceduralLayeringAnimInterface_C_ProceduralLayeredPose::InPassThroughPose' has a wrong offset!");
static_assert(offsetof(ProceduralLayeringAnimInterface_C_ProceduralLayeredPose, ProceduralLayeredPose_0) == 0x000020, "Member 'ProceduralLayeringAnimInterface_C_ProceduralLayeredPose::ProceduralLayeredPose_0' has a wrong offset!");

}

