#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProductCompatibilityEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function ProductCompatibilityEntry.ProductCompatibilityEntry_C.BP_SetText
// 0x0018 (0x0018 - 0x0000)
struct ProductCompatibilityEntry_C_BP_SetText final
{
public:
	class FText                                   CompatibilityText;                                 // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ProductCompatibilityEntry_C_BP_SetText) == 0x000008, "Wrong alignment on ProductCompatibilityEntry_C_BP_SetText");
static_assert(sizeof(ProductCompatibilityEntry_C_BP_SetText) == 0x000018, "Wrong size on ProductCompatibilityEntry_C_BP_SetText");
static_assert(offsetof(ProductCompatibilityEntry_C_BP_SetText, CompatibilityText) == 0x000000, "Member 'ProductCompatibilityEntry_C_BP_SetText::CompatibilityText' has a wrong offset!");

// Function ProductCompatibilityEntry.ProductCompatibilityEntry_C.ExecuteUbergraph_ProductCompatibilityEntry
// 0x0020 (0x0020 - 0x0000)
struct ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_CompatibilityText;                    // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry) == 0x000008, "Wrong alignment on ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry");
static_assert(sizeof(ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry) == 0x000020, "Wrong size on ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry");
static_assert(offsetof(ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry, EntryPoint) == 0x000000, "Member 'ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry, K2Node_Event_CompatibilityText) == 0x000008, "Member 'ProductCompatibilityEntry_C_ExecuteUbergraph_ProductCompatibilityEntry::K2Node_Event_CompatibilityText' has a wrong offset!");

}

