#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItem_Tall

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.BP_OnInitializeSetInfo
// 0x0098 (0x0098 - 0x0000)
struct ProgressiveItem_Tall_C_BP_OnInitializeSetInfo final
{
public:
	struct FProgressiveSetInfo                    InSetInfo;                                         // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   BottomText;                                        // 0x0060(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   BottomSubtext;                                     // 0x0078(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bSubscribed;                                       // 0x0090(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_BP_OnInitializeSetInfo) == 0x000008, "Wrong alignment on ProgressiveItem_Tall_C_BP_OnInitializeSetInfo");
static_assert(sizeof(ProgressiveItem_Tall_C_BP_OnInitializeSetInfo) == 0x000098, "Wrong size on ProgressiveItem_Tall_C_BP_OnInitializeSetInfo");
static_assert(offsetof(ProgressiveItem_Tall_C_BP_OnInitializeSetInfo, InSetInfo) == 0x000000, "Member 'ProgressiveItem_Tall_C_BP_OnInitializeSetInfo::InSetInfo' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_BP_OnInitializeSetInfo, BottomText) == 0x000060, "Member 'ProgressiveItem_Tall_C_BP_OnInitializeSetInfo::BottomText' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_BP_OnInitializeSetInfo, BottomSubtext) == 0x000078, "Member 'ProgressiveItem_Tall_C_BP_OnInitializeSetInfo::BottomSubtext' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_BP_OnInitializeSetInfo, bSubscribed) == 0x000090, "Member 'ProgressiveItem_Tall_C_BP_OnInitializeSetInfo::bSubscribed' has a wrong offset!");

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.BP_OnTileMaterialLoaded
// 0x0001 (0x0001 - 0x0000)
struct ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded final
{
public:
	bool                                          bSubscribed;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded) == 0x000001, "Wrong alignment on ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded");
static_assert(sizeof(ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded) == 0x000001, "Wrong size on ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded");
static_assert(offsetof(ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded, bSubscribed) == 0x000000, "Member 'ProgressiveItem_Tall_C_BP_OnTileMaterialLoaded::bSubscribed' has a wrong offset!");

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.ExecuteUbergraph_ProgressiveItem_Tall
// 0x00B0 (0x00B0 - 0x0000)
struct ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FProgressiveSetInfo                    K2Node_Event_InSetInfo;                            // 0x0010(0x0060)(ConstParm)
	class FText                                   K2Node_Event_BottomText;                           // 0x0070(0x0018)(ConstParm)
	class FText                                   K2Node_Event_BottomSubtext;                        // 0x0088(0x0018)(ConstParm)
	bool                                          K2Node_Event_bSubscribed_1;                        // 0x00A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSubscribed;                          // 0x00A2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall) == 0x000008, "Wrong alignment on ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall");
static_assert(sizeof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall) == 0x0000B0, "Wrong size on ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, EntryPoint) == 0x000000, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, K2Node_Event_InSetInfo) == 0x000010, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::K2Node_Event_InSetInfo' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, K2Node_Event_BottomText) == 0x000070, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::K2Node_Event_BottomText' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, K2Node_Event_BottomSubtext) == 0x000088, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::K2Node_Event_BottomSubtext' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, K2Node_Event_bSubscribed_1) == 0x0000A0, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::K2Node_Event_bSubscribed_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, K2Node_Event_IsDesignTime) == 0x0000A1, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, K2Node_Event_bSubscribed) == 0x0000A2, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::K2Node_Event_bSubscribed' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A8, "Member 'ProgressiveItem_Tall_C_ExecuteUbergraph_ProgressiveItem_Tall::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ProgressiveItem_Tall_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_PreConstruct) == 0x000001, "Wrong alignment on ProgressiveItem_Tall_C_PreConstruct");
static_assert(sizeof(ProgressiveItem_Tall_C_PreConstruct) == 0x000001, "Wrong size on ProgressiveItem_Tall_C_PreConstruct");
static_assert(offsetof(ProgressiveItem_Tall_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ProgressiveItem_Tall_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.UpdateCompletedState
// 0x0010 (0x0010 - 0x0000)
struct ProgressiveItem_Tall_C_UpdateCompletedState final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_UpdateCompletedState) == 0x000004, "Wrong alignment on ProgressiveItem_Tall_C_UpdateCompletedState");
static_assert(sizeof(ProgressiveItem_Tall_C_UpdateCompletedState) == 0x000010, "Wrong size on ProgressiveItem_Tall_C_UpdateCompletedState");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, Temp_byte_Variable) == 0x000000, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, Temp_byte_Variable_1) == 0x000001, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, Temp_bool_Variable) == 0x000002, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, CallFunc_Less_IntInt_ReturnValue) == 0x000003, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, CallFunc_Less_IntInt_ReturnValue_1) == 0x000004, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateCompletedState, K2Node_Select_Default) == 0x00000C, "Member 'ProgressiveItem_Tall_C_UpdateCompletedState::K2Node_Select_Default' has a wrong offset!");

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.UpdateSubscribedState
// 0x0078 (0x0078 - 0x0000)
struct ProgressiveItem_Tall_C_UpdateSubscribedState final
{
public:
	bool                                          bInSubscribed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_4;                // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_5;                // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_UpdateSubscribedState) == 0x000008, "Wrong alignment on ProgressiveItem_Tall_C_UpdateSubscribedState");
static_assert(sizeof(ProgressiveItem_Tall_C_UpdateSubscribedState) == 0x000078, "Wrong size on ProgressiveItem_Tall_C_UpdateSubscribedState");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, bInSubscribed) == 0x000000, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::bInSubscribed' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_SelectColor_ReturnValue_1) == 0x000014, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_SelectColor_ReturnValue_2) == 0x000024, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_SelectColor_ReturnValue_3) == 0x000034, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_SelectColor_ReturnValue_4) == 0x000044, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_SelectColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_SelectColor_ReturnValue_5) == 0x000054, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_SelectColor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateSubscribedState, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000070, "Member 'ProgressiveItem_Tall_C_UpdateSubscribedState::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function ProgressiveItem_Tall.ProgressiveItem_Tall_C.UpdateVisualState
// 0x0068 (0x0068 - 0x0000)
struct ProgressiveItem_Tall_C_UpdateVisualState final
{
public:
	bool                                          Selected_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Subbed;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered_0;                                         // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x004C(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tall_C_UpdateVisualState) == 0x000008, "Wrong alignment on ProgressiveItem_Tall_C_UpdateVisualState");
static_assert(sizeof(ProgressiveItem_Tall_C_UpdateVisualState) == 0x000068, "Wrong size on ProgressiveItem_Tall_C_UpdateVisualState");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Selected_0) == 0x000000, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Selected_0' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Subbed) == 0x000001, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Subbed' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Completed) == 0x000002, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Completed' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Hovered_0) == 0x000003, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Hovered_0' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Temp_bool_Variable) == 0x000004, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Temp_byte_Variable) == 0x000005, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Temp_byte_Variable_1) == 0x000006, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Temp_bool_Variable_1) == 0x000007, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, K2Node_Select_Default) == 0x000008, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Temp_byte_Variable_2) == 0x000009, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, Temp_byte_Variable_3) == 0x00000A, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, K2Node_Select_Default_1) == 0x000018, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, CallFunc_SelectColor_ReturnValue) == 0x000028, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, K2Node_MakeStruct_SlateColor_1) == 0x00004C, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tall_C_UpdateVisualState, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'ProgressiveItem_Tall_C_UpdateVisualState::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

