#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItemStateTitle

#include "Basic.hpp"

#include "CrewUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveItemStateTitle.ProgressiveItemStateTitle_C
// 0x00E0 (0x03A0 - 0x02C0)
class UProgressiveItemStateTitle_C final : public UFortProgressiveItemStateTitleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCrewCrown_Animated_C*                  CrewCrown_Animated;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveTagsBase_C*                 ProgressiveTags_Benefits;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveTagsBase_C*                 ProgressiveTags_Stages;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressiveTagsBase_C*                 ProgressiveTags_Subscribed;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subheading;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Subbed_Dark_Green;                                 // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0308(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Show_Multi_Benefits_tag;                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title_Text;                                        // 0x0328(0x0018)(Edit, BlueprintVisible)
	struct FSlateColor                            Unsubscribed_Subheader_Color;                      // 0x0340(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Subscibed_Subheader_Color;                         // 0x0354(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Unsubbed_White;                                    // 0x0368(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Subbed_Light_Green;                                // 0x037C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unsubbed_Pink_BG;                                  // 0x038C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnSetHeaderInfo(const class FText& Subheading, const bool bSubscribed, const int32 UnlockedStages, const int32 MaxStages);
	void ExecuteUbergraph_ProgressiveItemStateTitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_MultiBenefits_Tag(bool Index_0);
	void Update_Stages_Tag(bool Subscribed, const int32 Current_Stage, const int32 Max_Stage);
	void Update_Subheading(const class FText& Text_0, bool Subscribed);
	void Update_Subscribed_Tag(bool Subscribed);
	void Update_Title_Text();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveItemStateTitle_C">();
	}
	static class UProgressiveItemStateTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveItemStateTitle_C>();
	}
};
static_assert(alignof(UProgressiveItemStateTitle_C) == 0x000008, "Wrong alignment on UProgressiveItemStateTitle_C");
static_assert(sizeof(UProgressiveItemStateTitle_C) == 0x0003A0, "Wrong size on UProgressiveItemStateTitle_C");
static_assert(offsetof(UProgressiveItemStateTitle_C, UberGraphFrame) == 0x0002C0, "Member 'UProgressiveItemStateTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, CrewCrown_Animated) == 0x0002C8, "Member 'UProgressiveItemStateTitle_C::CrewCrown_Animated' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, ProgressiveTags_Benefits) == 0x0002D0, "Member 'UProgressiveItemStateTitle_C::ProgressiveTags_Benefits' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, ProgressiveTags_Stages) == 0x0002D8, "Member 'UProgressiveItemStateTitle_C::ProgressiveTags_Stages' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, ProgressiveTags_Subscribed) == 0x0002E0, "Member 'UProgressiveItemStateTitle_C::ProgressiveTags_Subscribed' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Text_Subheading) == 0x0002E8, "Member 'UProgressiveItemStateTitle_C::Text_Subheading' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Text_Title) == 0x0002F0, "Member 'UProgressiveItemStateTitle_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Subbed_Dark_Green) == 0x0002F8, "Member 'UProgressiveItemStateTitle_C::Subbed_Dark_Green' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Text) == 0x000308, "Member 'UProgressiveItemStateTitle_C::Text' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Show_Multi_Benefits_tag) == 0x000320, "Member 'UProgressiveItemStateTitle_C::Show_Multi_Benefits_tag' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Title_Text) == 0x000328, "Member 'UProgressiveItemStateTitle_C::Title_Text' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Unsubscribed_Subheader_Color) == 0x000340, "Member 'UProgressiveItemStateTitle_C::Unsubscribed_Subheader_Color' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Subscibed_Subheader_Color) == 0x000354, "Member 'UProgressiveItemStateTitle_C::Subscibed_Subheader_Color' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Unsubbed_White) == 0x000368, "Member 'UProgressiveItemStateTitle_C::Unsubbed_White' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Subbed_Light_Green) == 0x00037C, "Member 'UProgressiveItemStateTitle_C::Subbed_Light_Green' has a wrong offset!");
static_assert(offsetof(UProgressiveItemStateTitle_C, Unsubbed_Pink_BG) == 0x00038C, "Member 'UProgressiveItemStateTitle_C::Unsubbed_Pink_BG' has a wrong offset!");

}

