#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItem_Tooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ProgressiveItem_Tooltip.ProgressiveItem_Tooltip_C.ExecuteUbergraph_ProgressiveItem_Tooltip
// 0x0048 (0x0048 - 0x0000)
struct ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip) == 0x000008, "Wrong alignment on ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip");
static_assert(sizeof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip) == 0x000048, "Wrong size on ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, EntryPoint) == 0x000000, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_byte_Variable) == 0x000004, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_bool_Variable) == 0x000005, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_byte_Variable_1) == 0x000006, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_byte_Variable_2) == 0x000007, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_bool_Variable_1) == 0x000014, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_byte_Variable_3) == 0x000015, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_byte_Variable_4) == 0x000016, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, K2Node_Event_IsDesignTime) == 0x000017, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000018, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000020, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_byte_Variable_5) == 0x000028, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, K2Node_CustomEvent_Visible) == 0x000029, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00002A, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, K2Node_Select_Default) == 0x00002B, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, K2Node_Select_Default_1) == 0x00002C, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, Temp_bool_Variable_2) == 0x00002D, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000030, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000038, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, K2Node_Select_Default_2) == 0x000040, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'ProgressiveItem_Tooltip_C_ExecuteUbergraph_ProgressiveItem_Tooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ProgressiveItem_Tooltip.ProgressiveItem_Tooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ProgressiveItem_Tooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tooltip_C_PreConstruct) == 0x000001, "Wrong alignment on ProgressiveItem_Tooltip_C_PreConstruct");
static_assert(sizeof(ProgressiveItem_Tooltip_C_PreConstruct) == 0x000001, "Wrong size on ProgressiveItem_Tooltip_C_PreConstruct");
static_assert(offsetof(ProgressiveItem_Tooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ProgressiveItem_Tooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ProgressiveItem_Tooltip.ProgressiveItem_Tooltip_C.ToggleTooltip
// 0x0001 (0x0001 - 0x0000)
struct ProgressiveItem_Tooltip_C_ToggleTooltip final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItem_Tooltip_C_ToggleTooltip) == 0x000001, "Wrong alignment on ProgressiveItem_Tooltip_C_ToggleTooltip");
static_assert(sizeof(ProgressiveItem_Tooltip_C_ToggleTooltip) == 0x000001, "Wrong size on ProgressiveItem_Tooltip_C_ToggleTooltip");
static_assert(offsetof(ProgressiveItem_Tooltip_C_ToggleTooltip, Visible) == 0x000000, "Member 'ProgressiveItem_Tooltip_C_ToggleTooltip::Visible' has a wrong offset!");

// Function ProgressiveItem_Tooltip.ProgressiveItem_Tooltip_C.Update Text
// 0x0018 (0x0018 - 0x0000)
struct ProgressiveItem_Tooltip_C_Update_Text final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ProgressiveItem_Tooltip_C_Update_Text) == 0x000008, "Wrong alignment on ProgressiveItem_Tooltip_C_Update_Text");
static_assert(sizeof(ProgressiveItem_Tooltip_C_Update_Text) == 0x000018, "Wrong size on ProgressiveItem_Tooltip_C_Update_Text");
static_assert(offsetof(ProgressiveItem_Tooltip_C_Update_Text, InText) == 0x000000, "Member 'ProgressiveItem_Tooltip_C_Update_Text::InText' has a wrong offset!");

}

