#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline.PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C
// 0x0140 (0x0DD8 - 0x0C98)
class APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C final : public AFortAthenaSplineZipline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMesh*                            SplineStaticMesh;                                  // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TangentSmoothStrength;                             // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoSmoothTangents;                                // 0x0CB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               ForwardMeshAxis;                                   // 0x0CB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB2[0x6];                                      // 0x0CB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MotorOffset;                                       // 0x0CB8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PoleA;                                             // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 PoleB;                                             // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                PoleASocketLocation;                               // 0x0CE0(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PoleBSocketLocation;                               // 0x0CF8(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LowerPointID;                                      // 0x0D10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HigherPointID;                                     // 0x0D14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HigherEndLocation;                                 // 0x0D18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LowerEndLocation;                                  // 0x0D30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AutoLinearFactorLow;                               // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoLinearFactorHigh;                              // 0x0D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoSplineTangentLengthCoef;                       // 0x0D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoSplineTangentHorizCoef;                        // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoSplineTangentVertCoef;                         // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_Set_Spline_Ends;                              // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_Set_Spline_Mids;                              // 0x0D71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_D72[0x6];                                      // 0x0D72(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       SplineMaterials;                                   // 0x0D78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  BlockInteractTags;                                 // 0x0D88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TilingDivisor;                                     // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SplineMeshComponents;                              // 0x0DB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AFortPlayerPawn*>                PlayerPawnArray;                                   // 0x0DC0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Debug;                                             // 0x0DD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddPlayerToZipliningArray(const class AFortPlayerPawn*& NewItem);
	void AddSplineMeshSegment(class USplineMeshComponent** SplineMeshSegment);
	void AutoSmoothTanget(const struct FVector& Tangent, const struct FVector& PointA, const struct FVector& PointB, struct FVector* SmoothedTangent);
	void Calc_Auto_Location_At_Alpha(double InAlpha, bool DrawDebug, struct FVector* PointLocation);
	void CalculatePositionOfPoles();
	void ExecuteUbergraph_PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline(int32 EntryPoint);
	void GetAutoHorizAndVertVectors(const struct FVector& highVector, const struct FVector& LowVector, struct FVector* VertVec, struct FVector* HorizVec);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnZipliningStarted(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent);
	void OnZipliningStopped(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent, float ZiplineUsageDuration);
	void ReceiveBeginPlay();
	void RemovePlayerFromZipliningArray(const class AFortPlayerPawn*& Item);
	void SetCableTilingBySplineLength(class UMeshComponent* Target);
	void SetSplinePositionAndTangent(bool SetPosition, bool SetTangent, int32 ID);
	void UserConstructionScript();
	void WaitThenSetDynamicSpline();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C">();
	}
	static class APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C>();
	}
};
static_assert(alignof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C) == 0x000008, "Wrong alignment on APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C");
static_assert(sizeof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C) == 0x000DD8, "Wrong size on APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, UberGraphFrame) == 0x000C98, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, SplineStaticMesh) == 0x000CA0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::SplineStaticMesh' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, TangentSmoothStrength) == 0x000CA8, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::TangentSmoothStrength' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, AutoSmoothTangents) == 0x000CB0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::AutoSmoothTangents' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, ForwardMeshAxis) == 0x000CB1, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::ForwardMeshAxis' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, MotorOffset) == 0x000CB8, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::MotorOffset' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, PoleA) == 0x000CD0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::PoleA' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, PoleB) == 0x000CD8, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::PoleB' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, PoleASocketLocation) == 0x000CE0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::PoleASocketLocation' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, PoleBSocketLocation) == 0x000CF8, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::PoleBSocketLocation' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, LowerPointID) == 0x000D10, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::LowerPointID' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, HigherPointID) == 0x000D14, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::HigherPointID' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, HigherEndLocation) == 0x000D18, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::HigherEndLocation' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, LowerEndLocation) == 0x000D30, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::LowerEndLocation' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, AutoLinearFactorLow) == 0x000D48, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::AutoLinearFactorLow' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, AutoLinearFactorHigh) == 0x000D50, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::AutoLinearFactorHigh' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, AutoSplineTangentLengthCoef) == 0x000D58, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::AutoSplineTangentLengthCoef' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, AutoSplineTangentHorizCoef) == 0x000D60, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::AutoSplineTangentHorizCoef' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, AutoSplineTangentVertCoef) == 0x000D68, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::AutoSplineTangentVertCoef' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, Auto_Set_Spline_Ends) == 0x000D70, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::Auto_Set_Spline_Ends' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, Auto_Set_Spline_Mids) == 0x000D71, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::Auto_Set_Spline_Mids' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, SplineMaterials) == 0x000D78, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::SplineMaterials' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, BlockInteractTags) == 0x000D88, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::BlockInteractTags' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, TilingDivisor) == 0x000DA8, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::TilingDivisor' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, SplineMeshComponents) == 0x000DB0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::SplineMeshComponents' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, PlayerPawnArray) == 0x000DC0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::PlayerPawnArray' has a wrong offset!");
static_assert(offsetof(APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C, Debug) == 0x000DD0, "Member 'APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C::Debug' has a wrong offset!");

}

