#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseNavButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchaseNavButton.PurchaseNavButton_C
// 0x0130 (0x15C0 - 0x1490)
class UPurchaseNavButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Normal;                                            // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PeriodAlert;                                       // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderSwapDirection;                               // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AlertIcon;                                   // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_arcs;                                        // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs2;                                       // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs3;                                       // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arcs4;                                       // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HazardGlow;                                  // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconGlow;                                    // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lightning1;                                  // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sharplines;                                  // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Spinner;                                     // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_IconEffects;                               // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Lightning;                                 // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonText_1;                                 // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonText_2;                                 // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlipArrow;                                         // 0x1548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1549[0x7];                                     // 0x1549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              DispatchClicked;                                   // 0x1550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x1560(0x0018)(Edit, BlueprintVisible)
	struct FTimerHandle                           PeriodicAnim;                                      // 0x1578(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackupInputAction;                                 // 0x1580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          toBP;                                              // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1591[0x7];                                     // 0x1591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Unhovered_Sound;                                   // 0x1598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Hovered_Sound;                                     // 0x15A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Selected_Sound;                                    // 0x15A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Pad_Left;                                          // 0x15B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pad_Right;                                         // 0x15B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void EventSetupPeriodicTimer();
	void ExecuteUbergraph_PurchaseNavButton(int32 EntryPoint);
	void PlayPeriodicAnim();
	void PreConstruct(bool IsDesignTime);
	void ResetHoverAnimation();
	void UpdateTextSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchaseNavButton_C">();
	}
	static class UPurchaseNavButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchaseNavButton_C>();
	}
};
static_assert(alignof(UPurchaseNavButton_C) == 0x000010, "Wrong alignment on UPurchaseNavButton_C");
static_assert(sizeof(UPurchaseNavButton_C) == 0x0015C0, "Wrong size on UPurchaseNavButton_C");
static_assert(offsetof(UPurchaseNavButton_C, UberGraphFrame) == 0x001490, "Member 'UPurchaseNavButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Normal) == 0x001498, "Member 'UPurchaseNavButton_C::Normal' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, PeriodAlert) == 0x0014A0, "Member 'UPurchaseNavButton_C::PeriodAlert' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Hover) == 0x0014A8, "Member 'UPurchaseNavButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, BorderSwapDirection) == 0x0014B0, "Member 'UPurchaseNavButton_C::BorderSwapDirection' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_AlertIcon) == 0x0014B8, "Member 'UPurchaseNavButton_C::Image_AlertIcon' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_arcs) == 0x0014C0, "Member 'UPurchaseNavButton_C::Image_arcs' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arcs2) == 0x0014C8, "Member 'UPurchaseNavButton_C::Image_Arcs2' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arcs3) == 0x0014D0, "Member 'UPurchaseNavButton_C::Image_Arcs3' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arcs4) == 0x0014D8, "Member 'UPurchaseNavButton_C::Image_Arcs4' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Arrow) == 0x0014E0, "Member 'UPurchaseNavButton_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_BG) == 0x0014E8, "Member 'UPurchaseNavButton_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_HazardGlow) == 0x0014F0, "Member 'UPurchaseNavButton_C::Image_HazardGlow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_IconGlow) == 0x0014F8, "Member 'UPurchaseNavButton_C::Image_IconGlow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Lightning1) == 0x001500, "Member 'UPurchaseNavButton_C::Image_Lightning1' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Sharplines) == 0x001508, "Member 'UPurchaseNavButton_C::Image_Sharplines' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Image_Spinner) == 0x001510, "Member 'UPurchaseNavButton_C::Image_Spinner' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Overlay_IconEffects) == 0x001518, "Member 'UPurchaseNavButton_C::Overlay_IconEffects' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Overlay_Lightning) == 0x001520, "Member 'UPurchaseNavButton_C::Overlay_Lightning' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, SafeZone_0) == 0x001528, "Member 'UPurchaseNavButton_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Shadow) == 0x001530, "Member 'UPurchaseNavButton_C::Shadow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Text_ButtonText_1) == 0x001538, "Member 'UPurchaseNavButton_C::Text_ButtonText_1' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Text_ButtonText_2) == 0x001540, "Member 'UPurchaseNavButton_C::Text_ButtonText_2' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, FlipArrow) == 0x001548, "Member 'UPurchaseNavButton_C::FlipArrow' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, DispatchClicked) == 0x001550, "Member 'UPurchaseNavButton_C::DispatchClicked' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, ButtonText) == 0x001560, "Member 'UPurchaseNavButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, PeriodicAnim) == 0x001578, "Member 'UPurchaseNavButton_C::PeriodicAnim' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, BackupInputAction) == 0x001580, "Member 'UPurchaseNavButton_C::BackupInputAction' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, toBP) == 0x001590, "Member 'UPurchaseNavButton_C::toBP' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Unhovered_Sound) == 0x001598, "Member 'UPurchaseNavButton_C::Unhovered_Sound' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Hovered_Sound) == 0x0015A0, "Member 'UPurchaseNavButton_C::Hovered_Sound' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Selected_Sound) == 0x0015A8, "Member 'UPurchaseNavButton_C::Selected_Sound' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Pad_Left) == 0x0015B0, "Member 'UPurchaseNavButton_C::Pad_Left' has a wrong offset!");
static_assert(offsetof(UPurchaseNavButton_C, Pad_Right) == 0x0015B1, "Member 'UPurchaseNavButton_C::Pad_Right' has a wrong offset!");

}

