#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityLevelSelectScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QualityLevelSelectScreen.QualityLevelSelectScreen_C
// 0x0048 (0x0620 - 0x05D8)
class UQualityLevelSelectScreen_C final : public UFortQualityLevelSelectScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UQualityModeSelectTile_C*               Button_SelectHighQuality_1;                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              Footersafezone;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                OptionMessage;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QualityLevelCalculated;                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QualityTitle;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TilesRow;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_QualityLevelSelectScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QualityLevelSelectScreen_C">();
	}
	static class UQualityLevelSelectScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualityLevelSelectScreen_C>();
	}
};
static_assert(alignof(UQualityLevelSelectScreen_C) == 0x000008, "Wrong alignment on UQualityLevelSelectScreen_C");
static_assert(sizeof(UQualityLevelSelectScreen_C) == 0x000620, "Wrong size on UQualityLevelSelectScreen_C");
static_assert(offsetof(UQualityLevelSelectScreen_C, UberGraphFrame) == 0x0005D8, "Member 'UQualityLevelSelectScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Intro) == 0x0005E0, "Member 'UQualityLevelSelectScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Button_SelectHighQuality_1) == 0x0005E8, "Member 'UQualityLevelSelectScreen_C::Button_SelectHighQuality_1' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Footersafezone) == 0x0005F0, "Member 'UQualityLevelSelectScreen_C::Footersafezone' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Image_93) == 0x0005F8, "Member 'UQualityLevelSelectScreen_C::Image_93' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, OptionMessage) == 0x000600, "Member 'UQualityLevelSelectScreen_C::OptionMessage' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Text_QualityLevelCalculated) == 0x000608, "Member 'UQualityLevelSelectScreen_C::Text_QualityLevelCalculated' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, Text_QualityTitle) == 0x000610, "Member 'UQualityLevelSelectScreen_C::Text_QualityTitle' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectScreen_C, TilesRow) == 0x000618, "Member 'UQualityLevelSelectScreen_C::TilesRow' has a wrong offset!");

}

