#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityModeSelectTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QualityModeSelectTile.QualityModeSelectTile_C
// 0x00A0 (0x15A0 - 0x1500)
class UQualityModeSelectTile_C final : public UFortQualityModeTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InAnOutro;                                         // 0x1508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ConfirmSeleccion;                                  // 0x1510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GameModeSelection;                                 // 0x1518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Recommended;                                // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionFlash;                             // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisabledGray;                                      // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_140;                                         // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedIcon;                                      // 0x1548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_Recommended;                                     // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Tag_Selected;                                      // 0x1558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_AdditionalDownloadSize;                  // 0x1560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_QualityDescription;                      // 0x1568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_QualityLevelName;                        // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_TotalBuildSize;                          // 0x1578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TileArt;                                           // 0x1580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnhoveredVignette;                                 // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsRecommendedLevel;                               // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_QualityModeSelectTile(int32 EntryPoint);
	void OnSelectedStateChanged(bool bIsSelected);
	void OnSizeInfoReceived();
	void PreConstruct(bool IsDesignTime);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QualityModeSelectTile_C">();
	}
	static class UQualityModeSelectTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualityModeSelectTile_C>();
	}
};
static_assert(alignof(UQualityModeSelectTile_C) == 0x000010, "Wrong alignment on UQualityModeSelectTile_C");
static_assert(sizeof(UQualityModeSelectTile_C) == 0x0015A0, "Wrong size on UQualityModeSelectTile_C");
static_assert(offsetof(UQualityModeSelectTile_C, UberGraphFrame) == 0x001500, "Member 'UQualityModeSelectTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, InAnOutro) == 0x001508, "Member 'UQualityModeSelectTile_C::InAnOutro' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, ConfirmSeleccion) == 0x001510, "Member 'UQualityModeSelectTile_C::ConfirmSeleccion' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, GameModeSelection) == 0x001518, "Member 'UQualityModeSelectTile_C::GameModeSelection' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, Border_Recommended) == 0x001520, "Member 'UQualityModeSelectTile_C::Border_Recommended' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, ConfirmSelectionFlash) == 0x001528, "Member 'UQualityModeSelectTile_C::ConfirmSelectionFlash' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, ConfirmSelectionShine) == 0x001530, "Member 'UQualityModeSelectTile_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, DisabledGray) == 0x001538, "Member 'UQualityModeSelectTile_C::DisabledGray' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, Image_140) == 0x001540, "Member 'UQualityModeSelectTile_C::Image_140' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, SelectedIcon) == 0x001548, "Member 'UQualityModeSelectTile_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, T_Recommended) == 0x001550, "Member 'UQualityModeSelectTile_C::T_Recommended' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, Tag_Selected) == 0x001558, "Member 'UQualityModeSelectTile_C::Tag_Selected' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_AdditionalDownloadSize) == 0x001560, "Member 'UQualityModeSelectTile_C::TextBlock_AdditionalDownloadSize' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_QualityDescription) == 0x001568, "Member 'UQualityModeSelectTile_C::TextBlock_QualityDescription' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_QualityLevelName) == 0x001570, "Member 'UQualityModeSelectTile_C::TextBlock_QualityLevelName' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_TotalBuildSize) == 0x001578, "Member 'UQualityModeSelectTile_C::TextBlock_TotalBuildSize' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TileArt) == 0x001580, "Member 'UQualityModeSelectTile_C::TileArt' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, UnhoveredVignette) == 0x001588, "Member 'UQualityModeSelectTile_C::UnhoveredVignette' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, bIsRecommendedLevel) == 0x001590, "Member 'UQualityModeSelectTile_C::bIsRecommendedLevel' has a wrong offset!");

}

