#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestScreen_ArrowButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.ExecuteUbergraph_QuestScreen_ArrowButton
// 0x00E0 (0x00E0 - 0x0000)
struct QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_1;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_2;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton) == 0x000008, "Wrong alignment on QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton");
static_assert(sizeof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton) == 0x0000E0, "Wrong size on QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, EntryPoint) == 0x000000, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, K2Node_MakeStruct_Margin) == 0x000008, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_GetVisibility_ReturnValue) == 0x000018, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, K2Node_MakeStruct_Margin_1) == 0x00001C, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_GetEndTime_ReturnValue) == 0x000030, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, Temp_struct_Variable) == 0x000040, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, K2Node_CustomEvent_IsActive_1) == 0x000058, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::K2Node_CustomEvent_IsActive_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000068, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, K2Node_CustomEvent_IsActive) == 0x000070, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000078, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, K2Node_Event_IsDesignTime) == 0x000080, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, Temp_struct_Variable_1) == 0x000088, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation) == 0x000098, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000A0, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_1) == 0x0000A8, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_2) == 0x0000B0, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_2' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000B8, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x0000C0, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, Temp_bool_Variable) == 0x0000C8, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton, K2Node_Select_Default) == 0x0000D0, "Member 'QuestScreen_ArrowButton_C_ExecuteUbergraph_QuestScreen_ArrowButton::K2Node_Select_Default' has a wrong offset!");

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.GetActiveAnimation
// 0x0018 (0x0018 - 0x0000)
struct QuestScreen_ArrowButton_C_GetActiveAnimation final
{
public:
	class UWidgetAnimation*                       ActiveAnimation;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_GetActiveAnimation) == 0x000008, "Wrong alignment on QuestScreen_ArrowButton_C_GetActiveAnimation");
static_assert(sizeof(QuestScreen_ArrowButton_C_GetActiveAnimation) == 0x000018, "Wrong size on QuestScreen_ArrowButton_C_GetActiveAnimation");
static_assert(offsetof(QuestScreen_ArrowButton_C_GetActiveAnimation, ActiveAnimation) == 0x000000, "Member 'QuestScreen_ArrowButton_C_GetActiveAnimation::ActiveAnimation' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_GetActiveAnimation, Temp_bool_Variable) == 0x000008, "Member 'QuestScreen_ArrowButton_C_GetActiveAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_GetActiveAnimation, K2Node_Select_Default) == 0x000010, "Member 'QuestScreen_ArrowButton_C_GetActiveAnimation::K2Node_Select_Default' has a wrong offset!");

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.OnRowActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct QuestScreen_ArrowButton_C_OnRowActiveChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_OnRowActiveChanged) == 0x000001, "Wrong alignment on QuestScreen_ArrowButton_C_OnRowActiveChanged");
static_assert(sizeof(QuestScreen_ArrowButton_C_OnRowActiveChanged) == 0x000001, "Wrong size on QuestScreen_ArrowButton_C_OnRowActiveChanged");
static_assert(offsetof(QuestScreen_ArrowButton_C_OnRowActiveChanged, IsActive) == 0x000000, "Member 'QuestScreen_ArrowButton_C_OnRowActiveChanged::IsActive' has a wrong offset!");

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.OnRowReset
// 0x0001 (0x0001 - 0x0000)
struct QuestScreen_ArrowButton_C_OnRowReset final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_OnRowReset) == 0x000001, "Wrong alignment on QuestScreen_ArrowButton_C_OnRowReset");
static_assert(sizeof(QuestScreen_ArrowButton_C_OnRowReset) == 0x000001, "Wrong size on QuestScreen_ArrowButton_C_OnRowReset");
static_assert(offsetof(QuestScreen_ArrowButton_C_OnRowReset, IsActive) == 0x000000, "Member 'QuestScreen_ArrowButton_C_OnRowReset::IsActive' has a wrong offset!");

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct QuestScreen_ArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on QuestScreen_ArrowButton_C_PreConstruct");
static_assert(sizeof(QuestScreen_ArrowButton_C_PreConstruct) == 0x000001, "Wrong size on QuestScreen_ArrowButton_C_PreConstruct");
static_assert(offsetof(QuestScreen_ArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'QuestScreen_ArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.SnapAnimationToEnd
// 0x0018 (0x0018 - 0x0000)
struct QuestScreen_ArrowButton_C_SnapAnimationToEnd final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_SnapAnimationToEnd) == 0x000008, "Wrong alignment on QuestScreen_ArrowButton_C_SnapAnimationToEnd");
static_assert(sizeof(QuestScreen_ArrowButton_C_SnapAnimationToEnd) == 0x000018, "Wrong size on QuestScreen_ArrowButton_C_SnapAnimationToEnd");
static_assert(offsetof(QuestScreen_ArrowButton_C_SnapAnimationToEnd, InAnimation) == 0x000000, "Member 'QuestScreen_ArrowButton_C_SnapAnimationToEnd::InAnimation' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_SnapAnimationToEnd, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'QuestScreen_ArrowButton_C_SnapAnimationToEnd::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_SnapAnimationToEnd, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'QuestScreen_ArrowButton_C_SnapAnimationToEnd::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function QuestScreen_ArrowButton.QuestScreen_ArrowButton_C.UpdateArrowColor
// 0x0020 (0x0020 - 0x0000)
struct QuestScreen_ArrowButton_C_UpdateArrowColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestScreen_ArrowButton_C_UpdateArrowColor) == 0x000004, "Wrong alignment on QuestScreen_ArrowButton_C_UpdateArrowColor");
static_assert(sizeof(QuestScreen_ArrowButton_C_UpdateArrowColor) == 0x000020, "Wrong size on QuestScreen_ArrowButton_C_UpdateArrowColor");
static_assert(offsetof(QuestScreen_ArrowButton_C_UpdateArrowColor, Color) == 0x000000, "Member 'QuestScreen_ArrowButton_C_UpdateArrowColor::Color' has a wrong offset!");
static_assert(offsetof(QuestScreen_ArrowButton_C_UpdateArrowColor, HoverColor) == 0x000010, "Member 'QuestScreen_ArrowButton_C_UpdateArrowColor::HoverColor' has a wrong offset!");

}

