#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBANSettingStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// UserDefinedStruct RBANSettingStruct.RBANSettingStruct
// 0x0090 (0x0090 - 0x0000)
struct FRBANSettingStruct final
{
public:
	struct FVector                                ComponentLinearAccScale_28_9CBE863E417FC965C07809A2FE55ADFD; // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ComponentLinearVelScale_31_6A3DFE4A481AD4D7CB18D79F95CC88E8; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSimSpaceSettings                      SimSpaceSettings_34_FE68F666411FF9F29BA84CB4BE726A52; // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FRBANSettingStruct) == 0x000008, "Wrong alignment on FRBANSettingStruct");
static_assert(sizeof(FRBANSettingStruct) == 0x000090, "Wrong size on FRBANSettingStruct");
static_assert(offsetof(FRBANSettingStruct, ComponentLinearAccScale_28_9CBE863E417FC965C07809A2FE55ADFD) == 0x000000, "Member 'FRBANSettingStruct::ComponentLinearAccScale_28_9CBE863E417FC965C07809A2FE55ADFD' has a wrong offset!");
static_assert(offsetof(FRBANSettingStruct, ComponentLinearVelScale_31_6A3DFE4A481AD4D7CB18D79F95CC88E8) == 0x000018, "Member 'FRBANSettingStruct::ComponentLinearVelScale_31_6A3DFE4A481AD4D7CB18D79F95CC88E8' has a wrong offset!");
static_assert(offsetof(FRBANSettingStruct, SimSpaceSettings_34_FE68F666411FF9F29BA84CB4BE726A52) == 0x000030, "Member 'FRBANSettingStruct::SimSpaceSettings_34_FE68F666411FF9F29BA84CB4BE726A52' has a wrong offset!");

}

