#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootCardIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootCardIndicator.RebootCardIndicator_C
// 0x0030 (0x06C0 - 0x0690)
class URebootCardIndicator_C final : public UAthenaRebootCardIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Nameplate;                                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 burst;                                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RebootIcon;                                  // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IndicatorSpacer;                                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RebootCountdownContainer;                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void bp_UpdateCountdownText();
	void ExecuteUbergraph_RebootCardIndicator(int32 EntryPoint);
	void HandleDisplayForSelf(bool bSelf);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootCardIndicator_C">();
	}
	static class URebootCardIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootCardIndicator_C>();
	}
};
static_assert(alignof(URebootCardIndicator_C) == 0x000008, "Wrong alignment on URebootCardIndicator_C");
static_assert(sizeof(URebootCardIndicator_C) == 0x0006C0, "Wrong size on URebootCardIndicator_C");
static_assert(offsetof(URebootCardIndicator_C, UberGraphFrame) == 0x000690, "Member 'URebootCardIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, Border_Nameplate) == 0x000698, "Member 'URebootCardIndicator_C::Border_Nameplate' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, burst) == 0x0006A0, "Member 'URebootCardIndicator_C::burst' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, Image_RebootIcon) == 0x0006A8, "Member 'URebootCardIndicator_C::Image_RebootIcon' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, IndicatorSpacer) == 0x0006B0, "Member 'URebootCardIndicator_C::IndicatorSpacer' has a wrong offset!");
static_assert(offsetof(URebootCardIndicator_C, RebootCountdownContainer) == 0x0006B8, "Member 'URebootCardIndicator_C::RebootCountdownContainer' has a wrong offset!");

}

