#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootVanIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootVanIndicator.RebootVanIndicator_C
// 0x0040 (0x06B0 - 0x0670)
class URebootVanIndicator_C final : public UAthenaRebootVanIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Nameplate;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RebootIcon;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SmallIndicator;                              // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Van;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IndicatorSpacer;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_RebootVanIndicator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootVanIndicator_C">();
	}
	static class URebootVanIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootVanIndicator_C>();
	}
};
static_assert(alignof(URebootVanIndicator_C) == 0x000008, "Wrong alignment on URebootVanIndicator_C");
static_assert(sizeof(URebootVanIndicator_C) == 0x0006B0, "Wrong size on URebootVanIndicator_C");
static_assert(offsetof(URebootVanIndicator_C, UberGraphFrame) == 0x000670, "Member 'URebootVanIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Intro) == 0x000678, "Member 'URebootVanIndicator_C::Intro' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Border_Nameplate) == 0x000680, "Member 'URebootVanIndicator_C::Border_Nameplate' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Icon) == 0x000688, "Member 'URebootVanIndicator_C::Icon' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Image_RebootIcon) == 0x000690, "Member 'URebootVanIndicator_C::Image_RebootIcon' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Image_SmallIndicator) == 0x000698, "Member 'URebootVanIndicator_C::Image_SmallIndicator' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, Image_Van) == 0x0006A0, "Member 'URebootVanIndicator_C::Image_Van' has a wrong offset!");
static_assert(offsetof(URebootVanIndicator_C, IndicatorSpacer) == 0x0006A8, "Member 'URebootVanIndicator_C::IndicatorSpacer' has a wrong offset!");

}

