#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootRallyAvailableTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootRallyAvailableTooltip.RebootRallyAvailableTooltip_C
// 0x0030 (0x0490 - 0x0460)
class URebootRallyAvailableTooltip_C final : public UFortSidebarOnboardTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   CommonRichTextBlock_140;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBurst;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_9;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlipHorizontal;                                    // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RebootRallyAvailableTooltip(int32 EntryPoint);
	void HandleInputMethodChanged(ECommonInputType bNewInputType);
	void OnEndTooltip();
	void OnInitialized();
	void OnShowTooltip();
	void PreConstruct(bool IsDesignTime);
	void SetTooltipAlignment();
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootRallyAvailableTooltip_C">();
	}
	static class URebootRallyAvailableTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootRallyAvailableTooltip_C>();
	}
};
static_assert(alignof(URebootRallyAvailableTooltip_C) == 0x000008, "Wrong alignment on URebootRallyAvailableTooltip_C");
static_assert(sizeof(URebootRallyAvailableTooltip_C) == 0x000490, "Wrong size on URebootRallyAvailableTooltip_C");
static_assert(offsetof(URebootRallyAvailableTooltip_C, UberGraphFrame) == 0x000460, "Member 'URebootRallyAvailableTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, CommonRichTextBlock_140) == 0x000468, "Member 'URebootRallyAvailableTooltip_C::CommonRichTextBlock_140' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, Image_Arrow) == 0x000470, "Member 'URebootRallyAvailableTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, ImageBurst) == 0x000478, "Member 'URebootRallyAvailableTooltip_C::ImageBurst' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, SizeBox_9) == 0x000480, "Member 'URebootRallyAvailableTooltip_C::SizeBox_9' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, FlipHorizontal) == 0x000488, "Member 'URebootRallyAvailableTooltip_C::FlipHorizontal' has a wrong offset!");

}

