#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResolveTurretRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class ResolveTurretRuntime.FortPlayerAnimInstance_AntiVehMountedTurret
// 0x0040 (0x1660 - 0x1620)
class UFortPlayerAnimInstance_AntiVehMountedTurret final : public UFortPlayerAnimInstanceProxy
{
public:
	struct FVector                                HandAttachL;                                       // 0x1620(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachR;                                       // 0x1638(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandAttachBoneNameL;                               // 0x1650(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandAttachBoneNameR;                               // 0x1654(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1658[0x8];                                     // 0x1658(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_AntiVehMountedTurret">();
	}
	static class UFortPlayerAnimInstance_AntiVehMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_AntiVehMountedTurret>();
	}
};
static_assert(alignof(UFortPlayerAnimInstance_AntiVehMountedTurret) == 0x000010, "Wrong alignment on UFortPlayerAnimInstance_AntiVehMountedTurret");
static_assert(sizeof(UFortPlayerAnimInstance_AntiVehMountedTurret) == 0x001660, "Wrong size on UFortPlayerAnimInstance_AntiVehMountedTurret");
static_assert(offsetof(UFortPlayerAnimInstance_AntiVehMountedTurret, HandAttachL) == 0x001620, "Member 'UFortPlayerAnimInstance_AntiVehMountedTurret::HandAttachL' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_AntiVehMountedTurret, HandAttachR) == 0x001638, "Member 'UFortPlayerAnimInstance_AntiVehMountedTurret::HandAttachR' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_AntiVehMountedTurret, HandAttachBoneNameL) == 0x001650, "Member 'UFortPlayerAnimInstance_AntiVehMountedTurret::HandAttachBoneNameL' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_AntiVehMountedTurret, HandAttachBoneNameR) == 0x001654, "Member 'UFortPlayerAnimInstance_AntiVehMountedTurret::HandAttachBoneNameR' has a wrong offset!");

// Class ResolveTurretRuntime.FortVehicleAnimInstance_AntiVehMountedTurret
// 0x0000 (0x0640 - 0x0640)
class UFortVehicleAnimInstance_AntiVehMountedTurret final : public UFortMountedTurretAnimInstance
{
public:
	float                                         YawDeltaSmoothed;                                  // 0x0638(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAnimInstance_AntiVehMountedTurret">();
	}
	static class UFortVehicleAnimInstance_AntiVehMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAnimInstance_AntiVehMountedTurret>();
	}
};
static_assert(alignof(UFortVehicleAnimInstance_AntiVehMountedTurret) == 0x000010, "Wrong alignment on UFortVehicleAnimInstance_AntiVehMountedTurret");
static_assert(sizeof(UFortVehicleAnimInstance_AntiVehMountedTurret) == 0x000640, "Wrong size on UFortVehicleAnimInstance_AntiVehMountedTurret");
static_assert(offsetof(UFortVehicleAnimInstance_AntiVehMountedTurret, YawDeltaSmoothed) == 0x000638, "Member 'UFortVehicleAnimInstance_AntiVehMountedTurret::YawDeltaSmoothed' has a wrong offset!");

// Class ResolveTurretRuntime.FortVehicleAnimInstance_SevenMountedTurret
// 0x0000 (0x0640 - 0x0640)
class UFortVehicleAnimInstance_SevenMountedTurret final : public UFortMountedTurretAnimInstance
{
public:
	float                                         YawDeltaSmoothed;                                  // 0x0638(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAnimInstance_SevenMountedTurret">();
	}
	static class UFortVehicleAnimInstance_SevenMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAnimInstance_SevenMountedTurret>();
	}
};
static_assert(alignof(UFortVehicleAnimInstance_SevenMountedTurret) == 0x000010, "Wrong alignment on UFortVehicleAnimInstance_SevenMountedTurret");
static_assert(sizeof(UFortVehicleAnimInstance_SevenMountedTurret) == 0x000640, "Wrong size on UFortVehicleAnimInstance_SevenMountedTurret");
static_assert(offsetof(UFortVehicleAnimInstance_SevenMountedTurret, YawDeltaSmoothed) == 0x000638, "Member 'UFortVehicleAnimInstance_SevenMountedTurret::YawDeltaSmoothed' has a wrong offset!");

}

