#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: REVRuntime

#include "Basic.hpp"

#include "AudioMixer_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class REVRuntime.REVComponent
// 0x0030 (0x08B0 - 0x0880)
class UREVComponent final : public USynthComponent
{
public:
	uint8                                         Pad_880[0x8];                                      // 0x0880(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UREVModel*                              Model;                                             // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URevSettings*                           SimSettings;                                       // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89C[0x14];                                     // 0x089C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRevModel(class UREVModel* InModel);
	void SetSettings(class URevSettings* InSettings);
	void UpdateParameters(const float InPitch, const float InRPM, const float InThrottle, const float InVelocity, const int32 InGear, const bool bInEnableShifting);
	void UpdateSimSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"REVComponent">();
	}
	static class UREVComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UREVComponent>();
	}
};
static_assert(alignof(UREVComponent) == 0x000010, "Wrong alignment on UREVComponent");
static_assert(sizeof(UREVComponent) == 0x0008B0, "Wrong size on UREVComponent");
static_assert(offsetof(UREVComponent, Model) == 0x000888, "Member 'UREVComponent::Model' has a wrong offset!");
static_assert(offsetof(UREVComponent, SimSettings) == 0x000890, "Member 'UREVComponent::SimSettings' has a wrong offset!");
static_assert(offsetof(UREVComponent, PitchMultiplier) == 0x000898, "Member 'UREVComponent::PitchMultiplier' has a wrong offset!");

// Class REVRuntime.REVModel
// 0x0048 (0x0070 - 0x0028)
class UREVModel final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SampleRate;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumChannels;                                       // 0x005C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"REVModel">();
	}
	static class UREVModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UREVModel>();
	}
};
static_assert(alignof(UREVModel) == 0x000008, "Wrong alignment on UREVModel");
static_assert(sizeof(UREVModel) == 0x000070, "Wrong size on UREVModel");
static_assert(offsetof(UREVModel, SampleRate) == 0x000058, "Member 'UREVModel::SampleRate' has a wrong offset!");
static_assert(offsetof(UREVModel, NumChannels) == 0x00005C, "Member 'UREVModel::NumChannels' has a wrong offset!");

// Class REVRuntime.RevSettings
// 0x0058 (0x0080 - 0x0028)
class URevSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpShiftDuration;                                   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftAttackDuration;                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftAttackVolumeSpike;                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftAttackRPM;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftAttackThrottleTime;                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftWobblePitchFreq;                            // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftWobblePitchAmp;                             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UpShiftWobbleEnabled;                              // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpShiftWobbleVolFreq;                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftWobbleVolAmp;                               // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpShiftWobbleDuration;                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DownShiftDuration;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PopDuration;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClutchRPMSpike;                                    // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClutchRPMSpikeDuration;                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClutchRPMMergeTime;                                // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RevSettings">();
	}
	static class URevSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URevSettings>();
	}
};
static_assert(alignof(URevSettings) == 0x000008, "Wrong alignment on URevSettings");
static_assert(sizeof(URevSettings) == 0x000080, "Wrong size on URevSettings");
static_assert(offsetof(URevSettings, UpShiftDuration) == 0x000030, "Member 'URevSettings::UpShiftDuration' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftAttackDuration) == 0x000034, "Member 'URevSettings::UpShiftAttackDuration' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftAttackVolumeSpike) == 0x000038, "Member 'URevSettings::UpShiftAttackVolumeSpike' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftAttackRPM) == 0x00003C, "Member 'URevSettings::UpShiftAttackRPM' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftAttackThrottleTime) == 0x000040, "Member 'URevSettings::UpShiftAttackThrottleTime' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftWobblePitchFreq) == 0x000044, "Member 'URevSettings::UpShiftWobblePitchFreq' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftWobblePitchAmp) == 0x000048, "Member 'URevSettings::UpShiftWobblePitchAmp' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftWobbleEnabled) == 0x00004C, "Member 'URevSettings::UpShiftWobbleEnabled' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftWobbleVolFreq) == 0x000050, "Member 'URevSettings::UpShiftWobbleVolFreq' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftWobbleVolAmp) == 0x000054, "Member 'URevSettings::UpShiftWobbleVolAmp' has a wrong offset!");
static_assert(offsetof(URevSettings, UpShiftWobbleDuration) == 0x000058, "Member 'URevSettings::UpShiftWobbleDuration' has a wrong offset!");
static_assert(offsetof(URevSettings, DownShiftDuration) == 0x00005C, "Member 'URevSettings::DownShiftDuration' has a wrong offset!");
static_assert(offsetof(URevSettings, PopDuration) == 0x000060, "Member 'URevSettings::PopDuration' has a wrong offset!");
static_assert(offsetof(URevSettings, ClutchRPMSpike) == 0x000064, "Member 'URevSettings::ClutchRPMSpike' has a wrong offset!");
static_assert(offsetof(URevSettings, ClutchRPMSpikeDuration) == 0x000068, "Member 'URevSettings::ClutchRPMSpikeDuration' has a wrong offset!");
static_assert(offsetof(URevSettings, ClutchRPMMergeTime) == 0x00006C, "Member 'URevSettings::ClutchRPMMergeTime' has a wrong offset!");

}

