#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichTextButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function RichTextButton.RichTextButton_C.ExecuteUbergraph_RichTextButton
// 0x0008 (0x0008 - 0x0000)
struct RichTextButton_C_ExecuteUbergraph_RichTextButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RichTextButton_C_ExecuteUbergraph_RichTextButton) == 0x000004, "Wrong alignment on RichTextButton_C_ExecuteUbergraph_RichTextButton");
static_assert(sizeof(RichTextButton_C_ExecuteUbergraph_RichTextButton) == 0x000008, "Wrong size on RichTextButton_C_ExecuteUbergraph_RichTextButton");
static_assert(offsetof(RichTextButton_C_ExecuteUbergraph_RichTextButton, EntryPoint) == 0x000000, "Member 'RichTextButton_C_ExecuteUbergraph_RichTextButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(RichTextButton_C_ExecuteUbergraph_RichTextButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'RichTextButton_C_ExecuteUbergraph_RichTextButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function RichTextButton.RichTextButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RichTextButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RichTextButton_C_PreConstruct) == 0x000001, "Wrong alignment on RichTextButton_C_PreConstruct");
static_assert(sizeof(RichTextButton_C_PreConstruct) == 0x000001, "Wrong size on RichTextButton_C_PreConstruct");
static_assert(offsetof(RichTextButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RichTextButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

