#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RidingPlayerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0AC7 (0x0AC8 - 0x0001)
struct RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_265;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_266;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_267;                              // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_268;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_269;                                  // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_270;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_271;                                // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_272;                               // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_273;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_274;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_275;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_276;                                // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_277;                                // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_278;                                // 0x006E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_279;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_280;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_281;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_282;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_283;                              // 0x0080(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_284;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_285;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                              // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;                   // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;                    // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                     // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;                        // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;                    // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                     // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;                   // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                     // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone_1;                    // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                              // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                        // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_5;                   // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                              // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;                   // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;                   // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                     // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;                   // 0x0678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x06A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x06D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone;                      // 0x0708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x0768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x0798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x07C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x07F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x0828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;            // 0x0858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x0888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                        // 0x08B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                        // 0x08E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x0918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                              // 0x0948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;                   // 0x0978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;                   // 0x09A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                              // 0x09D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;                   // 0x0A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;                   // 0x0A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x0A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0A98(0x0030)()
};
static_assert(alignof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000AC8, "Wrong size on RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_265) == 0x000004, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_265' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_266) == 0x000008, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_266' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_267) == 0x00000C, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_267' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_268) == 0x000038, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_268' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_269) == 0x000040, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_269' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_270) == 0x000048, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_270' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_271) == 0x000049, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_271' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_272) == 0x000050, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_272' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_273) == 0x000060, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_273' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_274) == 0x000064, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_274' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_275) == 0x000068, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_275' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_276) == 0x00006C, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_276' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_277) == 0x00006D, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_277' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_278) == 0x00006E, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_278' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_279) == 0x000070, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_279' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_280) == 0x000074, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_280' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_281) == 0x000078, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_281' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_282) == 0x00007C, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_282' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_283) == 0x000080, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_283' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_284) == 0x000098, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_284' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_285) == 0x00009C, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_285' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000138, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_6) == 0x000168, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x000198, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x0001C8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x0001F8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_4) == 0x000228, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000258, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000288, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x0002B8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x0002E8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_7) == 0x000318, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000348, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotateRootBone_1) == 0x000378, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotateRootBone_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x0003A8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0003D8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x000408, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000438, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000468, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_3) == 0x000498, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x0004C8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x0004F8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000528, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_6) == 0x000558, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000588, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_5) == 0x0005B8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x0005E8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x000618, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000648, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x000678, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0006A8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x0006D8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotateRootBone) == 0x000708, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000738, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000768, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000798, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x0007C8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0007F8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000828, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x000858, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000888, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x0008B8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x0008E8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000918, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000948, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000978, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x0009A8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x0009D8, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000A08, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x000A38, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000A68, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000A98, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x000E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0016(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0017(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'RidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
