#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RidingGeneric_Interafce

#include "Basic.hpp"


namespace SDK::Params
{

// Function RidingGeneric_Interafce.RidingGeneric_Interafce_C.GetRidingInfoFromTarget
// 0x0018 (0x0018 - 0x0000)
struct RidingGeneric_Interafce_C_GetRidingInfoFromTarget final
{
public:
	double                                        JumpAttachGroundHeightMin;                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpAttachGroundHeightBuffer;                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsesAltRidingMessage;                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RidingGeneric_Interafce_C_GetRidingInfoFromTarget) == 0x000008, "Wrong alignment on RidingGeneric_Interafce_C_GetRidingInfoFromTarget");
static_assert(sizeof(RidingGeneric_Interafce_C_GetRidingInfoFromTarget) == 0x000018, "Wrong size on RidingGeneric_Interafce_C_GetRidingInfoFromTarget");
static_assert(offsetof(RidingGeneric_Interafce_C_GetRidingInfoFromTarget, JumpAttachGroundHeightMin) == 0x000000, "Member 'RidingGeneric_Interafce_C_GetRidingInfoFromTarget::JumpAttachGroundHeightMin' has a wrong offset!");
static_assert(offsetof(RidingGeneric_Interafce_C_GetRidingInfoFromTarget, JumpAttachGroundHeightBuffer) == 0x000008, "Member 'RidingGeneric_Interafce_C_GetRidingInfoFromTarget::JumpAttachGroundHeightBuffer' has a wrong offset!");
static_assert(offsetof(RidingGeneric_Interafce_C_GetRidingInfoFromTarget, UsesAltRidingMessage) == 0x000010, "Member 'RidingGeneric_Interafce_C_GetRidingInfoFromTarget::UsesAltRidingMessage' has a wrong offset!");

}

