#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UI_Image

#include "Basic.hpp"

#include "S_UI_Placement_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_Image.S_UI_Image
// 0x0058 (0x0058 - 0x0000)
struct FS_UI_Image final
{
public:
	struct FS_UI_Placement                        Placement_67_A94CBD4C4E96C298CF51F6B49895AE3D;     // 0x0000(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ImageSize_72_3E7C183E49CE6543B65BBEB8E5C3DEF9;     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_75_7A7C63B046ADDD7A04B8F3AB7F3C30C4;      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_UI_Image) == 0x000008, "Wrong alignment on FS_UI_Image");
static_assert(sizeof(FS_UI_Image) == 0x000058, "Wrong size on FS_UI_Image");
static_assert(offsetof(FS_UI_Image, Placement_67_A94CBD4C4E96C298CF51F6B49895AE3D) == 0x000000, "Member 'FS_UI_Image::Placement_67_A94CBD4C4E96C298CF51F6B49895AE3D' has a wrong offset!");
static_assert(offsetof(FS_UI_Image, ImageSize_72_3E7C183E49CE6543B65BBEB8E5C3DEF9) == 0x000040, "Member 'FS_UI_Image::ImageSize_72_3E7C183E49CE6543B65BBEB8E5C3DEF9' has a wrong offset!");
static_assert(offsetof(FS_UI_Image, Material_75_7A7C63B046ADDD7A04B8F3AB7F3C30C4) == 0x000050, "Member 'FS_UI_Image::Material_75_7A7C63B046ADDD7A04B8F3AB7F3C30C4' has a wrong offset!");

}

