#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UI_DialogButtons

#include "Basic.hpp"

#include "S_UI_Placement_structs.hpp"
#include "E_UI_ButtonSize_structs.hpp"
#include "E_UI_ButtonVisualType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_DialogButtons.S_UI_DialogButtons
// 0x0070 (0x0070 - 0x0000)
struct FS_UI_DialogButtons final
{
public:
	struct FS_UI_Placement                        GroupPlacement_71_A94CBD4C4E96C298CF51F6B49895AE3D; // 0x0000(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpaceBetweenButtons_62_39091237442DEAE1CAFAE3AB75A757F1; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_ButtonSize                               EachButtonSize_90_7A1E34E243F1F10533E9EA910463B328; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EachButtonMinWidth_77_CA4A0FEF4CF6FF0700E0DB8F95AC917B; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EachButtonHorizontalFill_87_3A1B89E0481CE49778D5E39C0BD7E90C; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_UI_ButtonVisualType>                 CTAButtonsTypes_89_963DA1ED40E4193862297D976DA12A11; // 0x0058(0x0010)(Edit, BlueprintVisible)
	int32                                         FocuseButton_85_CC6A212C4012DDFDC810689A87324E54;  // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_UI_DialogButtons) == 0x000008, "Wrong alignment on FS_UI_DialogButtons");
static_assert(sizeof(FS_UI_DialogButtons) == 0x000070, "Wrong size on FS_UI_DialogButtons");
static_assert(offsetof(FS_UI_DialogButtons, GroupPlacement_71_A94CBD4C4E96C298CF51F6B49895AE3D) == 0x000000, "Member 'FS_UI_DialogButtons::GroupPlacement_71_A94CBD4C4E96C298CF51F6B49895AE3D' has a wrong offset!");
static_assert(offsetof(FS_UI_DialogButtons, SpaceBetweenButtons_62_39091237442DEAE1CAFAE3AB75A757F1) == 0x000040, "Member 'FS_UI_DialogButtons::SpaceBetweenButtons_62_39091237442DEAE1CAFAE3AB75A757F1' has a wrong offset!");
static_assert(offsetof(FS_UI_DialogButtons, EachButtonSize_90_7A1E34E243F1F10533E9EA910463B328) == 0x000048, "Member 'FS_UI_DialogButtons::EachButtonSize_90_7A1E34E243F1F10533E9EA910463B328' has a wrong offset!");
static_assert(offsetof(FS_UI_DialogButtons, EachButtonMinWidth_77_CA4A0FEF4CF6FF0700E0DB8F95AC917B) == 0x00004C, "Member 'FS_UI_DialogButtons::EachButtonMinWidth_77_CA4A0FEF4CF6FF0700E0DB8F95AC917B' has a wrong offset!");
static_assert(offsetof(FS_UI_DialogButtons, EachButtonHorizontalFill_87_3A1B89E0481CE49778D5E39C0BD7E90C) == 0x000050, "Member 'FS_UI_DialogButtons::EachButtonHorizontalFill_87_3A1B89E0481CE49778D5E39C0BD7E90C' has a wrong offset!");
static_assert(offsetof(FS_UI_DialogButtons, CTAButtonsTypes_89_963DA1ED40E4193862297D976DA12A11) == 0x000058, "Member 'FS_UI_DialogButtons::CTAButtonsTypes_89_963DA1ED40E4193862297D976DA12A11' has a wrong offset!");
static_assert(offsetof(FS_UI_DialogButtons, FocuseButton_85_CC6A212C4012DDFDC810689A87324E54) == 0x000068, "Member 'FS_UI_DialogButtons::FocuseButton_85_CC6A212C4012DDFDC810689A87324E54' has a wrong offset!");

}

