#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UI_ToastProperty

#include "Basic.hpp"

#include "E_PositiveNegativeNeutral_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_ToastProperty.S_UI_ToastProperty
// 0x0010 (0x0010 - 0x0000)
struct FS_UI_ToastProperty final
{
public:
	double                                        DisplayTimeOverride_7_114246D24BF875A425BD61BBF1F040DA; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PositiveNegativeNeutral                     IntroAnimationType_14_0EB7EC4A496AAD67E7A7EF94D16B21EF; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseComplexAnim_21_87940237415E82117FBBFC925EA3E664; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_UI_ToastProperty) == 0x000008, "Wrong alignment on FS_UI_ToastProperty");
static_assert(sizeof(FS_UI_ToastProperty) == 0x000010, "Wrong size on FS_UI_ToastProperty");
static_assert(offsetof(FS_UI_ToastProperty, DisplayTimeOverride_7_114246D24BF875A425BD61BBF1F040DA) == 0x000000, "Member 'FS_UI_ToastProperty::DisplayTimeOverride_7_114246D24BF875A425BD61BBF1F040DA' has a wrong offset!");
static_assert(offsetof(FS_UI_ToastProperty, IntroAnimationType_14_0EB7EC4A496AAD67E7A7EF94D16B21EF) == 0x000008, "Member 'FS_UI_ToastProperty::IntroAnimationType_14_0EB7EC4A496AAD67E7A7EF94D16B21EF' has a wrong offset!");
static_assert(offsetof(FS_UI_ToastProperty, UseComplexAnim_21_87940237415E82117FBBFC925EA3E664) == 0x000009, "Member 'FS_UI_ToastProperty::UseComplexAnim_21_87940237415E82117FBBFC925EA3E664' has a wrong offset!");

}

