#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UI_HighlightColors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_HighlightColors.S_UI_HighlightColors
// 0x0080 (0x0080 - 0x0000)
struct FS_UI_HighlightColors final
{
public:
	struct FLinearColor                           AttentionTextColor_11_102071AF4E7A0065E1FA6698F3B29407; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AttentionBackgroundColor_13_6ADE20B0431DE44A87AA8F8ADDA4EDC8; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SocialTextColor_16_3125B0A54287EC2088D7CB8970BB6659; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SocialBackgroundColor_17_BC2DA64243DFE4A24052F68E1E4E2680; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UtilityTextColor_22_15D8BD754FF80FBCD6B2469B4E2631A5; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UtilityBackgroundColor_23_085C99A84137D53700605D972A963E47; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DealsTextColor_24_E50C7EC1462AA9FB3936CD90813B1F88; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DealsBackgroundColor_25_E391C8DA4251097FC95B73B6256C3B14; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_UI_HighlightColors) == 0x000004, "Wrong alignment on FS_UI_HighlightColors");
static_assert(sizeof(FS_UI_HighlightColors) == 0x000080, "Wrong size on FS_UI_HighlightColors");
static_assert(offsetof(FS_UI_HighlightColors, AttentionTextColor_11_102071AF4E7A0065E1FA6698F3B29407) == 0x000000, "Member 'FS_UI_HighlightColors::AttentionTextColor_11_102071AF4E7A0065E1FA6698F3B29407' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, AttentionBackgroundColor_13_6ADE20B0431DE44A87AA8F8ADDA4EDC8) == 0x000010, "Member 'FS_UI_HighlightColors::AttentionBackgroundColor_13_6ADE20B0431DE44A87AA8F8ADDA4EDC8' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, SocialTextColor_16_3125B0A54287EC2088D7CB8970BB6659) == 0x000020, "Member 'FS_UI_HighlightColors::SocialTextColor_16_3125B0A54287EC2088D7CB8970BB6659' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, SocialBackgroundColor_17_BC2DA64243DFE4A24052F68E1E4E2680) == 0x000030, "Member 'FS_UI_HighlightColors::SocialBackgroundColor_17_BC2DA64243DFE4A24052F68E1E4E2680' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, UtilityTextColor_22_15D8BD754FF80FBCD6B2469B4E2631A5) == 0x000040, "Member 'FS_UI_HighlightColors::UtilityTextColor_22_15D8BD754FF80FBCD6B2469B4E2631A5' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, UtilityBackgroundColor_23_085C99A84137D53700605D972A963E47) == 0x000050, "Member 'FS_UI_HighlightColors::UtilityBackgroundColor_23_085C99A84137D53700605D972A963E47' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, DealsTextColor_24_E50C7EC1462AA9FB3936CD90813B1F88) == 0x000060, "Member 'FS_UI_HighlightColors::DealsTextColor_24_E50C7EC1462AA9FB3936CD90813B1F88' has a wrong offset!");
static_assert(offsetof(FS_UI_HighlightColors, DealsBackgroundColor_25_E391C8DA4251097FC95B73B6256C3B14) == 0x000070, "Member 'FS_UI_HighlightColors::DealsBackgroundColor_25_E391C8DA4251097FC95B73B6256C3B14' has a wrong offset!");

}

