#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveTheWorldUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SaveTheWorldUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function SaveTheWorldUI.FortQuestMapViewer.OnPlayLayoutOutroAnimation
// 0x0001 (0x0001 - 0x0000)
struct FortQuestMapViewer_OnPlayLayoutOutroAnimation final
{
public:
	EViewerNavigationDirection                    TravelDirection;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortQuestMapViewer_OnPlayLayoutOutroAnimation) == 0x000001, "Wrong alignment on FortQuestMapViewer_OnPlayLayoutOutroAnimation");
static_assert(sizeof(FortQuestMapViewer_OnPlayLayoutOutroAnimation) == 0x000001, "Wrong size on FortQuestMapViewer_OnPlayLayoutOutroAnimation");
static_assert(offsetof(FortQuestMapViewer_OnPlayLayoutOutroAnimation, TravelDirection) == 0x000000, "Member 'FortQuestMapViewer_OnPlayLayoutOutroAnimation::TravelDirection' has a wrong offset!");

// Function SaveTheWorldUI.FortQuestMapViewer.OnTryUpdateUserWidgetColor
// 0x0020 (0x0020 - 0x0000)
struct FortQuestMapViewer_OnTryUpdateUserWidgetColor final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            OverrideColor;                                     // 0x0008(0x0014)(Parm, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortQuestMapViewer_OnTryUpdateUserWidgetColor) == 0x000008, "Wrong alignment on FortQuestMapViewer_OnTryUpdateUserWidgetColor");
static_assert(sizeof(FortQuestMapViewer_OnTryUpdateUserWidgetColor) == 0x000020, "Wrong size on FortQuestMapViewer_OnTryUpdateUserWidgetColor");
static_assert(offsetof(FortQuestMapViewer_OnTryUpdateUserWidgetColor, Widget) == 0x000000, "Member 'FortQuestMapViewer_OnTryUpdateUserWidgetColor::Widget' has a wrong offset!");
static_assert(offsetof(FortQuestMapViewer_OnTryUpdateUserWidgetColor, OverrideColor) == 0x000008, "Member 'FortQuestMapViewer_OnTryUpdateUserWidgetColor::OverrideColor' has a wrong offset!");

// Function SaveTheWorldUI.FortArmoryScreen.PushHeroLoadoutScreen
// 0x0008 (0x0008 - 0x0000)
struct FortArmoryScreen_PushHeroLoadoutScreen final
{
public:
	class UFortCampaignHeroLoadoutItem*           HeroLoadout;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoryScreen_PushHeroLoadoutScreen) == 0x000008, "Wrong alignment on FortArmoryScreen_PushHeroLoadoutScreen");
static_assert(sizeof(FortArmoryScreen_PushHeroLoadoutScreen) == 0x000008, "Wrong size on FortArmoryScreen_PushHeroLoadoutScreen");
static_assert(offsetof(FortArmoryScreen_PushHeroLoadoutScreen, HeroLoadout) == 0x000000, "Member 'FortArmoryScreen_PushHeroLoadoutScreen::HeroLoadout' has a wrong offset!");

// Function SaveTheWorldUI.FortArmoryScreen.PushItemInspectionScreen
// 0x0020 (0x0020 - 0x0000)
struct FortArmoryScreen_PushItemInspectionScreen final
{
public:
	class UFortItem*                              ItemToInspect;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortItemInspectionMode                       Mode;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemTileView*                      CycleTileView;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadOnly;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowFavoriting;                                  // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemporaryItem;                                  // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRarityUpgrading;                             // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortArmoryScreen_PushItemInspectionScreen) == 0x000008, "Wrong alignment on FortArmoryScreen_PushItemInspectionScreen");
static_assert(sizeof(FortArmoryScreen_PushItemInspectionScreen) == 0x000020, "Wrong size on FortArmoryScreen_PushItemInspectionScreen");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, ItemToInspect) == 0x000000, "Member 'FortArmoryScreen_PushItemInspectionScreen::ItemToInspect' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, Mode) == 0x000008, "Member 'FortArmoryScreen_PushItemInspectionScreen::Mode' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, CycleTileView) == 0x000010, "Member 'FortArmoryScreen_PushItemInspectionScreen::CycleTileView' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, bReadOnly) == 0x000018, "Member 'FortArmoryScreen_PushItemInspectionScreen::bReadOnly' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, bAllowFavoriting) == 0x000019, "Member 'FortArmoryScreen_PushItemInspectionScreen::bAllowFavoriting' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, bIsTemporaryItem) == 0x00001A, "Member 'FortArmoryScreen_PushItemInspectionScreen::bIsTemporaryItem' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemInspectionScreen, bAllowRarityUpgrading) == 0x00001B, "Member 'FortArmoryScreen_PushItemInspectionScreen::bAllowRarityUpgrading' has a wrong offset!");

// Function SaveTheWorldUI.FortArmoryScreen.PushItemManagementScreen
// 0x0018 (0x0018 - 0x0000)
struct FortArmoryScreen_PushItemManagementScreen final
{
public:
	EFortFrontendInventoryFilter                  ItemManagementFilter;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              ItemToSelect;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAutoMulch;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortArmoryScreen_PushItemManagementScreen) == 0x000008, "Wrong alignment on FortArmoryScreen_PushItemManagementScreen");
static_assert(sizeof(FortArmoryScreen_PushItemManagementScreen) == 0x000018, "Wrong size on FortArmoryScreen_PushItemManagementScreen");
static_assert(offsetof(FortArmoryScreen_PushItemManagementScreen, ItemManagementFilter) == 0x000000, "Member 'FortArmoryScreen_PushItemManagementScreen::ItemManagementFilter' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemManagementScreen, ItemToSelect) == 0x000008, "Member 'FortArmoryScreen_PushItemManagementScreen::ItemToSelect' has a wrong offset!");
static_assert(offsetof(FortArmoryScreen_PushItemManagementScreen, bShowAutoMulch) == 0x000010, "Member 'FortArmoryScreen_PushItemManagementScreen::bShowAutoMulch' has a wrong offset!");

// Function SaveTheWorldUI.FortCommandScreen.PushHeroLoadoutScreen
// 0x0008 (0x0008 - 0x0000)
struct FortCommandScreen_PushHeroLoadoutScreen final
{
public:
	class UFortCampaignHeroLoadoutItem*           HeroLoadout;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCommandScreen_PushHeroLoadoutScreen) == 0x000008, "Wrong alignment on FortCommandScreen_PushHeroLoadoutScreen");
static_assert(sizeof(FortCommandScreen_PushHeroLoadoutScreen) == 0x000008, "Wrong size on FortCommandScreen_PushHeroLoadoutScreen");
static_assert(offsetof(FortCommandScreen_PushHeroLoadoutScreen, HeroLoadout) == 0x000000, "Member 'FortCommandScreen_PushHeroLoadoutScreen::HeroLoadout' has a wrong offset!");

// Function SaveTheWorldUI.FortCommandScreen.PushItemInspectionScreen
// 0x0020 (0x0020 - 0x0000)
struct FortCommandScreen_PushItemInspectionScreen final
{
public:
	class UFortItem*                              ItemToInspect;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortItemInspectionMode                       Mode;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemTileView*                      CycleTileView;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadOnly;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowFavoriting;                                  // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemporaryItem;                                  // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRarityUpgrading;                             // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCommandScreen_PushItemInspectionScreen) == 0x000008, "Wrong alignment on FortCommandScreen_PushItemInspectionScreen");
static_assert(sizeof(FortCommandScreen_PushItemInspectionScreen) == 0x000020, "Wrong size on FortCommandScreen_PushItemInspectionScreen");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, ItemToInspect) == 0x000000, "Member 'FortCommandScreen_PushItemInspectionScreen::ItemToInspect' has a wrong offset!");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, Mode) == 0x000008, "Member 'FortCommandScreen_PushItemInspectionScreen::Mode' has a wrong offset!");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, CycleTileView) == 0x000010, "Member 'FortCommandScreen_PushItemInspectionScreen::CycleTileView' has a wrong offset!");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, bReadOnly) == 0x000018, "Member 'FortCommandScreen_PushItemInspectionScreen::bReadOnly' has a wrong offset!");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, bAllowFavoriting) == 0x000019, "Member 'FortCommandScreen_PushItemInspectionScreen::bAllowFavoriting' has a wrong offset!");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, bIsTemporaryItem) == 0x00001A, "Member 'FortCommandScreen_PushItemInspectionScreen::bIsTemporaryItem' has a wrong offset!");
static_assert(offsetof(FortCommandScreen_PushItemInspectionScreen, bAllowRarityUpgrading) == 0x00001B, "Member 'FortCommandScreen_PushItemInspectionScreen::bAllowRarityUpgrading' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.OnRewardStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_OnRewardStatusChanged final
{
public:
	ECollectionBookRewardStatus                   NewStatus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_OnRewardStatusChanged) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_OnRewardStatusChanged");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_OnRewardStatusChanged) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_OnRewardStatusChanged");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_OnRewardStatusChanged, NewStatus) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_OnRewardStatusChanged::NewStatus' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.SetCurrentItemToDisplay
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay final
{
public:
	class UFortItem*                              ItemToDisplay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay) == 0x000008, "Wrong alignment on FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay) == 0x000008, "Wrong size on FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay, ItemToDisplay) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay::ItemToDisplay' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.SetRewards
// 0x0030 (0x0030 - 0x0000)
struct FortCollectionBookGenericRewardWidget_SetRewards final
{
public:
	struct FFortRewardInfo                        Rewards;                                           // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_SetRewards) == 0x000008, "Wrong alignment on FortCollectionBookGenericRewardWidget_SetRewards");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_SetRewards) == 0x000030, "Wrong size on FortCollectionBookGenericRewardWidget_SetRewards");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_SetRewards, Rewards) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_SetRewards::Rewards' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.SetRewardStatus
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_SetRewardStatus final
{
public:
	ECollectionBookRewardStatus                   Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_SetRewardStatus) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_SetRewardStatus");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_SetRewardStatus) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_SetRewardStatus");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_SetRewardStatus, Status) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_SetRewardStatus::Status' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.GetRewardStatus
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_GetRewardStatus final
{
public:
	ECollectionBookRewardStatus                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_GetRewardStatus) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_GetRewardStatus");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_GetRewardStatus) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_GetRewardStatus");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_GetRewardStatus, ReturnValue) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_GetRewardStatus::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.HasRewards
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_HasRewards final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_HasRewards) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_HasRewards");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_HasRewards) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_HasRewards");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_HasRewards, ReturnValue) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_HasRewards::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.CanItemBePurchased
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookItemPopupMenu_CanItemBePurchased final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_CanItemBePurchased) == 0x000001, "Wrong alignment on FortCollectionBookItemPopupMenu_CanItemBePurchased");
static_assert(sizeof(FortCollectionBookItemPopupMenu_CanItemBePurchased) == 0x000001, "Wrong size on FortCollectionBookItemPopupMenu_CanItemBePurchased");
static_assert(offsetof(FortCollectionBookItemPopupMenu_CanItemBePurchased, ReturnValue) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_CanItemBePurchased::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.CanItemBeUnslotted
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookItemPopupMenu_CanItemBeUnslotted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_CanItemBeUnslotted) == 0x000001, "Wrong alignment on FortCollectionBookItemPopupMenu_CanItemBeUnslotted");
static_assert(sizeof(FortCollectionBookItemPopupMenu_CanItemBeUnslotted) == 0x000001, "Wrong size on FortCollectionBookItemPopupMenu_CanItemBeUnslotted");
static_assert(offsetof(FortCollectionBookItemPopupMenu_CanItemBeUnslotted, ReturnValue) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_CanItemBeUnslotted::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.HandleItemChanged
// 0x0003 (0x0003 - 0x0000)
struct FortCollectionBookItemPopupMenu_HandleItemChanged final
{
public:
	bool                                          bItemChanged;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAmmoChanged;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIngredientsChanged;                               // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_HandleItemChanged) == 0x000001, "Wrong alignment on FortCollectionBookItemPopupMenu_HandleItemChanged");
static_assert(sizeof(FortCollectionBookItemPopupMenu_HandleItemChanged) == 0x000003, "Wrong size on FortCollectionBookItemPopupMenu_HandleItemChanged");
static_assert(offsetof(FortCollectionBookItemPopupMenu_HandleItemChanged, bItemChanged) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_HandleItemChanged::bItemChanged' has a wrong offset!");
static_assert(offsetof(FortCollectionBookItemPopupMenu_HandleItemChanged, bAmmoChanged) == 0x000001, "Member 'FortCollectionBookItemPopupMenu_HandleItemChanged::bAmmoChanged' has a wrong offset!");
static_assert(offsetof(FortCollectionBookItemPopupMenu_HandleItemChanged, bIngredientsChanged) == 0x000002, "Member 'FortCollectionBookItemPopupMenu_HandleItemChanged::bIngredientsChanged' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.GetHostButton
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookItemPopupMenu_GetHostButton final
{
public:
	class UFortCollectionBookSlotButton*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_GetHostButton) == 0x000008, "Wrong alignment on FortCollectionBookItemPopupMenu_GetHostButton");
static_assert(sizeof(FortCollectionBookItemPopupMenu_GetHostButton) == 0x000008, "Wrong size on FortCollectionBookItemPopupMenu_GetHostButton");
static_assert(offsetof(FortCollectionBookItemPopupMenu_GetHostButton, ReturnValue) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_GetHostButton::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookOverviewWidget.HandlePagesChanged
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookOverviewWidget_HandlePagesChanged final
{
public:
	class UFortCollectionBookManager*             CBManager;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookOverviewWidget_HandlePagesChanged) == 0x000008, "Wrong alignment on FortCollectionBookOverviewWidget_HandlePagesChanged");
static_assert(sizeof(FortCollectionBookOverviewWidget_HandlePagesChanged) == 0x000008, "Wrong size on FortCollectionBookOverviewWidget_HandlePagesChanged");
static_assert(offsetof(FortCollectionBookOverviewWidget_HandlePagesChanged, CBManager) == 0x000000, "Member 'FortCollectionBookOverviewWidget_HandlePagesChanged::CBManager' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.HandleRewardDetailsModalWidgetDeactivated
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated final
{
public:
	class UCommonActivatablePanelLegacy*          DeactivatedPanel;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated) == 0x000008, "Wrong size on FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated, DeactivatedPanel) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated::DeactivatedPanel' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnDetailsPageChanged
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnDetailsPageChanged final
{
public:
	const class UFortCollectionBookPage*          InNewDetailsPage;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnDetailsPageChanged) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnDetailsPageChanged");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnDetailsPageChanged) == 0x000008, "Wrong size on FortCollectionBookPageDetailsWidget_OnDetailsPageChanged");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnDetailsPageChanged, InNewDetailsPage) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnDetailsPageChanged::InNewDetailsPage' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnPageProgressionUpdated
// 0x000C (0x000C - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated final
{
public:
	int32                                         TotalFilledSlots;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSlots;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCollectionBookState                      State;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated) == 0x000004, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated) == 0x00000C, "Wrong size on FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated, TotalFilledSlots) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated::TotalFilledSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated, TotalSlots) == 0x000004, "Member 'FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated::TotalSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated, State) == 0x000008, "Member 'FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated::State' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnSlotItemComplete
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnSlotItemComplete final
{
public:
	const class UFortAccountItem*                 SlottedItem;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotId;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnSlotItemComplete");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete) == 0x000010, "Wrong size on FortCollectionBookPageDetailsWidget_OnSlotItemComplete");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete, SlottedItem) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnSlotItemComplete::SlottedItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete, SlotId) == 0x000008, "Member 'FortCollectionBookPageDetailsWidget_OnSlotItemComplete::SlotId' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnUnslotItemComplete
// 0x0018 (0x0018 - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnUnslotItemComplete final
{
public:
	const class UFortAccountItem*                 SlottedItem;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortAccountItem*                 OldItem;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotId;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnUnslotItemComplete");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete) == 0x000018, "Wrong size on FortCollectionBookPageDetailsWidget_OnUnslotItemComplete");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete, SlottedItem) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnUnslotItemComplete::SlottedItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete, OldItem) == 0x000008, "Member 'FortCollectionBookPageDetailsWidget_OnUnslotItemComplete::OldItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete, SlotId) == 0x000010, "Member 'FortCollectionBookPageDetailsWidget_OnUnslotItemComplete::SlotId' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.OnCategoryDetailsUpdated
// 0x000C (0x000C - 0x0000)
struct FortCollectionBookPageListWidget_OnCategoryDetailsUpdated final
{
public:
	int32                                         AvailableSlots;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FilledSlots;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSlots;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated) == 0x000004, "Wrong alignment on FortCollectionBookPageListWidget_OnCategoryDetailsUpdated");
static_assert(sizeof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated) == 0x00000C, "Wrong size on FortCollectionBookPageListWidget_OnCategoryDetailsUpdated");
static_assert(offsetof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated, AvailableSlots) == 0x000000, "Member 'FortCollectionBookPageListWidget_OnCategoryDetailsUpdated::AvailableSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated, FilledSlots) == 0x000004, "Member 'FortCollectionBookPageListWidget_OnCategoryDetailsUpdated::FilledSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated, TotalSlots) == 0x000008, "Member 'FortCollectionBookPageListWidget_OnCategoryDetailsUpdated::TotalSlots' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.OnPageDetailsUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookPageListWidget_OnPageDetailsUpdated final
{
public:
	int32                                         AvailableSlots;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FilledSlots;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSlots;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCollectionBookState                      State;                                             // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageListWidget_OnPageDetailsUpdated) == 0x000004, "Wrong alignment on FortCollectionBookPageListWidget_OnPageDetailsUpdated");
static_assert(sizeof(FortCollectionBookPageListWidget_OnPageDetailsUpdated) == 0x000010, "Wrong size on FortCollectionBookPageListWidget_OnPageDetailsUpdated");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, AvailableSlots) == 0x000000, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::AvailableSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, FilledSlots) == 0x000004, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::FilledSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, TotalSlots) == 0x000008, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::TotalSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, State) == 0x00000C, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::State' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.OnSlottedItemOperationComplete
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookPageListWidget_OnSlottedItemOperationComplete final
{
public:
	const class UFortAccountItem*                 SlottedItem;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotId;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete) == 0x000008, "Wrong alignment on FortCollectionBookPageListWidget_OnSlottedItemOperationComplete");
static_assert(sizeof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete) == 0x000010, "Wrong size on FortCollectionBookPageListWidget_OnSlottedItemOperationComplete");
static_assert(offsetof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete, SlottedItem) == 0x000000, "Member 'FortCollectionBookPageListWidget_OnSlottedItemOperationComplete::SlottedItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete, SlotId) == 0x000008, "Member 'FortCollectionBookPageListWidget_OnSlottedItemOperationComplete::SlotId' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.SetupAsCategory
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPageListWidget_SetupAsCategory final
{
public:
	class UFortCollectionBookCategory*            Category;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageListWidget_SetupAsCategory) == 0x000008, "Wrong alignment on FortCollectionBookPageListWidget_SetupAsCategory");
static_assert(sizeof(FortCollectionBookPageListWidget_SetupAsCategory) == 0x000008, "Wrong size on FortCollectionBookPageListWidget_SetupAsCategory");
static_assert(offsetof(FortCollectionBookPageListWidget_SetupAsCategory, Category) == 0x000000, "Member 'FortCollectionBookPageListWidget_SetupAsCategory::Category' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.SetupAsPage
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPageListWidget_SetupAsPage final
{
public:
	class UFortCollectionBookPage*                Page;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageListWidget_SetupAsPage) == 0x000008, "Wrong alignment on FortCollectionBookPageListWidget_SetupAsPage");
static_assert(sizeof(FortCollectionBookPageListWidget_SetupAsPage) == 0x000008, "Wrong size on FortCollectionBookPageListWidget_SetupAsPage");
static_assert(offsetof(FortCollectionBookPageListWidget_SetupAsPage, Page) == 0x000000, "Member 'FortCollectionBookPageListWidget_SetupAsPage::Page' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPicker.ShowMulchDialogForItem
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPicker_ShowMulchDialogForItem final
{
public:
	class UFortItem*                              ItemToMulch;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPicker_ShowMulchDialogForItem) == 0x000008, "Wrong alignment on FortCollectionBookPicker_ShowMulchDialogForItem");
static_assert(sizeof(FortCollectionBookPicker_ShowMulchDialogForItem) == 0x000008, "Wrong size on FortCollectionBookPicker_ShowMulchDialogForItem");
static_assert(offsetof(FortCollectionBookPicker_ShowMulchDialogForItem, ItemToMulch) == 0x000000, "Member 'FortCollectionBookPicker_ShowMulchDialogForItem::ItemToMulch' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel.OnCollectionBookPageClicked
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked final
{
public:
	const class UFortCollectionBookPage*          ClickedPage;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked) == 0x000008, "Wrong alignment on FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked");
static_assert(sizeof(FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked) == 0x000008, "Wrong size on FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked");
static_assert(offsetof(FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked, ClickedPage) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_OnCollectionBookPageClicked::ClickedPage' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel.OnCollectionBookPageSelected
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected final
{
public:
	const class UFortCollectionBookPage*          SelectedPage;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected) == 0x000008, "Wrong alignment on FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected");
static_assert(sizeof(FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected) == 0x000008, "Wrong size on FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected");
static_assert(offsetof(FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected, SelectedPage) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_OnCollectionBookPageSelected::SelectedPage' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel.OnCollectionBookSectionClicked
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked final
{
public:
	const class UFortCollectionBookSection*       ClickedSection;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked) == 0x000008, "Wrong alignment on FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked");
static_assert(sizeof(FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked) == 0x000008, "Wrong size on FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked");
static_assert(offsetof(FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked, ClickedSection) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_OnCollectionBookSectionClicked::ClickedSection' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookPrimaryPanel_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_OnInputMethodChanged) == 0x000001, "Wrong alignment on FortCollectionBookPrimaryPanel_OnInputMethodChanged");
static_assert(sizeof(FortCollectionBookPrimaryPanel_OnInputMethodChanged) == 0x000001, "Wrong size on FortCollectionBookPrimaryPanel_OnInputMethodChanged");
static_assert(offsetof(FortCollectionBookPrimaryPanel_OnInputMethodChanged, CurrentInputType) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_OnInputMethodChanged::CurrentInputType' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel.OnSummonInfoPanelExecuted
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted) == 0x000001, "Wrong alignment on FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted");
static_assert(sizeof(FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted) == 0x000001, "Wrong size on FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted");
static_assert(offsetof(FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted, bPassThrough) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_OnSummonInfoPanelExecuted::bPassThrough' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy.OnBackActionExecuted
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted) == 0x000001, "Wrong alignment on FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted");
static_assert(sizeof(FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted) == 0x000001, "Wrong size on FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted");
static_assert(offsetof(FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted, bPassThrough) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_Legacy_OnBackActionExecuted::bPassThrough' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy.OnCollectionBookPageClicked
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked final
{
public:
	const class UFortCollectionBookPage*          ClickedPage;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked) == 0x000008, "Wrong alignment on FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked");
static_assert(sizeof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked) == 0x000008, "Wrong size on FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked");
static_assert(offsetof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked, ClickedPage) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageClicked::ClickedPage' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy.OnCollectionBookPageSelected
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected final
{
public:
	const class UFortCollectionBookPage*          SelectedPage;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected) == 0x000008, "Wrong alignment on FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected");
static_assert(sizeof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected) == 0x000008, "Wrong size on FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected");
static_assert(offsetof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected, SelectedPage) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookPageSelected::SelectedPage' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy.OnCollectionBookSectionClicked
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked final
{
public:
	const class UFortCollectionBookSection*       ClickedSection;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked) == 0x000008, "Wrong alignment on FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked");
static_assert(sizeof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked) == 0x000008, "Wrong size on FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked");
static_assert(offsetof(FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked, ClickedSection) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_Legacy_OnCollectionBookSectionClicked::ClickedSection' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged) == 0x000001, "Wrong alignment on FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged");
static_assert(sizeof(FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged) == 0x000001, "Wrong size on FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged");
static_assert(offsetof(FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged, CurrentInputType) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_Legacy_OnInputMethodChanged::CurrentInputType' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy.OnSummonInfoPanelExecuted
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted) == 0x000001, "Wrong alignment on FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted");
static_assert(sizeof(FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted) == 0x000001, "Wrong size on FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted");
static_assert(offsetof(FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted, bPassThrough) == 0x000000, "Member 'FortCollectionBookPrimaryPanel_Legacy_OnSummonInfoPanelExecuted::bPassThrough' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardDetailInspectWidget.OnXPRequiredChanged
// 0x0004 (0x0004 - 0x0000)
struct FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged final
{
public:
	int32                                         NewXPRequired;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged) == 0x000004, "Wrong alignment on FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged");
static_assert(sizeof(FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged) == 0x000004, "Wrong size on FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged");
static_assert(offsetof(FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged, NewXPRequired) == 0x000000, "Member 'FortCollectionBookProgressionRewardDetailInspectWidget_OnXPRequiredChanged::NewXPRequired' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardDetailInspectWidget.SetAssociatedLevel
// 0x0004 (0x0004 - 0x0000)
struct FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel) == 0x000004, "Wrong alignment on FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel");
static_assert(sizeof(FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel) == 0x000004, "Wrong size on FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel");
static_assert(offsetof(FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel, Level) == 0x000000, "Member 'FortCollectionBookProgressionRewardDetailInspectWidget_SetAssociatedLevel::Level' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardDetailInspectWidget.GetXPRequired
// 0x0004 (0x0004 - 0x0000)
struct FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired) == 0x000004, "Wrong alignment on FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired");
static_assert(sizeof(FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired) == 0x000004, "Wrong size on FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired");
static_assert(offsetof(FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired, ReturnValue) == 0x000000, "Member 'FortCollectionBookProgressionRewardDetailInspectWidget_GetXPRequired::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardsModalWidget.InspectItemBP
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookProgressionRewardsModalWidget_InspectItemBP final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookProgressionRewardsModalWidget_InspectItemBP) == 0x000008, "Wrong alignment on FortCollectionBookProgressionRewardsModalWidget_InspectItemBP");
static_assert(sizeof(FortCollectionBookProgressionRewardsModalWidget_InspectItemBP) == 0x000008, "Wrong size on FortCollectionBookProgressionRewardsModalWidget_InspectItemBP");
static_assert(offsetof(FortCollectionBookProgressionRewardsModalWidget_InspectItemBP, Item) == 0x000000, "Member 'FortCollectionBookProgressionRewardsModalWidget_InspectItemBP::Item' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardsModalWidget.OnLevelProgressionSet
// 0x000C (0x000C - 0x0000)
struct FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet final
{
public:
	int32                                         CurrentLevel;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextLvlPct;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAchievedLevel;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet) == 0x000004, "Wrong alignment on FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet");
static_assert(sizeof(FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet) == 0x00000C, "Wrong size on FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet");
static_assert(offsetof(FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet, CurrentLevel) == 0x000000, "Member 'FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet::CurrentLevel' has a wrong offset!");
static_assert(offsetof(FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet, NextLvlPct) == 0x000004, "Member 'FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet::NextLvlPct' has a wrong offset!");
static_assert(offsetof(FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet, MaxAchievedLevel) == 0x000008, "Member 'FortCollectionBookProgressionRewardsModalWidget_OnLevelProgressionSet::MaxAchievedLevel' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardsModalWidget.OnSelectedButtonChanged
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged final
{
public:
	class UCommonButtonLegacy*                    SelectedButton;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged) == 0x000008, "Wrong alignment on FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged");
static_assert(sizeof(FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged) == 0x000010, "Wrong size on FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged");
static_assert(offsetof(FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged, SelectedButton) == 0x000000, "Member 'FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged::SelectedButton' has a wrong offset!");
static_assert(offsetof(FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged, ButtonIndex) == 0x000008, "Member 'FortCollectionBookProgressionRewardsModalWidget_OnSelectedButtonChanged::ButtonIndex' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookProgressionRewardWidget.SetAssociatedLevel
// 0x0004 (0x0004 - 0x0000)
struct FortCollectionBookProgressionRewardWidget_SetAssociatedLevel final
{
public:
