#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SentryRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SentryRuntime.CreativeSentryAnimInstance
// 0x0020 (0x05D0 - 0x05B0)
class UCreativeSentryAnimInstance final : public UFortDefenderAnimInstance
{
public:
	float                                         RotateAimAnimationPitch;                           // 0x05B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CounterRotateAimAnimationPitch;                    // 0x05B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRelaxedLevel1OrNotTargeting;                    // 0x05B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RightHandIKAlpha;                                  // 0x05BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OneMinusLeftHandFK;                                // 0x05C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftHandIKAlpha;                                   // 0x05C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RetargetHandIKBonesToFKPositionWeight;             // 0x05C8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeSentryAnimInstance">();
	}
	static class UCreativeSentryAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeSentryAnimInstance>();
	}
};
static_assert(alignof(UCreativeSentryAnimInstance) == 0x000010, "Wrong alignment on UCreativeSentryAnimInstance");
static_assert(sizeof(UCreativeSentryAnimInstance) == 0x0005D0, "Wrong size on UCreativeSentryAnimInstance");
static_assert(offsetof(UCreativeSentryAnimInstance, RotateAimAnimationPitch) == 0x0005B0, "Member 'UCreativeSentryAnimInstance::RotateAimAnimationPitch' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, CounterRotateAimAnimationPitch) == 0x0005B4, "Member 'UCreativeSentryAnimInstance::CounterRotateAimAnimationPitch' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, bIsRelaxedLevel1OrNotTargeting) == 0x0005B8, "Member 'UCreativeSentryAnimInstance::bIsRelaxedLevel1OrNotTargeting' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, RightHandIKAlpha) == 0x0005BC, "Member 'UCreativeSentryAnimInstance::RightHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, OneMinusLeftHandFK) == 0x0005C0, "Member 'UCreativeSentryAnimInstance::OneMinusLeftHandFK' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, LeftHandIKAlpha) == 0x0005C4, "Member 'UCreativeSentryAnimInstance::LeftHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, RetargetHandIKBonesToFKPositionWeight) == 0x0005C8, "Member 'UCreativeSentryAnimInstance::RetargetHandIKBonesToFKPositionWeight' has a wrong offset!");

}

