#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownRegionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownRegionButton.ShowdownRegionButton_C
// 0x0030 (0x1560 - 0x1530)
class UShowdownRegionButton_C final : public UFortShowdownRegionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Bounce;                                       // 0x1538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x1540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonBackground_CTA_C*      Background;                                        // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_ShowdownRegionButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownRegionButton_C">();
	}
	static class UShowdownRegionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownRegionButton_C>();
	}
};
static_assert(alignof(UShowdownRegionButton_C) == 0x000010, "Wrong alignment on UShowdownRegionButton_C");
static_assert(sizeof(UShowdownRegionButton_C) == 0x001560, "Wrong size on UShowdownRegionButton_C");
static_assert(offsetof(UShowdownRegionButton_C, UberGraphFrame) == 0x001530, "Member 'UShowdownRegionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownRegionButton_C, Anim_Bounce) == 0x001538, "Member 'UShowdownRegionButton_C::Anim_Bounce' has a wrong offset!");
static_assert(offsetof(UShowdownRegionButton_C, Anim_Pressed_Transition) == 0x001540, "Member 'UShowdownRegionButton_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UShowdownRegionButton_C, Anim_Hovered_Transition) == 0x001548, "Member 'UShowdownRegionButton_C::Anim_Hovered_Transition' has a wrong offset!");
static_assert(offsetof(UShowdownRegionButton_C, Background) == 0x001550, "Member 'UShowdownRegionButton_C::Background' has a wrong offset!");

}

