#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownPosterViolator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownPosterViolator.ShowdownPosterViolator_C
// 0x0030 (0x0360 - 0x0330)
class UShowdownPosterViolator_C final : public UFortTournamentPosterViolator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          FutureEventViolator;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          InformationViolator;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          LiveEventViolator;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveViolator_C*                        LiveViolator;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoViolator;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShowdownPosterViolator(int32 EntryPoint);
	void OnViolatorStateRefreshed(ETournmentPosterViolatorState NewTimeState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownPosterViolator_C">();
	}
	static class UShowdownPosterViolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownPosterViolator_C>();
	}
};
static_assert(alignof(UShowdownPosterViolator_C) == 0x000008, "Wrong alignment on UShowdownPosterViolator_C");
static_assert(sizeof(UShowdownPosterViolator_C) == 0x000360, "Wrong size on UShowdownPosterViolator_C");
static_assert(offsetof(UShowdownPosterViolator_C, UberGraphFrame) == 0x000330, "Member 'UShowdownPosterViolator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownPosterViolator_C, FutureEventViolator) == 0x000338, "Member 'UShowdownPosterViolator_C::FutureEventViolator' has a wrong offset!");
static_assert(offsetof(UShowdownPosterViolator_C, InformationViolator) == 0x000340, "Member 'UShowdownPosterViolator_C::InformationViolator' has a wrong offset!");
static_assert(offsetof(UShowdownPosterViolator_C, LiveEventViolator) == 0x000348, "Member 'UShowdownPosterViolator_C::LiveEventViolator' has a wrong offset!");
static_assert(offsetof(UShowdownPosterViolator_C, LiveViolator) == 0x000350, "Member 'UShowdownPosterViolator_C::LiveViolator' has a wrong offset!");
static_assert(offsetof(UShowdownPosterViolator_C, NoViolator) == 0x000358, "Member 'UShowdownPosterViolator_C::NoViolator' has a wrong offset!");

}

