#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownEventTileViolator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownEventTileViolator.ShowdownEventTileViolator_C
// 0x0040 (0x07C0 - 0x0780)
class UShowdownEventTileViolator_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus;                                             // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_RoundNumber;                       // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_EventState;                   // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_Proximity;                    // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveViolator_C*                        LiveViolator;                                      // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OverrideDoNotShowRound;                            // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ShowdownEventTileViolator(int32 EntryPoint);
	void RefreshDataBP();
	void RefreshViolatorData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownEventTileViolator_C">();
	}
	static class UShowdownEventTileViolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownEventTileViolator_C>();
	}
};
static_assert(alignof(UShowdownEventTileViolator_C) == 0x000008, "Wrong alignment on UShowdownEventTileViolator_C");
static_assert(sizeof(UShowdownEventTileViolator_C) == 0x0007C0, "Wrong size on UShowdownEventTileViolator_C");
static_assert(offsetof(UShowdownEventTileViolator_C, UberGraphFrame) == 0x000780, "Member 'UShowdownEventTileViolator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, Focus) == 0x000788, "Member 'UShowdownEventTileViolator_C::Focus' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, CommonTextBlock_0) == 0x000790, "Member 'UShowdownEventTileViolator_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, CommonTextBlock_RoundNumber) == 0x000798, "Member 'UShowdownEventTileViolator_C::CommonTextBlock_RoundNumber' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, CommonWidgetSwitcher_EventState) == 0x0007A0, "Member 'UShowdownEventTileViolator_C::CommonWidgetSwitcher_EventState' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, CommonWidgetSwitcher_Proximity) == 0x0007A8, "Member 'UShowdownEventTileViolator_C::CommonWidgetSwitcher_Proximity' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, LiveViolator) == 0x0007B0, "Member 'UShowdownEventTileViolator_C::LiveViolator' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileViolator_C, OverrideDoNotShowRound) == 0x0007B8, "Member 'UShowdownEventTileViolator_C::OverrideDoNotShowRound' has a wrong offset!");

}

