#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownDivisionLobbyPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C
// 0x0148 (0x0900 - 0x07B8)
class UShowdownDivisionLobbyPanel_C final : public UFortDivisionLobbyPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EventButtonHover;                                  // 0x07C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x07C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Bar_DivisionProgress;                              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTimeRemaining;                               // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CentralContentSwitcher;                            // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_EarnAPin;                          // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_TournamentWarnings;           // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EarnPinContent;                                    // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EarnPinMessage;                                    // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GP_LeagueHeader;                                   // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_DivisionProgress;                    // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxJustHYpe;                             // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HypeIcon;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsButtonBG;                             // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG;                                     // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBG;                                     // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBorder;                                 // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MFA_WarningText;                                   // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoMessage;                                         // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichTextBlock_TournamentTitle;                     // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CrossplayWarning;                             // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CurrentHype;                                  // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DetailsButton;                                // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DivsionProgress;                              // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DivsionRank;                                  // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MatchCapWarning;                              // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Remaining;                                    // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningMessage;                                    // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Progress;                           // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            PrimaryColor;                                      // 0x08C0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ShadowColor;                                       // 0x08D4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HighlightColor;                                    // 0x08E8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void EventColorize();
	void EventSwitchUI(ECommonInputType bNewInputType);
	void ExecuteUbergraph_ShowdownDivisionLobbyPanel(int32 EntryPoint);
	void HandleCrossplayChanged();
	void InputTypeChanged(bool isGamepad);
	void Refresh();
	void RefreshDataBP();
	void RefreshDivisionData();
	void UpdateColors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownDivisionLobbyPanel_C">();
	}
	static class UShowdownDivisionLobbyPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownDivisionLobbyPanel_C>();
	}
};
static_assert(alignof(UShowdownDivisionLobbyPanel_C) == 0x000008, "Wrong alignment on UShowdownDivisionLobbyPanel_C");
static_assert(sizeof(UShowdownDivisionLobbyPanel_C) == 0x000900, "Wrong size on UShowdownDivisionLobbyPanel_C");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, UberGraphFrame) == 0x0007B8, "Member 'UShowdownDivisionLobbyPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EventButtonHover) == 0x0007C0, "Member 'UShowdownDivisionLobbyPanel_C::EventButtonHover' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Intro) == 0x0007C8, "Member 'UShowdownDivisionLobbyPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Bar_DivisionProgress) == 0x0007D0, "Member 'UShowdownDivisionLobbyPanel_C::Bar_DivisionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, BorderTimeRemaining) == 0x0007D8, "Member 'UShowdownDivisionLobbyPanel_C::BorderTimeRemaining' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CentralContentSwitcher) == 0x0007E0, "Member 'UShowdownDivisionLobbyPanel_C::CentralContentSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonTextBlock_1) == 0x0007E8, "Member 'UShowdownDivisionLobbyPanel_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonTextBlock_EarnAPin) == 0x0007F0, "Member 'UShowdownDivisionLobbyPanel_C::CommonTextBlock_EarnAPin' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonWidgetSwitcher_TournamentWarnings) == 0x0007F8, "Member 'UShowdownDivisionLobbyPanel_C::CommonWidgetSwitcher_TournamentWarnings' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EarnPinContent) == 0x000800, "Member 'UShowdownDivisionLobbyPanel_C::EarnPinContent' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EarnPinMessage) == 0x000808, "Member 'UShowdownDivisionLobbyPanel_C::EarnPinMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, GP_LeagueHeader) == 0x000810, "Member 'UShowdownDivisionLobbyPanel_C::GP_LeagueHeader' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HorizontalBox_DivisionProgress) == 0x000818, "Member 'UShowdownDivisionLobbyPanel_C::HorizontalBox_DivisionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HorizontalBoxJustHYpe) == 0x000820, "Member 'UShowdownDivisionLobbyPanel_C::HorizontalBoxJustHYpe' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HypeIcon) == 0x000828, "Member 'UShowdownDivisionLobbyPanel_C::HypeIcon' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_4) == 0x000830, "Member 'UShowdownDivisionLobbyPanel_C::Image_4' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_35) == 0x000838, "Member 'UShowdownDivisionLobbyPanel_C::Image_35' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_DetailsButtonBG) == 0x000840, "Member 'UShowdownDivisionLobbyPanel_C::Image_DetailsButtonBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_ErrorBG) == 0x000848, "Member 'UShowdownDivisionLobbyPanel_C::Image_ErrorBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_PanelBG) == 0x000850, "Member 'UShowdownDivisionLobbyPanel_C::Image_PanelBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_PanelBorder) == 0x000858, "Member 'UShowdownDivisionLobbyPanel_C::Image_PanelBorder' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, MFA_WarningText) == 0x000860, "Member 'UShowdownDivisionLobbyPanel_C::MFA_WarningText' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, NoMessage) == 0x000868, "Member 'UShowdownDivisionLobbyPanel_C::NoMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, RichTextBlock_TournamentTitle) == 0x000870, "Member 'UShowdownDivisionLobbyPanel_C::RichTextBlock_TournamentTitle' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_CrossplayWarning) == 0x000878, "Member 'UShowdownDivisionLobbyPanel_C::Text_CrossplayWarning' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_CurrentHype) == 0x000880, "Member 'UShowdownDivisionLobbyPanel_C::Text_CurrentHype' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DetailsButton) == 0x000888, "Member 'UShowdownDivisionLobbyPanel_C::Text_DetailsButton' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DivsionProgress) == 0x000890, "Member 'UShowdownDivisionLobbyPanel_C::Text_DivsionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DivsionRank) == 0x000898, "Member 'UShowdownDivisionLobbyPanel_C::Text_DivsionRank' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_MatchCapWarning) == 0x0008A0, "Member 'UShowdownDivisionLobbyPanel_C::Text_MatchCapWarning' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_Remaining) == 0x0008A8, "Member 'UShowdownDivisionLobbyPanel_C::Text_Remaining' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, WarningMessage) == 0x0008B0, "Member 'UShowdownDivisionLobbyPanel_C::WarningMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, WidgetSwitcher_Progress) == 0x0008B8, "Member 'UShowdownDivisionLobbyPanel_C::WidgetSwitcher_Progress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, PrimaryColor) == 0x0008C0, "Member 'UShowdownDivisionLobbyPanel_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, ShadowColor) == 0x0008D4, "Member 'UShowdownDivisionLobbyPanel_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HighlightColor) == 0x0008E8, "Member 'UShowdownDivisionLobbyPanel_C::HighlightColor' has a wrong offset!");

}

