#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarExitPopupRight

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_ExitGame_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_LeaveExperience_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_No_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_BndEvt__SidebarExitPopup_Button_Yes_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.ExecuteUbergraph_SidebarExitPopupRight
// 0x0158 (0x0158 - 0x0000)
struct SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllowLogout;                         // 0x003A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllowQuit;                           // 0x003B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
	bool                                          CallFunc_LeaveCreativeFavoriteButtonEnabled_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0070(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LeaveCreativeSupportButtonEnabled_ReturnValue; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_1;  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_2;  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_3;  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_4;  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_5;  // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_3;               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight");
static_assert(sizeof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight) == 0x000158, "Wrong size on SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, EntryPoint) == 0x000000, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_bool_Variable) == 0x000004, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_byte_Variable) == 0x000010, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_byte_Variable_1) == 0x000011, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_bool_Variable_1) == 0x000012, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_byte_Variable_2) == 0x000013, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_byte_Variable_3) == 0x000014, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_GetCurrentInputType_ReturnValue) == 0x00002C, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_bool_Variable_2) == 0x000038, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_Event_bAllowLogout) == 0x00003A, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_Event_bAllowLogout' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_Event_bAllowQuit) == 0x00003B, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_Event_bAllowQuit' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, Temp_bool_Variable_3) == 0x000048, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_Select_Default) == 0x000050, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_LeaveCreativeFavoriteButtonEnabled_ReturnValue) == 0x000068, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_LeaveCreativeFavoriteButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_Select_Default_1) == 0x000070, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_Select_Default_2) == 0x000088, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_LeaveCreativeSupportButtonEnabled_ReturnValue) == 0x000089, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_LeaveCreativeSupportButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_Select_Default_3) == 0x00008A, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_CustomEvent_Button) == 0x000090, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_GetContext_ReturnValue) == 0x000098, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base) == 0x0000A0, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_GetContext_ReturnValue_1) == 0x0000B0, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button_6) == 0x0000B8, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button_5) == 0x0000C0, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_1) == 0x0000C8, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_2) == 0x0000D8, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button_4) == 0x0000E8, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button_3) == 0x0000F0, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_3) == 0x0000F8, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_4) == 0x000108, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_4' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button_2) == 0x000118, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button_1) == 0x000120, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_5) == 0x000128, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_5' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, K2Node_ComponentBoundEvent_Button) == 0x000138, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000140, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000148, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight, CallFunc_SpawnSound2D_ReturnValue_3) == 0x000150, "Member 'SidebarExitPopupRight_C_ExecuteUbergraph_SidebarExitPopupRight::CallFunc_SpawnSound2D_ReturnValue_3' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.OnButtonBaseClicked_Event
// 0x0008 (0x0008 - 0x0000)
struct SidebarExitPopupRight_C_OnButtonBaseClicked_Event final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_OnButtonBaseClicked_Event) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_OnButtonBaseClicked_Event");
static_assert(sizeof(SidebarExitPopupRight_C_OnButtonBaseClicked_Event) == 0x000008, "Wrong size on SidebarExitPopupRight_C_OnButtonBaseClicked_Event");
static_assert(offsetof(SidebarExitPopupRight_C_OnButtonBaseClicked_Event, Button) == 0x000000, "Member 'SidebarExitPopupRight_C_OnButtonBaseClicked_Event::Button' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.OnInputMethodChanged
// 0x0007 (0x0007 - 0x0000)
struct SidebarExitPopupRight_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on SidebarExitPopupRight_C_OnInputMethodChanged");
static_assert(sizeof(SidebarExitPopupRight_C_OnInputMethodChanged) == 0x000007, "Wrong size on SidebarExitPopupRight_C_OnInputMethodChanged");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, NewInputType) == 0x000000, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::NewInputType' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, Temp_byte_Variable) == 0x000001, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, Temp_bool_Variable) == 0x000002, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, Temp_bool_Variable_1) == 0x000003, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, Temp_bool_Variable_2) == 0x000004, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, Temp_bool_Variable_3) == 0x000005, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_OnInputMethodChanged, K2Node_Select_Default) == 0x000006, "Member 'SidebarExitPopupRight_C_OnInputMethodChanged::K2Node_Select_Default' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.RefreshButtonsVisual
// 0x0048 (0x0048 - 0x0000)
struct SidebarExitPopupRight_C_RefreshButtonsVisual final
{
public:
	bool                                          IsTouch;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExpressYourSupportThumbsUpButtonRight_C* K2Node_DynamicCast_AsWBP_Express_Your_Support_Thumbs_Up_Button_Right; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExpressYourSupportThumbsUpButtonRight_C* K2Node_DynamicCast_AsWBP_Express_Your_Support_Thumbs_Up_Button_Right_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LeaveCreativeSupportButtonEnabled_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LeaveCreativeFavoriteButtonEnabled_ReturnValue; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExpressYourSupportFavoriteButton_C* K2Node_DynamicCast_AsWBP_Express_Your_Support_Favorite_Button; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExpressYourSupportFavoriteButton_C* K2Node_DynamicCast_AsWBP_Express_Your_Support_Favorite_Button_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_RefreshButtonsVisual) == 0x000008, "Wrong alignment on SidebarExitPopupRight_C_RefreshButtonsVisual");
static_assert(sizeof(SidebarExitPopupRight_C_RefreshButtonsVisual) == 0x000048, "Wrong size on SidebarExitPopupRight_C_RefreshButtonsVisual");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, IsTouch) == 0x000000, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::IsTouch' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_AsWBP_Express_Your_Support_Thumbs_Up_Button_Right) == 0x000008, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_AsWBP_Express_Your_Support_Thumbs_Up_Button_Right' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_AsWBP_Express_Your_Support_Thumbs_Up_Button_Right_1) == 0x000018, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_AsWBP_Express_Your_Support_Thumbs_Up_Button_Right_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, CallFunc_LeaveCreativeSupportButtonEnabled_ReturnValue) == 0x000021, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::CallFunc_LeaveCreativeSupportButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, CallFunc_LeaveCreativeFavoriteButtonEnabled_ReturnValue) == 0x000022, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::CallFunc_LeaveCreativeFavoriteButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, Temp_byte_Variable) == 0x000023, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, Temp_byte_Variable_1) == 0x000025, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_AsWBP_Express_Your_Support_Favorite_Button) == 0x000028, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_AsWBP_Express_Your_Support_Favorite_Button' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_AsWBP_Express_Your_Support_Favorite_Button_1) == 0x000038, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_AsWBP_Express_Your_Support_Favorite_Button_1' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, Temp_bool_Variable) == 0x000041, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_RefreshButtonsVisual, K2Node_Select_Default) == 0x000042, "Member 'SidebarExitPopupRight_C_RefreshButtonsVisual::K2Node_Select_Default' has a wrong offset!");

// Function SidebarExitPopupRight.SidebarExitPopupRight_C.UpdateNoEnabledButtonsText
// 0x0002 (0x0002 - 0x0000)
struct SidebarExitPopupRight_C_UpdateNoEnabledButtonsText final
{
public:
	bool                                          bAllowLogout;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowQuit;                                        // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarExitPopupRight_C_UpdateNoEnabledButtonsText) == 0x000001, "Wrong alignment on SidebarExitPopupRight_C_UpdateNoEnabledButtonsText");
static_assert(sizeof(SidebarExitPopupRight_C_UpdateNoEnabledButtonsText) == 0x000002, "Wrong size on SidebarExitPopupRight_C_UpdateNoEnabledButtonsText");
static_assert(offsetof(SidebarExitPopupRight_C_UpdateNoEnabledButtonsText, bAllowLogout) == 0x000000, "Member 'SidebarExitPopupRight_C_UpdateNoEnabledButtonsText::bAllowLogout' has a wrong offset!");
static_assert(offsetof(SidebarExitPopupRight_C_UpdateNoEnabledButtonsText, bAllowQuit) == 0x000001, "Member 'SidebarExitPopupRight_C_UpdateNoEnabledButtonsText::bAllowQuit' has a wrong offset!");

}

