#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSpecialNavWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SidebarSpecialNavWidget.SidebarSpecialNavWidget_C.ExecuteUbergraph_SidebarSpecialNavWidget
// 0x0020 (0x0020 - 0x0000)
struct SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget) == 0x000008, "Wrong alignment on SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget");
static_assert(sizeof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget) == 0x000020, "Wrong size on SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, EntryPoint) == 0x000000, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, K2Node_MakeStruct_Margin) == 0x000004, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, CallFunc_IsMobileGame_ReturnValue) == 0x000014, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000018, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");

// Function SidebarSpecialNavWidget.SidebarSpecialNavWidget_C.SetTooltipAlignment
// 0x0048 (0x0048 - 0x0000)
struct SidebarSpecialNavWidget_C_SetTooltipAlignment final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSpecialNavWidget_C_SetTooltipAlignment) == 0x000008, "Wrong alignment on SidebarSpecialNavWidget_C_SetTooltipAlignment");
static_assert(sizeof(SidebarSpecialNavWidget_C_SetTooltipAlignment) == 0x000048, "Wrong size on SidebarSpecialNavWidget_C_SetTooltipAlignment");
static_assert(offsetof(SidebarSpecialNavWidget_C_SetTooltipAlignment, Temp_bool_Variable) == 0x000000, "Member 'SidebarSpecialNavWidget_C_SetTooltipAlignment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_SetTooltipAlignment, Temp_struct_Variable) == 0x000008, "Member 'SidebarSpecialNavWidget_C_SetTooltipAlignment::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_SetTooltipAlignment, Temp_struct_Variable_1) == 0x000018, "Member 'SidebarSpecialNavWidget_C_SetTooltipAlignment::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_SetTooltipAlignment, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000028, "Member 'SidebarSpecialNavWidget_C_SetTooltipAlignment::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_SetTooltipAlignment, CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue) == 0x000030, "Member 'SidebarSpecialNavWidget_C_SetTooltipAlignment::CallFunc_GetIsDiscoverInLobbyEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_SetTooltipAlignment, K2Node_Select_Default) == 0x000038, "Member 'SidebarSpecialNavWidget_C_SetTooltipAlignment::K2Node_Select_Default' has a wrong offset!");

}

