#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarButton.SidebarButton_C
// 0x0030 (0x15E0 - 0x15B0)
class USidebarButton_C final : public UFortSocialSidebarButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unselected;                                        // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x15D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarButton(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetSkewBoxColor(const struct FLinearColor& InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarButton_C">();
	}
	static class USidebarButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarButton_C>();
	}
};
static_assert(alignof(USidebarButton_C) == 0x000010, "Wrong alignment on USidebarButton_C");
static_assert(sizeof(USidebarButton_C) == 0x0015E0, "Wrong size on USidebarButton_C");
static_assert(offsetof(USidebarButton_C, UberGraphFrame) == 0x0015B0, "Member 'USidebarButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarButton_C, Unselected) == 0x0015B8, "Member 'USidebarButton_C::Unselected' has a wrong offset!");
static_assert(offsetof(USidebarButton_C, Hovered) == 0x0015C0, "Member 'USidebarButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarButton_C, Selected) == 0x0015C8, "Member 'USidebarButton_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarButton_C, SizeBox_0) == 0x0015D0, "Member 'USidebarButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarButton_C, Condition) == 0x0015D8, "Member 'USidebarButton_C::Condition' has a wrong offset!");

}

