#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SiderbarSupervisedSettingsTooltipRight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SiderbarSupervisedSettingsTooltipRight.SiderbarSupervisedSettingsTooltipRight_C
// 0x0038 (0x0498 - 0x0460)
class USiderbarSupervisedSettingsTooltipRight_C final : public UFortSidebarOnboardTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_106;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_140;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBurst;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SiderbarSupervisedSettingsTooltipRight(int32 EntryPoint);
	void Finished_2C7F83764EE214DF43BB7BAFB7B55C0F();
	void OnEndTooltip();
	void OnShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SiderbarSupervisedSettingsTooltipRight_C">();
	}
	static class USiderbarSupervisedSettingsTooltipRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USiderbarSupervisedSettingsTooltipRight_C>();
	}
};
static_assert(alignof(USiderbarSupervisedSettingsTooltipRight_C) == 0x000008, "Wrong alignment on USiderbarSupervisedSettingsTooltipRight_C");
static_assert(sizeof(USiderbarSupervisedSettingsTooltipRight_C) == 0x000498, "Wrong size on USiderbarSupervisedSettingsTooltipRight_C");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, UberGraphFrame) == 0x000460, "Member 'USiderbarSupervisedSettingsTooltipRight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, Outro) == 0x000468, "Member 'USiderbarSupervisedSettingsTooltipRight_C::Outro' has a wrong offset!");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, Pulse) == 0x000470, "Member 'USiderbarSupervisedSettingsTooltipRight_C::Pulse' has a wrong offset!");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, CommonRichTextBlock_106) == 0x000478, "Member 'USiderbarSupervisedSettingsTooltipRight_C::CommonRichTextBlock_106' has a wrong offset!");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, CommonRichTextBlock_140) == 0x000480, "Member 'USiderbarSupervisedSettingsTooltipRight_C::CommonRichTextBlock_140' has a wrong offset!");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, Image_Arrow) == 0x000488, "Member 'USiderbarSupervisedSettingsTooltipRight_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(USiderbarSupervisedSettingsTooltipRight_C, ImageBurst) == 0x000490, "Member 'USiderbarSupervisedSettingsTooltipRight_C::ImageBurst' has a wrong offset!");

}

