#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarInviteListEntry_FriendInvite_XS

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SidebarInviteListEntry_FriendInvite_XS.SidebarInviteListEntry_FriendInvite_XS_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function SidebarInviteListEntry_FriendInvite_XS.SidebarInviteListEntry_FriendInvite_XS_C.ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS
// 0x0050 (0x0050 - 0x0000)
struct SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingNewAvatars;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0040(0x0008)(NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS) == 0x000008, "Wrong alignment on SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS");
static_assert(sizeof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS) == 0x000050, "Wrong size on SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, EntryPoint) == 0x000000, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, K2Node_Event_bUsingNewAvatars) == 0x000004, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::K2Node_Event_bUsingNewAvatars' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, Temp_byte_Variable) == 0x000005, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, Temp_byte_Variable_1) == 0x000006, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, Temp_bool_Variable) == 0x000007, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, Temp_byte_Variable_2) == 0x000008, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, Temp_byte_Variable_3) == 0x000009, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, K2Node_Select_Default) == 0x00000A, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, K2Node_ComponentBoundEvent_bIsOpen) == 0x000018, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, CallFunc_PlayAnimation_ReturnValue_3) == 0x000038, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, K2Node_Event_InFocusEvent) == 0x000040, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, Temp_bool_Variable_1) == 0x000048, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS, K2Node_Select_Default_1) == 0x000049, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS::K2Node_Select_Default_1' has a wrong offset!");

// Function SidebarInviteListEntry_FriendInvite_XS.SidebarInviteListEntry_FriendInvite_XS_C.HandleOnlineIndicatorView
// 0x0054 (0x0054 - 0x0000)
struct SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView final
{
public:
	uint8                                         OnlineStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView) == 0x000004, "Wrong alignment on SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView");
static_assert(sizeof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView) == 0x000054, "Wrong size on SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, OnlineStatus) == 0x000000, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::OnlineStatus' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, Temp_byte_Variable) == 0x000001, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable) == 0x000004, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable_1) == 0x000014, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable_2) == 0x000024, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable_3) == 0x000034, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView, K2Node_Select_Default) == 0x000044, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_HandleOnlineIndicatorView::K2Node_Select_Default' has a wrong offset!");

// Function SidebarInviteListEntry_FriendInvite_XS.SidebarInviteListEntry_FriendInvite_XS_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost) == 0x000004, "Wrong alignment on SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost");
static_assert(sizeof(SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost) == 0x000008, "Wrong size on SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function SidebarInviteListEntry_FriendInvite_XS.SidebarInviteListEntry_FriendInvite_XS_C.OnNewAvatarsEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged final
{
public:
	bool                                          bUsingNewAvatars;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged) == 0x000001, "Wrong alignment on SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged");
static_assert(sizeof(SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged) == 0x000001, "Wrong size on SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged");
static_assert(offsetof(SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged, bUsingNewAvatars) == 0x000000, "Member 'SidebarInviteListEntry_FriendInvite_XS_C_OnNewAvatarsEnabledChanged::bUsingNewAvatars' has a wrong offset!");

}

