#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLeavePartyListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLeavePartyListEntry.SidebarLeavePartyListEntry_C
// 0x0050 (0x1560 - 0x1510)
class USidebarLeavePartyListEntry_C final : public UFortLeavePartyListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_LeavePartyText;                               // 0x1548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLeavePartyListEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLeavePartyListEntry_C">();
	}
	static class USidebarLeavePartyListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLeavePartyListEntry_C>();
	}
};
static_assert(alignof(USidebarLeavePartyListEntry_C) == 0x000010, "Wrong alignment on USidebarLeavePartyListEntry_C");
static_assert(sizeof(USidebarLeavePartyListEntry_C) == 0x001560, "Wrong size on USidebarLeavePartyListEntry_C");
static_assert(offsetof(USidebarLeavePartyListEntry_C, UberGraphFrame) == 0x001510, "Member 'USidebarLeavePartyListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, Selected) == 0x001518, "Member 'USidebarLeavePartyListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, Hovered) == 0x001520, "Member 'USidebarLeavePartyListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, AnimatedInputBorder) == 0x001528, "Member 'USidebarLeavePartyListEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, Arrow) == 0x001530, "Member 'USidebarLeavePartyListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001538, "Member 'USidebarLeavePartyListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, EntryBorder) == 0x001540, "Member 'USidebarLeavePartyListEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, Text_LeavePartyText) == 0x001548, "Member 'USidebarLeavePartyListEntry_C::Text_LeavePartyText' has a wrong offset!");
static_assert(offsetof(USidebarLeavePartyListEntry_C, UserActionMenuInputButton) == 0x001550, "Member 'USidebarLeavePartyListEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

