#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarTeamMemberListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarTeamMemberListEntry.SidebarTeamMemberListEntry_C
// 0x0060 (0x1610 - 0x15B0)
class USidebarTeamMemberListEntry_C final : public UFortTeamMemberListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_SocialName;                               // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x15E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x15F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarTeamMemberListEntry(int32 EntryPoint);
	void OnNewAvatarsEnabledChanged(bool bUsingNewAvatars);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarTeamMemberListEntry_C">();
	}
	static class USidebarTeamMemberListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarTeamMemberListEntry_C>();
	}
};
static_assert(alignof(USidebarTeamMemberListEntry_C) == 0x000010, "Wrong alignment on USidebarTeamMemberListEntry_C");
static_assert(sizeof(USidebarTeamMemberListEntry_C) == 0x001610, "Wrong size on USidebarTeamMemberListEntry_C");
static_assert(offsetof(USidebarTeamMemberListEntry_C, UberGraphFrame) == 0x0015B0, "Member 'USidebarTeamMemberListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, Unhovered) == 0x0015B8, "Member 'USidebarTeamMemberListEntry_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, Selected) == 0x0015C0, "Member 'USidebarTeamMemberListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, Hovered) == 0x0015C8, "Member 'USidebarTeamMemberListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x0015D0, "Member 'USidebarTeamMemberListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, Switcher_SocialName) == 0x0015D8, "Member 'USidebarTeamMemberListEntry_C::Switcher_SocialName' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, UserActionMenuInputButton) == 0x0015E0, "Member 'USidebarTeamMemberListEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, EncourageEpicFriend_IdleColor) == 0x0015E8, "Member 'USidebarTeamMemberListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarTeamMemberListEntry_C, EncourageEpicFriend_HoveredColor) == 0x0015F8, "Member 'USidebarTeamMemberListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

