#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVRRVoiceChatDeactivated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C
// 0x0020 (0x1580 - 0x1560)
class USidebarVRRVoiceChatDeactivated_C final : public USocialListEntryEmptyPanelBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox;                                          // 0x1568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Regular_C*            WBP_UIKit_Button_Regular_Sec;                      // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_SidebarVRRVoiceChatDeactivated(int32 EntryPoint);
	void OnSidebarPanelVoiceChatActivated();
	void UpdateText(const class FText& Title, const class FText& Description, const class FText& ButtonText, const class FText& ButtonSecText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarVRRVoiceChatDeactivated_C">();
	}
	static class USidebarVRRVoiceChatDeactivated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarVRRVoiceChatDeactivated_C>();
	}
};
static_assert(alignof(USidebarVRRVoiceChatDeactivated_C) == 0x000010, "Wrong alignment on USidebarVRRVoiceChatDeactivated_C");
static_assert(sizeof(USidebarVRRVoiceChatDeactivated_C) == 0x001580, "Wrong size on USidebarVRRVoiceChatDeactivated_C");
static_assert(offsetof(USidebarVRRVoiceChatDeactivated_C, UberGraphFrame) == 0x001560, "Member 'USidebarVRRVoiceChatDeactivated_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarVRRVoiceChatDeactivated_C, ScaleBox) == 0x001568, "Member 'USidebarVRRVoiceChatDeactivated_C::ScaleBox' has a wrong offset!");
static_assert(offsetof(USidebarVRRVoiceChatDeactivated_C, WBP_UIKit_Button_Regular_Sec) == 0x001570, "Member 'USidebarVRRVoiceChatDeactivated_C::WBP_UIKit_Button_Regular_Sec' has a wrong offset!");

}

