#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgEmptyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgEmptyButton.SidebarLfgEmptyButton_C
// 0x0030 (0x14C0 - 0x1490)
class USidebarLfgEmptyButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonCopy;                                        // 0x14A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SidebarLfgEmptyButton(int32 EntryPoint);
	void OnHover();
	void OnUnhover();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgEmptyButton_C">();
	}
	static class USidebarLfgEmptyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgEmptyButton_C>();
	}
};
static_assert(alignof(USidebarLfgEmptyButton_C) == 0x000010, "Wrong alignment on USidebarLfgEmptyButton_C");
static_assert(sizeof(USidebarLfgEmptyButton_C) == 0x0014C0, "Wrong size on USidebarLfgEmptyButton_C");
static_assert(offsetof(USidebarLfgEmptyButton_C, UberGraphFrame) == 0x001490, "Member 'USidebarLfgEmptyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgEmptyButton_C, Hover) == 0x001498, "Member 'USidebarLfgEmptyButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USidebarLfgEmptyButton_C, ButtonText) == 0x0014A0, "Member 'USidebarLfgEmptyButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(USidebarLfgEmptyButton_C, ButtonCopy) == 0x0014A8, "Member 'USidebarLfgEmptyButton_C::ButtonCopy' has a wrong offset!");

}

