#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVRRVoiceChatDeactivated

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarVRRVoiceChatDeactivated_C_BndEvt__SidebarVRRVoiceChatDeactivated_WBP_UIKit_Button_Regular_Sec_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.ExecuteUbergraph_SidebarVRRVoiceChatDeactivated
// 0x00E8 (0x00E8 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0004(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0078(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Description;                          // 0x0090(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ButtonText;                           // 0x00A8(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ButtonSecText;                        // 0x00C0(0x0018)(ConstParm)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSplitscreen_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated) == 0x000008, "Wrong alignment on SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated");
static_assert(sizeof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated) == 0x0000E8, "Wrong size on SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, EntryPoint) == 0x000000, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000004, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, K2Node_ComponentBoundEvent_Button_1) == 0x000040, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_GetLocalSize_ReturnValue) == 0x000048, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, K2Node_ComponentBoundEvent_Button) == 0x000058, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_BreakVector2D_X) == 0x000060, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_BreakVector2D_Y) == 0x000068, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, K2Node_Event_Title) == 0x000078, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, K2Node_Event_Description) == 0x000090, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::K2Node_Event_Description' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, K2Node_Event_ButtonText) == 0x0000A8, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::K2Node_Event_ButtonText' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, K2Node_Event_ButtonSecText) == 0x0000C0, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::K2Node_Event_ButtonSecText' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x0000D8, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_IsInSplitscreen_ReturnValue) == 0x0000E0, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_IsInSplitscreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated, CallFunc_BooleanOR_ReturnValue) == 0x0000E1, "Member 'SidebarVRRVoiceChatDeactivated_C_ExecuteUbergraph_SidebarVRRVoiceChatDeactivated::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SidebarVRRVoiceChatDeactivated.SidebarVRRVoiceChatDeactivated_C.UpdateText
// 0x0060 (0x0060 - 0x0000)
struct SidebarVRRVoiceChatDeactivated_C_UpdateText final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Description;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ButtonText;                                        // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ButtonSecText;                                     // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SidebarVRRVoiceChatDeactivated_C_UpdateText) == 0x000008, "Wrong alignment on SidebarVRRVoiceChatDeactivated_C_UpdateText");
static_assert(sizeof(SidebarVRRVoiceChatDeactivated_C_UpdateText) == 0x000060, "Wrong size on SidebarVRRVoiceChatDeactivated_C_UpdateText");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_UpdateText, Title) == 0x000000, "Member 'SidebarVRRVoiceChatDeactivated_C_UpdateText::Title' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_UpdateText, Description) == 0x000018, "Member 'SidebarVRRVoiceChatDeactivated_C_UpdateText::Description' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_UpdateText, ButtonText) == 0x000030, "Member 'SidebarVRRVoiceChatDeactivated_C_UpdateText::ButtonText' has a wrong offset!");
static_assert(offsetof(SidebarVRRVoiceChatDeactivated_C_UpdateText, ButtonSecText) == 0x000048, "Member 'SidebarVRRVoiceChatDeactivated_C_UpdateText::ButtonSecText' has a wrong offset!");

}

