#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgState2ListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgState2ListEntry.SidebarLfgState2ListEntry_C
// 0x0040 (0x1550 - 0x1510)
class USidebarLfgState2ListEntry_C final : public UFortSidebarLfgState2ListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ButtonContainer;                                   // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarLfgState_Image_C*               SidebarLfgState_Image;                             // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarLfgState_RichText_C*            SidebarLfgState_RichText;                          // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLfgState2ListEntry(int32 EntryPoint);
	void GetIcon(ELfgState LfgState);
	void OnInitialized();
	void OnInputMethodChanged_Touch(ECommonInputType bNewInputType);
	void OnStateChanged(const ELfgState NewLfgState, const ESlateVisibility BodyVisibility, const class FText& StateText, const class FText& StateButton);
	void PreConstruct(bool IsDesignTime);
	void UpdateButtonVisibility(ELfgState LfgState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgState2ListEntry_C">();
	}
	static class USidebarLfgState2ListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgState2ListEntry_C>();
	}
};
static_assert(alignof(USidebarLfgState2ListEntry_C) == 0x000010, "Wrong alignment on USidebarLfgState2ListEntry_C");
static_assert(sizeof(USidebarLfgState2ListEntry_C) == 0x001550, "Wrong size on USidebarLfgState2ListEntry_C");
static_assert(offsetof(USidebarLfgState2ListEntry_C, UberGraphFrame) == 0x001510, "Member 'USidebarLfgState2ListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Selected) == 0x001518, "Member 'USidebarLfgState2ListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Hovered) == 0x001520, "Member 'USidebarLfgState2ListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, ButtonContainer) == 0x001528, "Member 'USidebarLfgState2ListEntry_C::ButtonContainer' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, EntryBorder) == 0x001530, "Member 'USidebarLfgState2ListEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, SidebarLfgState_Image) == 0x001538, "Member 'USidebarLfgState2ListEntry_C::SidebarLfgState_Image' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, SidebarLfgState_RichText) == 0x001540, "Member 'USidebarLfgState2ListEntry_C::SidebarLfgState_RichText' has a wrong offset!");

}

