#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgState_Image

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.ExecuteUbergraph_SidebarLfgState_Image
// 0x0008 (0x0008 - 0x0000)
struct SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image) == 0x000004, "Wrong alignment on SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image");
static_assert(sizeof(SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image) == 0x000008, "Wrong size on SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image");
static_assert(offsetof(SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image, EntryPoint) == 0x000000, "Member 'SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SidebarLfgState_Image_C_ExecuteUbergraph_SidebarLfgState_Image::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SidebarLfgState_Image_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState_Image_C_PreConstruct) == 0x000001, "Wrong alignment on SidebarLfgState_Image_C_PreConstruct");
static_assert(sizeof(SidebarLfgState_Image_C_PreConstruct) == 0x000001, "Wrong size on SidebarLfgState_Image_C_PreConstruct");
static_assert(offsetof(SidebarLfgState_Image_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SidebarLfgState_Image_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.SetColor
// 0x0010 (0x0010 - 0x0000)
struct SidebarLfgState_Image_C_SetColor final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState_Image_C_SetColor) == 0x000004, "Wrong alignment on SidebarLfgState_Image_C_SetColor");
static_assert(sizeof(SidebarLfgState_Image_C_SetColor) == 0x000010, "Wrong size on SidebarLfgState_Image_C_SetColor");
static_assert(offsetof(SidebarLfgState_Image_C_SetColor, InColorAndOpacity) == 0x000000, "Member 'SidebarLfgState_Image_C_SetColor::InColorAndOpacity' has a wrong offset!");

// Function SidebarLfgState_Image.SidebarLfgState_Image_C.SetMaterial
// 0x0028 (0x0028 - 0x0000)
struct SidebarLfgState_Image_C_SetMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      SoftMaterial;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState_Image_C_SetMaterial) == 0x000008, "Wrong alignment on SidebarLfgState_Image_C_SetMaterial");
static_assert(sizeof(SidebarLfgState_Image_C_SetMaterial) == 0x000028, "Wrong size on SidebarLfgState_Image_C_SetMaterial");
static_assert(offsetof(SidebarLfgState_Image_C_SetMaterial, SoftMaterial) == 0x000000, "Member 'SidebarLfgState_Image_C_SetMaterial::SoftMaterial' has a wrong offset!");
static_assert(offsetof(SidebarLfgState_Image_C_SetMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'SidebarLfgState_Image_C_SetMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

