#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVoiceChannelSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarVoiceChannelSettings.SidebarVoiceChannelSettings_C
// 0x0080 (0x0448 - 0x03C8)
class USidebarVoiceChannelSettings_C final : public UFortVoiceSettingsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GearHover;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    ActionWidget_InputDisplay;                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AlertIcon;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_NextInputDevice;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_NextOutputDevice;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_TogglePTT;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarRoundedRectangleButton_C*       Button_VoiceSettings;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GearIcon;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   InputDevice;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OutputDevice;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       PTTKeybindWidget;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   PushToTalk;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LowPowerMode;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoiceDisabledIcon;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   VoiceDisabledText;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarVoiceChannelSettings_Button_VoiceSettings_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_SidebarVoiceChannelSettings(int32 EntryPoint);
	void ShowVoiceSettingsButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarVoiceChannelSettings_C">();
	}
	static class USidebarVoiceChannelSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarVoiceChannelSettings_C>();
	}
};
static_assert(alignof(USidebarVoiceChannelSettings_C) == 0x000008, "Wrong alignment on USidebarVoiceChannelSettings_C");
static_assert(sizeof(USidebarVoiceChannelSettings_C) == 0x000448, "Wrong size on USidebarVoiceChannelSettings_C");
static_assert(offsetof(USidebarVoiceChannelSettings_C, UberGraphFrame) == 0x0003C8, "Member 'USidebarVoiceChannelSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, GearHover) == 0x0003D0, "Member 'USidebarVoiceChannelSettings_C::GearHover' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, ActionWidget_InputDisplay) == 0x0003D8, "Member 'USidebarVoiceChannelSettings_C::ActionWidget_InputDisplay' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, AlertIcon) == 0x0003E0, "Member 'USidebarVoiceChannelSettings_C::AlertIcon' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_NextInputDevice) == 0x0003E8, "Member 'USidebarVoiceChannelSettings_C::Button_NextInputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_NextOutputDevice) == 0x0003F0, "Member 'USidebarVoiceChannelSettings_C::Button_NextOutputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_TogglePTT) == 0x0003F8, "Member 'USidebarVoiceChannelSettings_C::Button_TogglePTT' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Button_VoiceSettings) == 0x000400, "Member 'USidebarVoiceChannelSettings_C::Button_VoiceSettings' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, GearIcon) == 0x000408, "Member 'USidebarVoiceChannelSettings_C::GearIcon' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, InputDevice) == 0x000410, "Member 'USidebarVoiceChannelSettings_C::InputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, OutputDevice) == 0x000418, "Member 'USidebarVoiceChannelSettings_C::OutputDevice' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, PTTKeybindWidget) == 0x000420, "Member 'USidebarVoiceChannelSettings_C::PTTKeybindWidget' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, PushToTalk) == 0x000428, "Member 'USidebarVoiceChannelSettings_C::PushToTalk' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, Text_LowPowerMode) == 0x000430, "Member 'USidebarVoiceChannelSettings_C::Text_LowPowerMode' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, VoiceDisabledIcon) == 0x000438, "Member 'USidebarVoiceChannelSettings_C::VoiceDisabledIcon' has a wrong offset!");
static_assert(offsetof(USidebarVoiceChannelSettings_C, VoiceDisabledText) == 0x000440, "Member 'USidebarVoiceChannelSettings_C::VoiceDisabledText' has a wrong offset!");

}

