#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarEmptyPanelButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarEmptyPanelButton.SidebarEmptyPanelButton_C
// 0x0020 (0x14C0 - 0x14A0)
class USidebarEmptyPanelButton_C final : public USidebarListEmptyPanelButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x14B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarEmptyPanelButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarEmptyPanelButton_C">();
	}
	static class USidebarEmptyPanelButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarEmptyPanelButton_C>();
	}
};
static_assert(alignof(USidebarEmptyPanelButton_C) == 0x000010, "Wrong alignment on USidebarEmptyPanelButton_C");
static_assert(sizeof(USidebarEmptyPanelButton_C) == 0x0014C0, "Wrong size on USidebarEmptyPanelButton_C");
static_assert(offsetof(USidebarEmptyPanelButton_C, UberGraphFrame) == 0x0014A0, "Member 'USidebarEmptyPanelButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarEmptyPanelButton_C, Unhovered) == 0x0014A8, "Member 'USidebarEmptyPanelButton_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarEmptyPanelButton_C, Hovered) == 0x0014B0, "Member 'USidebarEmptyPanelButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarEmptyPanelButton_C, EntryBorder) == 0x0014B8, "Member 'USidebarEmptyPanelButton_C::EntryBorder' has a wrong offset!");

}

