#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgState_Image

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgState_Image.SidebarLfgState_Image_C
// 0x0048 (0x0308 - 0x02C0)
class USidebarLfgState_Image_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LFG_Icon;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      LFG_Material;                                      // 0x02D0(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           LFG_Color;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LFG_DynamicMaterial;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarLfgState_Image(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetColor(const struct FLinearColor& InColorAndOpacity);
	void SetMaterial(TSoftObjectPtr<class UMaterialInterface> SoftMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgState_Image_C">();
	}
	static class USidebarLfgState_Image_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgState_Image_C>();
	}
};
static_assert(alignof(USidebarLfgState_Image_C) == 0x000008, "Wrong alignment on USidebarLfgState_Image_C");
static_assert(sizeof(USidebarLfgState_Image_C) == 0x000308, "Wrong size on USidebarLfgState_Image_C");
static_assert(offsetof(USidebarLfgState_Image_C, UberGraphFrame) == 0x0002C0, "Member 'USidebarLfgState_Image_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgState_Image_C, LFG_Icon) == 0x0002C8, "Member 'USidebarLfgState_Image_C::LFG_Icon' has a wrong offset!");
static_assert(offsetof(USidebarLfgState_Image_C, LFG_Material) == 0x0002D0, "Member 'USidebarLfgState_Image_C::LFG_Material' has a wrong offset!");
static_assert(offsetof(USidebarLfgState_Image_C, LFG_Color) == 0x0002F0, "Member 'USidebarLfgState_Image_C::LFG_Color' has a wrong offset!");
static_assert(offsetof(USidebarLfgState_Image_C, LFG_DynamicMaterial) == 0x000300, "Member 'USidebarLfgState_Image_C::LFG_DynamicMaterial' has a wrong offset!");

}

