#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialTagWidget

#include "Basic.hpp"

#include "SidebarSocialTagCategoryStructure_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSocialTagWidget.SidebarSocialTagWidget_C
// 0x0260 (0x1750 - 0x14F0)
class USidebarSocialTagWidget_C final : public USocialTagWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BorderUnhover;                                     // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BorderHover;                                       // 0x1500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StateChange;                                       // 0x1508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_TagBorder;                                  // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SidebarCollectionScreenContainerTabButtonEditTags_C* BP_SidebarCollectionScreenContainerTabButtonEditTags; // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_TagWidget;                               // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_TagCategoryIcon;                          // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarSocialAddingTagWidget_C*        SidebarSocialAddingTagWidget;                      // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_TagCategoryIcon;                            // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_SelectedState;                            // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TagName;                                      // 0x1548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_InnerColor;                                   // 0x1550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_OuterColor;                                   // 0x1554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_TagOpacity;                                   // 0x1558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155C[0x4];                                     // 0x155C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TagCategory_Disabled;                              // 0x1560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                           StateChangeLerpTimerHandle;                        // 0x1570(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StateChangeLerpAlpha;                              // 0x1578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FSidebarSocialTagCategoryStructure     TagCategoryStructureReference;                     // 0x1580(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSidebarSocialTagCategoryStructure     DisabledTagCategoryStructureReference;             // 0x15F0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        StateChangeLerpTimeStep;                           // 0x1660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TagBorderMaterialReference;                        // 0x1668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentInnerColorReference;                        // 0x1670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentOuterColorReference;                        // 0x1680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetInnerColorReference;                         // 0x1690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetOuterColorReference;                         // 0x16A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorWhite;                              // 0x16B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorWhiteDisabled;                      // 0x16C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorBlack;                              // 0x16D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentTagContentColorReference;                   // 0x16E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetTagContentColorReference;                    // 0x16F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorBlackDisabled;                      // 0x1700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnabledTagOpacity;                                 // 0x1710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisabledTagOpacity;                                // 0x1718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Highlighted;                                       // 0x1720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1721[0x7];                                     // 0x1721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               TagCategoryIconMaterialReference;                  // 0x1728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_GradientStartColor;                           // 0x1730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_GradientEndColor;                             // 0x1734(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_IconColor;                                    // 0x1738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_EndingInnerColor;                             // 0x173C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_EndingOuterColor;                             // 0x1740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void Event_SetFriendsCellColor();
	void ExecuteUbergraph_SidebarSocialTagWidget(int32 EntryPoint);
	void FunctionOnHovered();
	void FunctionOnUnhovered();
	void FunctionSetCategoryCustomizationVisibility(ESlateVisibility CategoryCustomizationVisibility);
	void FunctionSetTag(const class FText& InTagName, ESocialTagCategory InTagCategory, bool InIsSystemTag);
	void FunctionSetTagBorderColors(const struct FLinearColor& InnerColor, const struct FLinearColor& OuterColor);
	void GetCurrentTagBorderColors();
	void InterpolateTagColors();
	void OnTagListEntryHovered();
	void OnTagListEntryUnhovered();
	void SetCategoryCustomizationVisibility(ESlateVisibility CategoryCustomizationVisibility);
	void SetFullColor();
	void SetHighlightState(bool bHighlighted);
	void SetTag(const class FText& InTagName, const ESocialTagCategory InTagCategory, const bool bInIsSystemTag);
	void SetTagHoverState(bool IsUserSocialTag, bool IsHovering);
	void SetUnhoverState(bool bPlayAnimation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSocialTagWidget_C">();
	}
	static class USidebarSocialTagWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSocialTagWidget_C>();
	}
};
static_assert(alignof(USidebarSocialTagWidget_C) == 0x000010, "Wrong alignment on USidebarSocialTagWidget_C");
static_assert(sizeof(USidebarSocialTagWidget_C) == 0x001750, "Wrong size on USidebarSocialTagWidget_C");
static_assert(offsetof(USidebarSocialTagWidget_C, UberGraphFrame) == 0x0014F0, "Member 'USidebarSocialTagWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, BorderUnhover) == 0x0014F8, "Member 'USidebarSocialTagWidget_C::BorderUnhover' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, BorderHover) == 0x001500, "Member 'USidebarSocialTagWidget_C::BorderHover' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChange) == 0x001508, "Member 'USidebarSocialTagWidget_C::StateChange' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Border_TagBorder) == 0x001510, "Member 'USidebarSocialTagWidget_C::Border_TagBorder' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, BP_SidebarCollectionScreenContainerTabButtonEditTags) == 0x001518, "Member 'USidebarSocialTagWidget_C::BP_SidebarCollectionScreenContainerTabButtonEditTags' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, GridPanel_TagWidget) == 0x001520, "Member 'USidebarSocialTagWidget_C::GridPanel_TagWidget' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, ScaleBox_TagCategoryIcon) == 0x001528, "Member 'USidebarSocialTagWidget_C::ScaleBox_TagCategoryIcon' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, SidebarSocialAddingTagWidget) == 0x001530, "Member 'USidebarSocialTagWidget_C::SidebarSocialAddingTagWidget' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Spacer_TagCategoryIcon) == 0x001538, "Member 'USidebarSocialTagWidget_C::Spacer_TagCategoryIcon' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Switcher_SelectedState) == 0x001540, "Member 'USidebarSocialTagWidget_C::Switcher_SelectedState' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Text_TagName) == 0x001548, "Member 'USidebarSocialTagWidget_C::Text_TagName' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_InnerColor) == 0x001550, "Member 'USidebarSocialTagWidget_C::Name_InnerColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_OuterColor) == 0x001554, "Member 'USidebarSocialTagWidget_C::Name_OuterColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_TagOpacity) == 0x001558, "Member 'USidebarSocialTagWidget_C::Name_TagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagCategory_Disabled) == 0x001560, "Member 'USidebarSocialTagWidget_C::TagCategory_Disabled' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChangeLerpTimerHandle) == 0x001570, "Member 'USidebarSocialTagWidget_C::StateChangeLerpTimerHandle' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChangeLerpAlpha) == 0x001578, "Member 'USidebarSocialTagWidget_C::StateChangeLerpAlpha' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagCategoryStructureReference) == 0x001580, "Member 'USidebarSocialTagWidget_C::TagCategoryStructureReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, DisabledTagCategoryStructureReference) == 0x0015F0, "Member 'USidebarSocialTagWidget_C::DisabledTagCategoryStructureReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChangeLerpTimeStep) == 0x001660, "Member 'USidebarSocialTagWidget_C::StateChangeLerpTimeStep' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagBorderMaterialReference) == 0x001668, "Member 'USidebarSocialTagWidget_C::TagBorderMaterialReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, CurrentInnerColorReference) == 0x001670, "Member 'USidebarSocialTagWidget_C::CurrentInnerColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, CurrentOuterColorReference) == 0x001680, "Member 'USidebarSocialTagWidget_C::CurrentOuterColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TargetInnerColorReference) == 0x001690, "Member 'USidebarSocialTagWidget_C::TargetInnerColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TargetOuterColorReference) == 0x0016A0, "Member 'USidebarSocialTagWidget_C::TargetOuterColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagContentColorWhite) == 0x0016B0, "Member 'USidebarSocialTagWidget_C::TagContentColorWhite' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagContentColorWhiteDisabled) == 0x0016C0, "Member 'USidebarSocialTagWidget_C::TagContentColorWhiteDisabled' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagContentColorBlack) == 0x0016D0, "Member 'USidebarSocialTagWidget_C::TagContentColorBlack' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, CurrentTagContentColorReference) == 0x0016E0, "Member 'USidebarSocialTagWidget_C::CurrentTagContentColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TargetTagContentColorReference) == 0x0016F0, "Member 'USidebarSocialTagWidget_C::TargetTagContentColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagContentColorBlackDisabled) == 0x001700, "Member 'USidebarSocialTagWidget_C::TagContentColorBlackDisabled' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, EnabledTagOpacity) == 0x001710, "Member 'USidebarSocialTagWidget_C::EnabledTagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, DisabledTagOpacity) == 0x001718, "Member 'USidebarSocialTagWidget_C::DisabledTagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Highlighted) == 0x001720, "Member 'USidebarSocialTagWidget_C::Highlighted' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagCategoryIconMaterialReference) == 0x001728, "Member 'USidebarSocialTagWidget_C::TagCategoryIconMaterialReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_GradientStartColor) == 0x001730, "Member 'USidebarSocialTagWidget_C::Name_GradientStartColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_GradientEndColor) == 0x001734, "Member 'USidebarSocialTagWidget_C::Name_GradientEndColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_IconColor) == 0x001738, "Member 'USidebarSocialTagWidget_C::Name_IconColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_EndingInnerColor) == 0x00173C, "Member 'USidebarSocialTagWidget_C::Name_EndingInnerColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_EndingOuterColor) == 0x001740, "Member 'USidebarSocialTagWidget_C::Name_EndingOuterColor' has a wrong offset!");

}

