#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserListEntry_MutualFriend

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SidebarUserListEntry_MutualFriend.SidebarUserListEntry_MutualFriend_C.ExecuteUbergraph_SidebarUserListEntry_MutualFriend
// 0x0010 (0x0010 - 0x0000)
struct SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingNewAvatars;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend) == 0x000004, "Wrong alignment on SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend");
static_assert(sizeof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend) == 0x000010, "Wrong size on SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, EntryPoint) == 0x000000, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, Temp_byte_Variable) == 0x000004, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, Temp_byte_Variable_1) == 0x000005, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, Temp_bool_Variable) == 0x000006, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, Temp_byte_Variable_2) == 0x000007, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, Temp_byte_Variable_3) == 0x000008, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, Temp_bool_Variable_1) == 0x000009, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, K2Node_Event_bUsingNewAvatars) == 0x00000A, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::K2Node_Event_bUsingNewAvatars' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, K2Node_Select_Default) == 0x00000B, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend, K2Node_Select_Default_1) == 0x00000C, "Member 'SidebarUserListEntry_MutualFriend_C_ExecuteUbergraph_SidebarUserListEntry_MutualFriend::K2Node_Select_Default_1' has a wrong offset!");

// Function SidebarUserListEntry_MutualFriend.SidebarUserListEntry_MutualFriend_C.OnNewAvatarsEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged final
{
public:
	bool                                          bUsingNewAvatars;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged) == 0x000001, "Wrong alignment on SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged");
static_assert(sizeof(SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged) == 0x000001, "Wrong size on SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged");
static_assert(offsetof(SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged, bUsingNewAvatars) == 0x000000, "Member 'SidebarUserListEntry_MutualFriend_C_OnNewAvatarsEnabledChanged::bUsingNewAvatars' has a wrong offset!");

}

