#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSuggestedFriendListEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function SidebarSuggestedFriendListEntry.SidebarSuggestedFriendListEntry_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'SidebarSuggestedFriendListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function SidebarSuggestedFriendListEntry.SidebarSuggestedFriendListEntry_C.ExecuteUbergraph_SidebarSuggestedFriendListEntry
// 0x0060 (0x0060 - 0x0000)
struct SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingNewAvatars;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry) == 0x000008, "Wrong alignment on SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry");
static_assert(sizeof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry) == 0x000060, "Wrong size on SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, EntryPoint) == 0x000000, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, Temp_byte_Variable) == 0x000004, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, Temp_byte_Variable_1) == 0x000005, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, Temp_bool_Variable) == 0x000006, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, Temp_byte_Variable_2) == 0x000007, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, Temp_byte_Variable_3) == 0x000008, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, K2Node_ComponentBoundEvent_bIsOpen) == 0x000009, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, Temp_bool_Variable_1) == 0x000030, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, K2Node_Event_bUsingNewAvatars) == 0x000040, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::K2Node_Event_bUsingNewAvatars' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, K2Node_Select_Default) == 0x000041, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, K2Node_Select_Default_1) == 0x000042, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000048, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000050, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry, CallFunc_GetCurrentInputType_ReturnValue) == 0x000058, "Member 'SidebarSuggestedFriendListEntry_C_ExecuteUbergraph_SidebarSuggestedFriendListEntry::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");

// Function SidebarSuggestedFriendListEntry.SidebarSuggestedFriendListEntry_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged");
static_assert(sizeof(SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged) == 0x000001, "Wrong size on SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged, NewInputType) == 0x000000, "Member 'SidebarSuggestedFriendListEntry_C_HandleInputMethodChanged::NewInputType' has a wrong offset!");

// Function SidebarSuggestedFriendListEntry.SidebarSuggestedFriendListEntry_C.OnNewAvatarsEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged final
{
public:
	bool                                          bUsingNewAvatars;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged) == 0x000001, "Wrong alignment on SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged");
static_assert(sizeof(SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged) == 0x000001, "Wrong size on SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged, bUsingNewAvatars) == 0x000000, "Member 'SidebarSuggestedFriendListEntry_C_OnNewAvatarsEnabledChanged::bUsingNewAvatars' has a wrong offset!");

// Function SidebarSuggestedFriendListEntry.SidebarSuggestedFriendListEntry_C.SetUnhoverState
// 0x0038 (0x0038 - 0x0000)
struct SidebarSuggestedFriendListEntry_C_SetUnhoverState final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSuggestedFriendListEntry_C_SetUnhoverState) == 0x000008, "Wrong alignment on SidebarSuggestedFriendListEntry_C_SetUnhoverState");
static_assert(sizeof(SidebarSuggestedFriendListEntry_C_SetUnhoverState) == 0x000038, "Wrong size on SidebarSuggestedFriendListEntry_C_SetUnhoverState");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, bPlayAnimation) == 0x000000, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::bPlayAnimation' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_GetStartTime_ReturnValue) == 0x000004, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_SelectFloat_A_ImplicitCast) == 0x000020, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_SelectFloat_B_ImplicitCast) == 0x000028, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SidebarSuggestedFriendListEntry_C_SetUnhoverState, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000030, "Member 'SidebarSuggestedFriendListEntry_C_SetUnhoverState::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

}

