#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarReferAFriendEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarReferAFriendEntry.SidebarReferAFriendEntry_C
// 0x0020 (0x1530 - 0x1510)
class USidebarReferAFriendEntry_C final : public UFortReferFriendListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarLfgEmptyButton_C*               SidebarLfgEmptyButton;                             // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarReferAFriendEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarReferAFriendEntry_C">();
	}
	static class USidebarReferAFriendEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarReferAFriendEntry_C>();
	}
};
static_assert(alignof(USidebarReferAFriendEntry_C) == 0x000010, "Wrong alignment on USidebarReferAFriendEntry_C");
static_assert(sizeof(USidebarReferAFriendEntry_C) == 0x001530, "Wrong size on USidebarReferAFriendEntry_C");
static_assert(offsetof(USidebarReferAFriendEntry_C, UberGraphFrame) == 0x001510, "Member 'USidebarReferAFriendEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, BG) == 0x001518, "Member 'USidebarReferAFriendEntry_C::BG' has a wrong offset!");
static_assert(offsetof(USidebarReferAFriendEntry_C, SidebarLfgEmptyButton) == 0x001520, "Member 'USidebarReferAFriendEntry_C::SidebarLfgEmptyButton' has a wrong offset!");

}

