#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkewButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkewButton.SkewButton_C
// 0x0070 (0x1550 - 0x14E0)
class USkewButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Released;                                          // 0x14E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x14F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageButtonFill;                                   // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageShadow;                                       // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_ButtonContent;                           // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SkewBrushes;                               // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ButtonColor;                                       // 0x1520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x1530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Chip;                                              // 0x1540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Skew;                                              // 0x1541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoHoverColor;                                      // 0x1542(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SkewButton(int32 EntryPoint);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkewButton_C">();
	}
	static class USkewButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkewButton_C>();
	}
};
static_assert(alignof(USkewButton_C) == 0x000010, "Wrong alignment on USkewButton_C");
static_assert(sizeof(USkewButton_C) == 0x001550, "Wrong size on USkewButton_C");
static_assert(offsetof(USkewButton_C, UberGraphFrame) == 0x0014E0, "Member 'USkewButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Released) == 0x0014E8, "Member 'USkewButton_C::Released' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Pressed) == 0x0014F0, "Member 'USkewButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Hover) == 0x0014F8, "Member 'USkewButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USkewButton_C, ImageButtonFill) == 0x001500, "Member 'USkewButton_C::ImageButtonFill' has a wrong offset!");
static_assert(offsetof(USkewButton_C, ImageShadow) == 0x001508, "Member 'USkewButton_C::ImageShadow' has a wrong offset!");
static_assert(offsetof(USkewButton_C, NamedSlot_ButtonContent) == 0x001510, "Member 'USkewButton_C::NamedSlot_ButtonContent' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Overlay_SkewBrushes) == 0x001518, "Member 'USkewButton_C::Overlay_SkewBrushes' has a wrong offset!");
static_assert(offsetof(USkewButton_C, ButtonColor) == 0x001520, "Member 'USkewButton_C::ButtonColor' has a wrong offset!");
static_assert(offsetof(USkewButton_C, HoverColor) == 0x001530, "Member 'USkewButton_C::HoverColor' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Chip) == 0x001540, "Member 'USkewButton_C::Chip' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Skew) == 0x001541, "Member 'USkewButton_C::Skew' has a wrong offset!");
static_assert(offsetof(USkewButton_C, NoHoverColor) == 0x001542, "Member 'USkewButton_C::NoHoverColor' has a wrong offset!");

}

