#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SongItemPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SongItemPreview.SongItemPreview_C
// 0x0098 (0x0520 - 0x0488)
class ASongItemPreview_C final : public AFortItemPreviewOffPawnActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_AlbumCover;                                     // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLightLowMobile;                                 // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLightMobile;                            // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight6;                                         // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLigh3;                                          // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight2;                                         // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimLowerRight1;                                    // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimLeft1;                                          // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight5;                                         // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimBottomLeft1;                                    // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Bounce1;                                           // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BounceRear1;                                       // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimTopRight1;                                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_Lighting;                                    // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_LErp_440FD4D745E0E071C641BAB46D630F85;    // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_440FD4D745E0E071C641BAB46D630F85; // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysOn;                                          // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SongItemPreview(int32 EntryPoint);
	void LightControl(bool Active);
	void OnPreviewVisualsSpawned(const bool bUseSecondaryTransitionEffects, const bool bShowFloor);
	void SwitchMobileLighting(bool Visibility);
	void SwitchPCLighting(bool Visibility);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UpdateSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SongItemPreview_C">();
	}
	static class ASongItemPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASongItemPreview_C>();
	}
};
static_assert(alignof(ASongItemPreview_C) == 0x000008, "Wrong alignment on ASongItemPreview_C");
static_assert(sizeof(ASongItemPreview_C) == 0x000520, "Wrong size on ASongItemPreview_C");
static_assert(offsetof(ASongItemPreview_C, UberGraphFrame) == 0x000488, "Member 'ASongItemPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, SM_AlbumCover) == 0x000490, "Member 'ASongItemPreview_C::SM_AlbumCover' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, SkyLightLowMobile) == 0x000498, "Member 'ASongItemPreview_C::SkyLightLowMobile' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, Arrow) == 0x0004A0, "Member 'ASongItemPreview_C::Arrow' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, DirectionalLightMobile) == 0x0004A8, "Member 'ASongItemPreview_C::DirectionalLightMobile' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, KeyLight6) == 0x0004B0, "Member 'ASongItemPreview_C::KeyLight6' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, KeyLigh3) == 0x0004B8, "Member 'ASongItemPreview_C::KeyLigh3' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, KeyLight2) == 0x0004C0, "Member 'ASongItemPreview_C::KeyLight2' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, RimLowerRight1) == 0x0004C8, "Member 'ASongItemPreview_C::RimLowerRight1' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, RimLeft1) == 0x0004D0, "Member 'ASongItemPreview_C::RimLeft1' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, KeyLight5) == 0x0004D8, "Member 'ASongItemPreview_C::KeyLight5' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, RimBottomLeft1) == 0x0004E0, "Member 'ASongItemPreview_C::RimBottomLeft1' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, Bounce1) == 0x0004E8, "Member 'ASongItemPreview_C::Bounce1' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, BounceRear1) == 0x0004F0, "Member 'ASongItemPreview_C::BounceRear1' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, RimTopRight1) == 0x0004F8, "Member 'ASongItemPreview_C::RimTopRight1' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, Scene_Lighting) == 0x000500, "Member 'ASongItemPreview_C::Scene_Lighting' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, Timeline_LErp_440FD4D745E0E071C641BAB46D630F85) == 0x000508, "Member 'ASongItemPreview_C::Timeline_LErp_440FD4D745E0E071C641BAB46D630F85' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, Timeline__Direction_440FD4D745E0E071C641BAB46D630F85) == 0x00050C, "Member 'ASongItemPreview_C::Timeline__Direction_440FD4D745E0E071C641BAB46D630F85' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, Timeline) == 0x000510, "Member 'ASongItemPreview_C::Timeline' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, IsActive) == 0x000518, "Member 'ASongItemPreview_C::IsActive' has a wrong offset!");
static_assert(offsetof(ASongItemPreview_C, AlwaysOn) == 0x000519, "Member 'ASongItemPreview_C::AlwaysOn' has a wrong offset!");

}

