#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCommonRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SparksCommonRuntime.SparksCommonUtilities.GetSparksCommonUtilities
// 0x0010 (0x0010 - 0x0000)
struct SparksCommonUtilities_GetSparksCommonUtilities final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USparksCommonUtilities*                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SparksCommonUtilities_GetSparksCommonUtilities) == 0x000008, "Wrong alignment on SparksCommonUtilities_GetSparksCommonUtilities");
static_assert(sizeof(SparksCommonUtilities_GetSparksCommonUtilities) == 0x000010, "Wrong size on SparksCommonUtilities_GetSparksCommonUtilities");
static_assert(offsetof(SparksCommonUtilities_GetSparksCommonUtilities, WorldContextObject) == 0x000000, "Member 'SparksCommonUtilities_GetSparksCommonUtilities::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SparksCommonUtilities_GetSparksCommonUtilities, ReturnValue) == 0x000008, "Member 'SparksCommonUtilities_GetSparksCommonUtilities::ReturnValue' has a wrong offset!");

// Function SparksCommonRuntime.SparksCommonUtilities.ShowSparksCaptureTool
// 0x0001 (0x0001 - 0x0000)
struct SparksCommonUtilities_ShowSparksCaptureTool final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SparksCommonUtilities_ShowSparksCaptureTool) == 0x000001, "Wrong alignment on SparksCommonUtilities_ShowSparksCaptureTool");
static_assert(sizeof(SparksCommonUtilities_ShowSparksCaptureTool) == 0x000001, "Wrong size on SparksCommonUtilities_ShowSparksCaptureTool");
static_assert(offsetof(SparksCommonUtilities_ShowSparksCaptureTool, bShow) == 0x000000, "Member 'SparksCommonUtilities_ShowSparksCaptureTool::bShow' has a wrong offset!");

// Function SparksCommonRuntime.SparksCrowdSpawner.SpawnCrowd
// 0x00D8 (0x00D8 - 0x0000)
struct SparksCrowdSpawner_SpawnCrowd final
{
public:
	struct FVector                                InArea;                                            // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              InCrowdSize;                                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InPositionRandomness;                              // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InScaleVariance;                                   // 0x0030(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLookAt;                                          // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InLookAtRandomeness;                               // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InAdditionalRotation;                              // 0x0060(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         InBatchSize;                                       // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInstancedStaticMeshComponent*, int32> InMeshWeights;                                     // 0x0080(0x0050)(ConstParm, Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SparksCrowdSpawner_SpawnCrowd) == 0x000008, "Wrong alignment on SparksCrowdSpawner_SpawnCrowd");
static_assert(sizeof(SparksCrowdSpawner_SpawnCrowd) == 0x0000D8, "Wrong size on SparksCrowdSpawner_SpawnCrowd");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InArea) == 0x000000, "Member 'SparksCrowdSpawner_SpawnCrowd::InArea' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InCrowdSize) == 0x000018, "Member 'SparksCrowdSpawner_SpawnCrowd::InCrowdSize' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InPositionRandomness) == 0x000020, "Member 'SparksCrowdSpawner_SpawnCrowd::InPositionRandomness' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InScaleVariance) == 0x000030, "Member 'SparksCrowdSpawner_SpawnCrowd::InScaleVariance' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InLookAt) == 0x000040, "Member 'SparksCrowdSpawner_SpawnCrowd::InLookAt' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InLookAtRandomeness) == 0x000058, "Member 'SparksCrowdSpawner_SpawnCrowd::InLookAtRandomeness' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InAdditionalRotation) == 0x000060, "Member 'SparksCrowdSpawner_SpawnCrowd::InAdditionalRotation' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InBatchSize) == 0x000078, "Member 'SparksCrowdSpawner_SpawnCrowd::InBatchSize' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, InMeshWeights) == 0x000080, "Member 'SparksCrowdSpawner_SpawnCrowd::InMeshWeights' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowd, ReturnValue) == 0x0000D0, "Member 'SparksCrowdSpawner_SpawnCrowd::ReturnValue' has a wrong offset!");

// Function SparksCommonRuntime.SparksCrowdSpawner.SpawnCrowdNow
// 0x00D0 (0x00D0 - 0x0000)
struct SparksCrowdSpawner_SpawnCrowdNow final
{
public:
	struct FVector                                InArea;                                            // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              InCrowdSize;                                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InPositionRandomness;                              // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InScaleVariance;                                   // 0x0030(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLookAt;                                          // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InLookAtRandomeness;                               // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InAdditionalRotation;                              // 0x0060(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TMap<class UInstancedStaticMeshComponent*, int32> InMeshWeights;                                     // 0x0078(0x0050)(ConstParm, Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SparksCrowdSpawner_SpawnCrowdNow) == 0x000008, "Wrong alignment on SparksCrowdSpawner_SpawnCrowdNow");
static_assert(sizeof(SparksCrowdSpawner_SpawnCrowdNow) == 0x0000D0, "Wrong size on SparksCrowdSpawner_SpawnCrowdNow");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InArea) == 0x000000, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InArea' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InCrowdSize) == 0x000018, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InCrowdSize' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InPositionRandomness) == 0x000020, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InPositionRandomness' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InScaleVariance) == 0x000030, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InScaleVariance' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InLookAt) == 0x000040, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InLookAt' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InLookAtRandomeness) == 0x000058, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InLookAtRandomeness' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InAdditionalRotation) == 0x000060, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InAdditionalRotation' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, InMeshWeights) == 0x000078, "Member 'SparksCrowdSpawner_SpawnCrowdNow::InMeshWeights' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_SpawnCrowdNow, ReturnValue) == 0x0000C8, "Member 'SparksCrowdSpawner_SpawnCrowdNow::ReturnValue' has a wrong offset!");

// Function SparksCommonRuntime.SparksCrowdSpawner.TransitionCrowdToTargetParamValue
// 0x000C (0x000C - 0x0000)
struct SparksCrowdSpawner_TransitionCrowdToTargetParamValue final
{
public:
	int32                                         DataIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetValue;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToTransition;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SparksCrowdSpawner_TransitionCrowdToTargetParamValue) == 0x000004, "Wrong alignment on SparksCrowdSpawner_TransitionCrowdToTargetParamValue");
static_assert(sizeof(SparksCrowdSpawner_TransitionCrowdToTargetParamValue) == 0x00000C, "Wrong size on SparksCrowdSpawner_TransitionCrowdToTargetParamValue");
static_assert(offsetof(SparksCrowdSpawner_TransitionCrowdToTargetParamValue, DataIndex) == 0x000000, "Member 'SparksCrowdSpawner_TransitionCrowdToTargetParamValue::DataIndex' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_TransitionCrowdToTargetParamValue, TargetValue) == 0x000004, "Member 'SparksCrowdSpawner_TransitionCrowdToTargetParamValue::TargetValue' has a wrong offset!");
static_assert(offsetof(SparksCrowdSpawner_TransitionCrowdToTargetParamValue, TimeToTransition) == 0x000008, "Member 'SparksCrowdSpawner_TransitionCrowdToTargetParamValue::TimeToTransition' has a wrong offset!");

}

