#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventVaultWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VaultWorld_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpecialEventVaultWorld.SpecialEventVaultWorld_C
// 0x0080 (0x03D0 - 0x0350)
class ASpecialEventVaultWorld_C final : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SpecialEventVaultWorld_C;           // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   floor;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ItemDetails_X_Offset_1EDCEF5F41216A9DADD25897C8B68493; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ItemDetails__Direction_1EDCEF5F41216A9DADD25897C8B68493; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ItemDetails;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Floor_Visibility_FloorMask_37382717410D795E9E7E0990FC3EFCC2; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Floor_Visibility__Direction_37382717410D795E9E7E0990FC3EFCC2; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Floor_Visibility;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Effects_SetStreaks_7B5688E44724D9F68D3C20A520093829; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Background_Effects__Direction_7B5688E44724D9F68D3C20A520093829; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Background_Effects;                                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_FDB9DC244ED5578954F07A87EDA84CA5; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Pre_TransitionOffset_FDB9DC244ED5578954F07A87EDA84CA5; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_FDB9DC244ED5578954F07A87EDA84CA5; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_FDB9DC244ED5578954F07A87EDA84CA5; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_fx_Transition_fade_9CCDE9524354AF859735079DD2ED12AA; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Pre_Transition_Offset_9CCDE9524354AF859735079DD2ED12AA; // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Backward_9CCDE9524354AF859735079DD2ED12AA; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionBackward__Direction_9CCDE9524354AF859735079DD2ED12AA; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionBackward;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      FloorMI;                                           // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FloorMID;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TransitionForward__FinishedFunc();
	void TransitionForward__UpdateFunc();
	void TransitionBackward__UpdateFunc();
	void TransitionBackward__FinishedFunc();
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, struct FVaultWorldBackgroundData& BackgroundInfo, class UMaterialInstanceDynamic* Mid);
	void TransitionBackgroundForward(double Forward, double PreTransitionOffset, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void ReceiveBeginPlay();
	void TransitionBackgroundBackward(double Backward, double PreTransitionOffset, double FXTransitionFade, class UMaterialInstanceDynamic* Mid);
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnUpdateMaterialIndex(int32 MaterialIndex);
	void OnSetupBackground(const class UTexture2D* LoadedBackgroundTexture, const struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnTransitionItemDetails(const bool bShowItemDetails);
	void OnInitialBackgroundTransition();
	void OnTransitionBackground(bool bPlayForward, EBackgroundIntensityLevel IntensityTransition);
	void Floor_Visibility__UpdateFunc();
	void ItemDetails__UpdateFunc();
	void Floor_Visibility__FinishedFunc();
	void ItemDetails__FinishedFunc();
	void Background_Effects__UpdateFunc();
	void ExecuteUbergraph_SpecialEventVaultWorld(int32 EntryPoint);
	void Background_Effects__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpecialEventVaultWorld_C">();
	}
	static class ASpecialEventVaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpecialEventVaultWorld_C>();
	}
};
static_assert(alignof(ASpecialEventVaultWorld_C) == 0x000008, "Wrong alignment on ASpecialEventVaultWorld_C");
static_assert(sizeof(ASpecialEventVaultWorld_C) == 0x0003D0, "Wrong size on ASpecialEventVaultWorld_C");
static_assert(offsetof(ASpecialEventVaultWorld_C, UberGraphFrame_SpecialEventVaultWorld_C) == 0x000350, "Member 'ASpecialEventVaultWorld_C::UberGraphFrame_SpecialEventVaultWorld_C' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, floor) == 0x000358, "Member 'ASpecialEventVaultWorld_C::floor' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, ItemDetails_X_Offset_1EDCEF5F41216A9DADD25897C8B68493) == 0x000360, "Member 'ASpecialEventVaultWorld_C::ItemDetails_X_Offset_1EDCEF5F41216A9DADD25897C8B68493' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, ItemDetails__Direction_1EDCEF5F41216A9DADD25897C8B68493) == 0x000364, "Member 'ASpecialEventVaultWorld_C::ItemDetails__Direction_1EDCEF5F41216A9DADD25897C8B68493' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, ItemDetails) == 0x000368, "Member 'ASpecialEventVaultWorld_C::ItemDetails' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor_Visibility_FloorMask_37382717410D795E9E7E0990FC3EFCC2) == 0x000370, "Member 'ASpecialEventVaultWorld_C::Floor_Visibility_FloorMask_37382717410D795E9E7E0990FC3EFCC2' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor_Visibility__Direction_37382717410D795E9E7E0990FC3EFCC2) == 0x000374, "Member 'ASpecialEventVaultWorld_C::Floor_Visibility__Direction_37382717410D795E9E7E0990FC3EFCC2' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Floor_Visibility) == 0x000378, "Member 'ASpecialEventVaultWorld_C::Floor_Visibility' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Background_Effects_SetStreaks_7B5688E44724D9F68D3C20A520093829) == 0x000380, "Member 'ASpecialEventVaultWorld_C::Background_Effects_SetStreaks_7B5688E44724D9F68D3C20A520093829' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Background_Effects__Direction_7B5688E44724D9F68D3C20A520093829) == 0x000384, "Member 'ASpecialEventVaultWorld_C::Background_Effects__Direction_7B5688E44724D9F68D3C20A520093829' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, Background_Effects) == 0x000388, "Member 'ASpecialEventVaultWorld_C::Background_Effects' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward_FX_Transition_Fade_FDB9DC244ED5578954F07A87EDA84CA5) == 0x000390, "Member 'ASpecialEventVaultWorld_C::TransitionForward_FX_Transition_Fade_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward_Pre_TransitionOffset_FDB9DC244ED5578954F07A87EDA84CA5) == 0x000394, "Member 'ASpecialEventVaultWorld_C::TransitionForward_Pre_TransitionOffset_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward_Forward_FDB9DC244ED5578954F07A87EDA84CA5) == 0x000398, "Member 'ASpecialEventVaultWorld_C::TransitionForward_Forward_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward__Direction_FDB9DC244ED5578954F07A87EDA84CA5) == 0x00039C, "Member 'ASpecialEventVaultWorld_C::TransitionForward__Direction_FDB9DC244ED5578954F07A87EDA84CA5' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionForward) == 0x0003A0, "Member 'ASpecialEventVaultWorld_C::TransitionForward' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward_fx_Transition_fade_9CCDE9524354AF859735079DD2ED12AA) == 0x0003A8, "Member 'ASpecialEventVaultWorld_C::TransitionBackward_fx_Transition_fade_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward_Pre_Transition_Offset_9CCDE9524354AF859735079DD2ED12AA) == 0x0003AC, "Member 'ASpecialEventVaultWorld_C::TransitionBackward_Pre_Transition_Offset_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward_Backward_9CCDE9524354AF859735079DD2ED12AA) == 0x0003B0, "Member 'ASpecialEventVaultWorld_C::TransitionBackward_Backward_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward__Direction_9CCDE9524354AF859735079DD2ED12AA) == 0x0003B4, "Member 'ASpecialEventVaultWorld_C::TransitionBackward__Direction_9CCDE9524354AF859735079DD2ED12AA' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, TransitionBackward) == 0x0003B8, "Member 'ASpecialEventVaultWorld_C::TransitionBackward' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, FloorMI) == 0x0003C0, "Member 'ASpecialEventVaultWorld_C::FloorMI' has a wrong offset!");
static_assert(offsetof(ASpecialEventVaultWorld_C, FloorMID) == 0x0003C8, "Member 'ASpecialEventVaultWorld_C::FloorMID' has a wrong offset!");

}

