#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SqueegeeUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK
{

// Enum SqueegeeUI.EFortContentManagementState
// NumValues: 0x0003
enum class EFortContentManagementState : uint8
{
	Locked                                   = 0,
	Unlocked                                 = 1,
	WaitingForResponse                       = 2,
};

// ScriptStruct SqueegeeUI.SqueegeeInjectionData
// 0x0028 (0x0028 - 0x0000)
struct FSqueegeeInjectionData final
{
public:
	ESqueegeeWidgetInjection                      WidgetType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0008(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSqueegeeInjectionData) == 0x000008, "Wrong alignment on FSqueegeeInjectionData");
static_assert(sizeof(FSqueegeeInjectionData) == 0x000028, "Wrong size on FSqueegeeInjectionData");
static_assert(offsetof(FSqueegeeInjectionData, WidgetType) == 0x000000, "Member 'FSqueegeeInjectionData::WidgetType' has a wrong offset!");
static_assert(offsetof(FSqueegeeInjectionData, WidgetClass) == 0x000008, "Member 'FSqueegeeInjectionData::WidgetClass' has a wrong offset!");

// ScriptStruct SqueegeeUI.SqueegeeTextData
// 0x0020 (0x0020 - 0x0000)
struct FSqueegeeTextData final
{
public:
	ESqueegeeText                                 TextType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DesiredText;                                       // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSqueegeeTextData) == 0x000008, "Wrong alignment on FSqueegeeTextData");
static_assert(sizeof(FSqueegeeTextData) == 0x000020, "Wrong size on FSqueegeeTextData");
static_assert(offsetof(FSqueegeeTextData, TextType) == 0x000000, "Member 'FSqueegeeTextData::TextType' has a wrong offset!");
static_assert(offsetof(FSqueegeeTextData, DesiredText) == 0x000008, "Member 'FSqueegeeTextData::DesiredText' has a wrong offset!");

}

