#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio
// 0x0010 (0x0148 - 0x0138)
class UFortMobileActionButtonBehavior_ToggleRadio final : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           ToggleRadioOffSprite;                              // 0x0138(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleRadioPlaying(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void HandleRadioStopped(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_ToggleRadio">();
	}
	static class UFortMobileActionButtonBehavior_ToggleRadio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_ToggleRadio>();
	}
};
static_assert(alignof(UFortMobileActionButtonBehavior_ToggleRadio) == 0x000008, "Wrong alignment on UFortMobileActionButtonBehavior_ToggleRadio");
static_assert(sizeof(UFortMobileActionButtonBehavior_ToggleRadio) == 0x000148, "Wrong size on UFortMobileActionButtonBehavior_ToggleRadio");
static_assert(offsetof(UFortMobileActionButtonBehavior_ToggleRadio, ToggleRadioOffSprite) == 0x000138, "Member 'UFortMobileActionButtonBehavior_ToggleRadio::ToggleRadioOffSprite' has a wrong offset!");

// Class SrirachaRanchUI.RadioPlayerWidgetBase
// 0x0050 (0x0378 - 0x0328)
class URadioPlayerWidgetBase final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x40];                                     // 0x0328(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PriorityData;                                      // 0x0368(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingRadioPlayerComponent*         LastValidComp;                                     // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetRadioStatusOnScreenTime();
	bool HaveToChangeSongInfo(const struct FFortMediaInBandMetadata& MediaMetadata);
	bool IsMetadataEmpty(const struct FFortMediaInBandMetadata& MediaMetadata);
	void NativeEnteredVehicle();
	void NativeExitedVehicle();
	void OnControllerGainedNewFortPawn(class AFortPawn* FortPawn);
	void OnFailedToOpenSource(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnLoadingNewSource(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnMetadataChanged(const struct FFortMediaInBandMetadata& MediaMetadata);
	void OnRadioStopped(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& LastSource);
	void OnSourceFinished(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnSourcePlaying(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void SetControllable(bool bCanControl);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadioPlayerWidgetBase">();
	}
	static class URadioPlayerWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioPlayerWidgetBase>();
	}
};
static_assert(alignof(URadioPlayerWidgetBase) == 0x000008, "Wrong alignment on URadioPlayerWidgetBase");
static_assert(sizeof(URadioPlayerWidgetBase) == 0x000378, "Wrong size on URadioPlayerWidgetBase");
static_assert(offsetof(URadioPlayerWidgetBase, PriorityData) == 0x000368, "Member 'URadioPlayerWidgetBase::PriorityData' has a wrong offset!");
static_assert(offsetof(URadioPlayerWidgetBase, LastValidComp) == 0x000370, "Member 'URadioPlayerWidgetBase::LastValidComp' has a wrong offset!");

}

