#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "SrirachaRanch_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio.HandleRadioPlaying
// 0x0060 (0x0060 - 0x0000)
struct FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying) == 0x000008, "Wrong alignment on FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying");
static_assert(sizeof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying) == 0x000060, "Wrong size on FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying");
static_assert(offsetof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying, Radio) == 0x000000, "Member 'FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying::Radio' has a wrong offset!");
static_assert(offsetof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying, Source) == 0x000008, "Member 'FortMobileActionButtonBehavior_ToggleRadio_HandleRadioPlaying::Source' has a wrong offset!");

// Function SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio.HandleRadioStopped
// 0x0060 (0x0060 - 0x0000)
struct FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped) == 0x000008, "Wrong alignment on FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped");
static_assert(sizeof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped) == 0x000060, "Wrong size on FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped");
static_assert(offsetof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped, Radio) == 0x000000, "Member 'FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped::Radio' has a wrong offset!");
static_assert(offsetof(FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped, Source) == 0x000008, "Member 'FortMobileActionButtonBehavior_ToggleRadio_HandleRadioStopped::Source' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.GetRadioStatusOnScreenTime
// 0x0004 (0x0004 - 0x0000)
struct RadioPlayerWidgetBase_GetRadioStatusOnScreenTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_GetRadioStatusOnScreenTime) == 0x000004, "Wrong alignment on RadioPlayerWidgetBase_GetRadioStatusOnScreenTime");
static_assert(sizeof(RadioPlayerWidgetBase_GetRadioStatusOnScreenTime) == 0x000004, "Wrong size on RadioPlayerWidgetBase_GetRadioStatusOnScreenTime");
static_assert(offsetof(RadioPlayerWidgetBase_GetRadioStatusOnScreenTime, ReturnValue) == 0x000000, "Member 'RadioPlayerWidgetBase_GetRadioStatusOnScreenTime::ReturnValue' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.HaveToChangeSongInfo
// 0x0098 (0x0098 - 0x0000)
struct RadioPlayerWidgetBase_HaveToChangeSongInfo final
{
public:
	struct FFortMediaInBandMetadata               MediaMetadata;                                     // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RadioPlayerWidgetBase_HaveToChangeSongInfo) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_HaveToChangeSongInfo");
static_assert(sizeof(RadioPlayerWidgetBase_HaveToChangeSongInfo) == 0x000098, "Wrong size on RadioPlayerWidgetBase_HaveToChangeSongInfo");
static_assert(offsetof(RadioPlayerWidgetBase_HaveToChangeSongInfo, MediaMetadata) == 0x000000, "Member 'RadioPlayerWidgetBase_HaveToChangeSongInfo::MediaMetadata' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_HaveToChangeSongInfo, ReturnValue) == 0x000090, "Member 'RadioPlayerWidgetBase_HaveToChangeSongInfo::ReturnValue' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.IsMetadataEmpty
// 0x0098 (0x0098 - 0x0000)
struct RadioPlayerWidgetBase_IsMetadataEmpty final
{
public:
	struct FFortMediaInBandMetadata               MediaMetadata;                                     // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RadioPlayerWidgetBase_IsMetadataEmpty) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_IsMetadataEmpty");
static_assert(sizeof(RadioPlayerWidgetBase_IsMetadataEmpty) == 0x000098, "Wrong size on RadioPlayerWidgetBase_IsMetadataEmpty");
static_assert(offsetof(RadioPlayerWidgetBase_IsMetadataEmpty, MediaMetadata) == 0x000000, "Member 'RadioPlayerWidgetBase_IsMetadataEmpty::MediaMetadata' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_IsMetadataEmpty, ReturnValue) == 0x000090, "Member 'RadioPlayerWidgetBase_IsMetadataEmpty::ReturnValue' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnControllerGainedNewFortPawn
// 0x0008 (0x0008 - 0x0000)
struct RadioPlayerWidgetBase_OnControllerGainedNewFortPawn final
{
public:
	class AFortPawn*                              FortPawn;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnControllerGainedNewFortPawn) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnControllerGainedNewFortPawn");
static_assert(sizeof(RadioPlayerWidgetBase_OnControllerGainedNewFortPawn) == 0x000008, "Wrong size on RadioPlayerWidgetBase_OnControllerGainedNewFortPawn");
static_assert(offsetof(RadioPlayerWidgetBase_OnControllerGainedNewFortPawn, FortPawn) == 0x000000, "Member 'RadioPlayerWidgetBase_OnControllerGainedNewFortPawn::FortPawn' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnFailedToOpenSource
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnFailedToOpenSource final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnFailedToOpenSource) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnFailedToOpenSource");
static_assert(sizeof(RadioPlayerWidgetBase_OnFailedToOpenSource) == 0x000060, "Wrong size on RadioPlayerWidgetBase_OnFailedToOpenSource");
static_assert(offsetof(RadioPlayerWidgetBase_OnFailedToOpenSource, Radio) == 0x000000, "Member 'RadioPlayerWidgetBase_OnFailedToOpenSource::Radio' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_OnFailedToOpenSource, Source) == 0x000008, "Member 'RadioPlayerWidgetBase_OnFailedToOpenSource::Source' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnLoadingNewSource
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnLoadingNewSource final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnLoadingNewSource) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnLoadingNewSource");
static_assert(sizeof(RadioPlayerWidgetBase_OnLoadingNewSource) == 0x000060, "Wrong size on RadioPlayerWidgetBase_OnLoadingNewSource");
static_assert(offsetof(RadioPlayerWidgetBase_OnLoadingNewSource, Radio) == 0x000000, "Member 'RadioPlayerWidgetBase_OnLoadingNewSource::Radio' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_OnLoadingNewSource, Source) == 0x000008, "Member 'RadioPlayerWidgetBase_OnLoadingNewSource::Source' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnMetadataChanged
// 0x0090 (0x0090 - 0x0000)
struct RadioPlayerWidgetBase_OnMetadataChanged final
{
public:
	struct FFortMediaInBandMetadata               MediaMetadata;                                     // 0x0000(0x0090)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnMetadataChanged) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnMetadataChanged");
static_assert(sizeof(RadioPlayerWidgetBase_OnMetadataChanged) == 0x000090, "Wrong size on RadioPlayerWidgetBase_OnMetadataChanged");
static_assert(offsetof(RadioPlayerWidgetBase_OnMetadataChanged, MediaMetadata) == 0x000000, "Member 'RadioPlayerWidgetBase_OnMetadataChanged::MediaMetadata' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnRadioStopped
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnRadioStopped final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    LastSource;                                        // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnRadioStopped) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnRadioStopped");
static_assert(sizeof(RadioPlayerWidgetBase_OnRadioStopped) == 0x000060, "Wrong size on RadioPlayerWidgetBase_OnRadioStopped");
static_assert(offsetof(RadioPlayerWidgetBase_OnRadioStopped, Radio) == 0x000000, "Member 'RadioPlayerWidgetBase_OnRadioStopped::Radio' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_OnRadioStopped, LastSource) == 0x000008, "Member 'RadioPlayerWidgetBase_OnRadioStopped::LastSource' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnSourceFinished
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnSourceFinished final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnSourceFinished) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnSourceFinished");
static_assert(sizeof(RadioPlayerWidgetBase_OnSourceFinished) == 0x000060, "Wrong size on RadioPlayerWidgetBase_OnSourceFinished");
static_assert(offsetof(RadioPlayerWidgetBase_OnSourceFinished, Radio) == 0x000000, "Member 'RadioPlayerWidgetBase_OnSourceFinished::Radio' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_OnSourceFinished, Source) == 0x000008, "Member 'RadioPlayerWidgetBase_OnSourceFinished::Source' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.OnSourcePlaying
// 0x0060 (0x0060 - 0x0000)
struct RadioPlayerWidgetBase_OnSourcePlaying final
{
public:
	class UStreamingRadioPlayerComponent*         Radio;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaRadioStation                    Source;                                            // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_OnSourcePlaying) == 0x000008, "Wrong alignment on RadioPlayerWidgetBase_OnSourcePlaying");
static_assert(sizeof(RadioPlayerWidgetBase_OnSourcePlaying) == 0x000060, "Wrong size on RadioPlayerWidgetBase_OnSourcePlaying");
static_assert(offsetof(RadioPlayerWidgetBase_OnSourcePlaying, Radio) == 0x000000, "Member 'RadioPlayerWidgetBase_OnSourcePlaying::Radio' has a wrong offset!");
static_assert(offsetof(RadioPlayerWidgetBase_OnSourcePlaying, Source) == 0x000008, "Member 'RadioPlayerWidgetBase_OnSourcePlaying::Source' has a wrong offset!");

// Function SrirachaRanchUI.RadioPlayerWidgetBase.SetControllable
// 0x0001 (0x0001 - 0x0000)
struct RadioPlayerWidgetBase_SetControllable final
{
public:
	bool                                          bCanControl;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RadioPlayerWidgetBase_SetControllable) == 0x000001, "Wrong alignment on RadioPlayerWidgetBase_SetControllable");
static_assert(sizeof(RadioPlayerWidgetBase_SetControllable) == 0x000001, "Wrong size on RadioPlayerWidgetBase_SetControllable");
static_assert(offsetof(RadioPlayerWidgetBase_SetControllable, bCanControl) == 0x000000, "Member 'RadioPlayerWidgetBase_SetControllable::bCanControl' has a wrong offset!");

}

