#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_NPC_HealthInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NPC_HealthInfo.Struct_NPC_HealthInfo
// 0x0020 (0x0020 - 0x0000)
struct FStruct_NPC_HealthInfo final
{
public:
	double                                        HealthPercent_2_7EDADA384C7908EA98DEBD9958A249DE;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShieldPercent_5_B79C63B64AACF275A1621A9315964DCD;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHealth_6_7D7BEF7841B13FB96D2578989CF135BB;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxShield_9_F923E4444E2E476C56FB0E9D9D2F7846;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_NPC_HealthInfo) == 0x000008, "Wrong alignment on FStruct_NPC_HealthInfo");
static_assert(sizeof(FStruct_NPC_HealthInfo) == 0x000020, "Wrong size on FStruct_NPC_HealthInfo");
static_assert(offsetof(FStruct_NPC_HealthInfo, HealthPercent_2_7EDADA384C7908EA98DEBD9958A249DE) == 0x000000, "Member 'FStruct_NPC_HealthInfo::HealthPercent_2_7EDADA384C7908EA98DEBD9958A249DE' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_HealthInfo, ShieldPercent_5_B79C63B64AACF275A1621A9315964DCD) == 0x000008, "Member 'FStruct_NPC_HealthInfo::ShieldPercent_5_B79C63B64AACF275A1621A9315964DCD' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_HealthInfo, MaxHealth_6_7D7BEF7841B13FB96D2578989CF135BB) == 0x000010, "Member 'FStruct_NPC_HealthInfo::MaxHealth_6_7D7BEF7841B13FB96D2578989CF135BB' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_HealthInfo, MaxShield_9_F923E4444E2E476C56FB0E9D9D2F7846) == 0x000018, "Member 'FStruct_NPC_HealthInfo::MaxShield_9_F923E4444E2E476C56FB0E9D9D2F7846' has a wrong offset!");

}

