#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGameplayOptions_New

#include "Basic.hpp"


namespace SDK::Params
{

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature final
{
public:
	class UFortSetting*                           Setting;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Action;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature) == 0x000008, "Wrong alignment on TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature");
static_assert(sizeof(TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature) == 0x000010, "Wrong size on TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature");
static_assert(offsetof(TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature, Setting) == 0x000000, "Member 'TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature::Setting' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature, Action) == 0x000008, "Member 'TabGameplayOptions_New_C_BndEvt__Settings_Panel_K2Node_ComponentBoundEvent_1_OnExecuteNamedActionBP__DelegateSignature::Action' has a wrong offset!");

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.ExecuteUbergraph_TabGameplayOptions_New
// 0x0098 (0x0098 - 0x0000)
struct TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* ActivatableWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_ActivatableWidget_1;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_PushPrimaryContent*    CallFunc_PushPrimaryContentClassAsync_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UColorCalibration_C*                    K2Node_DynamicCast_AsColor_Calibration;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_ActivatableWidget;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* ActivatableWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               Temp_object_Variable_1;                            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_PushPrimaryContent*    CallFunc_PushPrimaryContentClassAsync_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UColorCalibration_C*                    K2Node_DynamicCast_AsColor_Calibration_1;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSetting*                           K2Node_ComponentBoundEvent_Setting;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_Action;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New) == 0x000008, "Wrong alignment on TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New");
static_assert(sizeof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New) == 0x000098, "Wrong size on TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, EntryPoint) == 0x000000, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_CustomEvent_ActivatableWidget_1) == 0x000010, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_CustomEvent_ActivatableWidget_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, Temp_object_Variable) == 0x000018, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, CallFunc_PushPrimaryContentClassAsync_ReturnValue) == 0x000020, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::CallFunc_PushPrimaryContentClassAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_DynamicCast_AsColor_Calibration) == 0x000030, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_DynamicCast_AsColor_Calibration' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_CustomEvent_ActivatableWidget) == 0x000040, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_CustomEvent_ActivatableWidget' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, Temp_object_Variable_1) == 0x000058, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, CallFunc_PushPrimaryContentClassAsync_ReturnValue_1) == 0x000060, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::CallFunc_PushPrimaryContentClassAsync_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_DynamicCast_AsColor_Calibration_1) == 0x000070, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_DynamicCast_AsColor_Calibration_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_CustomEvent_Value) == 0x000080, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_ComponentBoundEvent_Setting) == 0x000088, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_ComponentBoundEvent_Setting' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_ComponentBoundEvent_Action) == 0x000090, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_ComponentBoundEvent_Action' has a wrong offset!");
static_assert(offsetof(TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New, K2Node_SwitchName_CmpSuccess) == 0x000094, "Member 'TabGameplayOptions_New_C_ExecuteUbergraph_TabGameplayOptions_New::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB
// 0x0008 (0x0008 - 0x0000)
struct TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB final
{
public:
	class UCommonActivatableWidget*               ActivatableWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB) == 0x000008, "Wrong alignment on TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB");
static_assert(sizeof(TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB) == 0x000008, "Wrong size on TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB");
static_assert(offsetof(TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB, ActivatableWidget) == 0x000000, "Member 'TabGameplayOptions_New_C_OnPrimaryContentPushed_2B43339642D223ADA5A2A1AE55073FBB::ActivatableWidget' has a wrong offset!");

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5
// 0x0008 (0x0008 - 0x0000)
struct TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5 final
{
public:
	class UCommonActivatableWidget*               ActivatableWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5) == 0x000008, "Wrong alignment on TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5");
static_assert(sizeof(TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5) == 0x000008, "Wrong size on TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5");
static_assert(offsetof(TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5, ActivatableWidget) == 0x000000, "Member 'TabGameplayOptions_New_C_OnPrimaryContentPushed_5AB5972E44DCB37B5322F0BF3E4FC9F5::ActivatableWidget' has a wrong offset!");

// Function TabGameplayOptions_New.TabGameplayOptions_New_C.SettingValueChanged
// 0x0008 (0x0008 - 0x0000)
struct TabGameplayOptions_New_C_SettingValueChanged final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameplayOptions_New_C_SettingValueChanged) == 0x000008, "Wrong alignment on TabGameplayOptions_New_C_SettingValueChanged");
static_assert(sizeof(TabGameplayOptions_New_C_SettingValueChanged) == 0x000008, "Wrong size on TabGameplayOptions_New_C_SettingValueChanged");
static_assert(offsetof(TabGameplayOptions_New_C_SettingValueChanged, Value) == 0x000000, "Member 'TabGameplayOptions_New_C_SettingValueChanged::Value' has a wrong offset!");

}

