#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabTouchWeaponOptions_New

#include "Basic.hpp"


namespace SDK::Params
{

// Function TabTouchWeaponOptions_New.TabTouchWeaponOptions_New_C.ExecuteUbergraph_TabTouchWeaponOptions_New
// 0x0010 (0x0010 - 0x0000)
struct TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New) == 0x000008, "Wrong alignment on TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New");
static_assert(sizeof(TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New) == 0x000010, "Wrong size on TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New");
static_assert(offsetof(TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New, EntryPoint) == 0x000000, "Member 'TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New, K2Node_CustomEvent_Value) == 0x000008, "Member 'TabTouchWeaponOptions_New_C_ExecuteUbergraph_TabTouchWeaponOptions_New::K2Node_CustomEvent_Value' has a wrong offset!");

// Function TabTouchWeaponOptions_New.TabTouchWeaponOptions_New_C.SettingValueChanged
// 0x0008 (0x0008 - 0x0000)
struct TabTouchWeaponOptions_New_C_SettingValueChanged final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabTouchWeaponOptions_New_C_SettingValueChanged) == 0x000008, "Wrong alignment on TabTouchWeaponOptions_New_C_SettingValueChanged");
static_assert(sizeof(TabTouchWeaponOptions_New_C_SettingValueChanged) == 0x000008, "Wrong size on TabTouchWeaponOptions_New_C_SettingValueChanged");
static_assert(offsetof(TabTouchWeaponOptions_New_C_SettingValueChanged, Value) == 0x000000, "Member 'TabTouchWeaponOptions_New_C_SettingValueChanged::Value' has a wrong offset!");

}

