#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function TeamMemberPedestal.TeamMemberPedestal_C.ApplyHoloMaterialOverrideToPawn
// 0x0048 (0x0048 - 0x0000)
struct TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn final
{
public:
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveMaterialOverrideLocal_ReturnValue;  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0020)(UObjectWrapper, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_BP_ApplyMaterialOverrideLocalWithFlags_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn");
static_assert(sizeof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn) == 0x000048, "Wrong size on TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn");
static_assert(offsetof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000000, "Member 'TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn, CallFunc_RemoveMaterialOverrideLocal_ReturnValue) == 0x000009, "Member 'TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn::CallFunc_RemoveMaterialOverrideLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn, CallFunc_BP_ApplyMaterialOverrideLocalWithFlags_ReturnValue) == 0x000030, "Member 'TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn::CallFunc_BP_ApplyMaterialOverrideLocalWithFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'TeamMemberPedestal_C_ApplyHoloMaterialOverrideToPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.ClearPawnMaterialOverride
// 0x0010 (0x0010 - 0x0000)
struct TeamMemberPedestal_C_ClearPawnMaterialOverride final
{
public:
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveMaterialOverrideLocal_ReturnValue;  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_ClearPawnMaterialOverride) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_ClearPawnMaterialOverride");
static_assert(sizeof(TeamMemberPedestal_C_ClearPawnMaterialOverride) == 0x000010, "Wrong size on TeamMemberPedestal_C_ClearPawnMaterialOverride");
static_assert(offsetof(TeamMemberPedestal_C_ClearPawnMaterialOverride, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000000, "Member 'TeamMemberPedestal_C_ClearPawnMaterialOverride::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ClearPawnMaterialOverride, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'TeamMemberPedestal_C_ClearPawnMaterialOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ClearPawnMaterialOverride, CallFunc_RemoveMaterialOverrideLocal_ReturnValue) == 0x000009, "Member 'TeamMemberPedestal_C_ClearPawnMaterialOverride::CallFunc_RemoveMaterialOverrideLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ClearPawnMaterialOverride, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'TeamMemberPedestal_C_ClearPawnMaterialOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.EnableHologram
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_C_EnableHologram final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_EnableHologram) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_EnableHologram");
static_assert(sizeof(TeamMemberPedestal_C_EnableHologram) == 0x000001, "Wrong size on TeamMemberPedestal_C_EnableHologram");
static_assert(offsetof(TeamMemberPedestal_C_EnableHologram, Enabled) == 0x000000, "Member 'TeamMemberPedestal_C_EnableHologram::Enabled' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.ExecuteUbergraph_TeamMemberPedestal
// 0x0728 (0x0728 - 0x0000)
struct TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameReadiness                                Temp_byte_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInMatch;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPopulated_1;                       // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwningSquadContainsLocalPlayer_1;    // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B7[0x1];                                      // 0x01B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameReadiness                                K2Node_Event_GameReadiness;                        // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraAnimationTransition_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0228(0x0010)(ReferenceParm)
	class ACameraAnimationTransition_C*           CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bMultipleSquadsPopulated;             // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwningSquadContainsLocalPlayer;      // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaTeamDisplayInfo                 K2Node_Event_OwningSquadStyle;                     // 0x0248(0x0078)(ConstParm)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x02C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_1;        // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_2;        // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6[0x2];                                      // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SquadIdx;                             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSquadHasLocalPlayer;                 // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPopulated;                         // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_3;        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_4;        // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_5;        // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasValidTeamMember;                  // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x02E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_6;        // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_3;                           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_AvatarImage;                          // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Event_AvatarBackground;                     // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Event_HighlightColor;                       // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Bool_2;                         // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Bool_1;                         // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_2;                // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Bool;                           // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0368(0x00D0)(ContainsInstancedReference)
	class UObject*                                K2Node_HandleClientEvent_EventSource_1;            // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus_1;             // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent_1;            // 0x0448(0x0018)(ConstParm, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0470(0x0018)(ConstParm, NoDestructor)
	int32                                         CallFunc_GetCurrentTeamSize_ReturnValue;           // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentTeamSize_ReturnValue_1;         // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_493[0x5];                                      // 0x0493(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_4;                           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue_1;               // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x2];                                      // 0x04B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Height_1;                             // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Height;                               // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x04E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x05F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_2; // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_3; // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_4; // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_5; // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast_1;             // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal");
static_assert(sizeof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal) == 0x000728, "Wrong size on TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, EntryPoint) == 0x000000, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable) == 0x000008, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_1) == 0x000010, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_2) == 0x000018, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_3) == 0x000020, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_byte_Variable) == 0x000028, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable) == 0x000029, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_1) == 0x00002A, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_2) == 0x00002B, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_struct_Variable) == 0x00002C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_object_Variable) == 0x000048, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsTexture) == 0x000050, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_3) == 0x000059, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_struct_Variable_1) == 0x00005C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_4) == 0x00006C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_4) == 0x000070, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_5) == 0x000078, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_5) == 0x000080, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_6) == 0x000088, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_real_Variable_7) == 0x000090, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_byte_Variable_1) == 0x0000B0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default) == 0x0000B1, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bIsInMatch) == 0x0000C0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bIsInMatch' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000C8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_int_Array_Index_Variable) == 0x0001B0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsValid_ReturnValue) == 0x0001B4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bIsPopulated_1) == 0x0001B5, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bIsPopulated_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bOwningSquadContainsLocalPlayer_1) == 0x0001B6, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bOwningSquadContainsLocalPlayer_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0001B8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x0001C8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001E0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001E8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001F0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0001F8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000200, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInFrontend_ReturnValue) == 0x000208, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_GameReadiness) == 0x000209, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_GameReadiness' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterial_ReturnValue) == 0x000210, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000218, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_1) == 0x000220, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetAllActorsOfClass_OutActors) == 0x000228, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Array_Get_Item) == 0x000238, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Array_Length_ReturnValue) == 0x000240, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bMultipleSquadsPopulated) == 0x000244, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bMultipleSquadsPopulated' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bOwningSquadContainsLocalPlayer) == 0x000245, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bOwningSquadContainsLocalPlayer' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_OwningSquadStyle) == 0x000248, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_OwningSquadStyle' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue) == 0x0002C0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_2) == 0x0002C4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_1) == 0x0002D4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_2) == 0x0002D5, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_SquadIdx) == 0x0002D8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_SquadIdx' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bSquadHasLocalPlayer) == 0x0002DC, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bSquadHasLocalPlayer' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bIsPopulated) == 0x0002DD, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bIsPopulated' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_BooleanOR_ReturnValue) == 0x0002DE, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002DF, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_3) == 0x0002E0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_4) == 0x0002E1, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_5) == 0x0002E2, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bHasValidTeamMember) == 0x0002E3, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bHasValidTeamMember' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x0002E4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_6) == 0x0002F4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_3) == 0x0002F8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_AvatarImage) == 0x000300, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_AvatarImage' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_AvatarBackground) == 0x000308, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_AvatarBackground' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_HighlightColor) == 0x00030C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_HighlightColor' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000310, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterialIndex_ReturnValue) == 0x000320, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterial_ReturnValue_1) == 0x000328, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000330, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000338, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_Bool_2) == 0x000340, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_Bool_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_Bool_1) == 0x000341, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_Bool_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterial_ReturnValue_2) == 0x000348, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000350, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_Bool) == 0x000358, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_Bool' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000359, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_int_Loop_Counter_Variable) == 0x00035C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Less_IntInt_ReturnValue) == 0x000360, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Add_IntInt_ReturnValue) == 0x000364, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000368, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventSource_1) == 0x000438, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventSource_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventFocus_1) == 0x000440, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventFocus_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_ClientEvent_1) == 0x000448, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_ClientEvent_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventSource) == 0x000460, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventFocus) == 0x000468, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_ClientEvent) == 0x000470, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetCurrentTeamSize_ReturnValue) == 0x000488, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetCurrentTeamSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetCurrentTeamSize_ReturnValue_1) == 0x00048C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetCurrentTeamSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Greater_IntInt_ReturnValue) == 0x000490, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000491, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Not_PreBool_ReturnValue) == 0x000492, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_4) == 0x000498, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_5) == 0x0004A0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInFrontend_ReturnValue_1) == 0x0004B0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInFrontend_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Not_PreBool_ReturnValue_1) == 0x0004B1, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_Height_1) == 0x0004B4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_Height_1' has a wrong offset!");
