#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C
// 0x0340 (0x18F0 - 0x15B0)
class UTeamMemberPedestal_Nameplate_C final : public UFortTeamMemberPedestalNameplate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BannerSwap;                                        // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NotReadyTextColor;                                 // 0x15C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReadyTextColor;                                    // 0x15C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Ready_Change_Text;                              // 0x15D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortHUDElementWrapper_C*               FortHUDElementWrapper;                             // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_InputAction;                                    // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeamMemberPedestal_ActivatableContainer_C* TeamMemberPedestal_ActivatableContainer;           // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Widget_PlayerLevel;                                // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x1600(0x0250)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x1850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1851[0x3];                                     // 0x1851(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReadyColor;                                        // 0x1854(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NotReadyColor;                                     // 0x1864(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1874[0x4];                                     // 0x1874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             UnReadySound;                                      // 0x1878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReadySound;                                        // 0x1880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   AddFriendText;                                     // 0x1888(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptedInviteText;                                // 0x18A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptFriendRequestText;                           // 0x18B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SentInviteText;                                    // 0x18D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESlateVisibility                              FALSE_0;                                           // 0x18E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               DefaultOldCameraValue;                             // 0x18E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HabaneroState;                                     // 0x18EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_TeamMemberPedestal_Nameplate(int32 EntryPoint);
	void Finished_21F6CCB14E904953070D908FABF83658();
	ESlateVisibility GetInputActionVisibility();
	void HandleInputMethodChanged(ECommonInputType bNewInputType);
	void OnCurrentSubGameChanged(ESubGame NewSubGame);
	void OnFriendStatusUpdated(const EFortFriendRequestStatus FriendRequestStatus);
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void OnInitialized();
	void OnInputChanged(ECommonInputType bNewInputType);
	void OnIsPlayingHabaneroChanged(bool bPlayingHabanero);
	void OnPlayReadyAudio(bool bIsReadyForMatchmaking);
	void OnReadyStatusChanged(EGameReadiness GameReadiness, bool bIsDownloading);
	void ResetHabaneroAnimation(bool HabaneroState_0);
	void Update_Add_Friend_Button_Visuals(bool IsUsingTouch);
	void UpdateInputActionVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_Nameplate_C">();
	}
	static class UTeamMemberPedestal_Nameplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberPedestal_Nameplate_C>();
	}
};
static_assert(alignof(UTeamMemberPedestal_Nameplate_C) == 0x000010, "Wrong alignment on UTeamMemberPedestal_Nameplate_C");
static_assert(sizeof(UTeamMemberPedestal_Nameplate_C) == 0x0018F0, "Wrong size on UTeamMemberPedestal_Nameplate_C");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, UberGraphFrame) == 0x0015B0, "Member 'UTeamMemberPedestal_Nameplate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, BannerSwap) == 0x0015B8, "Member 'UTeamMemberPedestal_Nameplate_C::BannerSwap' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, NotReadyTextColor) == 0x0015C0, "Member 'UTeamMemberPedestal_Nameplate_C::NotReadyTextColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadyTextColor) == 0x0015C8, "Member 'UTeamMemberPedestal_Nameplate_C::ReadyTextColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, On_Ready_Change_Text) == 0x0015D0, "Member 'UTeamMemberPedestal_Nameplate_C::On_Ready_Change_Text' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, FortHUDElementWrapper) == 0x0015D8, "Member 'UTeamMemberPedestal_Nameplate_C::FortHUDElementWrapper' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, SB_InputAction) == 0x0015E0, "Member 'UTeamMemberPedestal_Nameplate_C::SB_InputAction' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ScaleBox_0) == 0x0015E8, "Member 'UTeamMemberPedestal_Nameplate_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, TeamMemberPedestal_ActivatableContainer) == 0x0015F0, "Member 'UTeamMemberPedestal_Nameplate_C::TeamMemberPedestal_ActivatableContainer' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, Widget_PlayerLevel) == 0x0015F8, "Member 'UTeamMemberPedestal_Nameplate_C::Widget_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, TeamMemberInfo) == 0x001600, "Member 'UTeamMemberPedestal_Nameplate_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, bHovered) == 0x001850, "Member 'UTeamMemberPedestal_Nameplate_C::bHovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadyColor) == 0x001854, "Member 'UTeamMemberPedestal_Nameplate_C::ReadyColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, NotReadyColor) == 0x001864, "Member 'UTeamMemberPedestal_Nameplate_C::NotReadyColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, UnReadySound) == 0x001878, "Member 'UTeamMemberPedestal_Nameplate_C::UnReadySound' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadySound) == 0x001880, "Member 'UTeamMemberPedestal_Nameplate_C::ReadySound' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AddFriendText) == 0x001888, "Member 'UTeamMemberPedestal_Nameplate_C::AddFriendText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AcceptedInviteText) == 0x0018A0, "Member 'UTeamMemberPedestal_Nameplate_C::AcceptedInviteText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AcceptFriendRequestText) == 0x0018B8, "Member 'UTeamMemberPedestal_Nameplate_C::AcceptFriendRequestText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, SentInviteText) == 0x0018D0, "Member 'UTeamMemberPedestal_Nameplate_C::SentInviteText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, FALSE_0) == 0x0018E8, "Member 'UTeamMemberPedestal_Nameplate_C::FALSE_0' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, DefaultOldCameraValue) == 0x0018E9, "Member 'UTeamMemberPedestal_Nameplate_C::DefaultOldCameraValue' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, HabaneroState) == 0x0018EA, "Member 'UTeamMemberPedestal_Nameplate_C::HabaneroState' has a wrong offset!");

}

