#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate_AddFriendButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberPedestal_Nameplate_AddFriendButton.TeamMemberPedestal_Nameplate_AddFriendButton_C
// 0x0050 (0x1530 - 0x14E0)
class UTeamMemberPedestal_Nameplate_AddFriendButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnUnhovered;                                       // 0x14E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x14F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayShine;                                         // 0x1500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x1508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_InputAction;                                    // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_TeamMemberPedestal_Nameplate_AddFriendButton(int32 EntryPoint);
	void SetButtonText(const class FText& InText);
	void SetInputActionVisibility(ESlateVisibility InVisibility);
	void UpdateVisuals(bool IsUsingTouch);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_Nameplate_AddFriendButton_C">();
	}
	static class UTeamMemberPedestal_Nameplate_AddFriendButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberPedestal_Nameplate_AddFriendButton_C>();
	}
};
static_assert(alignof(UTeamMemberPedestal_Nameplate_AddFriendButton_C) == 0x000010, "Wrong alignment on UTeamMemberPedestal_Nameplate_AddFriendButton_C");
static_assert(sizeof(UTeamMemberPedestal_Nameplate_AddFriendButton_C) == 0x001530, "Wrong size on UTeamMemberPedestal_Nameplate_AddFriendButton_C");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, UberGraphFrame) == 0x0014E0, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, OnUnhovered) == 0x0014E8, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Reset) == 0x0014F0, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Reset' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Disabled) == 0x0014F8, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Disabled' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, PlayShine) == 0x001500, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::PlayShine' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, OnHovered) == 0x001508, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, CenterButtonTextWidget) == 0x001510, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Image_ButtonTop) == 0x001518, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, SB_InputAction) == 0x001520, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::SB_InputAction' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, SizeBox_0) == 0x001528, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::SizeBox_0' has a wrong offset!");

}

