#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastSocialWidget

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ToastSocialWidget.ToastSocialWidget_C.BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.ExecuteUbergraph_ToastSocialWidget
// 0x0198 (0x0198 - 0x0000)
struct ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0078)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCursorModeEnabled;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_Select_Default;                             // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_NewInputType;                         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINotification*                    K2Node_Event_Notification_1;                       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortUINotification*                    K2Node_Event_Notification;                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDisplayTime_ReturnValue;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget) == 0x000008, "Wrong alignment on ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget");
static_assert(sizeof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget) == 0x000198, "Wrong size on ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, EntryPoint) == 0x000000, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, Temp_bool_Variable) == 0x000005, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_MyGeometry) == 0x000014, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000140, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000148, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_bCursorModeEnabled) == 0x000150, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_ComponentBoundEvent_Button) == 0x000158, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_BooleanOR_ReturnValue) == 0x000160, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Select_Default) == 0x000168, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_NewInputType) == 0x000170, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_NewInputType' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000174, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_Notification_1) == 0x000178, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_Notification_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, K2Node_Event_Notification) == 0x000180, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::K2Node_Event_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_GetDisplayTime_bOutDisplayTimeOverridden) == 0x000188, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_GetDisplayTime_bOutDisplayTimeOverridden' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_GetDisplayTime_ReturnValue) == 0x00018C, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_GetDisplayTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000190, "Member 'ToastSocialWidget_C_ExecuteUbergraph_ToastSocialWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.GetActiveWidgetIndex
// 0x0018 (0x0018 - 0x0000)
struct ToastSocialWidget_C_GetActiveWidgetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_GetActiveWidgetIndex) == 0x000008, "Wrong alignment on ToastSocialWidget_C_GetActiveWidgetIndex");
static_assert(sizeof(ToastSocialWidget_C_GetActiveWidgetIndex) == 0x000018, "Wrong size on ToastSocialWidget_C_GetActiveWidgetIndex");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, CallFunc_IsInZone_ReturnValue) == 0x000011, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetActiveWidgetIndex, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'ToastSocialWidget_C_GetActiveWidgetIndex::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.GetButtonCursorText
// 0x0028 (0x0028 - 0x0000)
struct ToastSocialWidget_C_GetButtonCursorText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_GetButtonCursorText) == 0x000008, "Wrong alignment on ToastSocialWidget_C_GetButtonCursorText");
static_assert(sizeof(ToastSocialWidget_C_GetButtonCursorText) == 0x000028, "Wrong size on ToastSocialWidget_C_GetButtonCursorText");
static_assert(offsetof(ToastSocialWidget_C_GetButtonCursorText, Text) == 0x000000, "Member 'ToastSocialWidget_C_GetButtonCursorText::Text' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetButtonCursorText, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000018, "Member 'ToastSocialWidget_C_GetButtonCursorText::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetButtonCursorText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ToastSocialWidget_C_GetButtonCursorText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetButtonCursorText, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'ToastSocialWidget_C_GetButtonCursorText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.GetButtonHoldText
// 0x0028 (0x0028 - 0x0000)
struct ToastSocialWidget_C_GetButtonHoldText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_GetButtonHoldText) == 0x000008, "Wrong alignment on ToastSocialWidget_C_GetButtonHoldText");
static_assert(sizeof(ToastSocialWidget_C_GetButtonHoldText) == 0x000028, "Wrong size on ToastSocialWidget_C_GetButtonHoldText");
static_assert(offsetof(ToastSocialWidget_C_GetButtonHoldText, Text) == 0x000000, "Member 'ToastSocialWidget_C_GetButtonHoldText::Text' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetButtonHoldText, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000018, "Member 'ToastSocialWidget_C_GetButtonHoldText::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetButtonHoldText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ToastSocialWidget_C_GetButtonHoldText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetButtonHoldText, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'ToastSocialWidget_C_GetButtonHoldText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.GetInputSwitcherVisibility
// 0x0006 (0x0006 - 0x0000)
struct ToastSocialWidget_C_GetInputSwitcherVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_GetInputSwitcherVisibility) == 0x000001, "Wrong alignment on ToastSocialWidget_C_GetInputSwitcherVisibility");
static_assert(sizeof(ToastSocialWidget_C_GetInputSwitcherVisibility) == 0x000006, "Wrong size on ToastSocialWidget_C_GetInputSwitcherVisibility");
static_assert(offsetof(ToastSocialWidget_C_GetInputSwitcherVisibility, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_C_GetInputSwitcherVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetInputSwitcherVisibility, Temp_bool_Variable) == 0x000001, "Member 'ToastSocialWidget_C_GetInputSwitcherVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetInputSwitcherVisibility, Temp_byte_Variable) == 0x000002, "Member 'ToastSocialWidget_C_GetInputSwitcherVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetInputSwitcherVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ToastSocialWidget_C_GetInputSwitcherVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetInputSwitcherVisibility, CallFunc_HasAction_ReturnValue) == 0x000004, "Member 'ToastSocialWidget_C_GetInputSwitcherVisibility::CallFunc_HasAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetInputSwitcherVisibility, K2Node_Select_Default) == 0x000005, "Member 'ToastSocialWidget_C_GetInputSwitcherVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.OnCursorModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ToastSocialWidget_C_OnCursorModeChanged final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_OnCursorModeChanged) == 0x000001, "Wrong alignment on ToastSocialWidget_C_OnCursorModeChanged");
static_assert(sizeof(ToastSocialWidget_C_OnCursorModeChanged) == 0x000001, "Wrong size on ToastSocialWidget_C_OnCursorModeChanged");
static_assert(offsetof(ToastSocialWidget_C_OnCursorModeChanged, bCursorModeEnabled) == 0x000000, "Member 'ToastSocialWidget_C_OnCursorModeChanged::bCursorModeEnabled' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ToastSocialWidget_C_OnInputModeChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_OnInputModeChanged) == 0x000001, "Wrong alignment on ToastSocialWidget_C_OnInputModeChanged");
static_assert(sizeof(ToastSocialWidget_C_OnInputModeChanged) == 0x000001, "Wrong size on ToastSocialWidget_C_OnInputModeChanged");
static_assert(offsetof(ToastSocialWidget_C_OnInputModeChanged, NewInputType) == 0x000000, "Member 'ToastSocialWidget_C_OnInputModeChanged::NewInputType' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct ToastSocialWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ToastSocialWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on ToastSocialWidget_C_OnMouseEnter");
static_assert(sizeof(ToastSocialWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on ToastSocialWidget_C_OnMouseEnter");
static_assert(offsetof(ToastSocialWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'ToastSocialWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'ToastSocialWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct ToastSocialWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ToastSocialWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on ToastSocialWidget_C_OnMouseLeave");
static_assert(sizeof(ToastSocialWidget_C_OnMouseLeave) == 0x000078, "Wrong size on ToastSocialWidget_C_OnMouseLeave");
static_assert(offsetof(ToastSocialWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'ToastSocialWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.OnNotificationSet
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_C_OnNotificationSet final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_OnNotificationSet) == 0x000008, "Wrong alignment on ToastSocialWidget_C_OnNotificationSet");
static_assert(sizeof(ToastSocialWidget_C_OnNotificationSet) == 0x000008, "Wrong size on ToastSocialWidget_C_OnNotificationSet");
static_assert(offsetof(ToastSocialWidget_C_OnNotificationSet, Notification) == 0x000000, "Member 'ToastSocialWidget_C_OnNotificationSet::Notification' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.OnNotificationUpdated
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_C_OnNotificationUpdated final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_OnNotificationUpdated) == 0x000008, "Wrong alignment on ToastSocialWidget_C_OnNotificationUpdated");
static_assert(sizeof(ToastSocialWidget_C_OnNotificationUpdated) == 0x000008, "Wrong size on ToastSocialWidget_C_OnNotificationUpdated");
static_assert(offsetof(ToastSocialWidget_C_OnNotificationUpdated, Notification) == 0x000000, "Member 'ToastSocialWidget_C_OnNotificationUpdated::Notification' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.SetImage
// 0x0030 (0x0030 - 0x0000)
struct ToastSocialWidget_C_SetImage final
{
public:
	TSoftObjectPtr<class UObject>                 CallFunc_GetDisplayAsset_ReturnValue;              // 0x0000(0x0020)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UTwitchNotification_C*                  K2Node_DynamicCast_AsTwitch_Notification;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_SetImage) == 0x000008, "Wrong alignment on ToastSocialWidget_C_SetImage");
static_assert(sizeof(ToastSocialWidget_C_SetImage) == 0x000030, "Wrong size on ToastSocialWidget_C_SetImage");
static_assert(offsetof(ToastSocialWidget_C_SetImage, CallFunc_GetDisplayAsset_ReturnValue) == 0x000000, "Member 'ToastSocialWidget_C_SetImage::CallFunc_GetDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetImage, K2Node_DynamicCast_AsTwitch_Notification) == 0x000020, "Member 'ToastSocialWidget_C_SetImage::K2Node_DynamicCast_AsTwitch_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetImage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ToastSocialWidget_C_SetImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetImage, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000029, "Member 'ToastSocialWidget_C_SetImage::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.SetupAnimBindings
// 0x0034 (0x0034 - 0x0000)
struct ToastSocialWidget_C_SetupAnimBindings final
{
public:
	bool                                          Unbind;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_SetupAnimBindings) == 0x000004, "Wrong alignment on ToastSocialWidget_C_SetupAnimBindings");
static_assert(sizeof(ToastSocialWidget_C_SetupAnimBindings) == 0x000034, "Wrong size on ToastSocialWidget_C_SetupAnimBindings");
static_assert(offsetof(ToastSocialWidget_C_SetupAnimBindings, Unbind) == 0x000000, "Member 'ToastSocialWidget_C_SetupAnimBindings::Unbind' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ToastSocialWidget_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'ToastSocialWidget_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'ToastSocialWidget_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'ToastSocialWidget_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.SetVisibilityForOptionalElements
// 0x0001 (0x0001 - 0x0000)
struct ToastSocialWidget_C_SetVisibilityForOptionalElements final
{
public:
	ESlateVisibility                              CallFunc_GetInputSwitcherVisibility_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_SetVisibilityForOptionalElements) == 0x000001, "Wrong alignment on ToastSocialWidget_C_SetVisibilityForOptionalElements");
static_assert(sizeof(ToastSocialWidget_C_SetVisibilityForOptionalElements) == 0x000001, "Wrong size on ToastSocialWidget_C_SetVisibilityForOptionalElements");
static_assert(offsetof(ToastSocialWidget_C_SetVisibilityForOptionalElements, CallFunc_GetInputSwitcherVisibility_ReturnValue) == 0x000000, "Member 'ToastSocialWidget_C_SetVisibilityForOptionalElements::CallFunc_GetInputSwitcherVisibility_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.StartIntro
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_C_StartIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_StartIntro) == 0x000008, "Wrong alignment on ToastSocialWidget_C_StartIntro");
static_assert(sizeof(ToastSocialWidget_C_StartIntro) == 0x000008, "Wrong size on ToastSocialWidget_C_StartIntro");
static_assert(offsetof(ToastSocialWidget_C_StartIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ToastSocialWidget_C_StartIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.TakeAction
// 0x0001 (0x0001 - 0x0000)
struct ToastSocialWidget_C_TakeAction final
{
public:
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_TakeAction) == 0x000001, "Wrong alignment on ToastSocialWidget_C_TakeAction");
static_assert(sizeof(ToastSocialWidget_C_TakeAction) == 0x000001, "Wrong size on ToastSocialWidget_C_TakeAction");
static_assert(offsetof(ToastSocialWidget_C_TakeAction, CallFunc_HasAction_ReturnValue) == 0x000000, "Member 'ToastSocialWidget_C_TakeAction::CallFunc_HasAction_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.UpdateToast
// 0x0078 (0x0078 - 0x0000)
struct ToastSocialWidget_C_UpdateToast final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            NewLocalVar_3;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0010(0x0018)(ConstParm)
	class FText                                   CallFunc_GetTitle_ReturnValue;                     // 0x0028(0x0018)(ConstParm)
	class FText                                   CallFunc_GetButtonHoldText_Text;                   // 0x0040(0x0018)()
	class FText                                   CallFunc_GetButtonCursorText_Text;                 // 0x0058(0x0018)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_UpdateToast) == 0x000008, "Wrong alignment on ToastSocialWidget_C_UpdateToast");
static_assert(sizeof(ToastSocialWidget_C_UpdateToast) == 0x000078, "Wrong size on ToastSocialWidget_C_UpdateToast");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, Notification) == 0x000000, "Member 'ToastSocialWidget_C_UpdateToast::Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, NewLocalVar_3) == 0x000008, "Member 'ToastSocialWidget_C_UpdateToast::NewLocalVar_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, CallFunc_GetDescription_ReturnValue) == 0x000010, "Member 'ToastSocialWidget_C_UpdateToast::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, CallFunc_GetTitle_ReturnValue) == 0x000028, "Member 'ToastSocialWidget_C_UpdateToast::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, CallFunc_GetButtonHoldText_Text) == 0x000040, "Member 'ToastSocialWidget_C_UpdateToast::CallFunc_GetButtonHoldText_Text' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, CallFunc_GetButtonCursorText_Text) == 0x000058, "Member 'ToastSocialWidget_C_UpdateToast::CallFunc_GetButtonCursorText_Text' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_UpdateToast, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000070, "Member 'ToastSocialWidget_C_UpdateToast::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget.ToastSocialWidget_C.GetDisplayTime
// 0x0020 (0x0020 - 0x0000)
struct ToastSocialWidget_C_GetDisplayTime final
{
public:
	bool                                          bOutDisplayTimeOverridden;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDisplayTime_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_C_GetDisplayTime) == 0x000008, "Wrong alignment on ToastSocialWidget_C_GetDisplayTime");
static_assert(sizeof(ToastSocialWidget_C_GetDisplayTime) == 0x000020, "Wrong size on ToastSocialWidget_C_GetDisplayTime");
static_assert(offsetof(ToastSocialWidget_C_GetDisplayTime, bOutDisplayTimeOverridden) == 0x000000, "Member 'ToastSocialWidget_C_GetDisplayTime::bOutDisplayTimeOverridden' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetDisplayTime, ReturnValue) == 0x000004, "Member 'ToastSocialWidget_C_GetDisplayTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_C_GetDisplayTime, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000008, "Member 'ToastSocialWidget_C_GetDisplayTime::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
