#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastWidget_New

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ToastWidget_New.ToastWidget_New_C.BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastWidget_New_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.ExecuteUbergraph_ToastWidget_New
// 0x0170 (0x0170 - 0x0000)
struct ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDisplayTime_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0058(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D0(0x0078)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortUINotification*                    K2Node_Event_Notification_1;                       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortUINotification*                    K2Node_Event_Notification;                         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New) == 0x000008, "Wrong alignment on ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New");
static_assert(sizeof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New) == 0x000170, "Wrong size on ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, EntryPoint) == 0x000000, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, CallFunc_GetDisplayTime_bOutDisplayTimeOverridden) == 0x000004, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::CallFunc_GetDisplayTime_bOutDisplayTimeOverridden' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, CallFunc_GetDisplayTime_ReturnValue) == 0x000008, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::CallFunc_GetDisplayTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_Event_MyGeometry) == 0x000020, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_Event_MouseEvent_1) == 0x000058, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_Event_MouseEvent) == 0x0000D0, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_ComponentBoundEvent_Button) == 0x000148, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, CallFunc_PlayAnimation_ReturnValue) == 0x000150, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_Event_Notification_1) == 0x000158, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_Event_Notification_1' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, K2Node_Event_Notification) == 0x000160, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::K2Node_Event_Notification' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New, CallFunc_HasAction_ReturnValue) == 0x000168, "Member 'ToastWidget_New_C_ExecuteUbergraph_ToastWidget_New::CallFunc_HasAction_ReturnValue' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.GetOpenButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct ToastWidget_New_C_GetOpenButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_GetOpenButtonVisibility) == 0x000008, "Wrong alignment on ToastWidget_New_C_GetOpenButtonVisibility");
static_assert(sizeof(ToastWidget_New_C_GetOpenButtonVisibility) == 0x000018, "Wrong size on ToastWidget_New_C_GetOpenButtonVisibility");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, ReturnValue) == 0x000000, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, CallFunc_HasAction_ReturnValue) == 0x000010, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::CallFunc_HasAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, CallFunc_IsInZone_ReturnValue) == 0x000011, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetOpenButtonVisibility, K2Node_Select_Default) == 0x000014, "Member 'ToastWidget_New_C_GetOpenButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct ToastWidget_New_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ToastWidget_New_C_OnMouseEnter) == 0x000008, "Wrong alignment on ToastWidget_New_C_OnMouseEnter");
static_assert(sizeof(ToastWidget_New_C_OnMouseEnter) == 0x0000B0, "Wrong size on ToastWidget_New_C_OnMouseEnter");
static_assert(offsetof(ToastWidget_New_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'ToastWidget_New_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'ToastWidget_New_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct ToastWidget_New_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ToastWidget_New_C_OnMouseLeave) == 0x000008, "Wrong alignment on ToastWidget_New_C_OnMouseLeave");
static_assert(sizeof(ToastWidget_New_C_OnMouseLeave) == 0x000078, "Wrong size on ToastWidget_New_C_OnMouseLeave");
static_assert(offsetof(ToastWidget_New_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'ToastWidget_New_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.OnNotificationSet
// 0x0008 (0x0008 - 0x0000)
struct ToastWidget_New_C_OnNotificationSet final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_OnNotificationSet) == 0x000008, "Wrong alignment on ToastWidget_New_C_OnNotificationSet");
static_assert(sizeof(ToastWidget_New_C_OnNotificationSet) == 0x000008, "Wrong size on ToastWidget_New_C_OnNotificationSet");
static_assert(offsetof(ToastWidget_New_C_OnNotificationSet, Notification) == 0x000000, "Member 'ToastWidget_New_C_OnNotificationSet::Notification' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.OnNotificationUpdated
// 0x0008 (0x0008 - 0x0000)
struct ToastWidget_New_C_OnNotificationUpdated final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_OnNotificationUpdated) == 0x000008, "Wrong alignment on ToastWidget_New_C_OnNotificationUpdated");
static_assert(sizeof(ToastWidget_New_C_OnNotificationUpdated) == 0x000008, "Wrong size on ToastWidget_New_C_OnNotificationUpdated");
static_assert(offsetof(ToastWidget_New_C_OnNotificationUpdated, Notification) == 0x000000, "Member 'ToastWidget_New_C_OnNotificationUpdated::Notification' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.SetImage
// 0x0030 (0x0030 - 0x0000)
struct ToastWidget_New_C_SetImage final
{
public:
	TSoftObjectPtr<class UObject>                 CallFunc_GetDisplayAsset_ReturnValue;              // 0x0000(0x0020)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UTwitchNotification_C*                  K2Node_DynamicCast_AsTwitch_Notification;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_SetImage) == 0x000008, "Wrong alignment on ToastWidget_New_C_SetImage");
static_assert(sizeof(ToastWidget_New_C_SetImage) == 0x000030, "Wrong size on ToastWidget_New_C_SetImage");
static_assert(offsetof(ToastWidget_New_C_SetImage, CallFunc_GetDisplayAsset_ReturnValue) == 0x000000, "Member 'ToastWidget_New_C_SetImage::CallFunc_GetDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetImage, K2Node_DynamicCast_AsTwitch_Notification) == 0x000020, "Member 'ToastWidget_New_C_SetImage::K2Node_DynamicCast_AsTwitch_Notification' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetImage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ToastWidget_New_C_SetImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetImage, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000029, "Member 'ToastWidget_New_C_SetImage::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.SetupAnimBindings
// 0x0034 (0x0034 - 0x0000)
struct ToastWidget_New_C_SetupAnimBindings final
{
public:
	bool                                          Unbind;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_SetupAnimBindings) == 0x000004, "Wrong alignment on ToastWidget_New_C_SetupAnimBindings");
static_assert(sizeof(ToastWidget_New_C_SetupAnimBindings) == 0x000034, "Wrong size on ToastWidget_New_C_SetupAnimBindings");
static_assert(offsetof(ToastWidget_New_C_SetupAnimBindings, Unbind) == 0x000000, "Member 'ToastWidget_New_C_SetupAnimBindings::Unbind' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ToastWidget_New_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'ToastWidget_New_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'ToastWidget_New_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'ToastWidget_New_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.StartIntro
// 0x0008 (0x0008 - 0x0000)
struct ToastWidget_New_C_StartIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_StartIntro) == 0x000008, "Wrong alignment on ToastWidget_New_C_StartIntro");
static_assert(sizeof(ToastWidget_New_C_StartIntro) == 0x000008, "Wrong size on ToastWidget_New_C_StartIntro");
static_assert(offsetof(ToastWidget_New_C_StartIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ToastWidget_New_C_StartIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.UpdateToast
// 0x0160 (0x0160 - 0x0000)
struct ToastWidget_New_C_UpdateToast final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0008(0x0018)(ConstParm)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescription_ReturnValue_1;             // 0x0088(0x0018)(ConstParm)
	class FText                                   CallFunc_GetTitle_ReturnValue;                     // 0x00A0(0x0018)(ConstParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0018)()
	ESlateVisibility                              CallFunc_GetOpenButtonVisibility_ReturnValue;      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_UpdateToast) == 0x000008, "Wrong alignment on ToastWidget_New_C_UpdateToast");
static_assert(sizeof(ToastWidget_New_C_UpdateToast) == 0x000160, "Wrong size on ToastWidget_New_C_UpdateToast");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, Notification) == 0x000000, "Member 'ToastWidget_New_C_UpdateToast::Notification' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_GetDescription_ReturnValue) == 0x000008, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000020, "Member 'ToastWidget_New_C_UpdateToast::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ToastWidget_New_C_UpdateToast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'ToastWidget_New_C_UpdateToast::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'ToastWidget_New_C_UpdateToast::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_HasAction_ReturnValue) == 0x000081, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_HasAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_GetDescription_ReturnValue_1) == 0x000088, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_GetDescription_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_GetTitle_ReturnValue) == 0x0000A0, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000D0, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'ToastWidget_New_C_UpdateToast::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_IsInZone_ReturnValue) == 0x000128, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, K2Node_MakeArray_Array) == 0x000130, "Member 'ToastWidget_New_C_UpdateToast::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_Format_ReturnValue) == 0x000140, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_UpdateToast, CallFunc_GetOpenButtonVisibility_ReturnValue) == 0x000158, "Member 'ToastWidget_New_C_UpdateToast::CallFunc_GetOpenButtonVisibility_ReturnValue' has a wrong offset!");

// Function ToastWidget_New.ToastWidget_New_C.GetDisplayTime
// 0x0020 (0x0020 - 0x0000)
struct ToastWidget_New_C_GetDisplayTime final
{
public:
	bool                                          bOutDisplayTimeOverridden;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDisplayTime_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidget_New_C_GetDisplayTime) == 0x000008, "Wrong alignment on ToastWidget_New_C_GetDisplayTime");
static_assert(sizeof(ToastWidget_New_C_GetDisplayTime) == 0x000020, "Wrong size on ToastWidget_New_C_GetDisplayTime");
static_assert(offsetof(ToastWidget_New_C_GetDisplayTime, bOutDisplayTimeOverridden) == 0x000000, "Member 'ToastWidget_New_C_GetDisplayTime::bOutDisplayTimeOverridden' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetDisplayTime, ReturnValue) == 0x000004, "Member 'ToastWidget_New_C_GetDisplayTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidget_New_C_GetDisplayTime, CallFunc_GetDisplayTime_bOutDisplayTimeOverridden) == 0x000008, "Member 'ToastWidget_New_C_GetDisplayTime::CallFunc_GetDisplayTime_bOutDisplayTimeOverridden' has a wrong offset!");
