#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastSocialWidget_Base

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "S_UI_ToastProperty_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "E_PositiveNegativeNeutral_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.DetermineIntroAnim
// 0x0040 (0x0040 - 0x0000)
struct ToastSocialWidget_Base_C_DetermineIntroAnim final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PositiveNegativeNeutral                     Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_DetermineIntroAnim) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_DetermineIntroAnim");
static_assert(sizeof(ToastSocialWidget_Base_C_DetermineIntroAnim) == 0x000040, "Wrong size on ToastSocialWidget_Base_C_DetermineIntroAnim");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable) == 0x000008, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_byte_Variable) == 0x000009, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable_1) == 0x00000A, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable_2) == 0x00000B, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable_3) == 0x00000C, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default) == 0x000010, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_1) == 0x000018, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_2) == 0x000020, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, CallFunc_HasAction_ReturnValue) == 0x000028, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::CallFunc_HasAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_3) == 0x000030, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_4) == 0x000038, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_4' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.ExecuteUbergraph_ToastSocialWidget_Base
// 0x02F0 (0x02F0 - 0x0000)
struct ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0058(0x0078)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0158(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCursorModeEnabled;                   // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_NewInputType;                         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0188(0x0014)()
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01A8(0x0014)()
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_DetermineIntroAnim_ReturnValue;           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINotification*                    K2Node_Event_Notification_1;                       // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINotification*                    K2Node_Event_Notification;                         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue_1;                  // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue_2;                  // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden; // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDisplayTime_ReturnValue;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayTime_bOutDisplayTimeOverridden_1; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDisplayTime_ReturnValue_1;             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingNewAvatars;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_4;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_5;                           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_2; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base");
static_assert(sizeof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base) == 0x0002F0, "Wrong size on ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, EntryPoint) == 0x000000, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable) == 0x000010, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetCurrentInputType_ReturnValue) == 0x000011, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_1) == 0x000012, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_2) == 0x000014, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_byte_Variable) == 0x000015, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_byte_Variable_1) == 0x000016, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_3) == 0x000017, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default) == 0x000018, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_byte_Variable_2) == 0x000019, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_byte_Variable_3) == 0x00001A, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_MyGeometry) == 0x00001C, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_MouseEvent_1) == 0x000058, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_1) == 0x0000D0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button_3) == 0x000150, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000158, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_bCursorModeEnabled) == 0x000164, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button_2) == 0x000168, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_NewInputType) == 0x000170, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_NewInputType' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000174, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue) == 0x000178, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000180, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_MakeStruct_SlateColor) == 0x000188, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x00019C, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00019D, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PauseAnimation_ReturnValue) == 0x0001A0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0001A4, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_MakeStruct_SlateColor_1) == 0x0001A8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x0001BC, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001C0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0001C8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_DetermineIntroAnim_ReturnValue) == 0x0001D0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_DetermineIntroAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_real_Variable) == 0x0001D8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button_1) == 0x0001E0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button) == 0x0001E8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_real_Variable_1) == 0x0001F0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_4) == 0x0001F8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Not_PreBool_ReturnValue) == 0x0001F9, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_2) == 0x000200, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_2) == 0x000208, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetVisibility_ReturnValue) == 0x000210, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_Notification_1) == 0x000218, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_Notification_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000220, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_Notification) == 0x000228, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_HasAction_ReturnValue) == 0x000230, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_HasAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_HasAction_ReturnValue_1) == 0x000231, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_HasAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_HasAction_ReturnValue_2) == 0x000232, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_HasAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDisplayTime_bOutDisplayTimeOverridden) == 0x000233, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDisplayTime_bOutDisplayTimeOverridden' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDisplayTime_ReturnValue) == 0x000234, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDisplayTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_BooleanAND_ReturnValue) == 0x000238, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000240, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x000248, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_3) == 0x000250, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000258, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDisplayTime_bOutDisplayTimeOverridden_1) == 0x000260, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDisplayTime_bOutDisplayTimeOverridden_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDisplayTime_ReturnValue_1) == 0x000264, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDisplayTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000268, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_bUsingNewAvatars) == 0x000270, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_bUsingNewAvatars' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_4) == 0x000278, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_real_Variable_2) == 0x000280, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_IsUsingTouch_ReturnValue) == 0x000288, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_BooleanOR_ReturnValue) == 0x000289, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_3) == 0x000290, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_5) == 0x000298, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0002A0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_4) == 0x0002A8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_5) == 0x0002B0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_5) == 0x0002B8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0002C0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x0002C8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0002D0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x0002D8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x0002E0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1) == 0x0002E8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_2) == 0x0002EC, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_2' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetActiveWidgetIndex
// 0x000C (0x000C - 0x0000)
struct ToastSocialWidget_Base_C_GetActiveWidgetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInGame_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetActiveWidgetIndex) == 0x000004, "Wrong alignment on ToastSocialWidget_Base_C_GetActiveWidgetIndex");
static_assert(sizeof(ToastSocialWidget_Base_C_GetActiveWidgetIndex) == 0x00000C, "Wrong size on ToastSocialWidget_Base_C_GetActiveWidgetIndex");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_GetIsInGame_ReturnValue) == 0x000005, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_GetIsInGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetInputSwitcherVisibility
// 0x0006 (0x0006 - 0x0000)
struct ToastSocialWidget_Base_C_GetInputSwitcherVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAction_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility) == 0x000001, "Wrong alignment on ToastSocialWidget_Base_C_GetInputSwitcherVisibility");
static_assert(sizeof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility) == 0x000006, "Wrong size on ToastSocialWidget_Base_C_GetInputSwitcherVisibility");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, Temp_bool_Variable) == 0x000001, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, Temp_byte_Variable) == 0x000002, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, CallFunc_HasAction_ReturnValue) == 0x000004, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::CallFunc_HasAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, K2Node_Select_Default) == 0x000005, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.HandleNotificationType
// 0x0170 (0x0170 - 0x0000)
struct ToastSocialWidget_Base_C_HandleNotificationType final
{
public:
	class FText                                   Return;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortUIFriendNotificationType                 Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	ECommonInputType                              Temp_byte_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortNotificationType                         CallFunc_GetNotificationType_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInGame_ReturnValue;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0060(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0090(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x00C0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x00D8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
