#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopBar.TopBar_C
// 0x0028 (0x0548 - 0x0520)
class UTopBar_C final : public UAthenaTopBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortTabGroupViewModel*                 FortTabGroupViewModel;                             // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             MainNav;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SidebarAvatarButton_C*             WBP_SidebarAvatarButton;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_TopNavBar_C*            WBP_UIKit_Tabs_TopNavBar;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__TopBar_WBP_SidebarAvatarButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_TopBar(int32 EntryPoint);
	bool GetIsMPLobbyEnabled();
	void OnActivityRequested();
	void OnSetSelectedTab(EFortUIFeature SelectedTab);
	void OnTabSelectionChangedUpdateContent(class FName TabID);
	void SelectTabFromFeature(EFortUIFeature Feature);
	void SetMainNavVisibility(ESlateVisibility NewVisibility);
	void SetTopTabsVisibility(ESlateVisibility NewVisibility);

	EFortUIFeature BP_GetActiveTab() const;
	EFortUIFeature BP_GetActiveTabForwardOnRemoval() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopBar_C">();
	}
	static class UTopBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopBar_C>();
	}
};
static_assert(alignof(UTopBar_C) == 0x000008, "Wrong alignment on UTopBar_C");
static_assert(sizeof(UTopBar_C) == 0x000548, "Wrong size on UTopBar_C");
static_assert(offsetof(UTopBar_C, UberGraphFrame) == 0x000520, "Member 'UTopBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopBar_C, FortTabGroupViewModel) == 0x000528, "Member 'UTopBar_C::FortTabGroupViewModel' has a wrong offset!");
static_assert(offsetof(UTopBar_C, MainNav) == 0x000530, "Member 'UTopBar_C::MainNav' has a wrong offset!");
static_assert(offsetof(UTopBar_C, WBP_SidebarAvatarButton) == 0x000538, "Member 'UTopBar_C::WBP_SidebarAvatarButton' has a wrong offset!");
static_assert(offsetof(UTopBar_C, WBP_UIKit_Tabs_TopNavBar) == 0x000540, "Member 'UTopBar_C::WBP_UIKit_Tabs_TopNavBar' has a wrong offset!");

}

