#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBarTabButton_SpyBase

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.ExecuteUbergraph_TopBarTabButton_SpyBase
// 0x00B0 (0x00B0 - 0x0000)
struct TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button, bool Selected)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNormalBangWrapper_C*                   K2Node_DynamicCast_AsNormal_Bang_Wrapper;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0044(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0014)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsSelected;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase) == 0x000008, "Wrong alignment on TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase");
static_assert(sizeof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase) == 0x0000B0, "Wrong size on TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, EntryPoint) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, Temp_bool_Variable) == 0x000005, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, Temp_class_Variable) == 0x000008, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, Temp_class_Variable_1) == 0x000010, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_Event_IsDesignTime) == 0x000024, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_IsMobileGame_ReturnValue_1) == 0x000025, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_DynamicCast_AsNormal_Bang_Wrapper) == 0x000028, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_DynamicCast_AsNormal_Bang_Wrapper' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_CustomEvent_Button) == 0x000038, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_CustomEvent_Selected) == 0x000040, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_MakeStruct_SlateColor) == 0x000044, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_BooleanOR_ReturnValue) == 0x00006C, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_CustomEvent_bIsSelected) == 0x00006D, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_CustomEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, K2Node_Select_Default) == 0x000070, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000078, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000088, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000090, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000098, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x0000A0, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase, CallFunc_IsMobileGame_ReturnValue_2) == 0x0000A8, "Member 'TopBarTabButton_SpyBase_C_ExecuteUbergraph_TopBarTabButton_SpyBase::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.HandleSelectionChangedVisuals
// 0x0001 (0x0001 - 0x0000)
struct TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals) == 0x000001, "Wrong alignment on TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals");
static_assert(sizeof(TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals) == 0x000001, "Wrong size on TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals");
static_assert(offsetof(TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals, bIsSelected) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_HandleSelectionChangedVisuals::bIsSelected' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.InitializeButtonBorderMID
// 0x0008 (0x0008 - 0x0000)
struct TopBarTabButton_SpyBase_C_InitializeButtonBorderMID final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetSingleMaterialStyleMID_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_InitializeButtonBorderMID) == 0x000008, "Wrong alignment on TopBarTabButton_SpyBase_C_InitializeButtonBorderMID");
static_assert(sizeof(TopBarTabButton_SpyBase_C_InitializeButtonBorderMID) == 0x000008, "Wrong size on TopBarTabButton_SpyBase_C_InitializeButtonBorderMID");
static_assert(offsetof(TopBarTabButton_SpyBase_C_InitializeButtonBorderMID, CallFunc_GetSingleMaterialStyleMID_ReturnValue) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_InitializeButtonBorderMID::CallFunc_GetSingleMaterialStyleMID_ReturnValue' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.OnSelectedChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct TopBarTabButton_SpyBase_C_OnSelectedChangedEvent final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected_0;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_OnSelectedChangedEvent) == 0x000008, "Wrong alignment on TopBarTabButton_SpyBase_C_OnSelectedChangedEvent");
static_assert(sizeof(TopBarTabButton_SpyBase_C_OnSelectedChangedEvent) == 0x000010, "Wrong size on TopBarTabButton_SpyBase_C_OnSelectedChangedEvent");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OnSelectedChangedEvent, Button) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_OnSelectedChangedEvent::Button' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OnSelectedChangedEvent, Selected_0) == 0x000008, "Member 'TopBarTabButton_SpyBase_C_OnSelectedChangedEvent::Selected_0' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.OverrideIcon
// 0x00E0 (0x00E0 - 0x0000)
struct TopBarTabButton_SpyBase_C_OverrideIcon final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            inSlateBrush;                                      // 0x0010(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_OverrideIcon) == 0x000010, "Wrong alignment on TopBarTabButton_SpyBase_C_OverrideIcon");
static_assert(sizeof(TopBarTabButton_SpyBase_C_OverrideIcon) == 0x0000E0, "Wrong size on TopBarTabButton_SpyBase_C_OverrideIcon");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, Show) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::Show' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, inSlateBrush) == 0x000010, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::inSlateBrush' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, Temp_bool_Variable) == 0x0000D0, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, Temp_byte_Variable) == 0x0000D1, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, Temp_byte_Variable_1) == 0x0000D2, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, K2Node_Select_Default) == 0x0000D3, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_OverrideIcon, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'TopBarTabButton_SpyBase_C_OverrideIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TopBarTabButton_SpyBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_PreConstruct) == 0x000001, "Wrong alignment on TopBarTabButton_SpyBase_C_PreConstruct");
static_assert(sizeof(TopBarTabButton_SpyBase_C_PreConstruct) == 0x000001, "Wrong size on TopBarTabButton_SpyBase_C_PreConstruct");
static_assert(offsetof(TopBarTabButton_SpyBase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.SeedRandomValues
// 0x0020 (0x0020 - 0x0000)
struct TopBarTabButton_SpyBase_C_SeedRandomValues final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_SeedRandomValues) == 0x000008, "Wrong alignment on TopBarTabButton_SpyBase_C_SeedRandomValues");
static_assert(sizeof(TopBarTabButton_SpyBase_C_SeedRandomValues) == 0x000020, "Wrong size on TopBarTabButton_SpyBase_C_SeedRandomValues");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000008, "Member 'TopBarTabButton_SpyBase_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000010, "Member 'TopBarTabButton_SpyBase_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SeedRandomValues, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000018, "Member 'TopBarTabButton_SpyBase_C_SeedRandomValues::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.SetText
// 0x0020 (0x0020 - 0x0000)
struct TopBarTabButton_SpyBase_C_SetText final
{
public:
	class FText                                   ButtonText_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_SetText) == 0x000008, "Wrong alignment on TopBarTabButton_SpyBase_C_SetText");
static_assert(sizeof(TopBarTabButton_SpyBase_C_SetText) == 0x000020, "Wrong size on TopBarTabButton_SpyBase_C_SetText");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SetText, ButtonText_0) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_SetText::ButtonText_0' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SetText, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'TopBarTabButton_SpyBase_C_SetText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_SetText, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'TopBarTabButton_SpyBase_C_SetText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TopBarTabButton_SpyBase.TopBarTabButton_SpyBase_C.UpdateMIDWithRandomValues
// 0x0014 (0x0014 - 0x0000)
struct TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues) == 0x000004, "Wrong alignment on TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues");
static_assert(sizeof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues) == 0x000014, "Wrong size on TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues");
static_assert(offsetof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000004, "Member 'TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000008, "Member 'TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x00000C, "Member 'TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000010, "Member 'TopBarTabButton_SpyBase_C_UpdateMIDWithRandomValues::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

}

