#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIChart

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UIChart_structs.hpp"


namespace SDK::Params
{

// Function UIChart.UIStateChartContext.BP_ApplyCommonChanges
// 0x0050 (0x0050 - 0x0000)
struct UIStateChartContext_BP_ApplyCommonChanges final
{
public:
	struct FUIStateChartContextChangeSet          ContextChanges;                                    // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_ApplyCommonChanges) == 0x000008, "Wrong alignment on UIStateChartContext_BP_ApplyCommonChanges");
static_assert(sizeof(UIStateChartContext_BP_ApplyCommonChanges) == 0x000050, "Wrong size on UIStateChartContext_BP_ApplyCommonChanges");
static_assert(offsetof(UIStateChartContext_BP_ApplyCommonChanges, ContextChanges) == 0x000000, "Member 'UIStateChartContext_BP_ApplyCommonChanges::ContextChanges' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_ApplyPlayerChanges
// 0x0058 (0x0058 - 0x0000)
struct UIStateChartContext_BP_ApplyPlayerChanges final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIStateChartContextChangeSet          ContextChanges;                                    // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_ApplyPlayerChanges) == 0x000008, "Wrong alignment on UIStateChartContext_BP_ApplyPlayerChanges");
static_assert(sizeof(UIStateChartContext_BP_ApplyPlayerChanges) == 0x000058, "Wrong size on UIStateChartContext_BP_ApplyPlayerChanges");
static_assert(offsetof(UIStateChartContext_BP_ApplyPlayerChanges, LocalPlayer) == 0x000000, "Member 'UIStateChartContext_BP_ApplyPlayerChanges::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_ApplyPlayerChanges, ContextChanges) == 0x000008, "Member 'UIStateChartContext_BP_ApplyPlayerChanges::ContextChanges' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_ClearCommonValue
// 0x0004 (0x0004 - 0x0000)
struct UIStateChartContext_BP_ClearCommonValue final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_ClearCommonValue) == 0x000004, "Wrong alignment on UIStateChartContext_BP_ClearCommonValue");
static_assert(sizeof(UIStateChartContext_BP_ClearCommonValue) == 0x000004, "Wrong size on UIStateChartContext_BP_ClearCommonValue");
static_assert(offsetof(UIStateChartContext_BP_ClearCommonValue, Key) == 0x000000, "Member 'UIStateChartContext_BP_ClearCommonValue::Key' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_ClearEntry
// 0x0004 (0x0004 - 0x0000)
struct UIStateChartContext_BP_ClearEntry final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_ClearEntry) == 0x000004, "Wrong alignment on UIStateChartContext_BP_ClearEntry");
static_assert(sizeof(UIStateChartContext_BP_ClearEntry) == 0x000004, "Wrong size on UIStateChartContext_BP_ClearEntry");
static_assert(offsetof(UIStateChartContext_BP_ClearEntry, Key) == 0x000000, "Member 'UIStateChartContext_BP_ClearEntry::Key' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_ClearPlayerValue
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContext_BP_ClearPlayerValue final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Key;                                               // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContext_BP_ClearPlayerValue) == 0x000008, "Wrong alignment on UIStateChartContext_BP_ClearPlayerValue");
static_assert(sizeof(UIStateChartContext_BP_ClearPlayerValue) == 0x000010, "Wrong size on UIStateChartContext_BP_ClearPlayerValue");
static_assert(offsetof(UIStateChartContext_BP_ClearPlayerValue, LocalPlayer) == 0x000000, "Member 'UIStateChartContext_BP_ClearPlayerValue::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_ClearPlayerValue, Key) == 0x000008, "Member 'UIStateChartContext_BP_ClearPlayerValue::Key' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetCommonBoolValue
// 0x0008 (0x0008 - 0x0000)
struct UIStateChartContext_BP_SetCommonBoolValue final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContext_BP_SetCommonBoolValue) == 0x000004, "Wrong alignment on UIStateChartContext_BP_SetCommonBoolValue");
static_assert(sizeof(UIStateChartContext_BP_SetCommonBoolValue) == 0x000008, "Wrong size on UIStateChartContext_BP_SetCommonBoolValue");
static_assert(offsetof(UIStateChartContext_BP_SetCommonBoolValue, Key) == 0x000000, "Member 'UIStateChartContext_BP_SetCommonBoolValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetCommonBoolValue, Value) == 0x000004, "Member 'UIStateChartContext_BP_SetCommonBoolValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetCommonFloatValue
// 0x0008 (0x0008 - 0x0000)
struct UIStateChartContext_BP_SetCommonFloatValue final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_SetCommonFloatValue) == 0x000004, "Wrong alignment on UIStateChartContext_BP_SetCommonFloatValue");
static_assert(sizeof(UIStateChartContext_BP_SetCommonFloatValue) == 0x000008, "Wrong size on UIStateChartContext_BP_SetCommonFloatValue");
static_assert(offsetof(UIStateChartContext_BP_SetCommonFloatValue, Key) == 0x000000, "Member 'UIStateChartContext_BP_SetCommonFloatValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetCommonFloatValue, Value) == 0x000004, "Member 'UIStateChartContext_BP_SetCommonFloatValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetCommonIntValue
// 0x0008 (0x0008 - 0x0000)
struct UIStateChartContext_BP_SetCommonIntValue final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_SetCommonIntValue) == 0x000004, "Wrong alignment on UIStateChartContext_BP_SetCommonIntValue");
static_assert(sizeof(UIStateChartContext_BP_SetCommonIntValue) == 0x000008, "Wrong size on UIStateChartContext_BP_SetCommonIntValue");
static_assert(offsetof(UIStateChartContext_BP_SetCommonIntValue, Key) == 0x000000, "Member 'UIStateChartContext_BP_SetCommonIntValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetCommonIntValue, Value) == 0x000004, "Member 'UIStateChartContext_BP_SetCommonIntValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetCommonStringValue
// 0x0018 (0x0018 - 0x0000)
struct UIStateChartContext_BP_SetCommonStringValue final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_SetCommonStringValue) == 0x000008, "Wrong alignment on UIStateChartContext_BP_SetCommonStringValue");
static_assert(sizeof(UIStateChartContext_BP_SetCommonStringValue) == 0x000018, "Wrong size on UIStateChartContext_BP_SetCommonStringValue");
static_assert(offsetof(UIStateChartContext_BP_SetCommonStringValue, Key) == 0x000000, "Member 'UIStateChartContext_BP_SetCommonStringValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetCommonStringValue, Value) == 0x000008, "Member 'UIStateChartContext_BP_SetCommonStringValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetPlayerBoolValue
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContext_BP_SetPlayerBoolValue final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Key;                                               // 0x0008(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContext_BP_SetPlayerBoolValue) == 0x000008, "Wrong alignment on UIStateChartContext_BP_SetPlayerBoolValue");
static_assert(sizeof(UIStateChartContext_BP_SetPlayerBoolValue) == 0x000010, "Wrong size on UIStateChartContext_BP_SetPlayerBoolValue");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerBoolValue, LocalPlayer) == 0x000000, "Member 'UIStateChartContext_BP_SetPlayerBoolValue::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerBoolValue, Key) == 0x000008, "Member 'UIStateChartContext_BP_SetPlayerBoolValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerBoolValue, Value) == 0x00000C, "Member 'UIStateChartContext_BP_SetPlayerBoolValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetPlayerFloatValue
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContext_BP_SetPlayerFloatValue final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Key;                                               // 0x0008(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_SetPlayerFloatValue) == 0x000008, "Wrong alignment on UIStateChartContext_BP_SetPlayerFloatValue");
static_assert(sizeof(UIStateChartContext_BP_SetPlayerFloatValue) == 0x000010, "Wrong size on UIStateChartContext_BP_SetPlayerFloatValue");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerFloatValue, LocalPlayer) == 0x000000, "Member 'UIStateChartContext_BP_SetPlayerFloatValue::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerFloatValue, Key) == 0x000008, "Member 'UIStateChartContext_BP_SetPlayerFloatValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerFloatValue, Value) == 0x00000C, "Member 'UIStateChartContext_BP_SetPlayerFloatValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetPlayerStringValue
// 0x0020 (0x0020 - 0x0000)
struct UIStateChartContext_BP_SetPlayerStringValue final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Key;                                               // 0x0008(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_SetPlayerStringValue) == 0x000008, "Wrong alignment on UIStateChartContext_BP_SetPlayerStringValue");
static_assert(sizeof(UIStateChartContext_BP_SetPlayerStringValue) == 0x000020, "Wrong size on UIStateChartContext_BP_SetPlayerStringValue");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerStringValue, LocalPlayer) == 0x000000, "Member 'UIStateChartContext_BP_SetPlayerStringValue::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerStringValue, Key) == 0x000008, "Member 'UIStateChartContext_BP_SetPlayerStringValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerStringValue, Value) == 0x000010, "Member 'UIStateChartContext_BP_SetPlayerStringValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_SetPlayerValue
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContext_BP_SetPlayerValue final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Key;                                               // 0x0008(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_SetPlayerValue) == 0x000008, "Wrong alignment on UIStateChartContext_BP_SetPlayerValue");
static_assert(sizeof(UIStateChartContext_BP_SetPlayerValue) == 0x000010, "Wrong size on UIStateChartContext_BP_SetPlayerValue");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerValue, LocalPlayer) == 0x000000, "Member 'UIStateChartContext_BP_SetPlayerValue::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerValue, Key) == 0x000008, "Member 'UIStateChartContext_BP_SetPlayerValue::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_SetPlayerValue, Value) == 0x00000C, "Member 'UIStateChartContext_BP_SetPlayerValue::Value' has a wrong offset!");

// Function UIChart.UIStateChartContext.BP_FindEntry
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContext_BP_FindEntry final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIStateChartContextEntry*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContext_BP_FindEntry) == 0x000008, "Wrong alignment on UIStateChartContext_BP_FindEntry");
static_assert(sizeof(UIStateChartContext_BP_FindEntry) == 0x000010, "Wrong size on UIStateChartContext_BP_FindEntry");
static_assert(offsetof(UIStateChartContext_BP_FindEntry, Key) == 0x000000, "Member 'UIStateChartContext_BP_FindEntry::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartContext_BP_FindEntry, ReturnValue) == 0x000008, "Member 'UIStateChartContext_BP_FindEntry::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetCommonValueAsBool
// 0x0001 (0x0001 - 0x0000)
struct UIStateChartContextEntry_GetCommonValueAsBool final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContextEntry_GetCommonValueAsBool) == 0x000001, "Wrong alignment on UIStateChartContextEntry_GetCommonValueAsBool");
static_assert(sizeof(UIStateChartContextEntry_GetCommonValueAsBool) == 0x000001, "Wrong size on UIStateChartContextEntry_GetCommonValueAsBool");
static_assert(offsetof(UIStateChartContextEntry_GetCommonValueAsBool, ReturnValue) == 0x000000, "Member 'UIStateChartContextEntry_GetCommonValueAsBool::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetCommonValueAsFloat
// 0x0004 (0x0004 - 0x0000)
struct UIStateChartContextEntry_GetCommonValueAsFloat final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContextEntry_GetCommonValueAsFloat) == 0x000004, "Wrong alignment on UIStateChartContextEntry_GetCommonValueAsFloat");
static_assert(sizeof(UIStateChartContextEntry_GetCommonValueAsFloat) == 0x000004, "Wrong size on UIStateChartContextEntry_GetCommonValueAsFloat");
static_assert(offsetof(UIStateChartContextEntry_GetCommonValueAsFloat, ReturnValue) == 0x000000, "Member 'UIStateChartContextEntry_GetCommonValueAsFloat::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetCommonValueAsInt
// 0x0004 (0x0004 - 0x0000)
struct UIStateChartContextEntry_GetCommonValueAsInt final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContextEntry_GetCommonValueAsInt) == 0x000004, "Wrong alignment on UIStateChartContextEntry_GetCommonValueAsInt");
static_assert(sizeof(UIStateChartContextEntry_GetCommonValueAsInt) == 0x000004, "Wrong size on UIStateChartContextEntry_GetCommonValueAsInt");
static_assert(offsetof(UIStateChartContextEntry_GetCommonValueAsInt, ReturnValue) == 0x000000, "Member 'UIStateChartContextEntry_GetCommonValueAsInt::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetCommonValueAsString
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContextEntry_GetCommonValueAsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContextEntry_GetCommonValueAsString) == 0x000008, "Wrong alignment on UIStateChartContextEntry_GetCommonValueAsString");
static_assert(sizeof(UIStateChartContextEntry_GetCommonValueAsString) == 0x000010, "Wrong size on UIStateChartContextEntry_GetCommonValueAsString");
static_assert(offsetof(UIStateChartContextEntry_GetCommonValueAsString, ReturnValue) == 0x000000, "Member 'UIStateChartContextEntry_GetCommonValueAsString::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetPlayerValueAsBool
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContextEntry_GetPlayerValueAsBool final
{
public:
	const class ULocalPlayer*                     InLocalPlayer;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContextEntry_GetPlayerValueAsBool) == 0x000008, "Wrong alignment on UIStateChartContextEntry_GetPlayerValueAsBool");
static_assert(sizeof(UIStateChartContextEntry_GetPlayerValueAsBool) == 0x000010, "Wrong size on UIStateChartContextEntry_GetPlayerValueAsBool");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsBool, InLocalPlayer) == 0x000000, "Member 'UIStateChartContextEntry_GetPlayerValueAsBool::InLocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsBool, ReturnValue) == 0x000008, "Member 'UIStateChartContextEntry_GetPlayerValueAsBool::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetPlayerValueAsFloat
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContextEntry_GetPlayerValueAsFloat final
{
public:
	const class ULocalPlayer*                     InLocalPlayer;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContextEntry_GetPlayerValueAsFloat) == 0x000008, "Wrong alignment on UIStateChartContextEntry_GetPlayerValueAsFloat");
static_assert(sizeof(UIStateChartContextEntry_GetPlayerValueAsFloat) == 0x000010, "Wrong size on UIStateChartContextEntry_GetPlayerValueAsFloat");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsFloat, InLocalPlayer) == 0x000000, "Member 'UIStateChartContextEntry_GetPlayerValueAsFloat::InLocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsFloat, ReturnValue) == 0x000008, "Member 'UIStateChartContextEntry_GetPlayerValueAsFloat::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetPlayerValueAsInt
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContextEntry_GetPlayerValueAsInt final
{
public:
	const class ULocalPlayer*                     InLocalPlayer;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContextEntry_GetPlayerValueAsInt) == 0x000008, "Wrong alignment on UIStateChartContextEntry_GetPlayerValueAsInt");
static_assert(sizeof(UIStateChartContextEntry_GetPlayerValueAsInt) == 0x000010, "Wrong size on UIStateChartContextEntry_GetPlayerValueAsInt");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsInt, InLocalPlayer) == 0x000000, "Member 'UIStateChartContextEntry_GetPlayerValueAsInt::InLocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsInt, ReturnValue) == 0x000008, "Member 'UIStateChartContextEntry_GetPlayerValueAsInt::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.GetPlayerValueAsString
// 0x0018 (0x0018 - 0x0000)
struct UIStateChartContextEntry_GetPlayerValueAsString final
{
public:
	const class ULocalPlayer*                     InLocalPlayer;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartContextEntry_GetPlayerValueAsString) == 0x000008, "Wrong alignment on UIStateChartContextEntry_GetPlayerValueAsString");
static_assert(sizeof(UIStateChartContextEntry_GetPlayerValueAsString) == 0x000018, "Wrong size on UIStateChartContextEntry_GetPlayerValueAsString");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsString, InLocalPlayer) == 0x000000, "Member 'UIStateChartContextEntry_GetPlayerValueAsString::InLocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContextEntry_GetPlayerValueAsString, ReturnValue) == 0x000008, "Member 'UIStateChartContextEntry_GetPlayerValueAsString::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartContextEntry.IsEmptyForPlayer
// 0x0010 (0x0010 - 0x0000)
struct UIStateChartContextEntry_IsEmptyForPlayer final
{
public:
	class ULocalPlayer*                           InLocalPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartContextEntry_IsEmptyForPlayer) == 0x000008, "Wrong alignment on UIStateChartContextEntry_IsEmptyForPlayer");
static_assert(sizeof(UIStateChartContextEntry_IsEmptyForPlayer) == 0x000010, "Wrong size on UIStateChartContextEntry_IsEmptyForPlayer");
static_assert(offsetof(UIStateChartContextEntry_IsEmptyForPlayer, InLocalPlayer) == 0x000000, "Member 'UIStateChartContextEntry_IsEmptyForPlayer::InLocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartContextEntry_IsEmptyForPlayer, ReturnValue) == 0x000008, "Member 'UIStateChartContextEntry_IsEmptyForPlayer::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartManager.BP_AddStateChart
// 0x0040 (0x0040 - 0x0000)
struct UIStateChartManager_BP_AddStateChart final
{
public:
	const class UUIStateChart*                    StateChartAsset;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalPlayer*                           OwningLocalPlayer;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AnimationHints;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InitialStateTag;                                   // 0x0030(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     Urgency;                                           // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartManager_BP_AddStateChart) == 0x000008, "Wrong alignment on UIStateChartManager_BP_AddStateChart");
static_assert(sizeof(UIStateChartManager_BP_AddStateChart) == 0x000040, "Wrong size on UIStateChartManager_BP_AddStateChart");
static_assert(offsetof(UIStateChartManager_BP_AddStateChart, StateChartAsset) == 0x000000, "Member 'UIStateChartManager_BP_AddStateChart::StateChartAsset' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_AddStateChart, OwningLocalPlayer) == 0x000008, "Member 'UIStateChartManager_BP_AddStateChart::OwningLocalPlayer' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_AddStateChart, AnimationHints) == 0x000010, "Member 'UIStateChartManager_BP_AddStateChart::AnimationHints' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_AddStateChart, InitialStateTag) == 0x000030, "Member 'UIStateChartManager_BP_AddStateChart::InitialStateTag' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_AddStateChart, Urgency) == 0x000034, "Member 'UIStateChartManager_BP_AddStateChart::Urgency' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_AddStateChart, ReturnValue) == 0x000038, "Member 'UIStateChartManager_BP_AddStateChart::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartManager.BP_DeactivateStateChart
// 0x0080 (0x0080 - 0x0000)
struct UIStateChartManager_BP_DeactivateStateChart final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AnimationHints;                                    // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FUIStateChartContextChangeSet          ContextChanges;                                    // 0x0028(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     Urgency;                                           // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0079(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartManager_BP_DeactivateStateChart) == 0x000008, "Wrong alignment on UIStateChartManager_BP_DeactivateStateChart");
static_assert(sizeof(UIStateChartManager_BP_DeactivateStateChart) == 0x000080, "Wrong size on UIStateChartManager_BP_DeactivateStateChart");
static_assert(offsetof(UIStateChartManager_BP_DeactivateStateChart, Key) == 0x000000, "Member 'UIStateChartManager_BP_DeactivateStateChart::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DeactivateStateChart, AnimationHints) == 0x000008, "Member 'UIStateChartManager_BP_DeactivateStateChart::AnimationHints' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DeactivateStateChart, ContextChanges) == 0x000028, "Member 'UIStateChartManager_BP_DeactivateStateChart::ContextChanges' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DeactivateStateChart, Urgency) == 0x000078, "Member 'UIStateChartManager_BP_DeactivateStateChart::Urgency' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DeactivateStateChart, ReturnValue) == 0x000079, "Member 'UIStateChartManager_BP_DeactivateStateChart::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartManager.BP_DispatchTransitionEvent
// 0x0088 (0x0088 - 0x0000)
struct UIStateChartManager_BP_DispatchTransitionEvent final
{
public:
	struct FGameplayTag                           TransitionTag;                                     // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULocalPlayer*                     StateChartOwner;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AnimationHints;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FUIStateChartContextChangeSet          ContextChanges;                                    // 0x0030(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     Urgency;                                           // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBacktrack;                                        // 0x0081(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0082(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartManager_BP_DispatchTransitionEvent) == 0x000008, "Wrong alignment on UIStateChartManager_BP_DispatchTransitionEvent");
static_assert(sizeof(UIStateChartManager_BP_DispatchTransitionEvent) == 0x000088, "Wrong size on UIStateChartManager_BP_DispatchTransitionEvent");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, TransitionTag) == 0x000000, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::TransitionTag' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, StateChartOwner) == 0x000008, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::StateChartOwner' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, AnimationHints) == 0x000010, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::AnimationHints' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, ContextChanges) == 0x000030, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::ContextChanges' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, Urgency) == 0x000080, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::Urgency' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, bBacktrack) == 0x000081, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::bBacktrack' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_DispatchTransitionEvent, ReturnValue) == 0x000082, "Member 'UIStateChartManager_BP_DispatchTransitionEvent::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartManager.BP_ReactivateStateChart
// 0x0030 (0x0030 - 0x0000)
struct UIStateChartManager_BP_ReactivateStateChart final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AnimationHints;                                    // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StateTag;                                          // 0x0028(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     Urgency;                                           // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartManager_BP_ReactivateStateChart) == 0x000008, "Wrong alignment on UIStateChartManager_BP_ReactivateStateChart");
static_assert(sizeof(UIStateChartManager_BP_ReactivateStateChart) == 0x000030, "Wrong size on UIStateChartManager_BP_ReactivateStateChart");
static_assert(offsetof(UIStateChartManager_BP_ReactivateStateChart, Key) == 0x000000, "Member 'UIStateChartManager_BP_ReactivateStateChart::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_ReactivateStateChart, AnimationHints) == 0x000008, "Member 'UIStateChartManager_BP_ReactivateStateChart::AnimationHints' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_ReactivateStateChart, StateTag) == 0x000028, "Member 'UIStateChartManager_BP_ReactivateStateChart::StateTag' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_ReactivateStateChart, Urgency) == 0x00002C, "Member 'UIStateChartManager_BP_ReactivateStateChart::Urgency' has a wrong offset!");

// Function UIChart.UIStateChartManager.BP_RemoveStateChart
// 0x0080 (0x0080 - 0x0000)
struct UIStateChartManager_BP_RemoveStateChart final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AnimationHints;                                    // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FUIStateChartContextChangeSet          ContextChanges;                                    // 0x0028(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUIStateTransitionUrgency                     Urgency;                                           // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0079(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIStateChartManager_BP_RemoveStateChart) == 0x000008, "Wrong alignment on UIStateChartManager_BP_RemoveStateChart");
static_assert(sizeof(UIStateChartManager_BP_RemoveStateChart) == 0x000080, "Wrong size on UIStateChartManager_BP_RemoveStateChart");
static_assert(offsetof(UIStateChartManager_BP_RemoveStateChart, Key) == 0x000000, "Member 'UIStateChartManager_BP_RemoveStateChart::Key' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_RemoveStateChart, AnimationHints) == 0x000008, "Member 'UIStateChartManager_BP_RemoveStateChart::AnimationHints' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_RemoveStateChart, ContextChanges) == 0x000028, "Member 'UIStateChartManager_BP_RemoveStateChart::ContextChanges' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_RemoveStateChart, Urgency) == 0x000078, "Member 'UIStateChartManager_BP_RemoveStateChart::Urgency' has a wrong offset!");
static_assert(offsetof(UIStateChartManager_BP_RemoveStateChart, ReturnValue) == 0x000079, "Member 'UIStateChartManager_BP_RemoveStateChart::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartManager.GetChartContext
// 0x0008 (0x0008 - 0x0000)
struct UIStateChartManager_GetChartContext final
{
public:
	class UUIStateChartContext*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartManager_GetChartContext) == 0x000008, "Wrong alignment on UIStateChartManager_GetChartContext");
static_assert(sizeof(UIStateChartManager_GetChartContext) == 0x000008, "Wrong size on UIStateChartManager_GetChartContext");
static_assert(offsetof(UIStateChartManager_GetChartContext, ReturnValue) == 0x000000, "Member 'UIStateChartManager_GetChartContext::ReturnValue' has a wrong offset!");

// Function UIChart.UIStateChartManager.GetContext
// 0x0008 (0x0008 - 0x0000)
struct UIStateChartManager_GetContext final
{
public:
	class UUIStateChartContext*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIStateChartManager_GetContext) == 0x000008, "Wrong alignment on UIStateChartManager_GetContext");
static_assert(sizeof(UIStateChartManager_GetContext) == 0x000008, "Wrong size on UIStateChartManager_GetContext");
static_assert(offsetof(UIStateChartManager_GetContext, ReturnValue) == 0x000000, "Member 'UIStateChartManager_GetContext::ReturnValue' has a wrong offset!");

}

