#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass VaultRotator.VaultRotator_C
// 0x01C0 (0x05A0 - 0x03E0)
class AVaultRotator_C final : public AItemPreviewRotator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDirectionalLightComponent*             DirectionalLightMobile;                            // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight_LOWPC;                            // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DirectionalLights;                                 // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLightLowMobile;                                 // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight_LOWPC;                                    // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess_Mobile;                                // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess_LOWPC;                                 // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GenericLighting;                                   // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_YawRotation_YawInterpAlpha_F13714DD4AFE0C9C8857E2950BEC127B; // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_YawRotation__Direction_F13714DD4AFE0C9C8857E2950BEC127B; // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_YawRotation;                              // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Zoom_ZoomLevel_6FFD6729471BD965D850258DA1C0AF39; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Zoom__Direction_6FFD6729471BD965D850258DA1C0AF39; // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Zoom;                                     // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTurn_180_to_360_CameraRotationOffset_DF51680448A0BDB5D459C9BB5786D714; // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTurn_180_to_360_CameraPositionOffset_DF51680448A0BDB5D459C9BB5786D714; // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTurn_180_to_360_DirectionRotation_DF51680448A0BDB5D459C9BB5786D714; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTurn_180_to_360_FoV_DF51680448A0BDB5D459C9BB5786D714; // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CameraTurn_180_to_360__Direction_DF51680448A0BDB5D459C9BB5786D714; // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CameraTurn_180_to_360;                             // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTurn_0_to_180_CameraRotationOffset_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0; // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTurn_0_to_180_CameraPositionOffset_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0; // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTurn_0_to_180_DirectionalRotation_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0; // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTurn_0_to_180_FoV_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0; // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CameraTurn_0_to_180__Direction_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0; // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CameraTurn_0_to_180;                               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8[0x8];                                      // 0x04E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InitialCameraTransform;                            // 0x04F0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ClockwiseSound;                                    // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CounterClockwiseSound;                             // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugMobile_Lighting;                              // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugLightingPC;                                   // 0x0561(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0562(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysOn;                                          // 0x0563(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugLighting_LOWDetailPC;                         // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetZoomLevel;                                   // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartingRotationOffset;                            // 0x0570(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               TargetRotationOffset;                              // 0x0588(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateSettings();
	void Timeline_Zoom__FinishedFunc();
	void ToggleBackgroundText(bool bDisplayText);
	void Timeline_YawRotation__UpdateFunc();
	void Timeline_Zoom__UpdateFunc();
	void SwitchPCLighting(bool Visibility);
	void Timeline_YawRotation__FinishedFunc();
	void SwitchMobileLighting(bool Visibility);
	void SwitchPCLighting_LOWDetail(bool Visibility);
	void ReceiveBeginPlay();
	void SetBackgroundString(const class FText& CustomText);
	void PlaySoundWhenEnabled(class USoundBase* sound);
	void SetBackgroundColor(const struct FLinearColor& RGBA0, const struct FLinearColor& RGBA1);
	void OnTargetZoomLevelCanceled();
	void OnUpdateBackgroundColor(bool bEnableAutotestBackground);
	void OnTargetRotationOffsetSet(const struct FRotator& TargetRotationOffset_0);
	void OnTargetZoomLevelSet(float TargetZoomLevel_0);
	void OnCameraTransitionReady(bool bPrimaryToSecondary, const class UFortAccountItemDefinition* PrimaryRequestedItem, const struct FSceneTransitionOptions& Options);
	void OnTargetRotationOffsetCanceled();
	void LightControl(bool Active);
	void OnSetBackgroundMessageText(const class FText& BackgroundMessageText);
	void CameraTurn_0_to_180__UpdateFunc();
	void ExecuteUbergraph_VaultRotator(int32 EntryPoint);
	void CameraTurn_0_to_180__FinishedFunc();
	void CameraTurn_180_to_360__UpdateFunc();
	void CameraTurn_180_to_360__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VaultRotator_C">();
	}
	static class AVaultRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVaultRotator_C>();
	}
};
static_assert(alignof(AVaultRotator_C) == 0x000010, "Wrong alignment on AVaultRotator_C");
static_assert(sizeof(AVaultRotator_C) == 0x0005A0, "Wrong size on AVaultRotator_C");
static_assert(offsetof(AVaultRotator_C, UberGraphFrame) == 0x0003E0, "Member 'AVaultRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, DirectionalLightMobile) == 0x0003E8, "Member 'AVaultRotator_C::DirectionalLightMobile' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, DirectionalLight_LOWPC) == 0x0003F0, "Member 'AVaultRotator_C::DirectionalLight_LOWPC' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, DirectionalLights) == 0x0003F8, "Member 'AVaultRotator_C::DirectionalLights' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, SkyLightLowMobile) == 0x000400, "Member 'AVaultRotator_C::SkyLightLowMobile' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, SkyLight) == 0x000408, "Member 'AVaultRotator_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, SkyLight_LOWPC) == 0x000410, "Member 'AVaultRotator_C::SkyLight_LOWPC' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Arrow) == 0x000418, "Member 'AVaultRotator_C::Arrow' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, PostProcess_Mobile) == 0x000420, "Member 'AVaultRotator_C::PostProcess_Mobile' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, PostProcess_LOWPC) == 0x000428, "Member 'AVaultRotator_C::PostProcess_LOWPC' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, GenericLighting) == 0x000430, "Member 'AVaultRotator_C::GenericLighting' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Timeline_YawRotation_YawInterpAlpha_F13714DD4AFE0C9C8857E2950BEC127B) == 0x000438, "Member 'AVaultRotator_C::Timeline_YawRotation_YawInterpAlpha_F13714DD4AFE0C9C8857E2950BEC127B' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Timeline_YawRotation__Direction_F13714DD4AFE0C9C8857E2950BEC127B) == 0x00043C, "Member 'AVaultRotator_C::Timeline_YawRotation__Direction_F13714DD4AFE0C9C8857E2950BEC127B' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Timeline_YawRotation) == 0x000440, "Member 'AVaultRotator_C::Timeline_YawRotation' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Timeline_Zoom_ZoomLevel_6FFD6729471BD965D850258DA1C0AF39) == 0x000448, "Member 'AVaultRotator_C::Timeline_Zoom_ZoomLevel_6FFD6729471BD965D850258DA1C0AF39' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Timeline_Zoom__Direction_6FFD6729471BD965D850258DA1C0AF39) == 0x00044C, "Member 'AVaultRotator_C::Timeline_Zoom__Direction_6FFD6729471BD965D850258DA1C0AF39' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, Timeline_Zoom) == 0x000450, "Member 'AVaultRotator_C::Timeline_Zoom' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_180_to_360_CameraRotationOffset_DF51680448A0BDB5D459C9BB5786D714) == 0x000458, "Member 'AVaultRotator_C::CameraTurn_180_to_360_CameraRotationOffset_DF51680448A0BDB5D459C9BB5786D714' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_180_to_360_CameraPositionOffset_DF51680448A0BDB5D459C9BB5786D714) == 0x000470, "Member 'AVaultRotator_C::CameraTurn_180_to_360_CameraPositionOffset_DF51680448A0BDB5D459C9BB5786D714' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_180_to_360_DirectionRotation_DF51680448A0BDB5D459C9BB5786D714) == 0x000488, "Member 'AVaultRotator_C::CameraTurn_180_to_360_DirectionRotation_DF51680448A0BDB5D459C9BB5786D714' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_180_to_360_FoV_DF51680448A0BDB5D459C9BB5786D714) == 0x00048C, "Member 'AVaultRotator_C::CameraTurn_180_to_360_FoV_DF51680448A0BDB5D459C9BB5786D714' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_180_to_360__Direction_DF51680448A0BDB5D459C9BB5786D714) == 0x000490, "Member 'AVaultRotator_C::CameraTurn_180_to_360__Direction_DF51680448A0BDB5D459C9BB5786D714' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_180_to_360) == 0x000498, "Member 'AVaultRotator_C::CameraTurn_180_to_360' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_0_to_180_CameraRotationOffset_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0) == 0x0004A0, "Member 'AVaultRotator_C::CameraTurn_0_to_180_CameraRotationOffset_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_0_to_180_CameraPositionOffset_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0) == 0x0004B8, "Member 'AVaultRotator_C::CameraTurn_0_to_180_CameraPositionOffset_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_0_to_180_DirectionalRotation_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0) == 0x0004D0, "Member 'AVaultRotator_C::CameraTurn_0_to_180_DirectionalRotation_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_0_to_180_FoV_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0) == 0x0004D4, "Member 'AVaultRotator_C::CameraTurn_0_to_180_FoV_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_0_to_180__Direction_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0) == 0x0004D8, "Member 'AVaultRotator_C::CameraTurn_0_to_180__Direction_EEFFCB9D4EE2DC181BC00CBD7C0E7EF0' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CameraTurn_0_to_180) == 0x0004E0, "Member 'AVaultRotator_C::CameraTurn_0_to_180' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, InitialCameraTransform) == 0x0004F0, "Member 'AVaultRotator_C::InitialCameraTransform' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, ClockwiseSound) == 0x000550, "Member 'AVaultRotator_C::ClockwiseSound' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, CounterClockwiseSound) == 0x000558, "Member 'AVaultRotator_C::CounterClockwiseSound' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, DebugMobile_Lighting) == 0x000560, "Member 'AVaultRotator_C::DebugMobile_Lighting' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, DebugLightingPC) == 0x000561, "Member 'AVaultRotator_C::DebugLightingPC' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, IsActive) == 0x000562, "Member 'AVaultRotator_C::IsActive' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, AlwaysOn) == 0x000563, "Member 'AVaultRotator_C::AlwaysOn' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, DebugLighting_LOWDetailPC) == 0x000564, "Member 'AVaultRotator_C::DebugLighting_LOWDetailPC' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, TargetZoomLevel) == 0x000568, "Member 'AVaultRotator_C::TargetZoomLevel' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, StartingRotationOffset) == 0x000570, "Member 'AVaultRotator_C::StartingRotationOffset' has a wrong offset!");
static_assert(offsetof(AVaultRotator_C, TargetRotationOffset) == 0x000588, "Member 'AVaultRotator_C::TargetRotationOffset' has a wrong offset!");

}

