#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteUI

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct VerseFortniteUI.VerseFortniteUIPresenterElement
// 0x0020 (0x0020 - 0x0000)
struct FVerseFortniteUIPresenterElement final
{
public:
	class UVerseFortniteUINamedSlot*              SlotWidget;                                        // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                UMGWidget;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseFortniteUIPresenterElement) == 0x000008, "Wrong alignment on FVerseFortniteUIPresenterElement");
static_assert(sizeof(FVerseFortniteUIPresenterElement) == 0x000020, "Wrong size on FVerseFortniteUIPresenterElement");
static_assert(offsetof(FVerseFortniteUIPresenterElement, SlotWidget) == 0x000000, "Member 'FVerseFortniteUIPresenterElement::SlotWidget' has a wrong offset!");
static_assert(offsetof(FVerseFortniteUIPresenterElement, UMGWidget) == 0x000008, "Member 'FVerseFortniteUIPresenterElement::UMGWidget' has a wrong offset!");

// ScriptStruct VerseFortniteUI.VerseFortniteUIFrameworkSliderValue
// 0x000C (0x000C - 0x0000)
struct FVerseFortniteUIFrameworkSliderValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClientId;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ServerID;                                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseFortniteUIFrameworkSliderValue) == 0x000004, "Wrong alignment on FVerseFortniteUIFrameworkSliderValue");
static_assert(sizeof(FVerseFortniteUIFrameworkSliderValue) == 0x00000C, "Wrong size on FVerseFortniteUIFrameworkSliderValue");
static_assert(offsetof(FVerseFortniteUIFrameworkSliderValue, Value) == 0x000000, "Member 'FVerseFortniteUIFrameworkSliderValue::Value' has a wrong offset!");
static_assert(offsetof(FVerseFortniteUIFrameworkSliderValue, ClientId) == 0x000004, "Member 'FVerseFortniteUIFrameworkSliderValue::ClientId' has a wrong offset!");
static_assert(offsetof(FVerseFortniteUIFrameworkSliderValue, ServerID) == 0x000008, "Member 'FVerseFortniteUIFrameworkSliderValue::ServerID' has a wrong offset!");

}

