#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseSimulation_0

#include "Basic.hpp"

#include "VerseSimulation_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseSimulation.Simulation_player_array_helper._L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R) == 0x000008, "Wrong alignment on Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R");
static_assert(sizeof(Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R) == 0x000010, "Wrong size on Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R");
static_assert(offsetof(Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R, RetVal) == 0x000008, "Member 'Simulation_player_array_helper__L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R final
{
public:
	struct VerseSimulation_0::Ftuple_Lint_Many_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R) == 0x000018, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R, RetVal) == 0x000010, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R final
{
public:
	struct Ftuple_Lplayer__component_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R) == 0x000018, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R, RetVal) == 0x000010, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R final
{
public:
	struct VerseSimulation_0::Ftuple_Lint_Many_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R) == 0x000018, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R, RetVal) == 0x000010, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R final
{
public:
	struct Ftuple_Lplayer__component_Many_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R) == 0x000018, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R, RetVal) == 0x000010, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_player_component*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R) == 0x000010, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R, RetVal) == 0x000008, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetSession
// 0x0010 (0x0010 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_session*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession) == 0x000010, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession, RetVal) == 0x000008, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSession::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime
// 0x0010 (0x0010 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime) == 0x000010, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime, RetVal) == 0x000008, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation._L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R
// 0x0020 (0x0020 - 0x0000)
struct Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_localizable_agent*          RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_0;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R) == 0x000008, "Wrong alignment on Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R");
static_assert(sizeof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R) == 0x000020, "Wrong size on Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R, RetVal) == 0x000008, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R::RetVal' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R, _InstancingGraph_0) == 0x000010, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R::_InstancingGraph_0' has a wrong offset!");
static_assert(offsetof(Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R, _InstancingGraph_1) == 0x000018, "Member 'Simulation__L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R::_InstancingGraph_1' has a wrong offset!");

// Function VerseSimulation.Simulation.Sleep_L_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct Simulation_Sleep_L_Nfloat_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Simulation_Sleep_L_Nfloat_R) == 0x000008, "Wrong alignment on Simulation_Sleep_L_Nfloat_R");
static_assert(sizeof(Simulation_Sleep_L_Nfloat_R) == 0x000028, "Wrong size on Simulation_Sleep_L_Nfloat_R");
static_assert(offsetof(Simulation_Sleep_L_Nfloat_R, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'Simulation_Sleep_L_Nfloat_R::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(Simulation_Sleep_L_Nfloat_R, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'Simulation_Sleep_L_Nfloat_R::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(Simulation_Sleep_L_Nfloat_R, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'Simulation_Sleep_L_Nfloat_R::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(Simulation_Sleep_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'Simulation_Sleep_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation_Sleep_L_Nfloat_R, RetVal) == 0x000020, "Member 'Simulation_Sleep_L_Nfloat_R::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation_player_component._L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle
// 0x0010 (0x0010 - 0x0000)
struct Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle) == 0x000008, "Wrong alignment on Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle");
static_assert(sizeof(Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle) == 0x000010, "Wrong size on Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle");
static_assert(offsetof(Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle, RetVal) == 0x000008, "Member 'Simulation_player_component__L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle::RetVal' has a wrong offset!");

// Function VerseSimulation.Simulation_player._L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive
// 0x0003 (0x0003 - 0x0000)
struct Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive final
{
public:
	struct VerseSimulation_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive) == 0x000001, "Wrong alignment on Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive");
static_assert(sizeof(Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive) == 0x000003, "Wrong size on Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive");
static_assert(offsetof(Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive, RetVal) == 0x000001, "Member 'Simulation_player__L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive::RetVal' has a wrong offset!");

// Function VerseSimulation.task_Simulation$Sleep_L_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_Simulation_Sleep_L_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_Simulation_Sleep_L_Nfloat_R_Update) == 0x000008, "Wrong alignment on task_Simulation_Sleep_L_Nfloat_R_Update");
static_assert(sizeof(task_Simulation_Sleep_L_Nfloat_R_Update) == 0x000008, "Wrong size on task_Simulation_Sleep_L_Nfloat_R_Update");
static_assert(offsetof(task_Simulation_Sleep_L_Nfloat_R_Update, RetVal) == 0x000000, "Member 'task_Simulation_Sleep_L_Nfloat_R_Update::RetVal' has a wrong offset!");

}

