#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseEngine_0

#include "Basic.hpp"

#include "VerseEngine_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseEngine.VerseEngine_multicast_delegate._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
// 0x0018 (0x0018 - 0x0000)
struct VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R) == 0x000008, "Wrong alignment on VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R");
static_assert(sizeof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R) == 0x000018, "Wrong size on VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R");
static_assert(offsetof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R, RetVal) == 0x000010, "Member 'VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_multicast_delegate._L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R final
{
public:
	FVerseDynamicProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R) == 0x000008, "Wrong alignment on VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R");
static_assert(sizeof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R) == 0x000010, "Wrong size on VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R");
static_assert(offsetof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_RBroadcast_L_Nt_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.VerseEngine_multicast_delegate._L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty
// 0x0001 (0x0001 - 0x0000)
struct VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty) == 0x000001, "Wrong alignment on VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty");
static_assert(sizeof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty) == 0x000001, "Wrong size on VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty");
static_assert(offsetof(VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_multicast_delegate__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_2fmulticast__delegate_Lt_R_N_REmpty::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R) == 0x000010, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R, RetVal) == 0x000008, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy
// 0x0002 (0x0002 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy) == 0x000001, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy) == 0x000002, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RDestroy::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R
// 0x0070 (0x0070 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	int64                                         _ForIndex_0;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_1;                                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xF655308E_ComponentClass_4;               // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _InvokeSureResultDummy_2;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_4;                                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xF655308E_ComponentClass_10;              // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _InvokeSureResultDummy_6;                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0060(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R) == 0x000070, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _ForIndex_0) == 0x000010, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_ForIndex_0' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _ForLength_1) == 0x000018, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_ForLength_1' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, __verse_0xF655308E_ComponentClass_4) == 0x000020, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::__verse_0xF655308E_ComponentClass_4' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _InvokeSureResultDummy_2) == 0x000028, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_InvokeSureResultDummy_2' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _Callee_3) == 0x000030, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_Callee_3' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _ForIndex_4) == 0x000040, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_ForIndex_4' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _ForLength_5) == 0x000048, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_ForLength_5' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, __verse_0xF655308E_ComponentClass_10) == 0x000050, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::__verse_0xF655308E_ComponentClass_10' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _InvokeSureResultDummy_6) == 0x000058, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_InvokeSureResultDummy_6' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R, _Callee_7) == 0x000060, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_REnsureComponents_L_N_Ksubtype_Lcomponent_R_R::_Callee_7' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R
// 0x0018 (0x0018 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R) == 0x000018, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R, RetVal) == 0x000008, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R) == 0x000010, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R, RetVal) == 0x000008, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname) == 0x000018, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname, RetVal) == 0x000008, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetFullname::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName) == 0x000018, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName, RetVal) == 0x000008, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetName::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R) == 0x000010, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R, RetVal) == 0x000008, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R
// 0x0098 (0x0098 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x0012(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_1;                                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_2;                                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xF655308E_ComponentClass_4;               // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_3;                                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_4;                                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_6;                                // 0x0050(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_8;                                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_9;                                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xF655308E_ComponentClass_12;              // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_10;                               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_11;                               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x0080(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_13;                               // 0x0090(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R) == 0x000098, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, RetVal) == 0x000010, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::RetVal' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ForIndex_1) == 0x000018, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ForIndex_1' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ForLength_2) == 0x000020, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ForLength_2' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, __verse_0xF655308E_ComponentClass_4) == 0x000028, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::__verse_0xF655308E_ComponentClass_4' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ExprResultStack_3) == 0x000030, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ExprResultStack_3' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ExprResultStack_4) == 0x000038, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ExprResultStack_4' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _Callee_5) == 0x000040, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_Callee_5' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ExprResultStack_6) == 0x000050, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ExprResultStack_6' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ForIndex_8) == 0x000058, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ForIndex_8' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ForLength_9) == 0x000060, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ForLength_9' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, __verse_0xF655308E_ComponentClass_12) == 0x000068, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::__verse_0xF655308E_ComponentClass_12' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ExprResultStack_10) == 0x000070, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ExprResultStack_10' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ExprResultStack_11) == 0x000078, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ExprResultStack_11' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _Callee_12) == 0x000080, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_Callee_12' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R, _ExprResultStack_13) == 0x000090, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RHasComponents_L_N_Ksubtype_Lcomponent_R_R::_ExprResultStack_13' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R final
{
public:
	class UVerseEngine_Entity_entity*             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R) == 0x000010, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RIsEqual_L_Nentity_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_entity._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R final
{
public:
	class UEntityComponent*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R");
static_assert(sizeof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R) == 0x000010, "Wrong size on VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R");
static_assert(offsetof(VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_entity__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.task_VerseEngine_subscribable_event$Await.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseEngine_subscribable_event_Await_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseEngine_subscribable_event_Await_Update) == 0x000008, "Wrong alignment on task_VerseEngine_subscribable_event_Await_Update");
static_assert(sizeof(task_VerseEngine_subscribable_event_Await_Update) == 0x000008, "Wrong size on task_VerseEngine_subscribable_event_Await_Update");
static_assert(offsetof(task_VerseEngine_subscribable_event_Await_Update, RetVal) == 0x000000, "Member 'task_VerseEngine_subscribable_event_Await_Update::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine._L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate
// 0x0030 (0x0030 - 0x0000)
struct VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate) == 0x000008, "Wrong alignment on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate");
static_assert(sizeof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate) == 0x000030, "Wrong size on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate, RetVal) == 0x000008, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate::RetVal' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate, _Callee_0) == 0x000010, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate::_Callee_0' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate, _Callee_1) == 0x000020, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate::_Callee_1' has a wrong offset!");

// Function VerseEngine.VerseEngine._L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R) == 0x000008, "Wrong alignment on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R");
static_assert(sizeof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R) == 0x000010, "Wrong size on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R, RetVal) == 0x000008, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine._L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event
// 0x0030 (0x0030 - 0x0000)
struct VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event) == 0x000008, "Wrong alignment on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event");
static_assert(sizeof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event) == 0x000030, "Wrong size on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event, RetVal) == 0x000008, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event::RetVal' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event, _Callee_0) == 0x000010, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event::_Callee_0' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event, _Callee_1) == 0x000020, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event::_Callee_1' has a wrong offset!");

// Function VerseEngine.VerseEngine._L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R) == 0x000008, "Wrong alignment on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R");
static_assert(sizeof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R) == 0x000010, "Wrong size on VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R, RetVal) == 0x000008, "Member 'VerseEngine__L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_multicast_delegate_subscription._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
// 0x0001 (0x0001 - 0x0000)
struct VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel final
{
public:
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel) == 0x000001, "Wrong alignment on VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel");
static_assert(sizeof(VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel) == 0x000001, "Wrong size on VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel");
static_assert(offsetof(VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_multicast_delegate_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_EntityHelpers._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R final
{
public:
	class UEntityComponent*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R");
static_assert(sizeof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R) == 0x000010, "Wrong size on VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R");
static_assert(offsetof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Ncomponent_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_EntityHelpers._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R
// 0x0018 (0x0018 - 0x0000)
struct VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R final
{
public:
	struct VerseEngine_0::Ftuple_Lcomponent_Many_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R");
static_assert(sizeof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R) == 0x000018, "Wrong size on VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R");
static_assert(offsetof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R, RetVal) == 0x000010, "Member 'VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Ncomponent_M_NType_20where_20Type_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_Entity_EntityHelpers._L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R
// 0x0010 (0x0010 - 0x0000)
struct VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R final
{
public:
	class UEntityComponent*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_entity*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R) == 0x000008, "Wrong alignment on VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R");
static_assert(sizeof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R) == 0x000010, "Wrong size on VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R");
static_assert(offsetof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R, RetVal) == 0x000008, "Member 'VerseEngine_Entity_EntityHelpers__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Ncomponent_R::RetVal' has a wrong offset!");

// Function VerseEngine.VerseEngine_subscribable_event.Await
// 0x0028 (0x0028 - 0x0000)
struct VerseEngine_subscribable_event_Await final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseEngine_subscribable_event_Await) == 0x000008, "Wrong alignment on VerseEngine_subscribable_event_Await");
static_assert(sizeof(VerseEngine_subscribable_event_Await) == 0x000028, "Wrong size on VerseEngine_subscribable_event_Await");
static_assert(offsetof(VerseEngine_subscribable_event_Await, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VerseEngine_subscribable_event_Await::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VerseEngine_subscribable_event_Await, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VerseEngine_subscribable_event_Await::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
