#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseGameplayTags

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct VerseGameplayTags.VerseGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct FVerseGameplayTag final
{
public:
	TSubclassOf<class UVerseGameplayTagBase>      InternalTag;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FVerseGameplayTag) == 0x000008, "Wrong alignment on FVerseGameplayTag");
static_assert(sizeof(FVerseGameplayTag) == 0x000008, "Wrong size on FVerseGameplayTag");
static_assert(offsetof(FVerseGameplayTag, InternalTag) == 0x000000, "Member 'FVerseGameplayTag::InternalTag' has a wrong offset!");

// ScriptStruct VerseGameplayTags.VerseGameplayTagContainer
// 0x0010 (0x0010 - 0x0000)
struct FVerseGameplayTagContainer final
{
public:
	TArray<struct FVerseGameplayTag>              InternalTags;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FVerseGameplayTagContainer) == 0x000008, "Wrong alignment on FVerseGameplayTagContainer");
static_assert(sizeof(FVerseGameplayTagContainer) == 0x000010, "Wrong size on FVerseGameplayTagContainer");
static_assert(offsetof(FVerseGameplayTagContainer, InternalTags) == 0x000000, "Member 'FVerseGameplayTagContainer::InternalTags' has a wrong offset!");

// ScriptStruct VerseGameplayTags.TaggedObjectFinderEntry
// 0x0030 (0x0030 - 0x0000)
struct FTaggedObjectFinderEntry final
{
public:
	struct FVerseGameplayTagContainer             RequiredTags;                                      // 0x0000(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVerseGameplayTagContainer             PreferredTags;                                     // 0x0010(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVerseGameplayTagContainer             ExclusionTags;                                     // 0x0020(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTaggedObjectFinderEntry) == 0x000008, "Wrong alignment on FTaggedObjectFinderEntry");
static_assert(sizeof(FTaggedObjectFinderEntry) == 0x000030, "Wrong size on FTaggedObjectFinderEntry");
static_assert(offsetof(FTaggedObjectFinderEntry, RequiredTags) == 0x000000, "Member 'FTaggedObjectFinderEntry::RequiredTags' has a wrong offset!");
static_assert(offsetof(FTaggedObjectFinderEntry, PreferredTags) == 0x000010, "Member 'FTaggedObjectFinderEntry::PreferredTags' has a wrong offset!");
static_assert(offsetof(FTaggedObjectFinderEntry, ExclusionTags) == 0x000020, "Member 'FTaggedObjectFinderEntry::ExclusionTags' has a wrong offset!");

}

