#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseParameterCollections

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseParameterCollections_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseParameterCollections.VerseParameterCollection
// 0x0050 (0x0078 - 0x0028)
class UVerseParameterCollection : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseParameterCollection">();
	}
	static class UVerseParameterCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseParameterCollection>();
	}
};
static_assert(alignof(UVerseParameterCollection) == 0x000008, "Wrong alignment on UVerseParameterCollection");
static_assert(sizeof(UVerseParameterCollection) == 0x000078, "Wrong size on UVerseParameterCollection");

// Class VerseParameterCollections.VerseParameterCollectionsSubsystem
// 0x0010 (0x0040 - 0x0030)
class UVerseParameterCollectionsSubsystem final : public UWorldSubsystem
{
public:
	TArray<struct FVerseParameterCollectionSubsystemEntry> ParameterCollections;                              // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseParameterCollectionsSubsystem">();
	}
	static class UVerseParameterCollectionsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseParameterCollectionsSubsystem>();
	}
};
static_assert(alignof(UVerseParameterCollectionsSubsystem) == 0x000008, "Wrong alignment on UVerseParameterCollectionsSubsystem");
static_assert(sizeof(UVerseParameterCollectionsSubsystem) == 0x000040, "Wrong size on UVerseParameterCollectionsSubsystem");
static_assert(offsetof(UVerseParameterCollectionsSubsystem, ParameterCollections) == 0x000030, "Member 'UVerseParameterCollectionsSubsystem::ParameterCollections' has a wrong offset!");

// Class VerseParameterCollections.VerseParameterCollectionReplication
// 0x0008 (0x0298 - 0x0290)
class AVerseParameterCollectionReplication final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseParameterCollectionReplication">();
	}
	static class AVerseParameterCollectionReplication* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVerseParameterCollectionReplication>();
	}
};
static_assert(alignof(AVerseParameterCollectionReplication) == 0x000008, "Wrong alignment on AVerseParameterCollectionReplication");
static_assert(sizeof(AVerseParameterCollectionReplication) == 0x000298, "Wrong size on AVerseParameterCollectionReplication");

}

