#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNative

#include "Basic.hpp"


namespace SDK
{

// Enum VerseNative.EVerseFalse
// NumValues: 0x0001
enum class EVerseFalse : uint8
{
	Value                                    = 0,
};

// Enum VerseNative.EVerseTrue
// NumValues: 0x0001
enum class EVerseTrue : uint8
{
	Value                                    = 0,
};

// ScriptStruct VerseNative.VerseIntRange
// 0x0010 (0x0010 - 0x0000)
struct FVerseIntRange final
{
public:
	int64                                         Left;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Right;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseIntRange) == 0x000008, "Wrong alignment on FVerseIntRange");
static_assert(sizeof(FVerseIntRange) == 0x000010, "Wrong size on FVerseIntRange");
static_assert(offsetof(FVerseIntRange, Left) == 0x000000, "Member 'FVerseIntRange::Left' has a wrong offset!");
static_assert(offsetof(FVerseIntRange, Right) == 0x000008, "Member 'FVerseIntRange::Right' has a wrong offset!");

// ScriptStruct VerseNative.VerseRational
// 0x0010 (0x0010 - 0x0000)
struct FVerseRational final
{
public:
	int64                                         Numerator;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Denominator;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseRational) == 0x000008, "Wrong alignment on FVerseRational");
static_assert(sizeof(FVerseRational) == 0x000010, "Wrong size on FVerseRational");
static_assert(offsetof(FVerseRational, Numerator) == 0x000000, "Member 'FVerseRational::Numerator' has a wrong offset!");
static_assert(offsetof(FVerseRational, Denominator) == 0x000008, "Member 'FVerseRational::Denominator' has a wrong offset!");

// ScriptStruct VerseNative.akeType
// 0x0001 (0x0001 - 0x0000)
struct FakeType final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FakeType) == 0x000001, "Wrong alignment on FakeType");
static_assert(sizeof(FakeType) == 0x000001, "Wrong size on FakeType");

}

