#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNPC

#include "Basic.hpp"

#include "VerseFortnite_classes.hpp"
#include "EntityCore_classes.hpp"
#include "VerseAIBase_classes.hpp"
#include "FortniteAI_structs.hpp"


namespace SDK
{

// Class VerseNPC.NPCCharacterModifier_Perception
// 0x0028 (0x0050 - 0x0028)
class UNPCCharacterModifier_Perception final : public UNPCCharacterModifier
{
public:
	uint8                                         bOverrideSightSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableSight : 1;                                  // 0x0028(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideHearingSettings : 1;                      // 0x0028(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableHearing : 1;                                // 0x0028(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideTouchSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableTouch : 1;                                  // 0x0028(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideDamageSettings : 1;                       // 0x0028(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableDamage : 1;                                 // 0x0028(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAISenseConfig_Sight*                   SightPerceptionSettings;                           // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Hearing*                 HearingPerceptionSettings;                         // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Touch*                   TouchPerceptionSettings;                           // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Damage*                  DamagePerceptionSettings;                          // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NPCCharacterModifier_Perception">();
	}
	static class UNPCCharacterModifier_Perception* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCCharacterModifier_Perception>();
	}
};
static_assert(alignof(UNPCCharacterModifier_Perception) == 0x000008, "Wrong alignment on UNPCCharacterModifier_Perception");
static_assert(sizeof(UNPCCharacterModifier_Perception) == 0x000050, "Wrong size on UNPCCharacterModifier_Perception");
static_assert(offsetof(UNPCCharacterModifier_Perception, SightPerceptionSettings) == 0x000030, "Member 'UNPCCharacterModifier_Perception::SightPerceptionSettings' has a wrong offset!");
static_assert(offsetof(UNPCCharacterModifier_Perception, HearingPerceptionSettings) == 0x000038, "Member 'UNPCCharacterModifier_Perception::HearingPerceptionSettings' has a wrong offset!");
static_assert(offsetof(UNPCCharacterModifier_Perception, TouchPerceptionSettings) == 0x000040, "Member 'UNPCCharacterModifier_Perception::TouchPerceptionSettings' has a wrong offset!");
static_assert(offsetof(UNPCCharacterModifier_Perception, DamagePerceptionSettings) == 0x000048, "Member 'UNPCCharacterModifier_Perception::DamagePerceptionSettings' has a wrong offset!");

// Class VerseNPC.CharacterModifier_GuardPerception
// 0x0088 (0x00B0 - 0x0028)
class UCharacterModifier_GuardPerception final : public UNPCCharacterModifier
{
public:
	uint8                                         bOverrideSightSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableSight : 1;                                  // 0x0028(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideHearingSettings : 1;                      // 0x0028(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableHearing : 1;                                // 0x0028(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideTouchSettings : 1;                        // 0x0028(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableTouch : 1;                                  // 0x0028(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideDamageSettings : 1;                       // 0x0028(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableDamage : 1;                                 // 0x0028(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAISenseConfig_Sight*                   SightPerceptionSettings[0x4];                      // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Hearing*                 HearingPerceptionSettings[0x4];                    // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Touch*                   TouchPerceptionSettings[0x4];                      // 0x0070(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAISenseConfig_Damage*                  DamagePerceptionSettings[0x4];                     // 0x0090(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterModifier_GuardPerception">();
	}
	static class UCharacterModifier_GuardPerception* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterModifier_GuardPerception>();
	}
};
static_assert(alignof(UCharacterModifier_GuardPerception) == 0x000008, "Wrong alignment on UCharacterModifier_GuardPerception");
static_assert(sizeof(UCharacterModifier_GuardPerception) == 0x0000B0, "Wrong size on UCharacterModifier_GuardPerception");
static_assert(offsetof(UCharacterModifier_GuardPerception, SightPerceptionSettings) == 0x000030, "Member 'UCharacterModifier_GuardPerception::SightPerceptionSettings' has a wrong offset!");
static_assert(offsetof(UCharacterModifier_GuardPerception, HearingPerceptionSettings) == 0x000050, "Member 'UCharacterModifier_GuardPerception::HearingPerceptionSettings' has a wrong offset!");
static_assert(offsetof(UCharacterModifier_GuardPerception, TouchPerceptionSettings) == 0x000070, "Member 'UCharacterModifier_GuardPerception::TouchPerceptionSettings' has a wrong offset!");
static_assert(offsetof(UCharacterModifier_GuardPerception, DamagePerceptionSettings) == 0x000090, "Member 'UCharacterModifier_GuardPerception::DamagePerceptionSettings' has a wrong offset!");

// Class VerseNPC.InventoryComponentBase
// 0x0040 (0x0098 - 0x0058)
class UInventoryComponentBase : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortInventory*                         CachedFortInventory;                               // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPawn*                              CachedFortPawn;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                   CachedBlackboardComponent;                         // 0x0090(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryComponentBase">();
	}
	static class UInventoryComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryComponentBase>();
	}
};
static_assert(alignof(UInventoryComponentBase) == 0x000008, "Wrong alignment on UInventoryComponentBase");
static_assert(sizeof(UInventoryComponentBase) == 0x000098, "Wrong size on UInventoryComponentBase");
static_assert(offsetof(UInventoryComponentBase, CachedFortInventory) == 0x000080, "Member 'UInventoryComponentBase::CachedFortInventory' has a wrong offset!");
static_assert(offsetof(UInventoryComponentBase, CachedFortPawn) == 0x000088, "Member 'UInventoryComponentBase::CachedFortPawn' has a wrong offset!");
static_assert(offsetof(UInventoryComponentBase, CachedBlackboardComponent) == 0x000090, "Member 'UInventoryComponentBase::CachedBlackboardComponent' has a wrong offset!");

// Class VerseNPC.LeashComponentBase
// 0x0000 (0x0070 - 0x0070)
class ULeashComponentBase : public UAIComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LeashComponentBase">();
	}
	static class ULeashComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeashComponentBase>();
	}
};
static_assert(alignof(ULeashComponentBase) == 0x000008, "Wrong alignment on ULeashComponentBase");
static_assert(sizeof(ULeashComponentBase) == 0x000070, "Wrong size on ULeashComponentBase");

// Class VerseNPC.NPCPerceptionComponentBase
// 0x0000 (0x0090 - 0x0090)
#pragma pack(push, 0x1)
class alignas(0x08) UNPCPerceptionComponentBase : public UAIPerceptionComponentBase
{
public:
	void OnBotControllerAlertLevelChanged(class AFortAthenaAIBotController* BotController, EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NPCPerceptionComponentBase">();
	}
	static class UNPCPerceptionComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCPerceptionComponentBase>();
	}
};
#pragma pack(pop)
static_assert(alignof(UNPCPerceptionComponentBase) == 0x000008, "Wrong alignment on UNPCPerceptionComponentBase");
static_assert(sizeof(UNPCPerceptionComponentBase) == 0x000090, "Wrong size on UNPCPerceptionComponentBase");

}

