#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseQuery_classes.hpp"
#include "Entity_0_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseGameplayTags_structs.hpp"


namespace SDK
{

// VerseClass VerseQuery.VerseQuery_playspace_association_component
// 0x0008 (0x00C0 - 0x00B8)
class UVerseQuery_playspace_association_component final : public UEntity_core_entity_component
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_playspace_association_component">();
	}
	static class UVerseQuery_playspace_association_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_playspace_association_component>();
	}
};
static_assert(alignof(UVerseQuery_playspace_association_component) == 0x000008, "Wrong alignment on UVerseQuery_playspace_association_component");
static_assert(sizeof(UVerseQuery_playspace_association_component) == 0x0000C0, "Wrong size on UVerseQuery_playspace_association_component");

// VerseClass VerseQuery.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseQuery_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseQuery.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseQuery_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseQuery_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseQuery_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseQuery_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseQuery_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseQuery_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseQuery.VerseQuery
// 0x0000 (0x0028 - 0x0028)
class UVerseQuery final : public UObject
{
public:
	static TArray<class UEntity_core_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R(const struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R(const struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_core_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R(const struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity__component_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R(const struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_core_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R(const struct Ftuple_Lquery__manager_Mtuple_L_R_Mquery__volume_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_core_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R(const struct Ftuple_Lquery__manager_Mtuple_L_R_Mtuple_L_Ktag_M_Ktag_M_Ktag_R_R& __verse_0xB2CDDD72_Argument);
	static class UEntityQueryManager* _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcomponent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UEntityQueryManager* _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcore__entity__component_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UEntityQueryManager* _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcore__entity_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery">();
	}
	static class UVerseQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery>();
	}
};
static_assert(alignof(UVerseQuery) == 0x000008, "Wrong alignment on UVerseQuery");
static_assert(sizeof(UVerseQuery) == 0x000028, "Wrong size on UVerseQuery");

// VerseClass VerseQuery.VerseQuery_query_iterator
// 0x0000 (0x0028 - 0x0028)
class UVerseQuery_query_iterator final : public UObject
{
public:
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_core_entity*, true> _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_query_iterator">();
	}
	static class UVerseQuery_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_query_iterator>();
	}
};
static_assert(alignof(UVerseQuery_query_iterator) == 0x000008, "Wrong alignment on UVerseQuery_query_iterator");
static_assert(sizeof(UVerseQuery_query_iterator) == 0x000028, "Wrong size on UVerseQuery_query_iterator");

// VerseClass VerseQuery.VerseQuery_core_entity_query_iterator
// 0x0058 (0x0098 - 0x0040)
class UVerseQuery_core_entity_query_iterator final : public UQueryIteratorBase
{
public:
	FVerseFunctionProperty_                       __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid; // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext; // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_60[0x38];                                      // 0x0060(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_core_entity*, true> _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_core_entity_query_iterator">();
	}
	static class UVerseQuery_core_entity_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_core_entity_query_iterator>();
	}
};
static_assert(alignof(UVerseQuery_core_entity_query_iterator) == 0x000008, "Wrong alignment on UVerseQuery_core_entity_query_iterator");
static_assert(sizeof(UVerseQuery_core_entity_query_iterator) == 0x000098, "Wrong size on UVerseQuery_core_entity_query_iterator");
static_assert(offsetof(UVerseQuery_core_entity_query_iterator, __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000040, "Member 'UVerseQuery_core_entity_query_iterator::__verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UVerseQuery_core_entity_query_iterator, __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000050, "Member 'UVerseQuery_core_entity_query_iterator::__verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_null_query_iterator
// 0x0020 (0x0048 - 0x0028)
class UVerseQuery_null_query_iterator final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_core_entity*, true> _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_null_query_iterator">();
	}
	static class UVerseQuery_null_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_null_query_iterator>();
	}
};
static_assert(alignof(UVerseQuery_null_query_iterator) == 0x000008, "Wrong alignment on UVerseQuery_null_query_iterator");
static_assert(sizeof(UVerseQuery_null_query_iterator) == 0x000048, "Wrong size on UVerseQuery_null_query_iterator");
static_assert(offsetof(UVerseQuery_null_query_iterator, __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000028, "Member 'UVerseQuery_null_query_iterator::__verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UVerseQuery_null_query_iterator, __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000038, "Member 'UVerseQuery_null_query_iterator::__verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_query_volume
// 0x0000 (0x0028 - 0x0028)
class UVerseQuery_query_volume : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_query_volume">();
	}
	static class UVerseQuery_query_volume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_query_volume>();
	}
};
static_assert(alignof(UVerseQuery_query_volume) == 0x000008, "Wrong alignment on UVerseQuery_query_volume");
static_assert(sizeof(UVerseQuery_query_volume) == 0x000028, "Wrong size on UVerseQuery_query_volume");

// VerseClass VerseQuery.VerseQuery_query_volume_box
// 0x0030 (0x0058 - 0x0028)
class UVerseQuery_query_volume_box final : public UVerseQuery_query_volume
{
public:
	struct FSpatialMath_vector3                   __verse_0x962BA9CF_Origin;                         // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xA327BDA5_Extent;                         // 0x0040(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_query_volume_box">();
	}
	static class UVerseQuery_query_volume_box* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_query_volume_box>();
	}
};
static_assert(alignof(UVerseQuery_query_volume_box) == 0x000008, "Wrong alignment on UVerseQuery_query_volume_box");
static_assert(sizeof(UVerseQuery_query_volume_box) == 0x000058, "Wrong size on UVerseQuery_query_volume_box");
static_assert(offsetof(UVerseQuery_query_volume_box, __verse_0x962BA9CF_Origin) == 0x000028, "Member 'UVerseQuery_query_volume_box::__verse_0x962BA9CF_Origin' has a wrong offset!");
static_assert(offsetof(UVerseQuery_query_volume_box, __verse_0xA327BDA5_Extent) == 0x000040, "Member 'UVerseQuery_query_volume_box::__verse_0xA327BDA5_Extent' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_tag_container_core_entity_component
// 0x0058 (0x0110 - 0x00B8)
class UVerseQuery_tag_container_core_entity_component final : public UEntity_core_entity_component
{
public:
	FVerseFunctionProperty_                       __verse_0xA4727E8A__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x49B7FFA7__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCC386530__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x35AE7D14__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UTags_tag_container*                    __verse_0x5C685848_InternalTags;                   // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             __verse_0x322F2385_TagSelector;                    // 0x0100(0x0010)(Edit, InstancedReference, SaveGame)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	class UTags_tag_container* _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R(class UTags_tag_container* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_tag_container_core_entity_component">();
	}
	static class UVerseQuery_tag_container_core_entity_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_tag_container_core_entity_component>();
	}
};
static_assert(alignof(UVerseQuery_tag_container_core_entity_component) == 0x000008, "Wrong alignment on UVerseQuery_tag_container_core_entity_component");
static_assert(sizeof(UVerseQuery_tag_container_core_entity_component) == 0x000110, "Wrong size on UVerseQuery_tag_container_core_entity_component");
static_assert(offsetof(UVerseQuery_tag_container_core_entity_component, __verse_0xA4727E8A__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags) == 0x0000B8, "Member 'UVerseQuery_tag_container_core_entity_component::__verse_0xA4727E8A__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_container_core_entity_component, __verse_0x49B7FFA7__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R) == 0x0000C8, "Member 'UVerseQuery_tag_container_core_entity_component::__verse_0x49B7FFA7__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_container_core_entity_component, __verse_0xCC386530__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R) == 0x0000D8, "Member 'UVerseQuery_tag_container_core_entity_component::__verse_0xCC386530__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_container_core_entity_component, __verse_0x35AE7D14__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R) == 0x0000E8, "Member 'UVerseQuery_tag_container_core_entity_component::__verse_0x35AE7D14__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_container_core_entity_component, __verse_0x5C685848_InternalTags) == 0x0000F8, "Member 'UVerseQuery_tag_container_core_entity_component::__verse_0x5C685848_InternalTags' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_container_core_entity_component, __verse_0x322F2385_TagSelector) == 0x000100, "Member 'UVerseQuery_tag_container_core_entity_component::__verse_0x322F2385_TagSelector' has a wrong offset!");

}

