#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VersePlayspace_0

#include "Basic.hpp"

#include "VersePlayspace_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseConcurrency_classes.hpp"
#include "EntityCore_classes.hpp"


namespace SDK
{

// VerseClass VersePlayspace.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VersePlayspace_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VersePlayspace.$SolarisSignatureFunctionOuter", true>();
	}
	static class VersePlayspace_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VersePlayspace_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VersePlayspace_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VersePlayspace_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VersePlayspace_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VersePlayspace_0::U_SolarisSignatureFunctionOuter");

// VerseClass VersePlayspace.Playspace_playspace_component
// 0x0108 (0x0160 - 0x0058)
class UPlayspace_playspace_component : public UEntityComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xC8D21C45__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayers_L_NPlayerType_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x68A1B3A5__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayerCount_L_NPlayerType_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x112880C6___WaitForSetupComplete;         // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x579A67A4___WaitForMatchBegin;            // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB30FF5AF___WaitForMatchEnd;              // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF324C2B5___WaitForPlayerAdded;           // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x74B0F4F3___WaitForPlayerRemoved;         // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4908ACA9__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RsetQueueUserForRespawnWhenAdded_L_Nlogic_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC9B0AC4A__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RSetPlayerComponentClass_L_NComponentType_20where_20ComponentType_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x78];                                      // 0x00E8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class Utask* __WaitForMatchBegin(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VersePlayspace_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* __WaitForMatchEnd(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VersePlayspace_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* __WaitForPlayerAdded(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VersePlayspace_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* __WaitForPlayerRemoved(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VersePlayspace_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* __WaitForSetupComplete(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VersePlayspace_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayerCount_L_NPlayerType_R(EPlayspace_PlayerType __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_player_component*> _L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayers_L_NPlayerType_R(EPlayspace_PlayerType __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RSetPlayerComponentClass_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RsetQueueUserForRespawnWhenAdded_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Playspace_playspace_component">();
	}
	static class UPlayspace_playspace_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspace_playspace_component>();
	}
};
static_assert(alignof(UPlayspace_playspace_component) == 0x000008, "Wrong alignment on UPlayspace_playspace_component");
static_assert(sizeof(UPlayspace_playspace_component) == 0x000160, "Wrong size on UPlayspace_playspace_component");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0xC8D21C45__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayers_L_NPlayerType_R) == 0x000058, "Member 'UPlayspace_playspace_component::__verse_0xC8D21C45__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayers_L_NPlayerType_R' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0x68A1B3A5__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayerCount_L_NPlayerType_R) == 0x000068, "Member 'UPlayspace_playspace_component::__verse_0x68A1B3A5__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RgetPlayerCount_L_NPlayerType_R' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0x112880C6___WaitForSetupComplete) == 0x000078, "Member 'UPlayspace_playspace_component::__verse_0x112880C6___WaitForSetupComplete' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0x579A67A4___WaitForMatchBegin) == 0x000088, "Member 'UPlayspace_playspace_component::__verse_0x579A67A4___WaitForMatchBegin' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0xB30FF5AF___WaitForMatchEnd) == 0x000098, "Member 'UPlayspace_playspace_component::__verse_0xB30FF5AF___WaitForMatchEnd' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0xF324C2B5___WaitForPlayerAdded) == 0x0000A8, "Member 'UPlayspace_playspace_component::__verse_0xF324C2B5___WaitForPlayerAdded' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0x74B0F4F3___WaitForPlayerRemoved) == 0x0000B8, "Member 'UPlayspace_playspace_component::__verse_0x74B0F4F3___WaitForPlayerRemoved' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0x4908ACA9__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RsetQueueUserForRespawnWhenAdded_L_Nlogic_R) == 0x0000C8, "Member 'UPlayspace_playspace_component::__verse_0x4908ACA9__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RsetQueueUserForRespawnWhenAdded_L_Nlogic_R' has a wrong offset!");
static_assert(offsetof(UPlayspace_playspace_component, __verse_0xC9B0AC4A__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RSetPlayerComponentClass_L_NComponentType_20where_20ComponentType_R) == 0x0000D8, "Member 'UPlayspace_playspace_component::__verse_0xC9B0AC4A__L_2fUnrealEngine_2ecom_2fPlayspace_2fplayspace__component_N_RSetPlayerComponentClass_L_NComponentType_20where_20ComponentType_R' has a wrong offset!");

// VerseClass VersePlayspace.task_Playspace_playspace_component$__WaitForSetupComplete
// 0x0010 (0x0160 - 0x0150)
class Utask_Playspace_playspace_component___WaitForSetupComplete final : public Utask
{
public:
	class UPlayspace_playspace_component*         _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VersePlayspace_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Playspace_playspace_component$__WaitForSetupComplete">();
	}
	static class Utask_Playspace_playspace_component___WaitForSetupComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Playspace_playspace_component___WaitForSetupComplete>();
	}
};
static_assert(alignof(Utask_Playspace_playspace_component___WaitForSetupComplete) == 0x000008, "Wrong alignment on Utask_Playspace_playspace_component___WaitForSetupComplete");
static_assert(sizeof(Utask_Playspace_playspace_component___WaitForSetupComplete) == 0x000160, "Wrong size on Utask_Playspace_playspace_component___WaitForSetupComplete");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForSetupComplete, _Self) == 0x000150, "Member 'Utask_Playspace_playspace_component___WaitForSetupComplete::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForSetupComplete, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_Playspace_playspace_component___WaitForSetupComplete::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VersePlayspace.task_Playspace_playspace_component$__WaitForMatchBegin
// 0x0010 (0x0160 - 0x0150)
class Utask_Playspace_playspace_component___WaitForMatchBegin final : public Utask
{
public:
	class UPlayspace_playspace_component*         _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VersePlayspace_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Playspace_playspace_component$__WaitForMatchBegin">();
	}
	static class Utask_Playspace_playspace_component___WaitForMatchBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Playspace_playspace_component___WaitForMatchBegin>();
	}
};
static_assert(alignof(Utask_Playspace_playspace_component___WaitForMatchBegin) == 0x000008, "Wrong alignment on Utask_Playspace_playspace_component___WaitForMatchBegin");
static_assert(sizeof(Utask_Playspace_playspace_component___WaitForMatchBegin) == 0x000160, "Wrong size on Utask_Playspace_playspace_component___WaitForMatchBegin");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForMatchBegin, _Self) == 0x000150, "Member 'Utask_Playspace_playspace_component___WaitForMatchBegin::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForMatchBegin, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_Playspace_playspace_component___WaitForMatchBegin::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VersePlayspace.task_Playspace_playspace_component$__WaitForMatchEnd
// 0x0010 (0x0160 - 0x0150)
class Utask_Playspace_playspace_component___WaitForMatchEnd final : public Utask
{
public:
	class UPlayspace_playspace_component*         _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VersePlayspace_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Playspace_playspace_component$__WaitForMatchEnd">();
	}
	static class Utask_Playspace_playspace_component___WaitForMatchEnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Playspace_playspace_component___WaitForMatchEnd>();
	}
};
static_assert(alignof(Utask_Playspace_playspace_component___WaitForMatchEnd) == 0x000008, "Wrong alignment on Utask_Playspace_playspace_component___WaitForMatchEnd");
static_assert(sizeof(Utask_Playspace_playspace_component___WaitForMatchEnd) == 0x000160, "Wrong size on Utask_Playspace_playspace_component___WaitForMatchEnd");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForMatchEnd, _Self) == 0x000150, "Member 'Utask_Playspace_playspace_component___WaitForMatchEnd::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForMatchEnd, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_Playspace_playspace_component___WaitForMatchEnd::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VersePlayspace.task_Playspace_playspace_component$__WaitForPlayerAdded
// 0x0018 (0x0168 - 0x0150)
class Utask_Playspace_playspace_component___WaitForPlayerAdded final : public Utask
{
public:
	class UPlayspace_playspace_component*         _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VersePlayspace_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player_component*           _RetVal;                                           // 0x0160(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Playspace_playspace_component$__WaitForPlayerAdded">();
	}
	static class Utask_Playspace_playspace_component___WaitForPlayerAdded* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Playspace_playspace_component___WaitForPlayerAdded>();
	}
};
static_assert(alignof(Utask_Playspace_playspace_component___WaitForPlayerAdded) == 0x000008, "Wrong alignment on Utask_Playspace_playspace_component___WaitForPlayerAdded");
static_assert(sizeof(Utask_Playspace_playspace_component___WaitForPlayerAdded) == 0x000168, "Wrong size on Utask_Playspace_playspace_component___WaitForPlayerAdded");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForPlayerAdded, _Self) == 0x000150, "Member 'Utask_Playspace_playspace_component___WaitForPlayerAdded::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForPlayerAdded, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_Playspace_playspace_component___WaitForPlayerAdded::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForPlayerAdded, _RetVal) == 0x000160, "Member 'Utask_Playspace_playspace_component___WaitForPlayerAdded::_RetVal' has a wrong offset!");

// VerseClass VersePlayspace.task_Playspace_playspace_component$__WaitForPlayerRemoved
// 0x0018 (0x0168 - 0x0150)
class Utask_Playspace_playspace_component___WaitForPlayerRemoved final : public Utask
{
public:
	class UPlayspace_playspace_component*         _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VersePlayspace_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player_component*           _RetVal;                                           // 0x0160(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Playspace_playspace_component$__WaitForPlayerRemoved">();
	}
	static class Utask_Playspace_playspace_component___WaitForPlayerRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Playspace_playspace_component___WaitForPlayerRemoved>();
	}
};
static_assert(alignof(Utask_Playspace_playspace_component___WaitForPlayerRemoved) == 0x000008, "Wrong alignment on Utask_Playspace_playspace_component___WaitForPlayerRemoved");
static_assert(sizeof(Utask_Playspace_playspace_component___WaitForPlayerRemoved) == 0x000168, "Wrong size on Utask_Playspace_playspace_component___WaitForPlayerRemoved");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForPlayerRemoved, _Self) == 0x000150, "Member 'Utask_Playspace_playspace_component___WaitForPlayerRemoved::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForPlayerRemoved, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_Playspace_playspace_component___WaitForPlayerRemoved::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_Playspace_playspace_component___WaitForPlayerRemoved, _RetVal) == 0x000160, "Member 'Utask_Playspace_playspace_component___WaitForPlayerRemoved::_RetVal' has a wrong offset!");

}

