#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNPC_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNPC_0_structs.hpp"
#include "VerseFortnite_0_structs.hpp"


namespace SDK::Params
{

// Function VerseNPC.task_VerseNPC_npc_component$LootObject_L_Nfort__loot__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$AttackObstacle_L_Nfort__obstacle__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$MaintainFocus_L_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_MaintainFocus_L_Nagent_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$AttackThreat_L_Ntarget__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$MaintainFocus_L_Nvector3_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_MaintainFocus_L_Nvector3_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Crouch.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Crouch_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Crouch_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Crouch_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Crouch_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Crouch_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Crouch_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Crouch_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Jump.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Jump_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Jump_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Jump_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Jump_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Jump_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Jump_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Jump_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$MoveInRangeToAttack.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_MoveInRangeToAttack_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_MoveInRangeToAttack_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_MoveInRangeToAttack_Update");
static_assert(sizeof(task_VerseNPC_npc_component_MoveInRangeToAttack_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_MoveInRangeToAttack_Update");
static_assert(offsetof(task_VerseNPC_npc_component_MoveInRangeToAttack_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_MoveInRangeToAttack_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$PlayEmote_L_Nemote_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_PlayEmote_L_Nemote_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$PlayRandomEmote.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_PlayRandomEmote_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_PlayRandomEmote_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_PlayRandomEmote_Update");
static_assert(sizeof(task_VerseNPC_npc_component_PlayRandomEmote_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_PlayRandomEmote_Update");
static_assert(offsetof(task_VerseNPC_npc_component_PlayRandomEmote_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_PlayRandomEmote_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Revive_L_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Revive_L_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Revive_L_Nagent_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Revive_L_Nagent_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Revive_L_Nagent_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Revive_L_Nagent_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Revive_L_Nagent_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Revive_L_Nagent_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$RoamAround.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_RoamAround_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_RoamAround_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_RoamAround_Update");
static_assert(sizeof(task_VerseNPC_npc_component_RoamAround_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_RoamAround_Update");
static_assert(offsetof(task_VerseNPC_npc_component_RoamAround_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_RoamAround_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Slide.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Slide_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Slide_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Slide_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Slide_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Slide_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Slide_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Slide_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Sprint.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Sprint_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Sprint_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Sprint_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Sprint_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Sprint_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Sprint_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Sprint_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$TacticalSprint.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_TacticalSprint_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_TacticalSprint_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_TacticalSprint_Update");
static_assert(sizeof(task_VerseNPC_npc_component_TacticalSprint_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_TacticalSprint_Update");
static_assert(offsetof(task_VerseNPC_npc_component_TacticalSprint_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_TacticalSprint_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Walk.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Walk_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Walk_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Walk_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Walk_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Walk_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Walk_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Walk_Update::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R
// 0x0030 (0x0030 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R final
{
public:
	struct VerseNPC_0::Ftuple_Lfort__inventory__item__asset_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<struct FVerseAIBase_fort_item_descriptor> RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R) == 0x000030, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R, RetVal) == 0x000010, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0018(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R, RetVal) == 0x000018, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems
// 0x0018 (0x0018 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseAIBase_fort_item_descriptor> RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems) == 0x000018, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems, RetVal) == 0x000008, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon
// 0x0028 (0x0028 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FVerseAIBase_fort_item_descriptor> RetVal;                                            // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon) == 0x000028, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon, RetVal) == 0x000008, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R
// 0x0038 (0x0038 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	TOptional<struct FVerseAIBase_fort_weapon_descriptor> RetVal;                                            // 0x0018(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R) == 0x000038, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R, RetVal) == 0x000018, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R
// 0x0018 (0x0018 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R) == 0x000018, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R, RetVal) == 0x000010, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R) == 0x000008, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_leash_component._L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash
// 0x0001 (0x0001 - 0x0000)
struct VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash) == 0x000001, "Wrong alignment on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash");
static_assert(sizeof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash) == 0x000001, "Wrong size on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash");
static_assert(offsetof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_leash_component._L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R final
{
public:
	struct VerseNPC_0::Ftuple_Lagent_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R) == 0x000018, "Wrong size on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_leash_component._L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R final
{
public:
	struct VerseNPC_0::Ftuple_Lvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R) == 0x000028, "Wrong size on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination
// 0x0028 (0x0028 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_vector3>        RetVal;                                            // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination) == 0x000028, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R) == 0x000008, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation
// 0x0001 (0x0001 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation) == 0x000001, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation) == 0x000001, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp
// 0x0002 (0x0002 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp) == 0x000001, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp) == 0x000002, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp, RetVal) == 0x000001, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire
// 0x0002 (0x0002 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire) == 0x000001, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire) == 0x000002, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack
// 0x0002 (0x0002 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack) == 0x000001, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack) == 0x000002, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload
// 0x0002 (0x0002 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload final
{
public:
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload) == 0x000001, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload) == 0x000002, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component.AttackObstacle_L_Nfort__obstacle__info_R
// 0x0048 (0x0048 - 0x0000)
struct VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info        __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0028)(Parm, NoDestructor)
	class Utask*                                  RetVal;                                            // 0x0040(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R) == 0x000008, "Wrong alignment on VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R");
static_assert(sizeof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R) == 0x000048, "Wrong size on VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R");
static_assert(offsetof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, RetVal) == 0x000040, "Member 'VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component.AttackThreat_L_Ntarget__info_R
// 0x0050 (0x0050 - 0x0000)
struct VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAI_target_info                        __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0030)(Parm, NoDestructor)
	class Utask*                                  RetVal;                                            // 0x0048(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R) == 0x000008, "Wrong alignment on VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R");
static_assert(sizeof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R) == 0x000050, "Wrong size on VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R");
static_assert(offsetof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R, RetVal) == 0x000048, "Member 'VerseNPC_npc_component_AttackThreat_L_Ntarget__info_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component.Crouch
// 0x0028 (0x0028 - 0x0000)
struct VerseNPC_npc_component_Crouch final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC_0::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component_Crouch) == 0x000008, "Wrong alignment on VerseNPC_npc_component_Crouch");
static_assert(sizeof(VerseNPC_npc_component_Crouch) == 0x000028, "Wrong size on VerseNPC_npc_component_Crouch");
static_assert(offsetof(VerseNPC_npc_component_Crouch, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VerseNPC_npc_component_Crouch::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_Crouch, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VerseNPC_npc_component_Crouch::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_Crouch, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VerseNPC_npc_component_Crouch::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_Crouch, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VerseNPC_npc_component_Crouch::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component_Crouch, RetVal) == 0x000020, "Member 'VerseNPC_npc_component_Crouch::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component.Jump
// 0x0028 (0x0028 - 0x0000)
struct VerseNPC_npc_component_Jump final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
