#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseQuery_0_structs.hpp"
#include "VerseGameplayTags_structs.hpp"


namespace SDK::Params
{

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R
// 0x0028 (0x0028 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R final
{
public:
	struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TArray<class UEntity_core_entity*>            RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R) == 0x000028, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R, RetVal) == 0x000018, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfType_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R
// 0x0020 (0x0020 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R final
{
public:
	struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R) == 0x000020, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R, RetVal) == 0x000018, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesOfTypeIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NEntityClass_20where_20EntityClass_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R
// 0x0028 (0x0028 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R final
{
public:
	struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TArray<class UEntity_core_entity*>            RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R) == 0x000028, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R, RetVal) == 0x000018, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponents_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R
// 0x0020 (0x0020 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R final
{
public:
	struct Ftuple_Lquery__manager_Mtuple_L_R_Mcore__entity_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R) == 0x000020, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R, RetVal) == 0x000018, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithComponentsIterator_U_L_Nquery__manager_M_Ntuple_L_R_M_NComponentClass_20where_20ComponentClass_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R
// 0x0028 (0x0028 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R final
{
public:
	struct Ftuple_Lquery__manager_Mtuple_L_R_Mquery__volume_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TArray<class UEntity_core_entity*>            RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R) == 0x000028, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R, RetVal) == 0x000018, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithinVolume_U_L_Nquery__manager_M_Ntuple_L_R_M_Nquery__volume_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R
// 0x0050 (0x0050 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R final
{
public:
	struct Ftuple_Lquery__manager_Mtuple_L_R_Mtuple_L_Ktag_M_Ktag_M_Ktag_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	TArray<class UEntity_core_entity*>            RetVal;                                            // 0x0040(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R) == 0x000050, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R, RetVal) == 0x000040, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eEntitiesWithTags_U_L_Nquery__manager_M_Ntuple_L_R_M_Ntuple_L_Ktag_M_Ktag_M_Ktag_R_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcomponent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityQueryManager*                    RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R) == 0x000018, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R, RetVal) == 0x000010, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncomponent_M_Ntuple_L_R_M_Ntuple_L_R_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcore__entity__component_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityQueryManager*                    RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R) == 0x000018, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R, RetVal) == 0x000010, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity__component_M_Ntuple_L_R_M_Ntuple_L_R_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery._L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcore__entity_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityQueryManager*                    RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R) == 0x000008, "Wrong alignment on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R");
static_assert(sizeof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R) == 0x000018, "Wrong size on VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R, RetVal) == 0x000010, "Member 'VerseQuery__L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eGetQueryManager_U_L_Ncore__entity_M_Ntuple_L_R_M_Ntuple_L_R_R::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery_query_iterator._L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid
// 0x0002 (0x0002 - 0x0000)
struct VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000001, "Wrong alignment on VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid");
static_assert(sizeof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000002, "Wrong size on VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid");
static_assert(offsetof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_query_iterator._L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext
// 0x0010 (0x0010 - 0x0000)
struct VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000008, "Wrong alignment on VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext");
static_assert(sizeof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000010, "Wrong size on VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext");
static_assert(offsetof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext, RetVal) == 0x000008, "Member 'VerseQuery_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery_core_entity_query_iterator._L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid
// 0x0002 (0x0002 - 0x0000)
struct VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000001, "Wrong alignment on VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid");
static_assert(sizeof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000002, "Wrong size on VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid");
static_assert(offsetof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_core_entity_query_iterator._L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext
// 0x0010 (0x0010 - 0x0000)
struct VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000008, "Wrong alignment on VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext");
static_assert(sizeof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000010, "Wrong size on VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext");
static_assert(offsetof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext, RetVal) == 0x000008, "Member 'VerseQuery_core_entity_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery_null_query_iterator._L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid
// 0x0002 (0x0002 - 0x0000)
struct VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000001, "Wrong alignment on VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid");
static_assert(sizeof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000002, "Wrong size on VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid");
static_assert(offsetof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_null_query_iterator._L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext
// 0x0010 (0x0010 - 0x0000)
struct VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_core_entity*, true>   RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000008, "Wrong alignment on VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext");
static_assert(sizeof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000010, "Wrong size on VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext");
static_assert(offsetof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext, RetVal) == 0x000008, "Member 'VerseQuery_null_query_iterator__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery_query_volume_box.$InitCDO
// 0x0260 (0x0260 - 0x0000)
struct VerseQuery_query_volume_box__InitCDO final
{
public:
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0018(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_5;                                     // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_6;                                // 0x00B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_10;                                    // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_11;                               // 0x0148(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x0198(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_15;                                    // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_16;                               // 0x01E0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_18;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_query_volume_box__InitCDO) == 0x000008, "Wrong alignment on VerseQuery_query_volume_box__InitCDO");
static_assert(sizeof(VerseQuery_query_volume_box__InitCDO) == 0x000260, "Wrong size on VerseQuery_query_volume_box__InitCDO");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_0) == 0x000000, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResultStack_1) == 0x000018, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResultStack_1' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_2) == 0x000068, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_3) == 0x000078, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_4) == 0x000088, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_5) == 0x000098, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_5' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResultStack_6) == 0x0000B0, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResultStack_6' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_7) == 0x000100, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_7' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_8) == 0x000110, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_8' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_9) == 0x000120, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_9' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_10) == 0x000130, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResultStack_11) == 0x000148, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResultStack_11' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_12) == 0x000198, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_12' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_13) == 0x0001A8, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_13' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_14) == 0x0001B8, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_14' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_15) == 0x0001C8, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_15' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResultStack_16) == 0x0001E0, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResultStack_16' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_17) == 0x000230, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_17' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_18) == 0x000240, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_18' has a wrong offset!");
static_assert(offsetof(VerseQuery_query_volume_box__InitCDO, _ExprResult_19) == 0x000250, "Member 'VerseQuery_query_volume_box__InitCDO::_ExprResult_19' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__InitCDO final
{
public:
	class UTags_tag_container*                    _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             _ExprResult_2;                                     // 0x0010(0x0010)()
	class UTags_tag_container*                    _ExprResult_3;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             _ExprResult_5;                                     // 0x0030(0x0010)()
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__InitCDO) == 0x000008, "Wrong alignment on VerseQuery_tag_container_core_entity_component__InitCDO");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__InitCDO) == 0x000040, "Wrong size on VerseQuery_tag_container_core_entity_component__InitCDO");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__InitCDO, _ExprResult_0) == 0x000000, "Member 'VerseQuery_tag_container_core_entity_component__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__InitCDO, _InstancingGraph_1) == 0x000008, "Member 'VerseQuery_tag_container_core_entity_component__InitCDO::_InstancingGraph_1' has a wrong offset!");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__InitCDO, _ExprResult_2) == 0x000010, "Member 'VerseQuery_tag_container_core_entity_component__InitCDO::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__InitCDO, _ExprResult_3) == 0x000020, "Member 'VerseQuery_tag_container_core_entity_component__InitCDO::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__InitCDO, _InstancingGraph_4) == 0x000028, "Member 'VerseQuery_tag_container_core_entity_component__InitCDO::_InstancingGraph_4' has a wrong offset!");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__InitCDO, _ExprResult_5) == 0x000030, "Member 'VerseQuery_tag_container_core_entity_component__InitCDO::_ExprResult_5' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld
// 0x0001 (0x0001 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld) == 0x000001, "Wrong alignment on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld) == 0x000001, "Wrong size on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RAddedToWorld::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld
// 0x0001 (0x0001 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld) == 0x000001, "Wrong alignment on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld) == 0x000001, "Wrong size on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcore__entity__component_N_RRemovingFromWorld::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component._L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R
// 0x0008 (0x0008 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R) == 0x000008, "Wrong alignment on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R) == 0x000008, "Wrong size on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RAddTag_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component._L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags
// 0x0010 (0x0010 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags final
{
public:
	struct VerseQuery_0::Ftuple_L_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTags_tag_container*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags) == 0x000008, "Wrong alignment on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags) == 0x000010, "Wrong size on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags, RetVal) == 0x000008, "Member 'VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RGetTags::RetVal' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component._L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R) == 0x000008, "Wrong alignment on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R) == 0x000010, "Wrong size on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R");
static_assert(offsetof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RRemoveTag_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseQuery.VerseQuery_tag_container_core_entity_component._L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R) == 0x000008, "Wrong alignment on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R");
static_assert(sizeof(VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R) == 0x000008, "Wrong size on VerseQuery_tag_container_core_entity_component__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__container__core__entity__component_N_RSetTags_L_Ntag__container_R");
