#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNPC

#include "Basic.hpp"

#include "FortniteAI_structs.hpp"


namespace SDK::Params
{

// Function VerseNPC.NPCPerceptionComponentBase.OnBotControllerAlertLevelChanged
// 0x0010 (0x0010 - 0x0000)
struct NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged final
{
public:
	class AFortAthenaAIBotController*             BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   OldAlertLevel;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   NewAlertLevel;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged) == 0x000008, "Wrong alignment on NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged");
static_assert(sizeof(NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged) == 0x000010, "Wrong size on NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged");
static_assert(offsetof(NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged, BotController) == 0x000000, "Member 'NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged::BotController' has a wrong offset!");
static_assert(offsetof(NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged, OldAlertLevel) == 0x000008, "Member 'NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged::OldAlertLevel' has a wrong offset!");
static_assert(offsetof(NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged, NewAlertLevel) == 0x000009, "Member 'NPCPerceptionComponentBase_OnBotControllerAlertLevelChanged::NewAlertLevel' has a wrong offset!");

}

