#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseUI

#include "Basic.hpp"

#include "EntityActor_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseUI.VersePlayerUIEntityComponent
// 0x0008 (0x00D8 - 0x00D0)
class UVersePlayerUIEntityComponent : public UEntityActorPlayerComponent
{
public:
	class UUIFrameworkPlayerComponent*            UIFComponent;                                      // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VersePlayerUIEntityComponent">();
	}
	static class UVersePlayerUIEntityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVersePlayerUIEntityComponent>();
	}
};
static_assert(alignof(UVersePlayerUIEntityComponent) == 0x000008, "Wrong alignment on UVersePlayerUIEntityComponent");
static_assert(sizeof(UVersePlayerUIEntityComponent) == 0x0000D8, "Wrong size on UVersePlayerUIEntityComponent");
static_assert(offsetof(UVersePlayerUIEntityComponent, UIFComponent) == 0x0000D0, "Member 'UVersePlayerUIEntityComponent::UIFComponent' has a wrong offset!");

// Class VerseUI.VerseWidgetNativeBase
// 0x0010 (0x0038 - 0x0028)
class UVerseWidgetNativeBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIFrameworkWidget*                     UIFWidgetInstance;                                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseWidgetNativeBase">();
	}
	static class UVerseWidgetNativeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseWidgetNativeBase>();
	}
};
static_assert(alignof(UVerseWidgetNativeBase) == 0x000008, "Wrong alignment on UVerseWidgetNativeBase");
static_assert(sizeof(UVerseWidgetNativeBase) == 0x000038, "Wrong size on UVerseWidgetNativeBase");
static_assert(offsetof(UVerseWidgetNativeBase, UIFWidgetInstance) == 0x000030, "Member 'UVerseWidgetNativeBase::UIFWidgetInstance' has a wrong offset!");

// Class VerseUI.VerseUIWorldSubsystem
// 0x00A0 (0x00D0 - 0x0030)
class UVerseUIWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseUIWorldSubsystem">();
	}
	static class UVerseUIWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseUIWorldSubsystem>();
	}
};
static_assert(alignof(UVerseUIWorldSubsystem) == 0x000008, "Wrong alignment on UVerseUIWorldSubsystem");
static_assert(sizeof(UVerseUIWorldSubsystem) == 0x0000D0, "Wrong size on UVerseUIWorldSubsystem");

}

