#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseDevices.ScriptDevice.BP_SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct ScriptDevice_BP_SetVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScriptDevice_BP_SetVisibility) == 0x000001, "Wrong alignment on ScriptDevice_BP_SetVisibility");
static_assert(sizeof(ScriptDevice_BP_SetVisibility) == 0x000001, "Wrong size on ScriptDevice_BP_SetVisibility");
static_assert(offsetof(ScriptDevice_BP_SetVisibility, bVisible) == 0x000000, "Member 'ScriptDevice_BP_SetVisibility::bVisible' has a wrong offset!");

// Function VerseDevices.ScriptDevice.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptDevice_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScriptDevice_SetEnabled) == 0x000001, "Wrong alignment on ScriptDevice_SetEnabled");
static_assert(sizeof(ScriptDevice_SetEnabled) == 0x000001, "Wrong size on ScriptDevice_SetEnabled");
static_assert(offsetof(ScriptDevice_SetEnabled, bInEnabled) == 0x000000, "Member 'ScriptDevice_SetEnabled::bInEnabled' has a wrong offset!");

}

