#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAIBase

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function VerseAIBase.AIPerceptionComponentBase.NotifyTargetPerceptionForgotten
// 0x0008 (0x0008 - 0x0000)
struct AIPerceptionComponentBase_NotifyTargetPerceptionForgotten final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIPerceptionComponentBase_NotifyTargetPerceptionForgotten) == 0x000008, "Wrong alignment on AIPerceptionComponentBase_NotifyTargetPerceptionForgotten");
static_assert(sizeof(AIPerceptionComponentBase_NotifyTargetPerceptionForgotten) == 0x000008, "Wrong size on AIPerceptionComponentBase_NotifyTargetPerceptionForgotten");
static_assert(offsetof(AIPerceptionComponentBase_NotifyTargetPerceptionForgotten, Actor) == 0x000000, "Member 'AIPerceptionComponentBase_NotifyTargetPerceptionForgotten::Actor' has a wrong offset!");

// Function VerseAIBase.AIPerceptionComponentBase.NotifyTargetPerceptionUpdated
// 0x0058 (0x0058 - 0x0000)
struct AIPerceptionComponentBase_NotifyTargetPerceptionUpdated final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x0050)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIPerceptionComponentBase_NotifyTargetPerceptionUpdated) == 0x000008, "Wrong alignment on AIPerceptionComponentBase_NotifyTargetPerceptionUpdated");
static_assert(sizeof(AIPerceptionComponentBase_NotifyTargetPerceptionUpdated) == 0x000058, "Wrong size on AIPerceptionComponentBase_NotifyTargetPerceptionUpdated");
static_assert(offsetof(AIPerceptionComponentBase_NotifyTargetPerceptionUpdated, Actor) == 0x000000, "Member 'AIPerceptionComponentBase_NotifyTargetPerceptionUpdated::Actor' has a wrong offset!");
static_assert(offsetof(AIPerceptionComponentBase_NotifyTargetPerceptionUpdated, Stimulus) == 0x000008, "Member 'AIPerceptionComponentBase_NotifyTargetPerceptionUpdated::Stimulus' has a wrong offset!");

// Function VerseAIBase.NPCBehaviorScriptComponent.GetBehaviorScript
// 0x0008 (0x0008 - 0x0000)
struct NPCBehaviorScriptComponent_GetBehaviorScript final
{
public:
	class UNPCBehaviorScript*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NPCBehaviorScriptComponent_GetBehaviorScript) == 0x000008, "Wrong alignment on NPCBehaviorScriptComponent_GetBehaviorScript");
static_assert(sizeof(NPCBehaviorScriptComponent_GetBehaviorScript) == 0x000008, "Wrong size on NPCBehaviorScriptComponent_GetBehaviorScript");
static_assert(offsetof(NPCBehaviorScriptComponent_GetBehaviorScript, ReturnValue) == 0x000000, "Member 'NPCBehaviorScriptComponent_GetBehaviorScript::ReturnValue' has a wrong offset!");

}

