#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseAssets_0_classes.hpp"
#include "VerseDevices_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseDevices_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseColors_structs.hpp"
#include "VerseConcurrency_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseClass VerseDevices.Devices_function_parameter_base
// 0x0000 (0x0028 - 0x0028)
class UDevices_function_parameter_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_base">();
	}
	static class UDevices_function_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_base>();
	}
};
static_assert(alignof(UDevices_function_parameter_base) == 0x000008, "Wrong alignment on UDevices_function_parameter_base");
static_assert(sizeof(UDevices_function_parameter_base) == 0x000028, "Wrong size on UDevices_function_parameter_base");

// VerseClass VerseDevices.Devices_function_parameter_vector3
// 0x0018 (0x0040 - 0x0028)
class UDevices_function_parameter_vector3 final : public UDevices_function_parameter_base
{
public:
	struct FSpatialMath_vector3                   __verse_0x31A8F10C_Value;                          // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_vector3">();
	}
	static class UDevices_function_parameter_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_vector3>();
	}
};
static_assert(alignof(UDevices_function_parameter_vector3) == 0x000008, "Wrong alignment on UDevices_function_parameter_vector3");
static_assert(sizeof(UDevices_function_parameter_vector3) == 0x000040, "Wrong size on UDevices_function_parameter_vector3");
static_assert(offsetof(UDevices_function_parameter_vector3, __verse_0x31A8F10C_Value) == 0x000028, "Member 'UDevices_function_parameter_vector3::__verse_0x31A8F10C_Value' has a wrong offset!");

// VerseClass VerseDevices.Devices_CreativeAnimation
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation final : public UObject
{
public:
	static struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__movable__object__base_R(class UVerseMovableObjectBase* __verse_0xB2CDDD72_Argument);
	static TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_Factory();
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_Factory();
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation">();
	}
	static class UDevices_CreativeAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation");
static_assert(sizeof(UDevices_CreativeAnimation) == 0x000028, "Wrong size on UDevices_CreativeAnimation");

// VerseClass VerseDevices.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseDevices_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseDevices.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseDevices_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseDevices_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseDevices_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseDevices_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseDevices_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseDevices_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseDevices.Devices_creative_object
// 0x0050 (0x0110 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x10) UDevices_creative_object : public UVerseCreativeObject
{
public:
	FVerseFunctionProperty_                       __verse_0x5139375F__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A483613__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Ntransform_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object">();
	}
	static class UDevices_creative_object* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object>();
	}
};
#pragma pack(pop)
static_assert(alignof(UDevices_creative_object) == 0x000010, "Wrong alignment on UDevices_creative_object");
static_assert(sizeof(UDevices_creative_object) == 0x000110, "Wrong size on UDevices_creative_object");
static_assert(offsetof(UDevices_creative_object, __verse_0x5139375F__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R) == 0x0000B8, "Member 'UDevices_creative_object::__verse_0x5139375F__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_object, __verse_0x0A483613__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R) == 0x0000C8, "Member 'UDevices_creative_object::__verse_0x0A483613__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_object, __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R) == 0x0000D8, "Member 'UDevices_creative_object::__verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_object, __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R) == 0x0000E8, "Member 'UDevices_creative_object::__verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_object, __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x0000F8, "Member 'UDevices_creative_object::__verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_prop
// 0x0070 (0x0180 - 0x0110)
class UDevices_creative_prop final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0xC4FF6975__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7DCCC181__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6E31A773__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x60EB84F3__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x909F40CD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lmaterial_M_QIndex_Nint_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R(class UAssets_mesh* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop">();
	}
	static class UDevices_creative_prop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop>();
	}
};
static_assert(alignof(UDevices_creative_prop) == 0x000010, "Wrong alignment on UDevices_creative_prop");
static_assert(sizeof(UDevices_creative_prop) == 0x000180, "Wrong size on UDevices_creative_prop");
static_assert(offsetof(UDevices_creative_prop, __verse_0xC4FF6975__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R) == 0x000108, "Member 'UDevices_creative_prop::__verse_0xC4FF6975__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x7DCCC181__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R) == 0x000118, "Member 'UDevices_creative_prop::__verse_0x7DCCC181__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x6E31A773__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow) == 0x000128, "Member 'UDevices_creative_prop::__verse_0x6E31A773__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x60EB84F3__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide) == 0x000138, "Member 'UDevices_creative_prop::__verse_0x60EB84F3__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x909F40CD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden) == 0x000148, "Member 'UDevices_creative_prop::__verse_0x909F40CD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid) == 0x000158, "Member 'UDevices_creative_prop::__verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose) == 0x000168, "Member 'UDevices_creative_prop::__verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_get_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_get_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_base">();
	}
	static class UDevices_device_function_get_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_base>();
	}
};
static_assert(alignof(UDevices_device_function_get_base) == 0x000008, "Wrong alignment on UDevices_device_function_get_base");
static_assert(sizeof(UDevices_device_function_get_base) == 0x000038, "Wrong size on UDevices_device_function_get_base");
static_assert(offsetof(UDevices_device_function_get_base, __verse_0xF8B4D924_FunctionName) == 0x000028, "Member 'UDevices_device_function_get_base::__verse_0xF8B4D924_FunctionName' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_get_agent
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_agent final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x2376EEDD__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_agent">();
	}
	static class UDevices_device_function_get_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_agent>();
	}
};
static_assert(alignof(UDevices_device_function_get_agent) == 0x000008, "Wrong alignment on UDevices_device_function_get_agent");
static_assert(sizeof(UDevices_device_function_get_agent) == 0x000048, "Wrong size on UDevices_device_function_get_agent");
static_assert(offsetof(UDevices_device_function_get_agent, __verse_0x2376EEDD__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke) == 0x000038, "Member 'UDevices_device_function_get_agent::__verse_0x2376EEDD__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke' has a wrong offset!");

// VerseClass VerseDevices.Devices_CreativeAnimation_InterpolationTypes
// 0x00A0 (0x00C8 - 0x0028)
class UDevices_CreativeAnimation_InterpolationTypes final : public UObject
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9B27EB9D_Linear;                         // 0x0028(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9CD14C25_Ease;                           // 0x0048(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xB345298C_EaseIn;                         // 0x0068(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xF59E2BD2_EaseOut;                        // 0x0088(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x29A389AE_EaseInOut;                      // 0x00A8(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_InterpolationTypes">();
	}
	static class UDevices_CreativeAnimation_InterpolationTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_InterpolationTypes>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation_InterpolationTypes) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation_InterpolationTypes");
static_assert(sizeof(UDevices_CreativeAnimation_InterpolationTypes) == 0x0000C8, "Wrong size on UDevices_CreativeAnimation_InterpolationTypes");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0x9B27EB9D_Linear) == 0x000028, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0x9B27EB9D_Linear' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0x9CD14C25_Ease) == 0x000048, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0x9CD14C25_Ease' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0xB345298C_EaseIn) == 0x000068, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0xB345298C_EaseIn' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0xF59E2BD2_EaseOut) == 0x000088, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0xF59E2BD2_EaseOut' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0x29A389AE_EaseInOut) == 0x0000A8, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0x29A389AE_EaseInOut' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_event
// 0x0060 (0x0088 - 0x0028)
class UDevices_device_event : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x21011A72_EventName;                      // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_58[0x30];                                      // 0x0058(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event">();
	}
	static class UDevices_device_event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event>();
	}
};
static_assert(alignof(UDevices_device_event) == 0x000008, "Wrong alignment on UDevices_device_event");
static_assert(sizeof(UDevices_device_event) == 0x000088, "Wrong size on UDevices_device_event");
static_assert(offsetof(UDevices_device_event, __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R) == 0x000028, "Member 'UDevices_device_event::__verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R' has a wrong offset!");
static_assert(offsetof(UDevices_device_event, __verse_0x8DE7DBE5_Await) == 0x000038, "Member 'UDevices_device_event::__verse_0x8DE7DBE5_Await' has a wrong offset!");
static_assert(offsetof(UDevices_device_event, __verse_0x21011A72_EventName) == 0x000048, "Member 'UDevices_device_event::__verse_0x21011A72_EventName' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_event_ai_interaction
// 0x0020 (0x00A8 - 0x0088)
class UDevices_device_event_ai_interaction final : public UDevices_device_event
{
public:
	FVerseStringProperty_                         __verse_0x6C9F60BB_SourceName;                     // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF6220969_TargetName;                     // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class Utask* Await(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_ai_interaction">();
	}
	static class UDevices_device_event_ai_interaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_ai_interaction>();
	}
};
static_assert(alignof(UDevices_device_event_ai_interaction) == 0x000008, "Wrong alignment on UDevices_device_event_ai_interaction");
static_assert(sizeof(UDevices_device_event_ai_interaction) == 0x0000A8, "Wrong size on UDevices_device_event_ai_interaction");
static_assert(offsetof(UDevices_device_event_ai_interaction, __verse_0x6C9F60BB_SourceName) == 0x000088, "Member 'UDevices_device_event_ai_interaction::__verse_0x6C9F60BB_SourceName' has a wrong offset!");
static_assert(offsetof(UDevices_device_event_ai_interaction, __verse_0xF6220969_TargetName) == 0x000098, "Member 'UDevices_device_event_ai_interaction::__verse_0xF6220969_TargetName' has a wrong offset!");

// VerseClass VerseDevices.Devices
// 0x0008 (0x0030 - 0x0028)
class UDevices final : public UObject
{
public:
	class UDevices_creative_prop_asset*           __verse_0x88F30926_DefaultCreativePropAsset;       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R(class UTags_tag_search_criteria* __verse_0xB2CDDD72_Argument);
	static EDevices_move_to_result _L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_RHandleTeleportToResult_L_Nteleport__to__result_R(EDevices_teleport_to_result __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UEntityQueryManager* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetQueryManagerFromObject_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FSpatialMath_transform _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& __verse_0xB2CDDD72_Argument);
	static EDevices_teleport_to_result _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Ntransform_R(const struct Ftuple_Lcreative__prop__asset_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lcreative__prop__asset_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_Factory();
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static class Utask* operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class Utask* operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class Utask* operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices">();
	}
	static class UDevices* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices>();
	}
};
static_assert(alignof(UDevices) == 0x000008, "Wrong alignment on UDevices");
static_assert(sizeof(UDevices) == 0x000030, "Wrong size on UDevices");
static_assert(offsetof(UDevices, __verse_0x88F30926_DefaultCreativePropAsset) == 0x000028, "Member 'UDevices::__verse_0x88F30926_DefaultCreativePropAsset' has a wrong offset!");

// VerseClass VerseDevices.task_Devices_creative_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0230 (0x0380 - 0x0150)
class Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final : public Utask
{
public:
	class UDevices_creative_device*               _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lvector3_Mrotation_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0050)(Parm, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x01B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  _AsyncTask_0;                                      // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x01C0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R _ExprResult_2;                                     // 0x01D0(0x0060)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x0230(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_231[0xF];                                      // 0x0231(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lvector3_Mrotation_Mfloat_R     _ExprResult_4;                                     // 0x0240(0x0050)(HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_6;                                      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_7;                                 // 0x02A0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R _ExprResult_8;                                     // 0x02B0(0x0060)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_9;                                     // 0x0310(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_311[0xF];                                      // 0x0311(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lvector3_Mrotation_Mfloat_R     _ExprResult_10;                                    // 0x0320(0x0050)(HasGetValueTypeHash)
	int64                                         _AsyncResult_11;                                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices_creative_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R">();
	}
	static class Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R>();
	}
};
static_assert(alignof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R) == 0x000010, "Wrong alignment on Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R");
static_assert(sizeof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R) == 0x000380, "Wrong size on Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _Self) == 0x000150, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000160, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _RetVal) == 0x0001B0, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_RetVal' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _AsyncTask_0) == 0x0001B8, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_AsyncTask_0' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _AsyncTaskClass_1) == 0x0001C0, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_AsyncTaskClass_1' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _ExprResult_2) == 0x0001D0, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _ExprResult_3) == 0x000230, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _ExprResult_4) == 0x000240, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _AsyncResult_5) == 0x000290, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_AsyncResult_5' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _AsyncTask_6) == 0x000298, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_AsyncTask_6' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _AsyncTaskClass_7) == 0x0002A0, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_AsyncTaskClass_7' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _ExprResult_8) == 0x0002B0, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_ExprResult_8' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _ExprResult_9) == 0x000310, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_ExprResult_9' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _ExprResult_10) == 0x000320, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R, _AsyncResult_11) == 0x000370, "Member 'Utask_Devices_creative_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R::_AsyncResult_11' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_get_int
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_int final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x5F417C53__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_int">();
	}
	static class UDevices_device_function_get_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_int>();
	}
};
static_assert(alignof(UDevices_device_function_get_int) == 0x000008, "Wrong alignment on UDevices_device_function_get_int");
static_assert(sizeof(UDevices_device_function_get_int) == 0x000048, "Wrong size on UDevices_device_function_get_int");
static_assert(offsetof(UDevices_device_function_get_int, __verse_0x5F417C53__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke) == 0x000038, "Member 'UDevices_device_function_get_int::__verse_0x5F417C53__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_object_interface
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_object_interface final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object_interface">();
	}
	static class UDevices_creative_object_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object_interface>();
	}
};
static_assert(alignof(UDevices_creative_object_interface) == 0x000008, "Wrong alignment on UDevices_creative_object_interface");
static_assert(sizeof(UDevices_creative_object_interface) == 0x000028, "Wrong size on UDevices_creative_object_interface");

// VerseClass VerseDevices.Devices_function_parameter_logic
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_logic final : public UDevices_function_parameter_base
{
public:
	uint8                                         __verse_0x31A8F10C_Value : 1;                      // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_logic">();
	}
	static class UDevices_function_parameter_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_logic>();
	}
};
static_assert(alignof(UDevices_function_parameter_logic) == 0x000008, "Wrong alignment on UDevices_function_parameter_logic");
static_assert(sizeof(UDevices_function_parameter_logic) == 0x000030, "Wrong size on UDevices_function_parameter_logic");

// VerseClass VerseDevices.Devices_creative_device
// 0x0090 (0x0150 - 0x00C0)
class UDevices_creative_device final : public UVerseCreativeDevice
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0AA415A9__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x826ED8B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x592F1135__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57F532B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Ntransform_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class Utask* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class Utask* OnBegin(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device">();
	}
	static class UDevices_creative_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device>();
	}
};
static_assert(alignof(UDevices_creative_device) == 0x000010, "Wrong alignment on UDevices_creative_device");
static_assert(sizeof(UDevices_creative_device) == 0x000150, "Wrong size on UDevices_creative_device");
static_assert(offsetof(UDevices_creative_device, __verse_0x1F792AAA_OnBegin) == 0x0000B8, "Member 'UDevices_creative_device::__verse_0x1F792AAA_OnBegin' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd) == 0x0000C8, "Member 'UDevices_creative_device::__verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x0AA415A9__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R) == 0x0000D8, "Member 'UDevices_creative_device::__verse_0x0AA415A9__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x826ED8B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R) == 0x0000E8, "Member 'UDevices_creative_device::__verse_0x826ED8B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R) == 0x0000F8, "Member 'UDevices_creative_device::__verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R) == 0x000108, "Member 'UDevices_creative_device::__verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x592F1135__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow) == 0x000118, "Member 'UDevices_creative_device::__verse_0x592F1135__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x57F532B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide) == 0x000128, "Member 'UDevices_creative_device::__verse_0x57F532B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x000138, "Member 'UDevices_creative_device::__verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_set_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_set_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_base">();
	}
	static class UDevices_device_function_set_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_base>();
	}
};
static_assert(alignof(UDevices_device_function_set_base) == 0x000008, "Wrong alignment on UDevices_device_function_set_base");
static_assert(sizeof(UDevices_device_function_set_base) == 0x000038, "Wrong size on UDevices_device_function_set_base");
static_assert(offsetof(UDevices_device_function_set_base, __verse_0xF8B4D924_FunctionName) == 0x000028, "Member 'UDevices_device_function_set_base::__verse_0xF8B4D924_FunctionName' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_set_message
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_message final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0xEE3C8C22__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_message">();
	}
	static class UDevices_device_function_set_message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_message>();
	}
};
static_assert(alignof(UDevices_device_function_set_message) == 0x000008, "Wrong alignment on UDevices_device_function_set_message");
static_assert(sizeof(UDevices_device_function_set_message) == 0x000048, "Wrong size on UDevices_device_function_set_message");
static_assert(offsetof(UDevices_device_function_set_message, __verse_0xEE3C8C22__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R) == 0x000038, "Member 'UDevices_device_function_set_message::__verse_0xEE3C8C22__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_set_multi_parameter_base
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_multi_parameter_base : public UDevices_device_function_set_base
{
public:
	TOptional<class UClass*>                      __verse_0xBF5FC553_ReturnType;                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_multi_parameter_base">();
	}
	static class UDevices_device_function_set_multi_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_multi_parameter_base>();
	}
};
static_assert(alignof(UDevices_device_function_set_multi_parameter_base) == 0x000008, "Wrong alignment on UDevices_device_function_set_multi_parameter_base");
static_assert(sizeof(UDevices_device_function_set_multi_parameter_base) == 0x000048, "Wrong size on UDevices_device_function_set_multi_parameter_base");
static_assert(offsetof(UDevices_device_function_set_multi_parameter_base, __verse_0xBF5FC553_ReturnType) == 0x000038, "Member 'UDevices_device_function_set_multi_parameter_base::__verse_0xBF5FC553_ReturnType' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_set_params_by_type
// 0x0020 (0x0068 - 0x0048)
class UDevices_device_function_set_params_by_type : public UDevices_device_function_set_multi_parameter_base
{
public:
	FVerseFunctionProperty_                       __verse_0x59B457FF__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type_N_RInvoke_L_N_Kfunction__parameter__base_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         __verse_0x8F623C81_ParameterTypes;                 // 0x0058(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UDevices_function_parameter_base*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type_N_RInvoke_L_N_Kfunction__parameter__base_R(const TArray<class UDevices_function_parameter_base*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_params_by_type">();
	}
	static class UDevices_device_function_set_params_by_type* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_params_by_type>();
	}
};
static_assert(alignof(UDevices_device_function_set_params_by_type) == 0x000008, "Wrong alignment on UDevices_device_function_set_params_by_type");
static_assert(sizeof(UDevices_device_function_set_params_by_type) == 0x000068, "Wrong size on UDevices_device_function_set_params_by_type");
static_assert(offsetof(UDevices_device_function_set_params_by_type, __verse_0x59B457FF__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type_N_RInvoke_L_N_Kfunction__parameter__base_R) == 0x000048, "Member 'UDevices_device_function_set_params_by_type::__verse_0x59B457FF__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__type_N_RInvoke_L_N_Kfunction__parameter__base_R' has a wrong offset!");
static_assert(offsetof(UDevices_device_function_set_params_by_type, __verse_0x8F623C81_ParameterTypes) == 0x000058, "Member 'UDevices_device_function_set_params_by_type::__verse_0x8F623C81_ParameterTypes' has a wrong offset!");

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation_animation_controller_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller_debug_log">();
	}
	static class UDevices_CreativeAnimation_animation_controller_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller_debug_log>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation_animation_controller_debug_log) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation_animation_controller_debug_log");
static_assert(sizeof(UDevices_CreativeAnimation_animation_controller_debug_log) == 0x000028, "Wrong size on UDevices_CreativeAnimation_animation_controller_debug_log");

// VerseClass VerseDevices.Devices_creative_device_asset
// 0x0000 (0x00C8 - 0x00C8)
class UDevices_creative_device_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_asset">();
	}
	static class UDevices_creative_device_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_asset>();
	}
};
static_assert(alignof(UDevices_creative_device_asset) == 0x000008, "Wrong alignment on UDevices_creative_device_asset");
static_assert(sizeof(UDevices_creative_device_asset) == 0x0000C8, "Wrong size on UDevices_creative_device_asset");

// VerseClass VerseDevices.Devices_creative_device_base
// 0x0020 (0x0130 - 0x0110)
class UDevices_creative_device_base final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0x0182371F__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E46A055__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_base">();
	}
	static class UDevices_creative_device_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_base>();
	}
};
static_assert(alignof(UDevices_creative_device_base) == 0x000010, "Wrong alignment on UDevices_creative_device_base");
static_assert(sizeof(UDevices_creative_device_base) == 0x000130, "Wrong size on UDevices_creative_device_base");
static_assert(offsetof(UDevices_creative_device_base, __verse_0x0182371F__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal) == 0x000108, "Member 'UDevices_creative_device_base::__verse_0x0182371F__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device_base, __verse_0x1E46A055__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal) == 0x000118, "Member 'UDevices_creative_device_base::__verse_0x1E46A055__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal' has a wrong offset!");

// VerseClass VerseDevices.Devices_function_parameter_message
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_message final : public UDevices_function_parameter_base
{
public:
	TOptional<class UVerse_message*, true>        __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_message">();
	}
	static class UDevices_function_parameter_message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_message>();
	}
};
static_assert(alignof(UDevices_function_parameter_message) == 0x000008, "Wrong alignment on UDevices_function_parameter_message");
static_assert(sizeof(UDevices_function_parameter_message) == 0x000030, "Wrong size on UDevices_function_parameter_message");
static_assert(offsetof(UDevices_function_parameter_message, __verse_0x31A8F10C_Value) == 0x000028, "Member 'UDevices_function_parameter_message::__verse_0x31A8F10C_Value' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_prop_asset
// 0x0000 (0x0090 - 0x0090)
class UDevices_creative_prop_asset final : public UVerseCreativePropAsset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_asset">();
	}
	static class UDevices_creative_prop_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_asset>();
	}
};
static_assert(alignof(UDevices_creative_prop_asset) == 0x000008, "Wrong alignment on UDevices_creative_prop_asset");
static_assert(sizeof(UDevices_creative_prop_asset) == 0x000090, "Wrong size on UDevices_creative_prop_asset");

// VerseClass VerseDevices.Devices_function_parameter_agent
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_agent final : public UDevices_function_parameter_base
{
public:
	TOptional<class USimulation_agent*, true>     __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_agent">();
	}
	static class UDevices_function_parameter_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_agent>();
	}
};
static_assert(alignof(UDevices_function_parameter_agent) == 0x000008, "Wrong alignment on UDevices_function_parameter_agent");
static_assert(sizeof(UDevices_function_parameter_agent) == 0x000030, "Wrong size on UDevices_function_parameter_agent");
static_assert(offsetof(UDevices_function_parameter_agent, __verse_0x31A8F10C_Value) == 0x000028, "Member 'UDevices_function_parameter_agent::__verse_0x31A8F10C_Value' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_prop_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_prop_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
