#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseFortnite_classes.hpp"
#include "VerseAssets_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseConcurrency_classes.hpp"


namespace SDK
{

// VerseClass VerseFortnite.Characters_fort_character
// 0x0000 (0x0028 - 0x0028)
class UCharacters_fort_character final : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R(const struct FCharacters_stasis_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Characters_fort_character">();
	}
	static class UCharacters_fort_character* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacters_fort_character>();
	}
};
static_assert(alignof(UCharacters_fort_character) == 0x000008, "Wrong alignment on UCharacters_fort_character");
static_assert(sizeof(UCharacters_fort_character) == 0x000028, "Wrong size on UCharacters_fort_character");

// VerseClass VerseFortnite.AI
// 0x0000 (0x0028 - 0x0028)
class UAI final : public UObject
{
public:
	static void _L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UAI_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static void _L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Ntarget__info_R(const struct FAI_target_info& __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UAI_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static void _L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UAI_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetEmoteInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetGuardPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetLastKnownPosition_U_L_Ntarget__info_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UAI_npc_behavior*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNPCBehavior_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetPerception_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FAI_target_info AI_target_info_Factory();
	static struct FAI_target_info AI_target_info_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI">();
	}
	static class UAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI>();
	}
};
static_assert(alignof(UAI) == 0x000008, "Wrong alignment on UAI");
static_assert(sizeof(UAI) == 0x000028, "Wrong size on UAI");

// VerseClass VerseFortnite.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseFortnite_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFortnite.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortnite_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortnite_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseFortnite_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseFortnite_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseFortnite_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseFortnite_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseFortnite.AI_damage_perception_settings
// 0x0010 (0x0038 - 0x0028)
class UAI_damage_perception_settings final : public UObject
{
public:
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_damage_perception_settings">();
	}
	static class UAI_damage_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_damage_perception_settings>();
	}
};
static_assert(alignof(UAI_damage_perception_settings) == 0x000008, "Wrong alignment on UAI_damage_perception_settings");
static_assert(sizeof(UAI_damage_perception_settings) == 0x000038, "Wrong size on UAI_damage_perception_settings");
static_assert(offsetof(UAI_damage_perception_settings, __verse_0x403FF374_MaxStimulusDuration) == 0x000028, "Member 'UAI_damage_perception_settings::__verse_0x403FF374_MaxStimulusDuration' has a wrong offset!");

// VerseClass VerseFortnite.Playspaces_fort_playspace
// 0x0000 (0x0028 - 0x0028)
class UPlayspaces_fort_playspace final : public UObject
{
public:
	TArray<class USimulation_player*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Playspaces_fort_playspace">();
	}
	static class UPlayspaces_fort_playspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaces_fort_playspace>();
	}
};
static_assert(alignof(UPlayspaces_fort_playspace) == 0x000008, "Wrong alignment on UPlayspaces_fort_playspace");
static_assert(sizeof(UPlayspaces_fort_playspace) == 0x000028, "Wrong size on UPlayspaces_fort_playspace");

// VerseClass VerseFortnite.AI_hearing_perception_settings
// 0x0018 (0x0040 - 0x0028)
class UAI_hearing_perception_settings final : public UObject
{
public:
	double                                        __verse_0xF825785F_HearingRange;                   // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0030(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_38_1 : 7;                                   // 0x0038(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6EFCE051_EnemiesDetected : 1;            // 0x0039(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_39_1 : 7;                                   // 0x0039(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x18648A9F_FriendliesDetected : 1;         // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_3A_1 : 7;                                   // 0x003A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x35B7560B_NeutralsDetected : 1;           // 0x003B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_hearing_perception_settings">();
	}
	static class UAI_hearing_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_hearing_perception_settings>();
	}
};
static_assert(alignof(UAI_hearing_perception_settings) == 0x000008, "Wrong alignment on UAI_hearing_perception_settings");
static_assert(sizeof(UAI_hearing_perception_settings) == 0x000040, "Wrong size on UAI_hearing_perception_settings");
static_assert(offsetof(UAI_hearing_perception_settings, __verse_0xF825785F_HearingRange) == 0x000028, "Member 'UAI_hearing_perception_settings::__verse_0xF825785F_HearingRange' has a wrong offset!");
static_assert(offsetof(UAI_hearing_perception_settings, __verse_0x403FF374_MaxStimulusDuration) == 0x000030, "Member 'UAI_hearing_perception_settings::__verse_0x403FF374_MaxStimulusDuration' has a wrong offset!");

// VerseClass VerseFortnite.AI_emote_interface
// 0x0000 (0x0028 - 0x0028)
class UAI_emote_interface final : public UObject
{
public:
	class Utask* PlayEmote_L_Nemote_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UAssets_emote* __verse_0xB2CDDD72_Argument);
	class Utask* PlayRandomEmote(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_emote_interface">();
	}
	static class UAI_emote_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_emote_interface>();
	}
};
static_assert(alignof(UAI_emote_interface) == 0x000008, "Wrong alignment on UAI_emote_interface");
static_assert(sizeof(UAI_emote_interface) == 0x000028, "Wrong size on UAI_emote_interface");

// VerseClass VerseFortnite.task_Animation_play_animation_controller_impl$PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0048 (0x0198 - 0x0150)
class Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R final : public Utask
{
public:
	class UAnimation_play_animation_controller_impl* _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct Ftuple_Lanimation__sequence_Mplay__animation__instance_Mlogic_Mfloat_Mfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0038)(Parm, HasGetValueTypeHash)
	EAnimation_PlayAnimation_play_animation_result _RetVal;                                           // 0x0190(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Animation_play_animation_controller_impl$PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R">();
	}
	static class Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R>();
	}
};
static_assert(alignof(Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000198, "Wrong size on Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R, _Self) == 0x000150, "Member 'Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R, _RetVal) == 0x000190, "Member 'Utask_Animation_play_animation_controller_impl_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R::_RetVal' has a wrong offset!");

// VerseClass VerseFortnite.AI_focus_interface
// 0x0000 (0x0028 - 0x0028)
class UAI_focus_interface final : public UObject
{
public:
	class Utask* MaintainFocus_L_Nagent_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class Utask* MaintainFocus_L_Nvector3_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_focus_interface">();
	}
	static class UAI_focus_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_focus_interface>();
	}
};
static_assert(alignof(UAI_focus_interface) == 0x000008, "Wrong alignment on UAI_focus_interface");
static_assert(sizeof(UAI_focus_interface) == 0x000028, "Wrong size on UAI_focus_interface");

// VerseClass VerseFortnite.AI_fort_leashable
// 0x0000 (0x0028 - 0x0028)
class UAI_fort_leashable final : public UObject
{
public:
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R(const struct VerseFortnite_0::Ftuple_Lagent_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R(const struct VerseFortnite_0::Ftuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_fort_leashable">();
	}
	static class UAI_fort_leashable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_fort_leashable>();
	}
};
static_assert(alignof(UAI_fort_leashable) == 0x000008, "Wrong alignment on UAI_fort_leashable");
static_assert(sizeof(UAI_fort_leashable) == 0x000028, "Wrong size on UAI_fort_leashable");

// VerseClass VerseFortnite.AI_guard_perception_interface
// 0x0000 (0x0028 - 0x0028)
class UAI_guard_perception_interface final : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RAlertLevelChangedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RCurrentTargetChangedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EAI_guard_alert_level _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetAlertLevel(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EAI_guard_alert_level _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetAlertLevel_L_Ntarget__info_R(const struct FAI_target_info& __verse_0xB2CDDD72_Argument);
	TOptional<struct FAI_target_info> _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetCurrentTargetInfo(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_damage_perception_settings* _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetDamageSettings_L_Nguard__alert__level_R(EAI_guard_alert_level __verse_0xB2CDDD72_Argument);
	class UAI_hearing_perception_settings* _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetHearingSettings_L_Nguard__alert__level_R(EAI_guard_alert_level __verse_0xB2CDDD72_Argument);
	class UAI_sight_perception_settings* _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetSightSettings_L_Nguard__alert__level_R(EAI_guard_alert_level __verse_0xB2CDDD72_Argument);
	class UAI_touch_perception_settings* _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RGetTouchSettings_L_Nguard__alert__level_R(EAI_guard_alert_level __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RSetDamageSettings_L_Nguard__alert__level_M_Ndamage__perception__settings_R(const struct VerseFortnite_0::Ftuple_Lguard__alert__level_Mdamage__perception__settings_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RSetHearingSettings_L_Nguard__alert__level_M_Nhearing__perception__settings_R(const struct VerseFortnite_0::Ftuple_Lguard__alert__level_Mhearing__perception__settings_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RSetSightSettings_L_Nguard__alert__level_M_Nsight__perception__settings_R(const struct VerseFortnite_0::Ftuple_Lguard__alert__level_Msight__perception__settings_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fguard__perception__interface_N_RSetTouchSettings_L_Nguard__alert__level_M_Ntouch__perception__settings_R(const struct VerseFortnite_0::Ftuple_Lguard__alert__level_Mtouch__perception__settings_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_guard_perception_interface">();
	}
	static class UAI_guard_perception_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_guard_perception_interface>();
	}
};
static_assert(alignof(UAI_guard_perception_interface) == 0x000008, "Wrong alignment on UAI_guard_perception_interface");
static_assert(sizeof(UAI_guard_perception_interface) == 0x000028, "Wrong size on UAI_guard_perception_interface");

// VerseClass VerseFortnite.AI_movement_type
// 0x0008 (0x0030 - 0x0028)
class UAI_movement_type final : public UObject
{
public:
	EAI_movement_style                            __verse_0x8A4A778B_MovementStyle;                  // 0x0028(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_movement_type">();
	}
	static class UAI_movement_type* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_movement_type>();
	}
};
static_assert(alignof(UAI_movement_type) == 0x000008, "Wrong alignment on UAI_movement_type");
static_assert(sizeof(UAI_movement_type) == 0x000030, "Wrong size on UAI_movement_type");
static_assert(offsetof(UAI_movement_type, __verse_0x8A4A778B_MovementStyle) == 0x000028, "Member 'UAI_movement_type::__verse_0x8A4A778B_MovementStyle' has a wrong offset!");

// VerseClass VerseFortnite.AI_movement_types
// 0x0010 (0x0038 - 0x0028)
class UAI_movement_types final : public UObject
{
public:
	class UAI_movement_type*                      __verse_0xA433B5E2_Walking;                        // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAI_movement_type*                      __verse_0x35702D43_Running;                        // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_movement_types">();
	}
	static class UAI_movement_types* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_movement_types>();
	}
};
static_assert(alignof(UAI_movement_types) == 0x000008, "Wrong alignment on UAI_movement_types");
static_assert(sizeof(UAI_movement_types) == 0x000038, "Wrong size on UAI_movement_types");
static_assert(offsetof(UAI_movement_types, __verse_0xA433B5E2_Walking) == 0x000028, "Member 'UAI_movement_types::__verse_0xA433B5E2_Walking' has a wrong offset!");
static_assert(offsetof(UAI_movement_types, __verse_0x35702D43_Running) == 0x000030, "Member 'UAI_movement_types::__verse_0x35702D43_Running' has a wrong offset!");

// VerseClass VerseFortnite.Assets_emote
// 0x0000 (0x00C8 - 0x00C8)
class UAssets_emote final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Assets_emote">();
	}
	static class UAssets_emote* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssets_emote>();
	}
};
static_assert(alignof(UAssets_emote) == 0x000008, "Wrong alignment on UAssets_emote");
static_assert(sizeof(UAssets_emote) == 0x0000C8, "Wrong size on UAssets_emote");

// VerseClass VerseFortnite.AI_navigatable
// 0x0000 (0x0028 - 0x0028)
class UAI_navigatable final : public UObject
{
public:
	TOptional<struct FSpatialMath_vector3> _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class Utask* Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, TOptional<double> __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_navigatable">();
	}
	static class UAI_navigatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_navigatable>();
	}
};
static_assert(alignof(UAI_navigatable) == 0x000008, "Wrong alignment on UAI_navigatable");
static_assert(sizeof(UAI_navigatable) == 0x000028, "Wrong size on UAI_navigatable");

// VerseClass VerseFortnite.AI_navigation_target
// 0x0020 (0x0048 - 0x0028)
class UAI_navigation_target final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_navigation_target">();
	}
	static class UAI_navigation_target* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_navigation_target>();
	}
};
static_assert(alignof(UAI_navigation_target) == 0x000008, "Wrong alignment on UAI_navigation_target");
static_assert(sizeof(UAI_navigation_target) == 0x000048, "Wrong size on UAI_navigation_target");

// VerseClass VerseFortnite.Vehicles_fort_vehicle
// 0x0000 (0x0028 - 0x0028)
class UVehicles_fort_vehicle final : public UObject
{
public:
	TArray<class UObject*> _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RGetPassengers(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInAir(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsInWater(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fVehicles_2ffort__vehicle_N_RIsOnGround(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vehicles_fort_vehicle">();
	}
	static class UVehicles_fort_vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicles_fort_vehicle>();
	}
};
static_assert(alignof(UVehicles_fort_vehicle) == 0x000008, "Wrong alignment on UVehicles_fort_vehicle");
static_assert(sizeof(UVehicles_fort_vehicle) == 0x000028, "Wrong size on UVehicles_fort_vehicle");

// VerseClass VerseFortnite.AI_npc_behavior
// 0x0058 (0x00C8 - 0x0070)
class UAI_npc_behavior : public UNPCBehaviorScript
{
public:
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x0080(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x19F0B2EF__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_ROnEnd; // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2956B03E__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetAgent; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetAgent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_ROnEnd(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utask* OnBegin(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_npc_behavior">();
	}
	static class UAI_npc_behavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_npc_behavior>();
	}
};
static_assert(alignof(UAI_npc_behavior) == 0x000008, "Wrong alignment on UAI_npc_behavior");
static_assert(sizeof(UAI_npc_behavior) == 0x0000C8, "Wrong size on UAI_npc_behavior");
static_assert(offsetof(UAI_npc_behavior, __verse_0x1F792AAA_OnBegin) == 0x000080, "Member 'UAI_npc_behavior::__verse_0x1F792AAA_OnBegin' has a wrong offset!");
static_assert(offsetof(UAI_npc_behavior, __verse_0x19F0B2EF__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_ROnEnd) == 0x000090, "Member 'UAI_npc_behavior::__verse_0x19F0B2EF__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_ROnEnd' has a wrong offset!");
static_assert(offsetof(UAI_npc_behavior, __verse_0x2956B03E__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetAgent) == 0x0000A0, "Member 'UAI_npc_behavior::__verse_0x2956B03E__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetAgent' has a wrong offset!");

// VerseClass VerseFortnite.task_AI_emote_interface$PlayEmote_L_Nemote_R
// 0x0018 (0x0168 - 0x0150)
class Utask_AI_emote_interface_PlayEmote_L_Nemote_R final : public Utask
{
public:
	class UAI_emote_interface*                    _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAssets_emote*                          __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAI_play_emote_result                         _RetVal;                                           // 0x0160(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_AI_emote_interface$PlayEmote_L_Nemote_R">();
	}
	static class Utask_AI_emote_interface_PlayEmote_L_Nemote_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_AI_emote_interface_PlayEmote_L_Nemote_R>();
	}
};
static_assert(alignof(Utask_AI_emote_interface_PlayEmote_L_Nemote_R) == 0x000008, "Wrong alignment on Utask_AI_emote_interface_PlayEmote_L_Nemote_R");
static_assert(sizeof(Utask_AI_emote_interface_PlayEmote_L_Nemote_R) == 0x000168, "Wrong size on Utask_AI_emote_interface_PlayEmote_L_Nemote_R");
static_assert(offsetof(Utask_AI_emote_interface_PlayEmote_L_Nemote_R, _Self) == 0x000150, "Member 'Utask_AI_emote_interface_PlayEmote_L_Nemote_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_AI_emote_interface_PlayEmote_L_Nemote_R, __verse_0xB2CDDD72_Argument) == 0x000158, "Member 'Utask_AI_emote_interface_PlayEmote_L_Nemote_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_AI_emote_interface_PlayEmote_L_Nemote_R, _RetVal) == 0x000160, "Member 'Utask_AI_emote_interface_PlayEmote_L_Nemote_R::_RetVal' has a wrong offset!");

// VerseClass VerseFortnite.AI_perception_interface
// 0x0000 (0x0028 - 0x0028)
class UAI_perception_interface final : public UObject
{
public:
	class UAI_damage_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDamageSettings(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FAI_target_info> _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTarget_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TArray<struct FAI_target_info> _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetDetectedTargets(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_hearing_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetHearingSettings(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_sight_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetSightSettings(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAI_touch_perception_settings* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RGetTouchSettings(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetDamageSettings_L_Ndamage__perception__settings_R(class UAI_damage_perception_settings* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetHearingSettings_L_Nhearing__perception__settings_R(class UAI_hearing_perception_settings* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetSightSettings_L_Nsight__perception__settings_R(class UAI_sight_perception_settings* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RSetTouchSettings_L_Ntouch__perception__settings_R(class UAI_touch_perception_settings* __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetAddedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetHeardEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetInfoUpdatedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetRemovedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetSeenEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fperception__interface_N_RTargetTouchedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_perception_interface">();
	}
	static class UAI_perception_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_perception_interface>();
	}
};
static_assert(alignof(UAI_perception_interface) == 0x000008, "Wrong alignment on UAI_perception_interface");
static_assert(sizeof(UAI_perception_interface) == 0x000028, "Wrong size on UAI_perception_interface");

// VerseClass VerseFortnite.AI_sight_perception_settings
// 0x0028 (0x0050 - 0x0028)
class UAI_sight_perception_settings final : public UObject
{
public:
	double                                        __verse_0xEFFE6BA9_SightRadius;                    // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x32B7E89E_LoseSightRadius;                // 0x0030(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4D74AFDD_PeripheralVisionAngle;          // 0x0038(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0040(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_48_1 : 7;                                   // 0x0048(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6EFCE051_EnemiesDetected : 1;            // 0x0049(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_49_1 : 7;                                   // 0x0049(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x18648A9F_FriendliesDetected : 1;         // 0x004A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_4A_1 : 7;                                   // 0x004A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x35B7560B_NeutralsDetected : 1;           // 0x004B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_sight_perception_settings">();
	}
	static class UAI_sight_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_sight_perception_settings>();
	}
};
static_assert(alignof(UAI_sight_perception_settings) == 0x000008, "Wrong alignment on UAI_sight_perception_settings");
static_assert(sizeof(UAI_sight_perception_settings) == 0x000050, "Wrong size on UAI_sight_perception_settings");
static_assert(offsetof(UAI_sight_perception_settings, __verse_0xEFFE6BA9_SightRadius) == 0x000028, "Member 'UAI_sight_perception_settings::__verse_0xEFFE6BA9_SightRadius' has a wrong offset!");
static_assert(offsetof(UAI_sight_perception_settings, __verse_0x32B7E89E_LoseSightRadius) == 0x000030, "Member 'UAI_sight_perception_settings::__verse_0x32B7E89E_LoseSightRadius' has a wrong offset!");
static_assert(offsetof(UAI_sight_perception_settings, __verse_0x4D74AFDD_PeripheralVisionAngle) == 0x000038, "Member 'UAI_sight_perception_settings::__verse_0x4D74AFDD_PeripheralVisionAngle' has a wrong offset!");
static_assert(offsetof(UAI_sight_perception_settings, __verse_0x403FF374_MaxStimulusDuration) == 0x000040, "Member 'UAI_sight_perception_settings::__verse_0x403FF374_MaxStimulusDuration' has a wrong offset!");

// VerseClass VerseFortnite.AI_touch_perception_settings
// 0x0010 (0x0038 - 0x0028)
class UAI_touch_perception_settings final : public UObject
{
public:
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_30_1 : 7;                                   // 0x0030(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6EFCE051_EnemiesDetected : 1;            // 0x0031(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_31_1 : 7;                                   // 0x0031(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x18648A9F_FriendliesDetected : 1;         // 0x0032(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_32_1 : 7;                                   // 0x0032(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x35B7560B_NeutralsDetected : 1;           // 0x0033(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_touch_perception_settings">();
	}
	static class UAI_touch_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_touch_perception_settings>();
	}
};
static_assert(alignof(UAI_touch_perception_settings) == 0x000008, "Wrong alignment on UAI_touch_perception_settings");
static_assert(sizeof(UAI_touch_perception_settings) == 0x000038, "Wrong size on UAI_touch_perception_settings");
static_assert(offsetof(UAI_touch_perception_settings, __verse_0x403FF374_MaxStimulusDuration) == 0x000028, "Member 'UAI_touch_perception_settings::__verse_0x403FF374_MaxStimulusDuration' has a wrong offset!");

// VerseClass VerseFortnite.Animation_play_animation_controller_impl
// 0x0040 (0x00E8 - 0x00A8)
class UAnimation_play_animation_controller_impl final : public UAIAnimationComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x1AE41359__L_2fFortnite_2ecom_2fAnimation_2fplay__animation__controller__impl_N_RCanPlayAnimation_L_Nanimation__sequence_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8D09494B_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x14508F4B_PlayAndAwait_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4D7533F6__L_2fFortnite_2ecom_2fAnimation_2fPlayAnimation_2fplay__animation__controller_N_RPlay_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fAnimation_2fplay__animation__controller__impl_N_RCanPlayAnimation_L_Nanimation__sequence_R(class UAssets_animation_sequence* __verse_0xB2CDDD72_Argument);
	class UAnimation_PlayAnimation_play_animation_instance* _L_2fFortnite_2ecom_2fAnimation_2fPlayAnimation_2fplay__animation__controller_N_RPlay_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lanimation__sequence_M_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class Utask* PlayAndAwait_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lanimation__sequence_M_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class Utask* PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lanimation__sequence_Mplay__animation__instance_Mlogic_Mfloat_Mfloat_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Animation_play_animation_controller_impl">();
	}
	static class UAnimation_play_animation_controller_impl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimation_play_animation_controller_impl>();
	}
};
static_assert(alignof(UAnimation_play_animation_controller_impl) == 0x000008, "Wrong alignment on UAnimation_play_animation_controller_impl");
static_assert(sizeof(UAnimation_play_animation_controller_impl) == 0x0000E8, "Wrong size on UAnimation_play_animation_controller_impl");
static_assert(offsetof(UAnimation_play_animation_controller_impl, __verse_0x1AE41359__L_2fFortnite_2ecom_2fAnimation_2fplay__animation__controller__impl_N_RCanPlayAnimation_L_Nanimation__sequence_R) == 0x0000A8, "Member 'UAnimation_play_animation_controller_impl::__verse_0x1AE41359__L_2fFortnite_2ecom_2fAnimation_2fplay__animation__controller__impl_N_RCanPlayAnimation_L_Nanimation__sequence_R' has a wrong offset!");
static_assert(offsetof(UAnimation_play_animation_controller_impl, __verse_0x8D09494B_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R) == 0x0000B8, "Member 'UAnimation_play_animation_controller_impl::__verse_0x8D09494B_PlayAnimationInternal_L_Nanimation__sequence_M_Nplay__animation__instance_M_Nlogic_M_Nfloat_M_Nfloat_M_Nfloat_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UAnimation_play_animation_controller_impl, __verse_0x14508F4B_PlayAndAwait_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R) == 0x0000C8, "Member 'UAnimation_play_animation_controller_impl::__verse_0x14508F4B_PlayAndAwait_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R' has a wrong offset!");
static_assert(offsetof(UAnimation_play_animation_controller_impl, __verse_0x4D7533F6__L_2fFortnite_2ecom_2fAnimation_2fPlayAnimation_2fplay__animation__controller_N_RPlay_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R) == 0x0000D8, "Member 'UAnimation_play_animation_controller_impl::__verse_0x4D7533F6__L_2fFortnite_2ecom_2fAnimation_2fPlayAnimation_2fplay__animation__controller_N_RPlay_L_Nanimation__sequence_M_N_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_N_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R' has a wrong offset!");

// VerseClass VerseFortnite.Game_game_action_instigator
// 0x0000 (0x0028 - 0x0028)
class UGame_game_action_instigator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_game_action_instigator">();
	}
	static class UGame_game_action_instigator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_game_action_instigator>();
	}
};
static_assert(alignof(UGame_game_action_instigator) == 0x000008, "Wrong alignment on UGame_game_action_instigator");
static_assert(sizeof(UGame_game_action_instigator) == 0x000028, "Wrong size on UGame_game_action_instigator");

// VerseClass VerseFortnite.Animation_PlayAnimation
// 0x0000 (0x0028 - 0x0028)
class UAnimation_PlayAnimation final : public UObject
{
public:
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAnimation_2fPlayAnimation_N_Roperator_U_2eGetPlayAnimationController_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Animation_PlayAnimation">();
	}
	static class UAnimation_PlayAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimation_PlayAnimation>();
	}
};
static_assert(alignof(UAnimation_PlayAnimation) == 0x000008, "Wrong alignment on UAnimation_PlayAnimation");
static_assert(sizeof(UAnimation_PlayAnimation) == 0x000028, "Wrong size on UAnimation_PlayAnimation");

// VerseClass VerseFortnite.task_Animation_PlayAnimation_play_animation_instance$Await
// 0x0390 (0x04E0 - 0x0150)
class Utask_Animation_PlayAnimation_play_animation_instance_Await final : public Utask
{
public:
	class UAnimation_PlayAnimation_play_animation_instance* _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0158(0x0001)(Parm, HasGetValueTypeHash)
	EAnimation_PlayAnimation_play_animation_result _RetVal;                                           // 0x0159(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimation_PlayAnimation_play_animation_result __verse_0x95D09D0E_Result_1;                       // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimation_PlayAnimation_play_animation_state __verse_0xD69A00E9_State_1;                        // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0160(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _ExprResult_1;                                     // 0x0170(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_2;                               // 0x0178(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_3;                                // 0x0188(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_4;                                     // 0x01A0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_5;                                     // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_6;                               // 0x01C0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_7;                                // 0x01D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_8;                                     // 0x01E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_9;                                     // 0x01F8(0x0010)(HasGetValueTypeHash)
	EAnimation_PlayAnimation_play_animation_result _AssignmentScratch_10;                             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_11;                              // 0x0210(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_12;                               // 0x0220(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_13;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	EAnimation_PlayAnimation_play_animation_result _AssignmentScratch_15;                             // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x0260(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_17;                               // 0x0270(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x0288(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x0298(0x0010)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_20 : 1;                           // 0x02A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2A8_1 : 7;                                  // 0x02A8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_21 : 1;                           // 0x02A9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__7;                             // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utask*                                  _AsyncTask_22;                                     // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_23;                                // 0x02C0(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _ExprResult_24;                                    // 0x02D0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
