#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst_0

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VGameplayRst_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function VGameplayRst.VGameplayRst_Transform_mutable_positionable._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R) == 0x000008, "Wrong alignment on VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R");
static_assert(sizeof(VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R) == 0x000018, "Wrong size on VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R");
static_assert(offsetof(VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Transform_mutable_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName) == 0x000018, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName, RetVal) == 0x000008, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionProfileName::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVGameplayRst_Physics_collision_shape_mode    RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode, RetVal) == 0x000001, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetCollisionShapeMode::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetEnabled::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetGravityEnabled::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetMovable::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendHitEventsOnCollide::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetSendOverlapEvents::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection) == 0x000002, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RGetUseContinuousCollisionDetection::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R) == 0x000018, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetBoxCollisionShapeMode_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R final
{
public:
	struct VGameplayRst_0::Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R) == 0x000010, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCapsuleCollisionShapeMode_L_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R) == 0x000010, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCollisionProfileName_L_N_Kchar_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R) == 0x000018, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetCustomDegreeOfFreedomConstrain_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R final
{
public:
	EVGameplayRst_Physics_dof_movement_mode       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetDegreeOfFreedomContraint_L_Ndof__movement__mode_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetEnabled_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetGravityEnabled_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R final
{
public:
	class UAssets_mesh*                           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R) == 0x000008, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMeshCollisionShapeMode_L_Nmesh_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetMovable_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendHitEventsOnCollide_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSendOverlapEvents_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R) == 0x000008, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R");
static_assert(offsetof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetSphereCollisionShapeMode_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Physics_collision_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fPhysics_2fcollision__component_N_RSetUseContinuousCollisionDetection_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Physics_collision_component.WaitBeginOverlap
// 0x0028 (0x0028 - 0x0000)
struct VGameplayRst_Physics_collision_component_WaitBeginOverlap final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component_WaitBeginOverlap) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component_WaitBeginOverlap");
static_assert(sizeof(VGameplayRst_Physics_collision_component_WaitBeginOverlap) == 0x000028, "Wrong size on VGameplayRst_Physics_collision_component_WaitBeginOverlap");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitBeginOverlap, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VGameplayRst_Physics_collision_component_WaitBeginOverlap::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitBeginOverlap, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VGameplayRst_Physics_collision_component_WaitBeginOverlap::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitBeginOverlap, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VGameplayRst_Physics_collision_component_WaitBeginOverlap::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitBeginOverlap, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VGameplayRst_Physics_collision_component_WaitBeginOverlap::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitBeginOverlap, RetVal) == 0x000020, "Member 'VGameplayRst_Physics_collision_component_WaitBeginOverlap::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component.WaitEndOverlap
// 0x0028 (0x0028 - 0x0000)
struct VGameplayRst_Physics_collision_component_WaitEndOverlap final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component_WaitEndOverlap) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component_WaitEndOverlap");
static_assert(sizeof(VGameplayRst_Physics_collision_component_WaitEndOverlap) == 0x000028, "Wrong size on VGameplayRst_Physics_collision_component_WaitEndOverlap");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitEndOverlap, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VGameplayRst_Physics_collision_component_WaitEndOverlap::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitEndOverlap, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VGameplayRst_Physics_collision_component_WaitEndOverlap::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitEndOverlap, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VGameplayRst_Physics_collision_component_WaitEndOverlap::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitEndOverlap, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VGameplayRst_Physics_collision_component_WaitEndOverlap::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitEndOverlap, RetVal) == 0x000020, "Member 'VGameplayRst_Physics_collision_component_WaitEndOverlap::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Physics_collision_component.WaitHit
// 0x0028 (0x0028 - 0x0000)
struct VGameplayRst_Physics_collision_component_WaitHit final
{
public:
	class Utask*                                  __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utask*                                  RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Physics_collision_component_WaitHit) == 0x000008, "Wrong alignment on VGameplayRst_Physics_collision_component_WaitHit");
static_assert(sizeof(VGameplayRst_Physics_collision_component_WaitHit) == 0x000028, "Wrong size on VGameplayRst_Physics_collision_component_WaitHit");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitHit, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VGameplayRst_Physics_collision_component_WaitHit::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitHit, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VGameplayRst_Physics_collision_component_WaitHit::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitHit, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VGameplayRst_Physics_collision_component_WaitHit::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitHit, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VGameplayRst_Physics_collision_component_WaitHit::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Physics_collision_component_WaitHit, RetVal) == 0x000020, "Member 'VGameplayRst_Physics_collision_component_WaitHit::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R) == 0x000001, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R");
static_assert(sizeof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R) == 0x000001, "Wrong size on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation) == 0x000001, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation");
static_assert(sizeof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation) == 0x000001, "Wrong size on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME) == 0x000008, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME");
static_assert(sizeof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME) == 0x000010, "Wrong size on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME, RetVal) == 0x000008, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME) == 0x000008, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME");
static_assert(sizeof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME) == 0x000010, "Wrong size on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME, RetVal) == 0x000008, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME::RetVal' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation) == 0x000001, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation");
static_assert(sizeof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation) == 0x000002, "Wrong size on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R final
{
public:
	class UAssets_animation*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R) == 0x000008, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R");
static_assert(sizeof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R) == 0x000008, "Wrong size on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R");
static_assert(offsetof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R final
{
public:
	class UAssets_animation_blueprint*            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R) == 0x000008, "Wrong alignment on VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R");
