#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelHeaderOptions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemMcp_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelHeaderOptions.VoiceChannelHeaderOptions_C
// 0x0130 (0x1690 - 0x1560)
class UVoiceChannelHeaderOptions_C final : public UFortVoiceChannelHeaderButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x1568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x1570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JoinSlideOut;                                      // 0x1578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleUp;                                           // 0x1580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Options;                                    // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ChannelInfoPanel;                                  // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         hb_friends;                                        // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Input;                                          // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         hb_teammates;                                      // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Join;                                         // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Buttons;                             // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Options;                             // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget_1;                               // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinLeaveButtonStw;                                // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotTransmitting;                                   // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ReportButtonStw;                                   // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionBackplate;                                // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Transmitting;                               // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_Social;                                   // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_VoiceReporting;                           // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Bullet_F;                                     // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Bullet_FT;                                    // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Options;                                      // 0x1628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Social_Friends_Only;                          // 0x1630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Social_Friends_Only_1;                        // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Social_None;                                  // 0x1640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_VoiceReporting_Off;                           // 0x1648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_VoiceReporting_On;                            // 0x1650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Transmitting;                                      // 0x1658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Header_Status;                             // 0x1660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusActiveColor;                            // 0x1668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusWarningColor;                           // 0x1678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Expanded;                                       // 0x1688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Old;                                               // 0x1689(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x168A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SidebarVoiceChannelHeader_Button_194_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SidebarVoiceChannelHeader_Button_Options_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SidebarVoiceChannelHeader_Button_Options_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__VoiceChannelHeaderOptions_JoinLeaveButtonStw_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__VoiceChannelHeaderOptions_ReportButtonStw_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_VoiceChannelHeaderOptions(int32 EntryPoint);
	void HandleHeaderClicked();
	void On_Options_Expansion_Changed(bool IsExpanded);
	void OnListItemObjectSet_1(class UObject* ListItemObject);
	void OnUpdateOptionsVisuals(ESocialCommsPermission VoicePermission, bool bVoiceReportingIsAvailable, bool bIsRecording, bool bCanJoinOrLeave, bool bMightBeAbleToReport);
	void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction);
	void Set_Header_Status_Visuals(bool Old_0);
	void SetExpansionState(const bool bIsExpanded);
	void SetJoinOrLeaveButton(bool Join);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelHeaderOptions_C">();
	}
	static class UVoiceChannelHeaderOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelHeaderOptions_C>();
	}
};
static_assert(alignof(UVoiceChannelHeaderOptions_C) == 0x000010, "Wrong alignment on UVoiceChannelHeaderOptions_C");
static_assert(sizeof(UVoiceChannelHeaderOptions_C) == 0x001690, "Wrong size on UVoiceChannelHeaderOptions_C");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, UberGraphFrame) == 0x001560, "Member 'UVoiceChannelHeaderOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, OnHover) == 0x001568, "Member 'UVoiceChannelHeaderOptions_C::OnHover' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, OnExpansion) == 0x001570, "Member 'UVoiceChannelHeaderOptions_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, JoinSlideOut) == 0x001578, "Member 'UVoiceChannelHeaderOptions_C::JoinSlideOut' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, ScaleUp) == 0x001580, "Member 'UVoiceChannelHeaderOptions_C::ScaleUp' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Button_Options) == 0x001588, "Member 'UVoiceChannelHeaderOptions_C::Button_Options' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, ChannelInfoPanel) == 0x001590, "Member 'UVoiceChannelHeaderOptions_C::ChannelInfoPanel' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, ExpandDirectionTick) == 0x001598, "Member 'UVoiceChannelHeaderOptions_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, hb_friends) == 0x0015A0, "Member 'UVoiceChannelHeaderOptions_C::hb_friends' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, HB_Input) == 0x0015A8, "Member 'UVoiceChannelHeaderOptions_C::HB_Input' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, hb_teammates) == 0x0015B0, "Member 'UVoiceChannelHeaderOptions_C::hb_teammates' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, HBox_Join) == 0x0015B8, "Member 'UVoiceChannelHeaderOptions_C::HBox_Join' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, HorizontalBox_Buttons) == 0x0015C0, "Member 'UVoiceChannelHeaderOptions_C::HorizontalBox_Buttons' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, HorizontalBox_Options) == 0x0015C8, "Member 'UVoiceChannelHeaderOptions_C::HorizontalBox_Options' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, InputActionWidget_1) == 0x0015D0, "Member 'UVoiceChannelHeaderOptions_C::InputActionWidget_1' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, JoinLeaveButtonStw) == 0x0015D8, "Member 'UVoiceChannelHeaderOptions_C::JoinLeaveButtonStw' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, NotTransmitting) == 0x0015E0, "Member 'UVoiceChannelHeaderOptions_C::NotTransmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Overlay_1) == 0x0015E8, "Member 'UVoiceChannelHeaderOptions_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, ReportButtonStw) == 0x0015F0, "Member 'UVoiceChannelHeaderOptions_C::ReportButtonStw' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, SelectionBackplate) == 0x0015F8, "Member 'UVoiceChannelHeaderOptions_C::SelectionBackplate' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Switch_Transmitting) == 0x001600, "Member 'UVoiceChannelHeaderOptions_C::Switch_Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Switcher_Social) == 0x001608, "Member 'UVoiceChannelHeaderOptions_C::Switcher_Social' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Switcher_VoiceReporting) == 0x001610, "Member 'UVoiceChannelHeaderOptions_C::Switcher_VoiceReporting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_Bullet_F) == 0x001618, "Member 'UVoiceChannelHeaderOptions_C::Text_Bullet_F' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_Bullet_FT) == 0x001620, "Member 'UVoiceChannelHeaderOptions_C::Text_Bullet_FT' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_Options) == 0x001628, "Member 'UVoiceChannelHeaderOptions_C::Text_Options' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_Social_Friends_Only) == 0x001630, "Member 'UVoiceChannelHeaderOptions_C::Text_Social_Friends_Only' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_Social_Friends_Only_1) == 0x001638, "Member 'UVoiceChannelHeaderOptions_C::Text_Social_Friends_Only_1' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_Social_None) == 0x001640, "Member 'UVoiceChannelHeaderOptions_C::Text_Social_None' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_VoiceReporting_Off) == 0x001648, "Member 'UVoiceChannelHeaderOptions_C::Text_VoiceReporting_Off' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Text_VoiceReporting_On) == 0x001650, "Member 'UVoiceChannelHeaderOptions_C::Text_VoiceReporting_On' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Transmitting) == 0x001658, "Member 'UVoiceChannelHeaderOptions_C::Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, WrapBox_Header_Status) == 0x001660, "Member 'UVoiceChannelHeaderOptions_C::WrapBox_Header_Status' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, VoiceStatusActiveColor) == 0x001668, "Member 'UVoiceChannelHeaderOptions_C::VoiceStatusActiveColor' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, VoiceStatusWarningColor) == 0x001678, "Member 'UVoiceChannelHeaderOptions_C::VoiceStatusWarningColor' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Is_Expanded) == 0x001688, "Member 'UVoiceChannelHeaderOptions_C::Is_Expanded' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Old) == 0x001689, "Member 'UVoiceChannelHeaderOptions_C::Old' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderOptions_C, Hovered) == 0x00168A, "Member 'UVoiceChannelHeaderOptions_C::Hovered' has a wrong offset!");

}

