#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelHeaderButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelHeaderButton.VoiceChannelHeaderButton_C
// 0x00B0 (0x1610 - 0x1560)
class UVoiceChannelHeaderButton_C final : public UFortVoiceChannelHeaderButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x1568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JoinSlideOut;                                      // 0x1570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleUp;                                           // 0x1578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x1580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Join;                                         // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VoiceChatWarning;                            // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   JoinText;                                          // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotTransmitting;                                   // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OffText;                                           // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OnOffSwitcher;                                     // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OnText;                                            // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionBackplate;                                // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SimultaneousChannelSwitcher;                       // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Transmitting;                               // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Transmitting;                                      // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusActiveColor;                            // 0x15E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusWarningColor;                           // 0x15F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	void ExecuteUbergraph_VoiceChannelHeaderButton(int32 EntryPoint);
	void OnListItemObjectSet_1(class UObject* ListItemObject);
	void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelHeaderButton_C">();
	}
	static class UVoiceChannelHeaderButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelHeaderButton_C>();
	}
};
static_assert(alignof(UVoiceChannelHeaderButton_C) == 0x000010, "Wrong alignment on UVoiceChannelHeaderButton_C");
static_assert(sizeof(UVoiceChannelHeaderButton_C) == 0x001610, "Wrong size on UVoiceChannelHeaderButton_C");
static_assert(offsetof(UVoiceChannelHeaderButton_C, UberGraphFrame) == 0x001560, "Member 'UVoiceChannelHeaderButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnExpansion) == 0x001568, "Member 'UVoiceChannelHeaderButton_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, JoinSlideOut) == 0x001570, "Member 'UVoiceChannelHeaderButton_C::JoinSlideOut' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, ScaleUp) == 0x001578, "Member 'UVoiceChannelHeaderButton_C::ScaleUp' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, ExpandDirectionTick) == 0x001580, "Member 'UVoiceChannelHeaderButton_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, HBox_Join) == 0x001588, "Member 'UVoiceChannelHeaderButton_C::HBox_Join' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Image_VoiceChatWarning) == 0x001590, "Member 'UVoiceChannelHeaderButton_C::Image_VoiceChatWarning' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, JoinText) == 0x001598, "Member 'UVoiceChannelHeaderButton_C::JoinText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, NotTransmitting) == 0x0015A0, "Member 'UVoiceChannelHeaderButton_C::NotTransmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OffText) == 0x0015A8, "Member 'UVoiceChannelHeaderButton_C::OffText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnOffSwitcher) == 0x0015B0, "Member 'UVoiceChannelHeaderButton_C::OnOffSwitcher' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnText) == 0x0015B8, "Member 'UVoiceChannelHeaderButton_C::OnText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Overlay_1) == 0x0015C0, "Member 'UVoiceChannelHeaderButton_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, SelectionBackplate) == 0x0015C8, "Member 'UVoiceChannelHeaderButton_C::SelectionBackplate' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, SimultaneousChannelSwitcher) == 0x0015D0, "Member 'UVoiceChannelHeaderButton_C::SimultaneousChannelSwitcher' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Switch_Transmitting) == 0x0015D8, "Member 'UVoiceChannelHeaderButton_C::Switch_Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Transmitting) == 0x0015E0, "Member 'UVoiceChannelHeaderButton_C::Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, VoiceStatusActiveColor) == 0x0015E8, "Member 'UVoiceChannelHeaderButton_C::VoiceStatusActiveColor' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, VoiceStatusWarningColor) == 0x0015F8, "Member 'UVoiceChannelHeaderButton_C::VoiceStatusWarningColor' has a wrong offset!");

}

