#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PopupModal

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PopupModal.WBP_PopupModal_C
// 0x0030 (0x0300 - 0x02D0)
class UWBP_PopupModal_C final : public UFortPopupModal
{
public:
	class UNamedSlot*                             NamedSlot_Background;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_DetailsText;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_HeaderText;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Image;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_InputBlock;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_QRCode;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PopupModal_C">();
	}
	static class UWBP_PopupModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PopupModal_C>();
	}
};
static_assert(alignof(UWBP_PopupModal_C) == 0x000008, "Wrong alignment on UWBP_PopupModal_C");
static_assert(sizeof(UWBP_PopupModal_C) == 0x000300, "Wrong size on UWBP_PopupModal_C");
static_assert(offsetof(UWBP_PopupModal_C, NamedSlot_Background) == 0x0002D0, "Member 'UWBP_PopupModal_C::NamedSlot_Background' has a wrong offset!");
static_assert(offsetof(UWBP_PopupModal_C, NamedSlot_DetailsText) == 0x0002D8, "Member 'UWBP_PopupModal_C::NamedSlot_DetailsText' has a wrong offset!");
static_assert(offsetof(UWBP_PopupModal_C, NamedSlot_HeaderText) == 0x0002E0, "Member 'UWBP_PopupModal_C::NamedSlot_HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_PopupModal_C, NamedSlot_Image) == 0x0002E8, "Member 'UWBP_PopupModal_C::NamedSlot_Image' has a wrong offset!");
static_assert(offsetof(UWBP_PopupModal_C, NamedSlot_InputBlock) == 0x0002F0, "Member 'UWBP_PopupModal_C::NamedSlot_InputBlock' has a wrong offset!");
static_assert(offsetof(UWBP_PopupModal_C, NamedSlot_QRCode) == 0x0002F8, "Member 'UWBP_PopupModal_C::NamedSlot_QRCode' has a wrong offset!");

}

