#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActivityBrowserSocialProof_NEW

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActivityBrowserSocialProof_NEW.WBP_ActivityBrowserSocialProof_NEW_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_ActivityBrowserSocialProof_NEW_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortMobileImage*                       Image_CCU;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CCUCount;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ActivityBrowserSocialProof_NEW(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_CCU_Count_Data(int32 CCU_Count, bool Hide);
	void SetCCUCount(int32 CCUCount, bool Hide);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActivityBrowserSocialProof_NEW_C">();
	}
	static class UWBP_ActivityBrowserSocialProof_NEW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActivityBrowserSocialProof_NEW_C>();
	}
};
static_assert(alignof(UWBP_ActivityBrowserSocialProof_NEW_C) == 0x000008, "Wrong alignment on UWBP_ActivityBrowserSocialProof_NEW_C");
static_assert(sizeof(UWBP_ActivityBrowserSocialProof_NEW_C) == 0x0002D8, "Wrong size on UWBP_ActivityBrowserSocialProof_NEW_C");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_NEW_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ActivityBrowserSocialProof_NEW_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_NEW_C, Image_CCU) == 0x0002C8, "Member 'UWBP_ActivityBrowserSocialProof_NEW_C::Image_CCU' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_NEW_C, Text_CCUCount) == 0x0002D0, "Member 'UWBP_ActivityBrowserSocialProof_NEW_C::Text_CCUCount' has a wrong offset!");

}

