#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AugmentSelector_Augment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AugmentSelector_Augment.WBP_AugmentSelector_Augment_C
// 0x0070 (0x0330 - 0x02C0)
class UWBP_AugmentSelector_Augment_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_UnfocusScale;                                 // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Reroll;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Activate;                                     // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focus;                                        // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAugmentInfoTouchWidget*      FortPlayerAugmentInfoTouchWidget;                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BottomShadow;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TopShadow;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AugmentSelector_AugmentInfo_C*     WBP_AugmentSelector_AugmentInfo;                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortPlayerAugmentItemDefinition*       In_Augment_Item_Definition;                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableTopShadowVisibility;                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableBottomShadowVisibility;                     // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_ConfirmationOutline;                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_GreenOverlay;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateAugment(double* AnimationEndTime);
	void Construct();
	void ExecuteUbergraph_WBP_AugmentSelector_Augment(int32 EntryPoint);
	void FocusAugment(bool InFocusAugment);
	void Highlight(bool PlayAnimation_0);
	void OnInitialized();
	void PlayHUDSwapAnim();
	void RerollAugment();
	void ResetState();
	void Set_Augment_Index(int32 New_Index);
	void SetAugmentInfo(class UFortPlayerAugmentItemDefinition* InAugmentItemDefinition);
	void TriggerFocusPulseAnim();
	void Unhighlight(bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AugmentSelector_Augment_C">();
	}
	static class UWBP_AugmentSelector_Augment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AugmentSelector_Augment_C>();
	}
};
static_assert(alignof(UWBP_AugmentSelector_Augment_C) == 0x000008, "Wrong alignment on UWBP_AugmentSelector_Augment_C");
static_assert(sizeof(UWBP_AugmentSelector_Augment_C) == 0x000330, "Wrong size on UWBP_AugmentSelector_Augment_C");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_AugmentSelector_Augment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Anim_UnfocusScale) == 0x0002C8, "Member 'UWBP_AugmentSelector_Augment_C::Anim_UnfocusScale' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Anim_Reroll) == 0x0002D0, "Member 'UWBP_AugmentSelector_Augment_C::Anim_Reroll' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Anim_Activate) == 0x0002D8, "Member 'UWBP_AugmentSelector_Augment_C::Anim_Activate' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Anim_Focus) == 0x0002E0, "Member 'UWBP_AugmentSelector_Augment_C::Anim_Focus' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, FortPlayerAugmentInfoTouchWidget) == 0x0002E8, "Member 'UWBP_AugmentSelector_Augment_C::FortPlayerAugmentInfoTouchWidget' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Image_BottomShadow) == 0x0002F0, "Member 'UWBP_AugmentSelector_Augment_C::Image_BottomShadow' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Image_TopShadow) == 0x0002F8, "Member 'UWBP_AugmentSelector_Augment_C::Image_TopShadow' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, Overlay_Main) == 0x000300, "Member 'UWBP_AugmentSelector_Augment_C::Overlay_Main' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, WBP_AugmentSelector_AugmentInfo) == 0x000308, "Member 'UWBP_AugmentSelector_Augment_C::WBP_AugmentSelector_AugmentInfo' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, In_Augment_Item_Definition) == 0x000310, "Member 'UWBP_AugmentSelector_Augment_C::In_Augment_Item_Definition' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, bEnableTopShadowVisibility) == 0x000318, "Member 'UWBP_AugmentSelector_Augment_C::bEnableTopShadowVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, bEnableBottomShadowVisibility) == 0x000319, "Member 'UWBP_AugmentSelector_Augment_C::bEnableBottomShadowVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, IsFocused) == 0x00031A, "Member 'UWBP_AugmentSelector_Augment_C::IsFocused' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, MID_ConfirmationOutline) == 0x000320, "Member 'UWBP_AugmentSelector_Augment_C::MID_ConfirmationOutline' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Augment_C, MID_GreenOverlay) == 0x000328, "Member 'UWBP_AugmentSelector_Augment_C::MID_GreenOverlay' has a wrong offset!");

}

