#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_STI_ItemsCategoryList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_STI_ItemsCategoryList.WBP_STI_ItemsCategoryList_C.SetFortTemporaryItemsRewardGroupVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM final
{
public:
	class UFortTemporaryItemsRewardGroupVM*       ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM) == 0x000008, "Wrong alignment on WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM");
static_assert(sizeof(WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM) == 0x000028, "Wrong size on WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM");
static_assert(offsetof(WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM, ViewModel) == 0x000000, "Member 'WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_STI_ItemsCategoryList_C_SetFortTemporaryItemsRewardGroupVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

}

