#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LockedStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LockedStatus.WBP_LockedStatus_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_LockedStatus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_OnHover;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Locked;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Highlight_C*                 WBP_UIKit_Highlight;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LockedReason;                                      // 0x02E0(0x0018)(Edit, BlueprintVisible)
	bool                                          UseNewDesign;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LockedStatus(int32 EntryPoint);
	void On_Lock_Hover_Select(bool bIsHoverSelected);
	void PreConstruct(bool IsDesignTime);
	void SetDefaultVisualsState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LockedStatus_C">();
	}
	static class UWBP_LockedStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LockedStatus_C>();
	}
};
static_assert(alignof(UWBP_LockedStatus_C) == 0x000008, "Wrong alignment on UWBP_LockedStatus_C");
static_assert(sizeof(UWBP_LockedStatus_C) == 0x000300, "Wrong size on UWBP_LockedStatus_C");
static_assert(offsetof(UWBP_LockedStatus_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_LockedStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LockedStatus_C, Anim_OnHover) == 0x0002C8, "Member 'UWBP_LockedStatus_C::Anim_OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_LockedStatus_C, StatusIndicator_Locked) == 0x0002D0, "Member 'UWBP_LockedStatus_C::StatusIndicator_Locked' has a wrong offset!");
static_assert(offsetof(UWBP_LockedStatus_C, WBP_UIKit_Highlight) == 0x0002D8, "Member 'UWBP_LockedStatus_C::WBP_UIKit_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_LockedStatus_C, LockedReason) == 0x0002E0, "Member 'UWBP_LockedStatus_C::LockedReason' has a wrong offset!");
static_assert(offsetof(UWBP_LockedStatus_C, UseNewDesign) == 0x0002F8, "Member 'UWBP_LockedStatus_C::UseNewDesign' has a wrong offset!");

}

