#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContentGate_RatingTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ContentGate_RatingTag.WBP_ContentGate_RatingTag_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_ContentGate_RatingTag_C final : public UFortSqueegeeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_Tag_C*                       WBP_UIKit_Tag;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         InHeightOverride;                                  // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetGameActivity(class UFortGameActivity* GameActivity);
	void ExecuteUbergraph_WBP_ContentGate_RatingTag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ContentGate_RatingTag_C">();
	}
	static class UWBP_ContentGate_RatingTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ContentGate_RatingTag_C>();
	}
};
static_assert(alignof(UWBP_ContentGate_RatingTag_C) == 0x000008, "Wrong alignment on UWBP_ContentGate_RatingTag_C");
static_assert(sizeof(UWBP_ContentGate_RatingTag_C) == 0x000320, "Wrong size on UWBP_ContentGate_RatingTag_C");
static_assert(offsetof(UWBP_ContentGate_RatingTag_C, UberGraphFrame) == 0x000308, "Member 'UWBP_ContentGate_RatingTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ContentGate_RatingTag_C, WBP_UIKit_Tag) == 0x000310, "Member 'UWBP_ContentGate_RatingTag_C::WBP_UIKit_Tag' has a wrong offset!");
static_assert(offsetof(UWBP_ContentGate_RatingTag_C, InHeightOverride) == 0x000318, "Member 'UWBP_ContentGate_RatingTag_C::InHeightOverride' has a wrong offset!");

}

