#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ShopInfo_Dialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ShopInfo_Dialog.WBP_ShopInfo_Dialog_C
// 0x0018 (0x0418 - 0x0400)
class UWBP_ShopInfo_Dialog_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIKitDialogViewModel*                  UIKitDialogViewModel;                              // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_UIKit_Dialog_Base_C*               Dialog_Base;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CloseModal(int32 ButtonIndex);
	void ExecuteUbergraph_WBP_ShopInfo_Dialog(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetUIKitDialogViewModel(class UUIKitDialogViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ShopInfo_Dialog_C">();
	}
	static class UWBP_ShopInfo_Dialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ShopInfo_Dialog_C>();
	}
};
static_assert(alignof(UWBP_ShopInfo_Dialog_C) == 0x000008, "Wrong alignment on UWBP_ShopInfo_Dialog_C");
static_assert(sizeof(UWBP_ShopInfo_Dialog_C) == 0x000418, "Wrong size on UWBP_ShopInfo_Dialog_C");
static_assert(offsetof(UWBP_ShopInfo_Dialog_C, UberGraphFrame) == 0x000400, "Member 'UWBP_ShopInfo_Dialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ShopInfo_Dialog_C, UIKitDialogViewModel) == 0x000408, "Member 'UWBP_ShopInfo_Dialog_C::UIKitDialogViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ShopInfo_Dialog_C, Dialog_Base) == 0x000410, "Member 'UWBP_ShopInfo_Dialog_C::Dialog_Base' has a wrong offset!");

}

