#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NameLoadout_MP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NameLoadout_MP.WBP_NameLoadout_MP_C
// 0x0088 (0x0620 - 0x0598)
class UWBP_NameLoadout_MP_C final : public UFortSaveLoadoutPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_Button_Regular_C*            Button_Accept;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Regular_C*            Button_Cancel;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         Button_CloseTouch;                                 // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutCard_MP_C*                  Card_ExistingPreset;                               // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutCard_MP_C*                  Card_NewPreset;                                    // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Dialog_Base_C*               Dialog_Base;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ExisitingPresetGroup;                              // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Buttons;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Chevron;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CardsPreset;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTypedModularLoadoutVM*             CurrentLoadout;                                    // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUIKitDialogViewModel*                  DialogVM;                                          // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ClearLoadout;                                      // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortLoadoutActionType                        Loadout_Action;                                    // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTypedModularLoadoutVM*             Target_Loadout;                                    // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__NameLoadout_MP_Button_Cancel_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_NameLoadout_MP_Button_Accept2_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_NameLoadout_MP_Button_CloseTouch_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_NameLoadout_MP_Text_EditableLoadoutName_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature(const class FText& Text);
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_WBP_NameLoadout_MP(int32 EntryPoint);
	void Initialize(EFortLoadoutActionType Loadout_Action_0, class UFortTypedModularLoadoutVM* Target_Loadout_0, class UFortTypedModularLoadoutsVM* TypedModularLoadouts);
	void OnInitialized();
	void OnOperationCompleted_AB97A05243EDAA0EBD5FB3B0B1784F68(bool Success);
	void OnSanitizationReady(const bool bSuccess, const class FString& Sanitizedtext);
	void PreConstruct(bool IsDesignTime);
	void SetMobileStyle();
	void SetNavigationRulesForSTW();
	void SetupForClear(class UFortTypedModularLoadoutVM* TargetLoadout);
	void SetupForDelete(class UFortTypedModularLoadoutVM* TargetLoadout);
	void SetupForRename(class UFortTypedModularLoadoutVM* Target_Loadout_0);
	void SetupForSave(class UFortTypedModularLoadoutVM* Target_Loadout_0, bool Override);
	void Use2PresetLayout(bool Use_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NameLoadout_MP_C">();
	}
	static class UWBP_NameLoadout_MP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NameLoadout_MP_C>();
	}
};
static_assert(alignof(UWBP_NameLoadout_MP_C) == 0x000008, "Wrong alignment on UWBP_NameLoadout_MP_C");
static_assert(sizeof(UWBP_NameLoadout_MP_C) == 0x000620, "Wrong size on UWBP_NameLoadout_MP_C");
static_assert(offsetof(UWBP_NameLoadout_MP_C, UberGraphFrame) == 0x000598, "Member 'UWBP_NameLoadout_MP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Button_Accept) == 0x0005A0, "Member 'UWBP_NameLoadout_MP_C::Button_Accept' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Button_Cancel) == 0x0005A8, "Member 'UWBP_NameLoadout_MP_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Button_CloseTouch) == 0x0005B0, "Member 'UWBP_NameLoadout_MP_C::Button_CloseTouch' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Card_ExistingPreset) == 0x0005B8, "Member 'UWBP_NameLoadout_MP_C::Card_ExistingPreset' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Card_NewPreset) == 0x0005C0, "Member 'UWBP_NameLoadout_MP_C::Card_NewPreset' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Dialog_Base) == 0x0005C8, "Member 'UWBP_NameLoadout_MP_C::Dialog_Base' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, ExisitingPresetGroup) == 0x0005D0, "Member 'UWBP_NameLoadout_MP_C::ExisitingPresetGroup' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, HB_Buttons) == 0x0005D8, "Member 'UWBP_NameLoadout_MP_C::HB_Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Image_Chevron) == 0x0005E0, "Member 'UWBP_NameLoadout_MP_C::Image_Chevron' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Overlay_CardsPreset) == 0x0005E8, "Member 'UWBP_NameLoadout_MP_C::Overlay_CardsPreset' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, CurrentLoadout) == 0x0005F0, "Member 'UWBP_NameLoadout_MP_C::CurrentLoadout' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, DialogVM) == 0x0005F8, "Member 'UWBP_NameLoadout_MP_C::DialogVM' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, ClearLoadout) == 0x000600, "Member 'UWBP_NameLoadout_MP_C::ClearLoadout' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Loadout_Action) == 0x000610, "Member 'UWBP_NameLoadout_MP_C::Loadout_Action' has a wrong offset!");
static_assert(offsetof(UWBP_NameLoadout_MP_C, Target_Loadout) == 0x000618, "Member 'UWBP_NameLoadout_MP_C::Target_Loadout' has a wrong offset!");

}

