#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_BlockBackground_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.ExecuteUbergraph_WBP_UIKit_BlockBackground_Base
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base) == 0x000004, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base) == 0x000008, "Wrong size on WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base, EntryPoint) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UIKit_BlockBackground_Base_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Base::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_BlockBackground_Base_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.RefreshBackgroundMID
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID final
{
public:
	class UMaterialInstanceDynamic*               Background_MID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewMID;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID) == 0x000010, "Wrong size on WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID, Background_MID) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID::Background_MID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID, NewMID) == 0x000008, "Member 'WBP_UIKit_BlockBackground_Base_C_RefreshBackgroundMID::NewMID' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.RefreshOutlineMID
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID final
{
public:
	class UMaterialInstanceDynamic*               Outline_MID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewMID;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID) == 0x000010, "Wrong size on WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID, Outline_MID) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID::Outline_MID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID, NewMID) == 0x000008, "Member 'WBP_UIKit_BlockBackground_Base_C_RefreshOutlineMID::NewMID' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.SetBackgroundBrush
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush) == 0x000010, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush) == 0x0000C0, "Wrong size on WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush, InBrush) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_SetBackgroundBrush::InBrush' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.SetBackgroundMaterial
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial) == 0x000008, "Wrong size on WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_SetBackgroundMaterial::Material_Instance' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.SetOutlineBrush
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush final
{
public:
	struct FSlateBrush                            In_Brush;                                          // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush) == 0x000010, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush) == 0x0000C0, "Wrong size on WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush, In_Brush) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_SetOutlineBrush::In_Brush' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Base.WBP_UIKit_BlockBackground_Base_C.SetOutlineMaterial
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial");
static_assert(sizeof(WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial) == 0x000008, "Wrong size on WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial");
static_assert(offsetof(WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Base_C_SetOutlineMaterial::Material_Instance' has a wrong offset!");

}

