#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_PresetCard

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.BP_OnHoldTriggered
// 0x0180 (0x0180 - 0x0000)
struct WBP_UIKit_PresetCard_C_BP_OnHoldTriggered final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            ReturnValue;                                       // 0x0008(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00C8(0x00B8)()
};
static_assert(alignof(WBP_UIKit_PresetCard_C_BP_OnHoldTriggered) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_BP_OnHoldTriggered");
static_assert(sizeof(WBP_UIKit_PresetCard_C_BP_OnHoldTriggered) == 0x000180, "Wrong size on WBP_UIKit_PresetCard_C_BP_OnHoldTriggered");
static_assert(offsetof(WBP_UIKit_PresetCard_C_BP_OnHoldTriggered, CurrentInputType) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_BP_OnHoldTriggered::CurrentInputType' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_BP_OnHoldTriggered, ReturnValue) == 0x000008, "Member 'WBP_UIKit_PresetCard_C_BP_OnHoldTriggered::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_BP_OnHoldTriggered, K2Node_SwitchEnum_CmpSuccess) == 0x0000C0, "Member 'WBP_UIKit_PresetCard_C_BP_OnHoldTriggered::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_BP_OnHoldTriggered, CallFunc_Handled_ReturnValue) == 0x0000C8, "Member 'WBP_UIKit_PresetCard_C_BP_OnHoldTriggered::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.ExecuteUbergraph_WBP_UIKit_PresetCard
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortTypedModularLoadoutVM*             K2Node_DynamicCast_AsFort_Typed_Modular_Loadout_VM; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_2;               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_3;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0060(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0080(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard");
static_assert(sizeof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard) == 0x0000D8, "Wrong size on WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, EntryPoint) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, Temp_byte_Variable) == 0x000004, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, Temp_byte_Variable_1) == 0x000014, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, Temp_bool_Variable) == 0x000015, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, Temp_byte_Variable_2) == 0x000016, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, Temp_byte_Variable_3) == 0x000017, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_Event_bIsExpanded) == 0x000019, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_Event_bIsSelected) == 0x00001A, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_Event_IsDesignTime) == 0x00001B, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_Event_ListItemObject) == 0x000020, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_DynamicCast_AsFort_Typed_Modular_Loadout_VM) == 0x000028, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_DynamicCast_AsFort_Typed_Modular_Loadout_VM' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsUsingTouch_ReturnValue) == 0x000040, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsUsingTouch_ReturnValue_1) == 0x000041, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_Select_Default) == 0x000042, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_Select_Default_1) == 0x000043, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsHovered_ReturnValue) == 0x000044, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsOpen_ReturnValue) == 0x000045, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsUsingTouch_ReturnValue_2) == 0x000046, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsUsingTouch_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsOpen_ReturnValue_1) == 0x000047, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsUsingTouch_ReturnValue_3) == 0x000048, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsUsingTouch_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_BooleanOR_ReturnValue) == 0x000049, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_IsMobileGame_ReturnValue) == 0x00004A, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000058, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_MakeStruct_FontOutlineSettings) == 0x000060, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard, K2Node_MakeStruct_SlateFontInfo) == 0x000080, "Member 'WBP_UIKit_PresetCard_C_ExecuteUbergraph_WBP_UIKit_PresetCard::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.IsShuffleEnabled
// 0x0020 (0x0020 - 0x0000)
struct WBP_UIKit_PresetCard_C_IsShuffleEnabled final
{
public:
	bool                                          IsShuffled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0008(0x0018)()
};
static_assert(alignof(WBP_UIKit_PresetCard_C_IsShuffleEnabled) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_IsShuffleEnabled");
static_assert(sizeof(WBP_UIKit_PresetCard_C_IsShuffleEnabled) == 0x000020, "Wrong size on WBP_UIKit_PresetCard_C_IsShuffleEnabled");
static_assert(offsetof(WBP_UIKit_PresetCard_C_IsShuffleEnabled, IsShuffled) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_IsShuffleEnabled::IsShuffled' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_IsShuffleEnabled, CallFunc_SelectText_ReturnValue) == 0x000008, "Member 'WBP_UIKit_PresetCard_C_IsShuffleEnabled::CallFunc_SelectText_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_PresetCard_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_OnListItemObjectSet");
static_assert(sizeof(WBP_UIKit_PresetCard_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_UIKit_PresetCard_C_OnListItemObjectSet");
static_assert(offsetof(WBP_UIKit_PresetCard_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_PresetCard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_PresetCard_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_PresetCard_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_PresetCard_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_PresetCard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.Set Image if Valid
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_UIKit_PresetCard_C_Set_Image_if_Valid final
{
public:
	class UFortModularLoadoutItemVM*              LoadoutItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortLockerCategorySlotInfo            CallFunc_GetSlotInfo_ReturnValue;                  // 0x0010(0x0050)(ConstParm)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0060(0x0020)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0088(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x00B0(0x0020)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x00D0(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_Set_Image_if_Valid");
static_assert(sizeof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid) == 0x0000F0, "Wrong size on WBP_UIKit_PresetCard_C_Set_Image_if_Valid");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, LoadoutItem) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::LoadoutItem' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, Temp_bool_Variable) == 0x000008, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, CallFunc_GetSlotInfo_ReturnValue) == 0x000010, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::CallFunc_GetSlotInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000060, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, Temp_bool_Variable_1) == 0x000080, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, Temp_softobject_Variable) == 0x000088, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000A8, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Set_Image_if_Valid, K2Node_Select_Default_1) == 0x0000D0, "Member 'WBP_UIKit_PresetCard_C_Set_Image_if_Valid::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.SetContextMenuActionContext
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_UIKit_PresetCard_C_SetContextMenuActionContext final
{
public:
	TDelegate<void()>                             RenameInInteractionDelegate;                       // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             DeleteInInteractionDelegate;                       // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FUIKitContextMenuActionInfo            K2Node_MakeStruct_UIKitContextMenuActionInfo;      // 0x0018(0x0050)(ContainsInstancedReference)
	struct FUIKitContextMenuActionInfo            K2Node_MakeStruct_UIKitContextMenuActionInfo_1;    // 0x0068(0x0050)(ContainsInstancedReference)
	class UUIKitContextMenuActionContext*         CallFunc_SpawnObject_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_SetContextMenuActionContext");
static_assert(sizeof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext) == 0x0000C0, "Wrong size on WBP_UIKit_PresetCard_C_SetContextMenuActionContext");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext, RenameInInteractionDelegate) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuActionContext::RenameInInteractionDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext, DeleteInInteractionDelegate) == 0x00000C, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuActionContext::DeleteInInteractionDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext, K2Node_MakeStruct_UIKitContextMenuActionInfo) == 0x000018, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuActionContext::K2Node_MakeStruct_UIKitContextMenuActionInfo' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext, K2Node_MakeStruct_UIKitContextMenuActionInfo_1) == 0x000068, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuActionContext::K2Node_MakeStruct_UIKitContextMenuActionInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuActionContext, CallFunc_SpawnObject_ReturnValue) == 0x0000B8, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuActionContext::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.SetContextMenuPadding
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_PresetCard_C_SetContextMenuPadding final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_SetContextMenuPadding) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_SetContextMenuPadding");
static_assert(sizeof(WBP_UIKit_PresetCard_C_SetContextMenuPadding) == 0x000018, "Wrong size on WBP_UIKit_PresetCard_C_SetContextMenuPadding");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuPadding, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuPadding::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetContextMenuPadding, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000010, "Member 'WBP_UIKit_PresetCard_C_SetContextMenuPadding::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.SetFortTypedModularLoadoutVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM final
{
public:
	class UFortTypedModularLoadoutVM*             ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM");
static_assert(sizeof(WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM) == 0x000028, "Wrong size on WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM, ViewModel) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_UIKit_PresetCard_C_SetFortTypedModularLoadoutVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_PresetCard_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_SetText) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_SetText");
static_assert(sizeof(WBP_UIKit_PresetCard_C_SetText) == 0x000018, "Wrong size on WBP_UIKit_PresetCard_C_SetText");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetText, Text) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_SetText::Text' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.SetupPresetCard
// 0x0020 (0x0020 - 0x0000)
struct WBP_UIKit_PresetCard_C_SetupPresetCard final
{
public:
	TArray<class UFortModularLoadoutItemVM*>      Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortModularLoadoutItemVM*        CallFunc_GetFirstValidItemInAnyCategory_ReturnValue; // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_SetupPresetCard) == 0x000008, "Wrong alignment on WBP_UIKit_PresetCard_C_SetupPresetCard");
static_assert(sizeof(WBP_UIKit_PresetCard_C_SetupPresetCard) == 0x000020, "Wrong size on WBP_UIKit_PresetCard_C_SetupPresetCard");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetupPresetCard, Items) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_SetupPresetCard::Items' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetupPresetCard, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_UIKit_PresetCard_C_SetupPresetCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetupPresetCard, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_UIKit_PresetCard_C_SetupPresetCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_SetupPresetCard, CallFunc_GetFirstValidItemInAnyCategory_ReturnValue) == 0x000018, "Member 'WBP_UIKit_PresetCard_C_SetupPresetCard::CallFunc_GetFirstValidItemInAnyCategory_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.Toggle Context Menu If Hovered
// 0x0002 (0x0002 - 0x0000)
struct WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered final
{
public:
	bool                                          ToggleSucess;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered) == 0x000001, "Wrong alignment on WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered");
static_assert(sizeof(WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered) == 0x000002, "Wrong size on WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered, ToggleSucess) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered::ToggleSucess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered, CallFunc_IsOpen_ReturnValue) == 0x000001, "Member 'WBP_UIKit_PresetCard_C_Toggle_Context_Menu_If_Hovered::CallFunc_IsOpen_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.__a95d2a70-494a-fcec-4100-fb8d6da56ed1_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest final
{
public:
	bool                                          IsShuffleEnabled;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShuffleTile_IsShuffleEnabled;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest) == 0x000001, "Wrong alignment on WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest");
static_assert(sizeof(WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest) == 0x000002, "Wrong size on WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest");
static_assert(offsetof(WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest, IsShuffleEnabled) == 0x000000, "Member 'WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest::IsShuffleEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest, CallFunc_IsShuffleTile_IsShuffleEnabled) == 0x000001, "Member 'WBP_UIKit_PresetCard_C___a95d2a70_494a_fcec_4100_fb8d6da56ed1_SourceToDest::CallFunc_IsShuffleTile_IsShuffleEnabled' has a wrong offset!");

// Function WBP_UIKit_PresetCard.WBP_UIKit_PresetCard_C.IsShuffleTile
// 0x0003 (0x0003 - 0x0000)
struct WBP_UIKit_PresetCard_C_IsShuffleTile final
{
public:
	bool                                          IsShuffleTile_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShuffled;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShuffleEnabled_0;                                // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PresetCard_C_IsShuffleTile) == 0x000001, "Wrong alignment on WBP_UIKit_PresetCard_C_IsShuffleTile");
static_assert(sizeof(WBP_UIKit_PresetCard_C_IsShuffleTile) == 0x000003, "Wrong size on WBP_UIKit_PresetCard_C_IsShuffleTile");
static_assert(offsetof(WBP_UIKit_PresetCard_C_IsShuffleTile, IsShuffleTile_0) == 0x000000, "Member 'WBP_UIKit_PresetCard_C_IsShuffleTile::IsShuffleTile_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_IsShuffleTile, IsShuffled) == 0x000001, "Member 'WBP_UIKit_PresetCard_C_IsShuffleTile::IsShuffled' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PresetCard_C_IsShuffleTile, IsShuffleEnabled_0) == 0x000002, "Member 'WBP_UIKit_PresetCard_C_IsShuffleTile::IsShuffleEnabled_0' has a wrong offset!");

}

