#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AugmentSelector_AugmentInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerAugmentsUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AugmentSelector_AugmentInfo.WBP_AugmentSelector_AugmentInfo_C
// 0x00D0 (0x0420 - 0x0350)
class UWBP_AugmentSelector_AugmentInfo_C final : public UFortPlayerAugmentInfoEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FocusPulse;                                   // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Reroll;                                       // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ActivationConfirmation;                       // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused;                                      // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Button_AugmentActivate;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Content;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DescriptionTextOverlay;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTouchUserWidget*                   FortTouchUserWidget;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_BackingPanel_UnlockedFX;                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Border_Unlocked;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Border_UnlockedGlow;                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AugmentIcon;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CheckMark;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ConfirmationOutline;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GreenOverlay;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Outline_Scale;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TeammateIcon_Color;                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TeammateIcon_Color_Glow;                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       Keybind_ActivateAction;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewPrompt;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TeammateAugment;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_UnlockedBang;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PlatformVisibilityOverlay;                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_WidthConrol;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortPlayerAugmentItemDefinition*       Augment_Item_Definition;                           // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_AugmentSelector_AugmentInfo(int32 EntryPoint);
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemPinColorSet(const struct FLinearColor& PinColor);
	void OnLoaded_922BC2C84BE9FC8FE494899AC556F9F2(class UObject* Loaded);
	void PlayHUDSwapAnim();
	void PlayPulseAnimation();
	void PlayRerollAnim();
	void ResetState();
	void SetAugmentIcon(TSoftObjectPtr<class UObject> Asset);
	void SetAugmentInfo(class UFortPlayerAugmentItemDefinition* InAugmentItemDefinition);
	void SetFocused(bool IsFocused, bool PlayAnimation_0);
	void SetMobileVisuals(ECommonInputType InputType);
	void TriggerActivationAnimation(double* AnimationEndTime);
	void UpdateBorrowedPrompt(bool IsBorrowed);
	void UpdateNewPrompt(bool IsNew);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AugmentSelector_AugmentInfo_C">();
	}
	static class UWBP_AugmentSelector_AugmentInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AugmentSelector_AugmentInfo_C>();
	}
};
static_assert(alignof(UWBP_AugmentSelector_AugmentInfo_C) == 0x000008, "Wrong alignment on UWBP_AugmentSelector_AugmentInfo_C");
static_assert(sizeof(UWBP_AugmentSelector_AugmentInfo_C) == 0x000420, "Wrong size on UWBP_AugmentSelector_AugmentInfo_C");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, UberGraphFrame) == 0x000350, "Member 'UWBP_AugmentSelector_AugmentInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Anim_FocusPulse) == 0x000358, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Anim_FocusPulse' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Anim_Reroll) == 0x000360, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Anim_Reroll' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Anim_ActivationConfirmation) == 0x000368, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Anim_ActivationConfirmation' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Anim_Focused) == 0x000370, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Anim_Focused' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Button_AugmentActivate) == 0x000378, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Button_AugmentActivate' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Content) == 0x000380, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, DescriptionTextOverlay) == 0x000388, "Member 'UWBP_AugmentSelector_AugmentInfo_C::DescriptionTextOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, FortTouchUserWidget) == 0x000390, "Member 'UWBP_AugmentSelector_AugmentInfo_C::FortTouchUserWidget' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Icon_BackingPanel_UnlockedFX) == 0x000398, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Icon_BackingPanel_UnlockedFX' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Icon_Border_Unlocked) == 0x0003A0, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Icon_Border_Unlocked' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Icon_Border_UnlockedGlow) == 0x0003A8, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Icon_Border_UnlockedGlow' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_AugmentIcon) == 0x0003B0, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_AugmentIcon' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_CheckMark) == 0x0003B8, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_CheckMark' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_ConfirmationOutline) == 0x0003C0, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_ConfirmationOutline' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_GreenOverlay) == 0x0003C8, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_GreenOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_Outline_Scale) == 0x0003D0, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_Outline_Scale' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_TeammateIcon_Color) == 0x0003D8, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_TeammateIcon_Color' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Image_TeammateIcon_Color_Glow) == 0x0003E0, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Image_TeammateIcon_Color_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Keybind_ActivateAction) == 0x0003E8, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Keybind_ActivateAction' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Overlay_NewPrompt) == 0x0003F0, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Overlay_NewPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Overlay_TeammateAugment) == 0x0003F8, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Overlay_TeammateAugment' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Overlay_UnlockedBang) == 0x000400, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Overlay_UnlockedBang' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, PlatformVisibilityOverlay) == 0x000408, "Member 'UWBP_AugmentSelector_AugmentInfo_C::PlatformVisibilityOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Spacer_WidthConrol) == 0x000410, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Spacer_WidthConrol' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentInfo_C, Augment_Item_Definition) == 0x000418, "Member 'UWBP_AugmentSelector_AugmentInfo_C::Augment_Item_Definition' has a wrong offset!");

}

