#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_Toggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_ToggleType_structs.hpp"
#include "WBP_UIKit_Block_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_Toggle.WBP_UIKit_Block_Toggle_C
// 0x0128 (0x0420 - 0x02F8)
class UWBP_UIKit_Block_Toggle_C final : public UWBP_UIKit_Block_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SelectedDisabled_Transition;                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedPressed_Transition;                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedFocused_Transition;                   // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedHovered_Transition;                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Selected_Transition;                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       Image;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Brush;                                             // 0x0350(0x00C0)(Edit, BlueprintVisible)
	E_UI_ToggleType                               ToggleType;                                        // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Block_Toggle(int32 EntryPoint);
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnInstantTransitionToSelected();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void PreConstruct(bool IsDesignTime);
	void RefreshImageMID();
	void SetBrush(const struct FSlateBrush& InBrush);
	void SetMaterial(const class UMaterialInstance*& InMaterial);
	void SetSelected(bool Selected);
	void SetSize(const struct FVector2D& Desired_Size);
	void SetToggleType(E_UI_ToggleType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_Toggle_C">();
	}
	static class UWBP_UIKit_Block_Toggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_Toggle_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Block_Toggle_C) == 0x000010, "Wrong alignment on UWBP_UIKit_Block_Toggle_C");
static_assert(sizeof(UWBP_UIKit_Block_Toggle_C) == 0x000420, "Wrong size on UWBP_UIKit_Block_Toggle_C");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UIKit_Block_Toggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_SelectedDisabled_Transition) == 0x000300, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_SelectedDisabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_SelectedPressed_Transition) == 0x000308, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_SelectedPressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_SelectedFocused_Transition) == 0x000310, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_SelectedFocused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_SelectedHovered_Transition) == 0x000318, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_SelectedHovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_Selected_Transition) == 0x000320, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_Selected_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_Disabled_Transition) == 0x000328, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_Disabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_Pressed_Transition) == 0x000330, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_Focused_Transition) == 0x000338, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_Focused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Anim_Hovered_Transition) == 0x000340, "Member 'UWBP_UIKit_Block_Toggle_C::Anim_Hovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Image) == 0x000348, "Member 'UWBP_UIKit_Block_Toggle_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, Brush) == 0x000350, "Member 'UWBP_UIKit_Block_Toggle_C::Brush' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, ToggleType) == 0x000410, "Member 'UWBP_UIKit_Block_Toggle_C::ToggleType' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Toggle_C, ImageMID) == 0x000418, "Member 'UWBP_UIKit_Block_Toggle_C::ImageMID' has a wrong offset!");

}

