#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Transference

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Transference.WBP_UIKit_Transference_C.SetHasTransference
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Transference_C_SetHasTransference final
{
public:
	bool                                          Has_Transference;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Transference_C_SetHasTransference) == 0x000001, "Wrong alignment on WBP_UIKit_Transference_C_SetHasTransference");
static_assert(sizeof(WBP_UIKit_Transference_C_SetHasTransference) == 0x000001, "Wrong size on WBP_UIKit_Transference_C_SetHasTransference");
static_assert(offsetof(WBP_UIKit_Transference_C_SetHasTransference, Has_Transference) == 0x000000, "Member 'WBP_UIKit_Transference_C_SetHasTransference::Has_Transference' has a wrong offset!");

// Function WBP_UIKit_Transference.WBP_UIKit_Transference_C.SetHasTransferenceModes
// 0x0050 (0x0050 - 0x0000)
struct WBP_UIKit_Transference_C_SetHasTransferenceModes final
{
public:
	TSet<ECosmeticCompatibleMode>                 Compatible_Modes;                                  // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_UIKit_Transference_C_SetHasTransferenceModes) == 0x000008, "Wrong alignment on WBP_UIKit_Transference_C_SetHasTransferenceModes");
static_assert(sizeof(WBP_UIKit_Transference_C_SetHasTransferenceModes) == 0x000050, "Wrong size on WBP_UIKit_Transference_C_SetHasTransferenceModes");
static_assert(offsetof(WBP_UIKit_Transference_C_SetHasTransferenceModes, Compatible_Modes) == 0x000000, "Member 'WBP_UIKit_Transference_C_SetHasTransferenceModes::Compatible_Modes' has a wrong offset!");

// Function WBP_UIKit_Transference.WBP_UIKit_Transference_C.SetIsEnhanced
// 0x0020 (0x0020 - 0x0000)
struct WBP_UIKit_Transference_C_SetIsEnhanced final
{
public:
	bool                                          Is_Enhanced;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Transference_C_SetIsEnhanced) == 0x000008, "Wrong alignment on WBP_UIKit_Transference_C_SetIsEnhanced");
static_assert(sizeof(WBP_UIKit_Transference_C_SetIsEnhanced) == 0x000020, "Wrong size on WBP_UIKit_Transference_C_SetIsEnhanced");
static_assert(offsetof(WBP_UIKit_Transference_C_SetIsEnhanced, Is_Enhanced) == 0x000000, "Member 'WBP_UIKit_Transference_C_SetIsEnhanced::Is_Enhanced' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Transference_C_SetIsEnhanced, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Transference_C_SetIsEnhanced::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Transference_C_SetIsEnhanced, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_UIKit_Transference_C_SetIsEnhanced::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Transference_C_SetIsEnhanced, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_UIKit_Transference_C_SetIsEnhanced::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_Transference.WBP_UIKit_Transference_C.SetRoundedCorners
// 0x0020 (0x0020 - 0x0000)
struct WBP_UIKit_Transference_C_SetRoundedCorners final
{
public:
	bool                                          Is_Rounded;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Transference_C_SetRoundedCorners) == 0x000008, "Wrong alignment on WBP_UIKit_Transference_C_SetRoundedCorners");
static_assert(sizeof(WBP_UIKit_Transference_C_SetRoundedCorners) == 0x000020, "Wrong size on WBP_UIKit_Transference_C_SetRoundedCorners");
static_assert(offsetof(WBP_UIKit_Transference_C_SetRoundedCorners, Is_Rounded) == 0x000000, "Member 'WBP_UIKit_Transference_C_SetRoundedCorners::Is_Rounded' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Transference_C_SetRoundedCorners, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Transference_C_SetRoundedCorners::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Transference_C_SetRoundedCorners, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_UIKit_Transference_C_SetRoundedCorners::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Transference_C_SetRoundedCorners, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_UIKit_Transference_C_SetRoundedCorners::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_Transference.WBP_UIKit_Transference_C.SetSize
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Transference_C_SetSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Transference_C_SetSize) == 0x000008, "Wrong alignment on WBP_UIKit_Transference_C_SetSize");
static_assert(sizeof(WBP_UIKit_Transference_C_SetSize) == 0x000010, "Wrong size on WBP_UIKit_Transference_C_SetSize");
static_assert(offsetof(WBP_UIKit_Transference_C_SetSize, Size) == 0x000000, "Member 'WBP_UIKit_Transference_C_SetSize::Size' has a wrong offset!");

}

