#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPLocker_ItemDetails

#include "Basic.hpp"

#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_MPLocker_ItemDetails.WBP_MPLocker_ItemDetails_C.BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MPLocker_ItemDetails_C_BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MPLocker_ItemDetails.WBP_MPLocker_ItemDetails_C.ExecuteUbergraph_WBP_MPLocker_ItemDetails
// 0x0038 (0x0038 - 0x0000)
struct WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails) == 0x000008, "Wrong alignment on WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails");
static_assert(sizeof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails) == 0x000038, "Wrong size on WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, EntryPoint) == 0x000000, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, CallFunc_IsInSubGame_ReturnValue) == 0x000030, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::CallFunc_IsInSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'WBP_MPLocker_ItemDetails_C_ExecuteUbergraph_WBP_MPLocker_ItemDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MPLocker_ItemDetails.WBP_MPLocker_ItemDetails_C.SetCustomItemDetails
// 0x0020 (0x0020 - 0x0000)
struct WBP_MPLocker_ItemDetails_C_SetCustomItemDetails final
{
public:
	class UClass*                                 CustomItemDetails_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPLocker_ItemDetails_C_SetCustomItemDetails) == 0x000008, "Wrong alignment on WBP_MPLocker_ItemDetails_C_SetCustomItemDetails");
static_assert(sizeof(WBP_MPLocker_ItemDetails_C_SetCustomItemDetails) == 0x000020, "Wrong size on WBP_MPLocker_ItemDetails_C_SetCustomItemDetails");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_SetCustomItemDetails, CustomItemDetails_0) == 0x000000, "Member 'WBP_MPLocker_ItemDetails_C_SetCustomItemDetails::CustomItemDetails_0' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_SetCustomItemDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_MPLocker_ItemDetails_C_SetCustomItemDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_SetCustomItemDetails, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_MPLocker_ItemDetails_C_SetCustomItemDetails::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_SetCustomItemDetails, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'WBP_MPLocker_ItemDetails_C_SetCustomItemDetails::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_MPLocker_ItemDetails.WBP_MPLocker_ItemDetails_C.BP_GetDesiredInputConfig
// 0x000C (0x000C - 0x0000)
struct WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig final
{
public:
	struct FUIInputConfig                         ReturnValue;                                       // 0x0000(0x0006)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUIInputConfig                         K2Node_MakeStruct_UIInputConfig;                   // 0x0006(0x0006)(NoDestructor)
};
static_assert(alignof(WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig) == 0x000001, "Wrong alignment on WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig");
static_assert(sizeof(WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig) == 0x00000C, "Wrong size on WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig, ReturnValue) == 0x000000, "Member 'WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig, K2Node_MakeStruct_UIInputConfig) == 0x000006, "Member 'WBP_MPLocker_ItemDetails_C_BP_GetDesiredInputConfig::K2Node_MakeStruct_UIInputConfig' has a wrong offset!");

}

