#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActivityBrowserTile_JoinableParty

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.BP_OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged, CurrentInputType) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_BP_OnInputMethodChanged::CurrentInputType' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.BP_OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_BP_OnSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.BP_PartyInformationUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated final
{
public:
	bool                                          bInIsTileSelected;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated, bInIsTileSelected) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_BP_PartyInformationUpdated::bInIsTileSelected' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty
// 0x0248 (0x0248 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTexture*                         K2Node_Event_ThumbnailTexture_1;                   // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_RichPresence;                         // 0x0028(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Names;                                // 0x0040(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_2;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SingleFriendName;                     // 0x0098(0x0018)(ConstParm)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_LastInteraction;                      // 0x00C0(0x0018)(ConstParm)
	bool                                          Temp_bool_Variable_4;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_CurrentInputType;                     // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsTileSelected;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x016C(0x0014)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_4;                           // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UTexture*                         K2Node_Event_ThumbnailTexture;                     // 0x01D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_OtherPlayersSubText;                  // 0x01E0(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTileActive;                        // 0x01F9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_2;               // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_6;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Select_Default_7;                           // 0x0220(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_8;                           // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty) == 0x000248, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, EntryPoint) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_byte_Variable) == 0x000004, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable) == 0x000005, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_2) == 0x000007, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_ThumbnailTexture_1) == 0x000020, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_ThumbnailTexture_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_RichPresence) == 0x000028, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_RichPresence' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_Names) == 0x000040, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_Names' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_TextIsEmpty_ReturnValue) == 0x000058, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_byte_Variable_1) == 0x000059, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_3) == 0x00005A, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_IsDesignTime) == 0x00005B, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000060, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x000068, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000070, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_struct_Variable) == 0x000078, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetCurrentInputType_ReturnValue_2) == 0x000088, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetCurrentInputType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_ComponentBoundEvent_Button) == 0x000090, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_SingleFriendName) == 0x000098, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_SingleFriendName' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_struct_Variable_1) == 0x0000B0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_LastInteraction) == 0x0000C0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_LastInteraction' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_4) == 0x0000D8, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000D9, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_struct_Variable_2) == 0x0000E0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_IsMobileGame_ReturnValue) == 0x0000F0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_IsUsingTouch_ReturnValue) == 0x0000F1, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_CurrentInputType) == 0x0000F2, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_CurrentInputType' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_BooleanAND_ReturnValue) == 0x0000F3, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_SelectFloat_ReturnValue) == 0x0000F8, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default) == 0x000100, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_5) == 0x000110, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_IsMobileGame_ReturnValue_1) == 0x000111, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_bIsSelected) == 0x000112, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_bInIsTileSelected) == 0x000128, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_bInIsTileSelected' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_struct_Variable_3) == 0x000130, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_struct_Variable_4) == 0x000140, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_6) == 0x000150, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_struct_Variable_5) == 0x000158, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_7) == 0x000168, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_MakeStruct_SlateColor) == 0x00016C, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000180, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_BooleanAND_ReturnValue_1) == 0x000181, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_SelectFloat_ReturnValue_1) == 0x000188, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_1) == 0x000190, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_byte_Variable_2) == 0x0001A0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_byte_Variable_3) == 0x0001A1, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_8) == 0x0001A2, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_2) == 0x0001A8, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_3) == 0x0001B8, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_4) == 0x0001C0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_ThumbnailTexture) == 0x0001D0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_ThumbnailTexture' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_byte_Variable_4) == 0x0001D8, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_OtherPlayersSubText) == 0x0001E0, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_OtherPlayersSubText' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_TextIsEmpty_ReturnValue_2) == 0x0001F8, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Event_bIsTileActive) == 0x0001F9, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Event_bIsTileActive' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_5) == 0x0001FA, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_IsUsingTouch_ReturnValue_1) == 0x0001FB, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_IsUsingTouch_ReturnValue_2) == 0x0001FC, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_IsUsingTouch_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_6) == 0x000200, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000208, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_PlayAnimationForward_ReturnValue) == 0x000210, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_byte_Variable_5) == 0x000218, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_7) == 0x000220, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetEndTime_ReturnValue) == 0x000228, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_GetStartTime_ReturnValue) == 0x00022C, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, Temp_bool_Variable_9) == 0x000230, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_8) == 0x000234, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, K2Node_Select_Default_9) == 0x000238, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00023C, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x000240, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.Is Arabic Language
// 0x0020 (0x0020 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language final
{
public:
	bool                                          IsArabic;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language) == 0x000020, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language, IsArabic) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language::IsArabic' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language, CallFunc_GetCurrentCulture_ReturnValue) == 0x000008, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Is_Arabic_Language::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.OnTextureLoadingComplete
// 0x0008 (0x0008 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete final
{
public:
	const class UTexture*                         ThumbnailTexture_0;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete) == 0x000008, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete, ThumbnailTexture_0) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_OnTextureLoadingComplete::ThumbnailTexture_0' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.OnTileActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged final
{
public:
	bool                                          bIsTileActive;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged, bIsTileActive) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_OnTileActiveChanged::bIsTileActive' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.Set CTAButton Padding
// 0x0080 (0x0080 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default;                             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding) == 0x000080, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, InputType) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::InputType' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, Temp_byte_Variable) == 0x000001, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, Temp_struct_Variable) == 0x000004, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, CallFunc_GetIsEnabled_ReturnValue) == 0x000024, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, CallFunc_SelectFloat_ReturnValue_1) == 0x000038, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000040, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, K2Node_MakeStruct_Margin) == 0x000048, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, K2Node_MakeStruct_Margin_1) == 0x000058, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, K2Node_Select_Default) == 0x000068, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, K2Node_MakeStruct_Left_ImplicitCast) == 0x000078, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding, K2Node_MakeStruct_Left_ImplicitCast_1) == 0x00007C, "Member 'WBP_ActivityBrowserTile_JoinableParty_C_Set_CTAButton_Padding::K2Node_MakeStruct_Left_ImplicitCast_1' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty.WBP_ActivityBrowserTile_JoinableParty_C.Set Right Left Background
// 0x0020 (0x0020 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_C_Set_Right_Left_Background final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Arabic_Language_IsArabic;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
