#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPLocker_ItemDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPLocker_ItemDetails.WBP_MPLocker_ItemDetails_C
// 0x0080 (0x0480 - 0x0400)
class UWBP_MPLocker_ItemDetails_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScreenIn;                                          // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_CameraFrame;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_Back;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_Camera;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemPreviewWidget_C*               FortItemPreviewWidget;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Header_Item;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_CustomDetails;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_22;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Details;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBarContainer_C*              WBP_ActionBarContainer;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerInfo_C*                      WBP_PlayerInfo;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_ItemDescription_MPL_C*       WBP_UIKit_ItemDescription_MPL;                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Widget_CameraFrame;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 CustomItemDetails;                                 // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPLocker_ItemDetails_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_MPLocker_ItemDetails(int32 EntryPoint);
	void Finished_9AF8DE53422991084904A18DB321BA72();
	void SetCustomItemDetails(class UClass* CustomItemDetails_0);

	struct FUIInputConfig BP_GetDesiredInputConfig() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPLocker_ItemDetails_C">();
	}
	static class UWBP_MPLocker_ItemDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPLocker_ItemDetails_C>();
	}
};
static_assert(alignof(UWBP_MPLocker_ItemDetails_C) == 0x000008, "Wrong alignment on UWBP_MPLocker_ItemDetails_C");
static_assert(sizeof(UWBP_MPLocker_ItemDetails_C) == 0x000480, "Wrong size on UWBP_MPLocker_ItemDetails_C");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, UberGraphFrame) == 0x000400, "Member 'UWBP_MPLocker_ItemDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, FortItemSelectionVM) == 0x000408, "Member 'UWBP_MPLocker_ItemDetails_C::FortItemSelectionVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, ScreenIn) == 0x000410, "Member 'UWBP_MPLocker_ItemDetails_C::ScreenIn' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, Border_CameraFrame) == 0x000418, "Member 'UWBP_MPLocker_ItemDetails_C::Border_CameraFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, Button_Back) == 0x000420, "Member 'UWBP_MPLocker_ItemDetails_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, Button_Camera) == 0x000428, "Member 'UWBP_MPLocker_ItemDetails_C::Button_Camera' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, FortItemPreviewWidget) == 0x000430, "Member 'UWBP_MPLocker_ItemDetails_C::FortItemPreviewWidget' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, Header_Item) == 0x000438, "Member 'UWBP_MPLocker_ItemDetails_C::Header_Item' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, NamedSlot_CustomDetails) == 0x000440, "Member 'UWBP_MPLocker_ItemDetails_C::NamedSlot_CustomDetails' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, SafeZone_22) == 0x000448, "Member 'UWBP_MPLocker_ItemDetails_C::SafeZone_22' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, SizeBox_Details) == 0x000450, "Member 'UWBP_MPLocker_ItemDetails_C::SizeBox_Details' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, WBP_ActionBarContainer) == 0x000458, "Member 'UWBP_MPLocker_ItemDetails_C::WBP_ActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, WBP_PlayerInfo) == 0x000460, "Member 'UWBP_MPLocker_ItemDetails_C::WBP_PlayerInfo' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, WBP_UIKit_ItemDescription_MPL) == 0x000468, "Member 'UWBP_MPLocker_ItemDetails_C::WBP_UIKit_ItemDescription_MPL' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, Widget_CameraFrame) == 0x000470, "Member 'UWBP_MPLocker_ItemDetails_C::Widget_CameraFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_ItemDetails_C, CustomItemDetails) == 0x000478, "Member 'UWBP_MPLocker_ItemDetails_C::CustomItemDetails' has a wrong offset!");

}

