#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_Collectible

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EventScreenBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LinedNotebook_Collectible.WBP_LinedNotebook_Collectible_C
// 0x0070 (0x0390 - 0x0320)
class UWBP_LinedNotebook_Collectible_C final : public UFortEventTokenCollectionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Owned;                                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Collected;                                         // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVisualAttachment*                  FVA_Backing;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Socket;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Token_MID;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCollected;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CollectedSound;                                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OwnedSound;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             RevealedSound;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRewardPreview;                                   // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstViewAfterCollection;                        // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ChaseRewardImage;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPurpleBG;                                        // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayBacking;                                    // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CollectAnim();
	void CompletedEvent();
	class FString DetermineIntroAnim();
	void ExecuteUbergraph_WBP_LinedNotebook_Collectible(int32 EntryPoint);
	void HIdeAll();
	void InitMaterials();
	void OnRefreshIcon(const bool IsCollected_0, const bool bIsFirstViewAfterCollection);
	void PlayRevealAnim(const class FString& DebugSelection);
	void PreConstruct(bool IsDesignTime);
	void RefreshTokenIcon(bool IsCollected_0);
	void SequenceEvent__ENTRYPOINTWBP_LinedNotebook_Collectible();
	void SetIsPurpleBG(bool IsPurpleBG_0);
	void SetupRewardPreviewCollectible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LinedNotebook_Collectible_C">();
	}
	static class UWBP_LinedNotebook_Collectible_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LinedNotebook_Collectible_C>();
	}
};
static_assert(alignof(UWBP_LinedNotebook_Collectible_C) == 0x000008, "Wrong alignment on UWBP_LinedNotebook_Collectible_C");
static_assert(sizeof(UWBP_LinedNotebook_Collectible_C) == 0x000390, "Wrong size on UWBP_LinedNotebook_Collectible_C");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, UberGraphFrame) == 0x000320, "Member 'UWBP_LinedNotebook_Collectible_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, Owned) == 0x000328, "Member 'UWBP_LinedNotebook_Collectible_C::Owned' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, Collected) == 0x000330, "Member 'UWBP_LinedNotebook_Collectible_C::Collected' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, Reveal) == 0x000338, "Member 'UWBP_LinedNotebook_Collectible_C::Reveal' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, FVA_Backing) == 0x000340, "Member 'UWBP_LinedNotebook_Collectible_C::FVA_Backing' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, Image_Socket) == 0x000348, "Member 'UWBP_LinedNotebook_Collectible_C::Image_Socket' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, Token_MID) == 0x000350, "Member 'UWBP_LinedNotebook_Collectible_C::Token_MID' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, IsCollected) == 0x000358, "Member 'UWBP_LinedNotebook_Collectible_C::IsCollected' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, CollectedSound) == 0x000360, "Member 'UWBP_LinedNotebook_Collectible_C::CollectedSound' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, OwnedSound) == 0x000368, "Member 'UWBP_LinedNotebook_Collectible_C::OwnedSound' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, RevealedSound) == 0x000370, "Member 'UWBP_LinedNotebook_Collectible_C::RevealedSound' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, IsRewardPreview) == 0x000378, "Member 'UWBP_LinedNotebook_Collectible_C::IsRewardPreview' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, IsFirstViewAfterCollection) == 0x000379, "Member 'UWBP_LinedNotebook_Collectible_C::IsFirstViewAfterCollection' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, ChaseRewardImage) == 0x000380, "Member 'UWBP_LinedNotebook_Collectible_C::ChaseRewardImage' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, IsPurpleBG) == 0x000388, "Member 'UWBP_LinedNotebook_Collectible_C::IsPurpleBG' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Collectible_C, DisplayBacking) == 0x000389, "Member 'UWBP_LinedNotebook_Collectible_C::DisplayBacking' has a wrong offset!");

}

