#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPL_Customize_NumberSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPL_Customize_NumberSelect.WBP_MPL_Customize_NumberSelect_C
// 0x0050 (0x0310 - 0x02C0)
class UWBP_MPL_Customize_NumberSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_VariantName;                                  // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NumericalValue;                               // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVariantSelectorVM*                 FortVariantSelectorVM;                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortVariantNumericChannelVM*           FortVariantNumericChannelVM;                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UPanelButton_C*                         Button_TenDigitDown;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         Button_TenDigitUp;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         Button_ZeroDigitDown;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         Button_ZeroDigitUp;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__FortCosmeticVariantRow_Numeric_Button_TenDigitDown_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__FortCosmeticVariantRow_Numeric_Button_TenDigitUp_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__FortCosmeticVariantRow_Numeric_Button_ZeroDigitDown_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__FortCosmeticVariantRow_Numeric_Button_ZeroDigitUp_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_WBP_MPL_Customize_NumberSelect(int32 EntryPoint);
	void OnOperationCompleted_E6DD132F46D20B74225C7FBF217F23FF(bool Success);
	void SetFortVariantNumericChannelVM(class UFortVariantNumericChannelVM* ViewModel);

	void GetDesiredFocusTarget(class UWidget** FocusTarget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPL_Customize_NumberSelect_C">();
	}
	static class UWBP_MPL_Customize_NumberSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPL_Customize_NumberSelect_C>();
	}
};
static_assert(alignof(UWBP_MPL_Customize_NumberSelect_C) == 0x000008, "Wrong alignment on UWBP_MPL_Customize_NumberSelect_C");
static_assert(sizeof(UWBP_MPL_Customize_NumberSelect_C) == 0x000310, "Wrong size on UWBP_MPL_Customize_NumberSelect_C");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_MPL_Customize_NumberSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, Text_VariantName) == 0x0002C8, "Member 'UWBP_MPL_Customize_NumberSelect_C::Text_VariantName' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, Text_NumericalValue) == 0x0002D0, "Member 'UWBP_MPL_Customize_NumberSelect_C::Text_NumericalValue' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, FortVariantSelectorVM) == 0x0002D8, "Member 'UWBP_MPL_Customize_NumberSelect_C::FortVariantSelectorVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, FortItemSelectionVM) == 0x0002E0, "Member 'UWBP_MPL_Customize_NumberSelect_C::FortItemSelectionVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, FortVariantNumericChannelVM) == 0x0002E8, "Member 'UWBP_MPL_Customize_NumberSelect_C::FortVariantNumericChannelVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, Button_TenDigitDown) == 0x0002F0, "Member 'UWBP_MPL_Customize_NumberSelect_C::Button_TenDigitDown' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, Button_TenDigitUp) == 0x0002F8, "Member 'UWBP_MPL_Customize_NumberSelect_C::Button_TenDigitUp' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, Button_ZeroDigitDown) == 0x000300, "Member 'UWBP_MPL_Customize_NumberSelect_C::Button_ZeroDigitDown' has a wrong offset!");
static_assert(offsetof(UWBP_MPL_Customize_NumberSelect_C, Button_ZeroDigitUp) == 0x000308, "Member 'UWBP_MPL_Customize_NumberSelect_C::Button_ZeroDigitUp' has a wrong offset!");

}

