#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SubcategoriesCarousel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_TabsInputActionType_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "E_UI_BackplateCornerRadius_structs.hpp"
#include "E_UI_BackplateBrightness_structs.hpp"
#include "S_UI_Placement_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.AddBackplate
// 0x0058 (0x0058 - 0x0000)
struct WBP_SubcategoriesCarousel_C_AddBackplate final
{
public:
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Base_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Base_C*            CallFunc_SpawnObject_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Base_C*            CallFunc_SpawnObject_ReturnValue_2;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_AddBackplate) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_AddBackplate");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_AddBackplate) == 0x000058, "Wrong size on WBP_SubcategoriesCarousel_C_AddBackplate");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_AddChild_ReturnValue) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_AddChild_ReturnValue_1) == 0x000018, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_AddChildToGrid_ReturnValue) == 0x000020, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_AddChildToGrid_ReturnValue_1) == 0x000028, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_AddChildToGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SpawnObject_ReturnValue_1) == 0x000030, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SpawnObject_ReturnValue_2) == 0x000038, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x000044, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast_1) == 0x000048, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast) == 0x00004C, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddBackplate, CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast_1) == 0x000050, "Member 'WBP_SubcategoriesCarousel_C_AddBackplate::CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast_1' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.AddButtonToGrid
// 0x0058 (0x0058 - 0x0000)
struct WBP_SubcategoriesCarousel_C_AddButtonToGrid final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_AddButtonToGrid) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_AddButtonToGrid");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_AddButtonToGrid) == 0x000058, "Wrong size on WBP_SubcategoriesCarousel_C_AddButtonToGrid");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, Widget) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::Widget' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, Index_0) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, K2Node_MakeStruct_Margin) == 0x000020, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, K2Node_MakeStruct_Margin_1) == 0x000030, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, CallFunc_AddChildToGrid_ReturnValue) == 0x000040, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, CallFunc_AddChildToGrid_ReturnValue_1) == 0x000048, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::CallFunc_AddChildToGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, K2Node_MakeStruct_Top_ImplicitCast) == 0x000050, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddButtonToGrid, K2Node_MakeStruct_Left_ImplicitCast) == 0x000054, "Member 'WBP_SubcategoriesCarousel_C_AddButtonToGrid::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.AddDivider
// 0x0028 (0x0028 - 0x0000)
struct WBP_SubcategoriesCarousel_C_AddDivider final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubGroup;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Divider_Base_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_AddDivider) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_AddDivider");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_AddDivider) == 0x000028, "Wrong size on WBP_SubcategoriesCarousel_C_AddDivider");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, Index_0) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, SubGroup) == 0x000004, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::SubGroup' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, Temp_int_Variable) == 0x000020, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, CallFunc_NotEqual_NameName_ReturnValue) == 0x000024, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDivider, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'WBP_SubcategoriesCarousel_C_AddDivider::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.AddDividerToGrid
// 0x0020 (0x0020 - 0x0000)
struct WBP_SubcategoriesCarousel_C_AddDividerToGrid final
{
public:
	class UWBP_UIKit_Divider_Base_C*              Divider;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_AddDividerToGrid) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_AddDividerToGrid");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_AddDividerToGrid) == 0x000020, "Wrong size on WBP_SubcategoriesCarousel_C_AddDividerToGrid");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDividerToGrid, Divider) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_AddDividerToGrid::Divider' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDividerToGrid, Index_0) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_AddDividerToGrid::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDividerToGrid, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SubcategoriesCarousel_C_AddDividerToGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDividerToGrid, CallFunc_AddChildToGrid_ReturnValue) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_AddDividerToGrid::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_AddDividerToGrid, CallFunc_AddChildToGrid_ReturnValue_1) == 0x000018, "Member 'WBP_SubcategoriesCarousel_C_AddDividerToGrid::CallFunc_AddChildToGrid_ReturnValue_1' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_NextButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_BndEvt__WBP_SubcategoriesCarousel_PrevButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.Cleanup
// 0x0020 (0x0020 - 0x0000)
struct WBP_SubcategoriesCarousel_C_Cleanup final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_Cleanup) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_Cleanup");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_Cleanup) == 0x000020, "Wrong size on WBP_SubcategoriesCarousel_C_Cleanup");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_Cleanup, Widget) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_Cleanup::Widget' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_Cleanup, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_Cleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_Cleanup, CallFunc_GetParent_ReturnValue) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_Cleanup::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_Cleanup, CallFunc_RemoveChild_ReturnValue) == 0x000018, "Member 'WBP_SubcategoriesCarousel_C_Cleanup::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.Event On Input Method Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed) == 0x000001, "Wrong alignment on WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed) == 0x000001, "Wrong size on WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed, bNewInputType) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_Event_On_Input_Method_Changed::bNewInputType' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.ExecuteUbergraph_WBP_SubcategoriesCarousel
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button, bool Selected)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TabNameID_1;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_Event_TabButton_1;                          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TabNameID;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_Event_TabButton;                            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel) == 0x0000E0, "Wrong size on WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, EntryPoint) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_MakeVector2D_ReturnValue_1) == 0x000018, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_ComponentBoundEvent_Button_1) == 0x000038, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000048, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_Event_IsDesignTime) == 0x00004C, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_MakeVector2D_ReturnValue_2) == 0x000058, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_MakeVector2D_ReturnValue_3) == 0x000068, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_Event_TabNameID_1) == 0x000078, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_Event_TabNameID_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_Event_TabButton_1) == 0x000080, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_Event_TabButton_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_CustomEvent_bNewInputType) == 0x000088, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000090, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_CustomEvent_Button) == 0x0000A8, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_CustomEvent_Selected) == 0x0000B0, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000B8, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_Event_TabNameID) == 0x0000C0, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_Event_TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, K2Node_Event_TabButton) == 0x0000C8, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::K2Node_Event_TabButton' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000D0, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'WBP_SubcategoriesCarousel_C_ExecuteUbergraph_WBP_SubcategoriesCarousel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.HandleTabCreation
// 0x0010 (0x0010 - 0x0000)
struct WBP_SubcategoriesCarousel_C_HandleTabCreation final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_HandleTabCreation) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_HandleTabCreation");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_HandleTabCreation) == 0x000010, "Wrong size on WBP_SubcategoriesCarousel_C_HandleTabCreation");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_HandleTabCreation, TabNameID) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_HandleTabCreation::TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_HandleTabCreation, TabButton) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_HandleTabCreation::TabButton' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.HandleTabRemoval
// 0x0010 (0x0010 - 0x0000)
struct WBP_SubcategoriesCarousel_C_HandleTabRemoval final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_HandleTabRemoval) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_HandleTabRemoval");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_HandleTabRemoval) == 0x000010, "Wrong size on WBP_SubcategoriesCarousel_C_HandleTabRemoval");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_HandleTabRemoval, TabNameID) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_HandleTabRemoval::TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_HandleTabRemoval, TabButton) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_HandleTabRemoval::TabButton' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.OnButtonSelectedChange
// 0x0010 (0x0010 - 0x0000)
struct WBP_SubcategoriesCarousel_C_OnButtonSelectedChange final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_OnButtonSelectedChange) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_OnButtonSelectedChange");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_OnButtonSelectedChange) == 0x000010, "Wrong size on WBP_SubcategoriesCarousel_C_OnButtonSelectedChange");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_OnButtonSelectedChange, Button) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_OnButtonSelectedChange::Button' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_OnButtonSelectedChange, Selected) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_OnButtonSelectedChange::Selected' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.OverrideInputActions
// 0x0020 (0x0020 - 0x0000)
struct WBP_SubcategoriesCarousel_C_OverrideInputActions final
{
public:
	struct FDataTableRowHandle                    Next_Tab;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FDataTableRowHandle                    PreviousTab;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_OverrideInputActions) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_OverrideInputActions");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_OverrideInputActions) == 0x000020, "Wrong size on WBP_SubcategoriesCarousel_C_OverrideInputActions");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_OverrideInputActions, Next_Tab) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_OverrideInputActions::Next_Tab' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_OverrideInputActions, PreviousTab) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_OverrideInputActions::PreviousTab' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.PopulateCategories
// 0x0098 (0x0098 - 0x0000)
struct WBP_SubcategoriesCarousel_C_PopulateCategories final
{
public:
	TArray<class UFortLockerCategoryItemVM*>      Categories;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           Category_labels;                                   // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UUIKitTabGroupViewModel*                tabsVM;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortLockerCategoryItemVM*              CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortTabViewModel*                      CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCategoryDisplayName_ReturnValue;       // 0x0040(0x0018)()
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAreAnyItemsNew_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortLockerCategoryConfig*        CallFunc_GetConfig_ReturnValue;                    // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortTabGroupViewModel*                 CallFunc_SpawnObject_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 Temp_byte_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 Temp_byte_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 K2Node_Select_Default;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_PopulateCategories) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_PopulateCategories");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_PopulateCategories) == 0x000098, "Wrong size on WBP_SubcategoriesCarousel_C_PopulateCategories");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Categories) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Categories' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Category_labels) == 0x000010, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Category_labels' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, tabsVM) == 0x000020, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::tabsVM' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_SpawnObject_ReturnValue) == 0x000038, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_GetCategoryDisplayName_ReturnValue) == 0x000040, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_GetCategoryDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_GetObjectName_ReturnValue) == 0x000058, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_GetAreAnyItemsNew_ReturnValue) == 0x00006C, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_GetAreAnyItemsNew_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_GetConfig_ReturnValue) == 0x000070, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_GetConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_SpawnObject_ReturnValue_1) == 0x000078, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Temp_byte_Variable) == 0x000080, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Temp_bool_Variable) == 0x000081, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Temp_byte_Variable_1) == 0x000088, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, K2Node_Select_Default) == 0x000090, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_Less_IntInt_ReturnValue) == 0x000091, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PopulateCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'WBP_SubcategoriesCarousel_C_PopulateCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SubcategoriesCarousel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SubcategoriesCarousel_C_PreConstruct");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_PreConstruct) == 0x000001, "Wrong size on WBP_SubcategoriesCarousel_C_PreConstruct");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SubcategoriesCarousel.WBP_SubcategoriesCarousel_C.PresetForDesignTime
// 0x0048 (0x0048 - 0x0000)
struct WBP_SubcategoriesCarousel_C_PresetForDesignTime final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SubcategoriesCarousel_C_PresetForDesignTime) == 0x000008, "Wrong alignment on WBP_SubcategoriesCarousel_C_PresetForDesignTime");
static_assert(sizeof(WBP_SubcategoriesCarousel_C_PresetForDesignTime) == 0x000048, "Wrong size on WBP_SubcategoriesCarousel_C_PresetForDesignTime");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PresetForDesignTime, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WBP_SubcategoriesCarousel_C_PresetForDesignTime::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PresetForDesignTime, Temp_bool_Variable) == 0x000001, "Member 'WBP_SubcategoriesCarousel_C_PresetForDesignTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PresetForDesignTime, Temp_byte_Variable) == 0x000002, "Member 'WBP_SubcategoriesCarousel_C_PresetForDesignTime::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PresetForDesignTime, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_SubcategoriesCarousel_C_PresetForDesignTime::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SubcategoriesCarousel_C_PresetForDesignTime, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_SubcategoriesCarousel_C_PresetForDesignTime::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
