#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActiveAugments_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "PlayerAugmentsUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActiveAugments_List.WBP_ActiveAugments_List_C
// 0x0080 (0x03B0 - 0x0330)
class UWBP_ActiveAugments_List_C final : public UFortPlayerAugmentHUDQuickbarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ListFocused;                                  // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_ArrowDown;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ArrowUp;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       Keybind_CycleAction;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortChildNavigatableScrollBox*         ScrollBox_ActiveList;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_CycleInput;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxAugmentIndex_DesignTime;                        // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ActiveAugments_ListEntry_C*> ActiveAugmentsEntries;                             // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_ActiveAugments_ListEntry_C*        FocusedEntry;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusedEntryIndex;                                 // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              InputType;                                         // 0x038C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ScrollTickSound;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HighlightSound;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortPlayerAugmentItemDefinition*> Active_Augments;                                   // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CreateActiveAugmentList(int32 Count);
	void ExecuteUbergraph_WBP_ActiveAugments_List(int32 EntryPoint);
	void OnActiveListOpened();
	void OnAugmentsUpdated(const TArray<class UFortPlayerAugmentItemDefinition*>& ActiveAugments);
	void PreConstruct(bool IsDesignTime);
	void RefreshArrows();
	void RefreshCurrentAugmentList();
	void ResetFocusedEntry();
	void ScrollDown();
	void ScrollUp();
	void SetFocusedEntry(int32 NewFocusedEntryIndex);
	void UpdateScrollBoundAction(ECommonInputType InputType_0);

	void GetNumAugmentGrantRounds(int32* NumAugmentsForRound) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActiveAugments_List_C">();
	}
	static class UWBP_ActiveAugments_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActiveAugments_List_C>();
	}
};
static_assert(alignof(UWBP_ActiveAugments_List_C) == 0x000008, "Wrong alignment on UWBP_ActiveAugments_List_C");
static_assert(sizeof(UWBP_ActiveAugments_List_C) == 0x0003B0, "Wrong size on UWBP_ActiveAugments_List_C");
static_assert(offsetof(UWBP_ActiveAugments_List_C, UberGraphFrame) == 0x000330, "Member 'UWBP_ActiveAugments_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, Anim_ListFocused) == 0x000338, "Member 'UWBP_ActiveAugments_List_C::Anim_ListFocused' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, Image_ArrowDown) == 0x000340, "Member 'UWBP_ActiveAugments_List_C::Image_ArrowDown' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, Image_ArrowUp) == 0x000348, "Member 'UWBP_ActiveAugments_List_C::Image_ArrowUp' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, Keybind_CycleAction) == 0x000350, "Member 'UWBP_ActiveAugments_List_C::Keybind_CycleAction' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, ScrollBox_ActiveList) == 0x000358, "Member 'UWBP_ActiveAugments_List_C::ScrollBox_ActiveList' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, VBox_CycleInput) == 0x000360, "Member 'UWBP_ActiveAugments_List_C::VBox_CycleInput' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, MaxAugmentIndex_DesignTime) == 0x000368, "Member 'UWBP_ActiveAugments_List_C::MaxAugmentIndex_DesignTime' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, ActiveAugmentsEntries) == 0x000370, "Member 'UWBP_ActiveAugments_List_C::ActiveAugmentsEntries' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, FocusedEntry) == 0x000380, "Member 'UWBP_ActiveAugments_List_C::FocusedEntry' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, FocusedEntryIndex) == 0x000388, "Member 'UWBP_ActiveAugments_List_C::FocusedEntryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, InputType) == 0x00038C, "Member 'UWBP_ActiveAugments_List_C::InputType' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, ScrollTickSound) == 0x000390, "Member 'UWBP_ActiveAugments_List_C::ScrollTickSound' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, HighlightSound) == 0x000398, "Member 'UWBP_ActiveAugments_List_C::HighlightSound' has a wrong offset!");
static_assert(offsetof(UWBP_ActiveAugments_List_C, Active_Augments) == 0x0003A0, "Member 'UWBP_ActiveAugments_List_C::Active_Augments' has a wrong offset!");

}

