#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CosmeticGate_IslandPreview

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CosmeticGate_IslandPreview.WBP_CosmeticGate_IslandPreview_C.ExecuteUbergraph_WBP_CosmeticGate_IslandPreview
// 0x0008 (0x0008 - 0x0000)
struct WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview) == 0x000004, "Wrong alignment on WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview");
static_assert(sizeof(WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview) == 0x000008, "Wrong size on WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview, EntryPoint) == 0x000000, "Member 'WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CosmeticGate_IslandPreview_C_ExecuteUbergraph_WBP_CosmeticGate_IslandPreview::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CosmeticGate_IslandPreview.WBP_CosmeticGate_IslandPreview_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CosmeticGate_IslandPreview_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_IslandPreview_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CosmeticGate_IslandPreview_C_PreConstruct");
static_assert(sizeof(WBP_CosmeticGate_IslandPreview_C_PreConstruct) == 0x000001, "Wrong size on WBP_CosmeticGate_IslandPreview_C_PreConstruct");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CosmeticGate_IslandPreview_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CosmeticGate_IslandPreview.WBP_CosmeticGate_IslandPreview_C.SetApprovalStatus
// 0x0020 (0x0020 - 0x0000)
struct WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus final
{
public:
	bool                                          ApprovalStatus;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_0_ImplicitCast;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus) == 0x000008, "Wrong alignment on WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus");
static_assert(sizeof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus) == 0x000020, "Wrong size on WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, ApprovalStatus) == 0x000000, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::ApprovalStatus' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, Temp_bool_Variable) == 0x000001, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, Temp_real_Variable) == 0x000004, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, K2Node_Select_Default) == 0x00000C, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, K2Node_Select_Default_1) == 0x000010, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus, K2Node_Select_Option_0_ImplicitCast) == 0x000018, "Member 'WBP_CosmeticGate_IslandPreview_C_SetApprovalStatus::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");

// Function WBP_CosmeticGate_IslandPreview.WBP_CosmeticGate_IslandPreview_C.SetMobileSize
// 0x0150 (0x0150 - 0x0000)
struct WBP_CosmeticGate_IslandPreview_C_SetMobileSize final
{
public:
	class UImage*                                 Image_ApprovalStatus_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_RatingIcon_0;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Thumbnail_0;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00C0)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_A_ImplicitCast; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize) == 0x000010, "Wrong alignment on WBP_CosmeticGate_IslandPreview_C_SetMobileSize");
static_assert(sizeof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize) == 0x000150, "Wrong size on WBP_CosmeticGate_IslandPreview_C_SetMobileSize");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, Image_ApprovalStatus_0) == 0x000000, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::Image_ApprovalStatus_0' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, Image_RatingIcon_0) == 0x000008, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::Image_RatingIcon_0' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, Image_Thumbnail_0) == 0x000010, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::Image_Thumbnail_0' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_IsMobileGame_ReturnValue) == 0x000050, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, Temp_int_Loop_Counter_Variable) == 0x000120, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, CallFunc_Multiply_Vector2DVector2D_A_ImplicitCast) == 0x000130, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::CallFunc_Multiply_Vector2DVector2D_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetMobileSize, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000140, "Member 'WBP_CosmeticGate_IslandPreview_C_SetMobileSize::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");

// Function WBP_CosmeticGate_IslandPreview.WBP_CosmeticGate_IslandPreview_C.SetRatingIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_CosmeticGate_IslandPreview_C_SetRatingIcon final
{
public:
	class UTexture2DDynamic*                      RatingIcon;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_IslandPreview_C_SetRatingIcon) == 0x000008, "Wrong alignment on WBP_CosmeticGate_IslandPreview_C_SetRatingIcon");
static_assert(sizeof(WBP_CosmeticGate_IslandPreview_C_SetRatingIcon) == 0x000010, "Wrong size on WBP_CosmeticGate_IslandPreview_C_SetRatingIcon");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetRatingIcon, RatingIcon) == 0x000000, "Member 'WBP_CosmeticGate_IslandPreview_C_SetRatingIcon::RatingIcon' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetRatingIcon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_CosmeticGate_IslandPreview_C_SetRatingIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CosmeticGate_IslandPreview.WBP_CosmeticGate_IslandPreview_C.SetThumbnailImage
// 0x0010 (0x0010 - 0x0000)
struct WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage final
{
public:
	class UTexture2D*                             Thumbnail;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage) == 0x000008, "Wrong alignment on WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage");
static_assert(sizeof(WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage) == 0x000010, "Wrong size on WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage, Thumbnail) == 0x000000, "Member 'WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage::Thumbnail' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CosmeticGate_IslandPreview_C_SetThumbnailImage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

