#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DynamicSubtitle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DynamicSubtitle.WBP_DynamicSubtitle_C.ExecuteUbergraph_WBP_DynamicSubtitle
// 0x0008 (0x0008 - 0x0000)
struct WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle) == 0x000004, "Wrong alignment on WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle");
static_assert(sizeof(WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle) == 0x000008, "Wrong size on WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle");
static_assert(offsetof(WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle, EntryPoint) == 0x000000, "Member 'WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DynamicSubtitle_C_ExecuteUbergraph_WBP_DynamicSubtitle::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_DynamicSubtitle.WBP_DynamicSubtitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DynamicSubtitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicSubtitle_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DynamicSubtitle_C_PreConstruct");
static_assert(sizeof(WBP_DynamicSubtitle_C_PreConstruct) == 0x000001, "Wrong size on WBP_DynamicSubtitle_C_PreConstruct");
static_assert(offsetof(WBP_DynamicSubtitle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DynamicSubtitle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DynamicSubtitle.WBP_DynamicSubtitle_C.SetSubtitleFont
// 0x0058 (0x0058 - 0x0000)
struct WBP_DynamicSubtitle_C_SetSubtitleFont final
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DynamicSubtitle_C_SetSubtitleFont) == 0x000008, "Wrong alignment on WBP_DynamicSubtitle_C_SetSubtitleFont");
static_assert(sizeof(WBP_DynamicSubtitle_C_SetSubtitleFont) == 0x000058, "Wrong size on WBP_DynamicSubtitle_C_SetSubtitleFont");
static_assert(offsetof(WBP_DynamicSubtitle_C_SetSubtitleFont, Font) == 0x000000, "Member 'WBP_DynamicSubtitle_C_SetSubtitleFont::Font' has a wrong offset!");

}

