#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CosmeticGate_ShopModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_BndEvt__WBP_CosmeticGate_ShopModal_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.ExecuteUbergraph_WBP_CosmeticGate_ShopModal
// 0x0050 (0x0050 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal) == 0x000050, "Wrong size on WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, EntryPoint) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000038, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000040, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_CosmeticGate_ShopModal_C_ExecuteUbergraph_WBP_CosmeticGate_ShopModal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.SetIslandAgeRestrictionIcons
// 0x0090 (0x0090 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CosmeticGate_IslandPreview_C*> K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CosmeticGate_IslandPreview_C*> K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2DDynamic*>              CallFunc_GetAgeRatingIconsForExperiences_AgeRatingIconsForExperiences; // 0x0040(0x0010)(ReferenceParm)
	class UTexture2DDynamic*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CosmeticGate_IslandPreview_C*> K2Node_Select_Default;                             // 0x0068(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CosmeticGate_IslandPreview_C*      CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons) == 0x000090, "Wrong size on WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, Temp_bool_Variable) == 0x000004, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, K2Node_MakeArray_Array_1) == 0x000020, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000038, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_GetAgeRatingIconsForExperiences_AgeRatingIconsForExperiences) == 0x000040, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_GetAgeRatingIconsForExperiences_AgeRatingIconsForExperiences' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000058, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, K2Node_Select_Default) == 0x000068, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandAgeRestrictionIcons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.SetIslandApprovalStatus
// 0x0040 (0x0040 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus final
{
public:
	TArray<TScriptInterface<class ICosmeticItemGatingInterface>> Cosmetic_Item_Interfaces;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetMinRatingGameplayTagsForCosmetics_OutMinGameplayTag; // 0x0018(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus) == 0x000040, "Wrong size on WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, Cosmetic_Item_Interfaces) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::Cosmetic_Item_Interfaces' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000010, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, CallFunc_GetMinRatingGameplayTagsForCosmetics_OutMinGameplayTag) == 0x000018, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::CallFunc_GetMinRatingGameplayTagsForCosmetics_OutMinGameplayTag' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, CallFunc_HasTag_ReturnValue) == 0x000038, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, CallFunc_HasTag_ReturnValue_1) == 0x000039, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, CallFunc_HasTag_ReturnValue_2) == 0x00003A, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus, CallFunc_BooleanOR_ReturnValue) == 0x00003B, "Member 'WBP_CosmeticGate_ShopModal_C_SetIslandApprovalStatus::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.SetMobileStyle
// 0x0020 (0x0020 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_SetMobileStyle final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_SetMobileStyle) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_SetMobileStyle");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_SetMobileStyle) == 0x000020, "Wrong size on WBP_CosmeticGate_ShopModal_C_SetMobileStyle");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetMobileStyle, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_SetMobileStyle::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetMobileStyle, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'WBP_CosmeticGate_ShopModal_C_SetMobileStyle::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetMobileStyle, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000018, "Member 'WBP_CosmeticGate_ShopModal_C_SetMobileStyle::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.SetOfferInfo
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_SetOfferInfo final
{
public:
	class UFortStoreFrontOfferInfo*               OfferInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OfferContainsJamTrack;                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItem*>                      CallFunc_GetGrantedItems_Items;                    // 0x0010(0x0010)(ReferenceParm)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemQuantityPair>          CallFunc_GetGrantedItemQuantityPairs_ItemQuantityPairs; // 0x00A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class ICosmeticItemGatingInterface>> CallFunc_ConvertItemQuantityPairsToCosmeticGatingInterfaces_OutCosmeticItemGatingInterfaces; // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetPurchaseConfirmationRatingRestrictedWarningText_ReturnValue; // 0x00D0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_SetOfferInfo");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo) == 0x0000F0, "Wrong size on WBP_CosmeticGate_ShopModal_C_SetOfferInfo");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, OfferInfo) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::OfferInfo' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, OfferContainsJamTrack) == 0x000008, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::OfferContainsJamTrack' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_bool_Variable) == 0x000009, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_GetGrantedItems_Items) == 0x000010, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_GetGrantedItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_text_Variable) == 0x000020, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_text_Variable_1) == 0x000040, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_int_Array_Index_Variable) == 0x000058, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000068, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_GetItemType_ReturnValue) == 0x000070, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, K2Node_Select_Default) == 0x000078, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_bool_Variable_1) == 0x000090, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_byte_Variable) == 0x000091, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_byte_Variable_1) == 0x000092, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, K2Node_Select_Default_1) == 0x000093, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000098, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_GetGrantedItemQuantityPairs_ItemQuantityPairs) == 0x0000A8, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_GetGrantedItemQuantityPairs_ItemQuantityPairs' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_ConvertItemQuantityPairsToCosmeticGatingInterfaces_OutCosmeticItemGatingInterfaces) == 0x0000C0, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_ConvertItemQuantityPairsToCosmeticGatingInterfaces_OutCosmeticItemGatingInterfaces' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_GetPurchaseConfirmationRatingRestrictedWarningText_ReturnValue) == 0x0000D0, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_GetPurchaseConfirmationRatingRestrictedWarningText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_SetOfferInfo, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_CosmeticGate_ShopModal_C_SetOfferInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CosmeticGate_ShopModal.WBP_CosmeticGate_ShopModal_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget, Temp_bool_Variable) == 0x000008, "Member 'WBP_CosmeticGate_ShopModal_C_BP_GetDesiredFocusTarget::Temp_bool_Variable' has a wrong offset!");
