#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PurchaseConfirmation_Dialog

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PurchaseConfirmation_Dialog.WBP_PurchaseConfirmation_Dialog_C.CheckOverrideDialogInfoText
// 0x0018 (0x0018 - 0x0000)
struct WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText final
{
public:
	class UUIKitDialogViewModel*                  DialogVM;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIKitDialogViewModel*                  OutDialogVM;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText) == 0x000008, "Wrong alignment on WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText");
static_assert(sizeof(WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText) == 0x000018, "Wrong size on WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText, DialogVM) == 0x000000, "Member 'WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText::DialogVM' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText, OutDialogVM) == 0x000008, "Member 'WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText::OutDialogVM' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText, CallFunc_TextIsEmpty_ReturnValue) == 0x000010, "Member 'WBP_PurchaseConfirmation_Dialog_C_CheckOverrideDialogInfoText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_PurchaseConfirmation_Dialog.WBP_PurchaseConfirmation_Dialog_C.ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog
// 0x0038 (0x0038 - 0x0000)
struct WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogVM_PurchaseConfirmation_C*       CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ButtonIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogVM_PurchaseConfirmation_C*       CallFunc_SpawnObject_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIKitDialogViewModel*                  CallFunc_CheckOverrideDialogInfoText_OutDialogVM;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog) == 0x000008, "Wrong alignment on WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog");
static_assert(sizeof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog) == 0x000038, "Wrong size on WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, EntryPoint) == 0x000000, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, CallFunc_SpawnObject_ReturnValue_1) == 0x000020, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, CallFunc_CheckOverrideDialogInfoText_OutDialogVM) == 0x000028, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::CallFunc_CheckOverrideDialogInfoText_OutDialogVM' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, K2Node_CustomEvent_ButtonIndex) == 0x000030, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, K2Node_SwitchInteger_CmpSuccess) == 0x000034, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog, K2Node_Event_IsDesignTime) == 0x000035, "Member 'WBP_PurchaseConfirmation_Dialog_C_ExecuteUbergraph_WBP_PurchaseConfirmation_Dialog::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_PurchaseConfirmation_Dialog.WBP_PurchaseConfirmation_Dialog_C.OnButtonClicked
// 0x0004 (0x0004 - 0x0000)
struct WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked) == 0x000004, "Wrong alignment on WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked");
static_assert(sizeof(WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked) == 0x000004, "Wrong size on WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked, ButtonIndex) == 0x000000, "Member 'WBP_PurchaseConfirmation_Dialog_C_OnButtonClicked::ButtonIndex' has a wrong offset!");

// Function WBP_PurchaseConfirmation_Dialog.WBP_PurchaseConfirmation_Dialog_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PurchaseConfirmation_Dialog_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PurchaseConfirmation_Dialog_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PurchaseConfirmation_Dialog_C_PreConstruct");
static_assert(sizeof(WBP_PurchaseConfirmation_Dialog_C_PreConstruct) == 0x000001, "Wrong size on WBP_PurchaseConfirmation_Dialog_C_PreConstruct");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PurchaseConfirmation_Dialog_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PurchaseConfirmation_Dialog.WBP_PurchaseConfirmation_Dialog_C.SetUIKitDialogViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel final
{
public:
	class UUIKitDialogViewModel*                  ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel) == 0x000008, "Wrong alignment on WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel");
static_assert(sizeof(WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel) == 0x000028, "Wrong size on WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel, ViewModel) == 0x000000, "Member 'WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_PurchaseConfirmation_Dialog_C_SetUIKitDialogViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

}

