#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestScreen_PlayerProfileAndXPBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_QuestScreen_PlayerProfileAndXPBar.WBP_QuestScreen_PlayerProfileAndXPBar_C.ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar
// 0x0004 (0x0004 - 0x0000)
struct WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar) == 0x000004, "Wrong alignment on WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar");
static_assert(sizeof(WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar) == 0x000004, "Wrong size on WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar");
static_assert(offsetof(WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar, EntryPoint) == 0x000000, "Member 'WBP_QuestScreen_PlayerProfileAndXPBar_C_ExecuteUbergraph_WBP_QuestScreen_PlayerProfileAndXPBar::EntryPoint' has a wrong offset!");

// Function WBP_QuestScreen_PlayerProfileAndXPBar.WBP_QuestScreen_PlayerProfileAndXPBar_C.SetCollapsedMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode final
{
public:
	bool                                          IsCollapsed;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode) == 0x000001, "Wrong alignment on WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode");
static_assert(sizeof(WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode) == 0x000001, "Wrong size on WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode");
static_assert(offsetof(WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode, IsCollapsed) == 0x000000, "Member 'WBP_QuestScreen_PlayerProfileAndXPBar_C_SetCollapsedMode::IsCollapsed' has a wrong offset!");

}

