#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_PurchaseLevelsModal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Addition_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_BndEvt__WBP_EventModal_Button_Subtraction_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000004, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000010, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0, Margin) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_CREATEDELEGATE_PROXYFUNCTION_0::Margin' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal
// 0x0450 (0x0450 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHolding;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCommonButtonBase*>              K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortEventScreenData*             K2Node_Event_InEventScreenData;                    // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x00B0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x00E0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_1;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_2;                           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x01CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CallFunc_Array_Get_Item;                           // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlusMinusButton_C*                     K2Node_DynamicCast_AsPlus_Minus_Button;            // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_CustomEvent_PreviewMargin;                  // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0210(0x0018)()
	TDelegate<void(struct FMargin& Margin)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0228(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_LegalText;                            // 0x0238(0x0018)(ConstParm)
	int32                                         K2Node_Event_TotalPrice;                           // 0x0250(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_LevelQuantity;                        // 0x0254(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PurchaseQuantity;                     // 0x0258(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ResourceQuantity;                     // 0x025C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0270(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x02C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02E0(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0338(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0350(0x0050)(HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_4;                           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x03D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0420(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0430(0x0018)()
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0448(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal) == 0x000010, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal) == 0x000450, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, EntryPoint) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_bool_Variable) == 0x000004, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_real_Variable) == 0x000008, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_bool_Variable_1) == 0x000010, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_int_Variable) == 0x000014, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_int_Variable_1) == 0x000018, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_bool_Variable_2) == 0x00001C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_real_Variable_2) == 0x000020, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_real_Variable_3) == 0x000024, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_real_Variable_4) == 0x000028, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_ComponentBoundEvent_Button_1) == 0x000048, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_ComponentBoundEvent_Button) == 0x000050, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_real_Variable_5) == 0x000058, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_CustomEvent_IsHolding) == 0x000068, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_CustomEvent_IsHolding' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_InEventScreenData) == 0x000090, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_InEventScreenData' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_bool_Variable_3) == 0x000098, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_IsDesignTime) == 0x000099, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_GetSafeZonePadding_SafePadding) == 0x0000B0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_GetSafeZonePadding_SafePadding' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_GetSafeZonePadding_SafePaddingScale) == 0x0000D0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_GetSafeZonePadding_SafePaddingScale' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_GetSafeZonePadding_SpillOverPadding) == 0x0000E0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_GetSafeZonePadding_SpillOverPadding' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_SpawnSound2D_ReturnValue) == 0x000100, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_BreakVector2D_X) == 0x000108, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_BreakVector2D_Y) == 0x000110, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000118, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000120, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_NormalizeToRange_ReturnValue) == 0x000128, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_GetViewportSize_ReturnValue) == 0x000130, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_FClamp_ReturnValue) == 0x000140, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_BreakVector2D_X_1) == 0x000148, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_BreakVector2D_Y_1) == 0x000150, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000158, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_FClamp_ReturnValue_1) == 0x000168, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_NormalizeToRange_ReturnValue_1) == 0x000170, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_NormalizeToRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_FClamp_ReturnValue_2) == 0x000178, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_IsMobileGame_ReturnValue) == 0x000180, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Lerp_ReturnValue) == 0x000188, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Lerp_ReturnValue_1) == 0x000190, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Select_Default) == 0x000198, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_MakeVector2D_ReturnValue) == 0x0001A0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Select_Default_1) == 0x0001B0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeStruct_Margin) == 0x0001B4, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Select_Default_2) == 0x0001C4, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_int_Array_Index_Variable) == 0x0001C8, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeStruct_Margin_1) == 0x0001CC, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_DynamicCast_AsPlus_Minus_Button) == 0x0001E8, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_DynamicCast_AsPlus_Minus_Button' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0001F8, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_CustomEvent_PreviewMargin) == 0x000200, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_CustomEvent_PreviewMargin' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_text_Variable) == 0x000210, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_CreateDelegate_OutputDelegate_3) == 0x000228, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_LegalText) == 0x000238, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_LegalText' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_TotalPrice) == 0x000250, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_TotalPrice' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_LevelQuantity) == 0x000254, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_LevelQuantity' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_PurchaseQuantity) == 0x000258, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_PurchaseQuantity' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Event_ResourceQuantity) == 0x00025C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Event_ResourceQuantity' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000260, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Greater_IntInt_ReturnValue) == 0x000268, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeStruct_FormatArgumentData) == 0x000270, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0002C0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_text_Variable_1) == 0x0002C8, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002E0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, Temp_bool_Variable_4) == 0x000330, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000331, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Select_Default_3) == 0x000338, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeStruct_FormatArgumentData_2) == 0x000350, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_Select_Default_4) == 0x0003A0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeArray_Array_1) == 0x0003A8, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Format_ReturnValue) == 0x0003B8, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeStruct_FormatArgumentData_3) == 0x0003D0, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, K2Node_MakeArray_Array_2) == 0x000420, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_Format_ReturnValue_1) == 0x000430, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000448, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_ExecuteUbergraph_WBP_LinedNotebook_PurchaseLevelsModal::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.HoldActionProgress
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress final
{
public:
	bool                                          IsHolding;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress) == 0x000001, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress) == 0x000001, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress, IsHolding) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_HoldActionProgress::IsHolding' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.OnCMSTextApplied
// 0x0018 (0x0018 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied final
{
public:
	class FText                                   LegalText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied) == 0x000008, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied) == 0x000018, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied, LegalText) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnCMSTextApplied::LegalText' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.OnEventScreenDataSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet final
{
public:
	const class UFortEventScreenData*             InEventScreenData;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet) == 0x000008, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet) == 0x000008, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet, InEventScreenData) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnEventScreenDataSet::InEventScreenData' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.OnPurchaseAmountChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged final
{
public:
	int32                                         TotalPrice;                                        // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelQuantity;                                     // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PurchaseQuantity;                                  // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceQuantity;                                  // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged) == 0x000004, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged) == 0x000010, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged, TotalPrice) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged::TotalPrice' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged, LevelQuantity) == 0x000004, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged::LevelQuantity' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged, PurchaseQuantity) == 0x000008, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged::PurchaseQuantity' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged, ResourceQuantity) == 0x00000C, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchaseAmountChanged::ResourceQuantity' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.OnPurchasePreviewOffsetAnimationEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent final
{
public:
	struct FMargin                                PreviewMargin;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent) == 0x000004, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent) == 0x000010, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent, PreviewMargin) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_OnPurchasePreviewOffsetAnimationEvent::PreviewMargin' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct");
static_assert(sizeof(WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct) == 0x000001, "Wrong size on WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct");
static_assert(offsetof(WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LinedNotebook_PurchaseLevelsModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LinedNotebook_PurchaseLevelsModal.WBP_LinedNotebook_PurchaseLevelsModal_C.UpdateFocus
// 0x0020 (0x0020 - 0x0000)
struct WBP_LinedNotebook_PurchaseLevelsModal_C_UpdateFocus final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocusedDescendants_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue_1;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocusedDescendants_ReturnValue_1;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
