#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_FlameFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LinedNotebook_FlameFX.WBP_LinedNotebook_FlameFX_C
// 0x0050 (0x0310 - 0x02C0)
class UWBP_LinedNotebook_FlameFX_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimShow;                                          // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FlameImage;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               FlameOverlay;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        DistortionOffsetX;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistortionOffsetY;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DesiredSizeX;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DesiredSizeY;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      FlameMaterialInstance;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bHiddenByDefault;                                  // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LinedNotebook_FlameFX(int32 EntryPoint);
	void HideFlame();
	void PreConstruct(bool IsDesignTime);
	void ShowFlame();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LinedNotebook_FlameFX_C">();
	}
	static class UWBP_LinedNotebook_FlameFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LinedNotebook_FlameFX_C>();
	}
};
static_assert(alignof(UWBP_LinedNotebook_FlameFX_C) == 0x000008, "Wrong alignment on UWBP_LinedNotebook_FlameFX_C");
static_assert(sizeof(UWBP_LinedNotebook_FlameFX_C) == 0x000310, "Wrong size on UWBP_LinedNotebook_FlameFX_C");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_LinedNotebook_FlameFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, AnimShow) == 0x0002C8, "Member 'UWBP_LinedNotebook_FlameFX_C::AnimShow' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, FlameImage) == 0x0002D0, "Member 'UWBP_LinedNotebook_FlameFX_C::FlameImage' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, FlameOverlay) == 0x0002D8, "Member 'UWBP_LinedNotebook_FlameFX_C::FlameOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, DistortionOffsetX) == 0x0002E0, "Member 'UWBP_LinedNotebook_FlameFX_C::DistortionOffsetX' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, DistortionOffsetY) == 0x0002E8, "Member 'UWBP_LinedNotebook_FlameFX_C::DistortionOffsetY' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, DesiredSizeX) == 0x0002F0, "Member 'UWBP_LinedNotebook_FlameFX_C::DesiredSizeX' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, DesiredSizeY) == 0x0002F8, "Member 'UWBP_LinedNotebook_FlameFX_C::DesiredSizeY' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, FlameMaterialInstance) == 0x000300, "Member 'UWBP_LinedNotebook_FlameFX_C::FlameMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_FlameFX_C, bHiddenByDefault) == 0x000308, "Member 'UWBP_LinedNotebook_FlameFX_C::bHiddenByDefault' has a wrong offset!");

}

