#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_Rewards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EventScreenBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LinedNotebook_Rewards.WBP_LinedNotebook_Rewards_C
// 0x0038 (0x0308 - 0x02D0)
class UWBP_LinedNotebook_Rewards_C final : public UFortEventTrackerModule_ProgressiveRewards
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                Spacer_58;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_CompletionMessage;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        ProgressClimbComponent;                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpraypaintSound;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TileFillSound;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TileFillCompleteSound;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_LinedNotebook_Rewards(int32 EntryPoint);
	void OnModuleInitialized(const class UFortEventScreenData* InEventScreenData);
	void OnPopulateCompletionMessage(const bool bIsComplete, const class FText& CompletionText);
	void OnProgressBarAnimationCompleted();
	void OnProgressBarAnimationInterrupted();
	void OnProgressBarAnimationStarted();
	void PopulateCompletionMessage(const class FText& MessageText, bool Completed);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LinedNotebook_Rewards_C">();
	}
	static class UWBP_LinedNotebook_Rewards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LinedNotebook_Rewards_C>();
	}
};
static_assert(alignof(UWBP_LinedNotebook_Rewards_C) == 0x000008, "Wrong alignment on UWBP_LinedNotebook_Rewards_C");
static_assert(sizeof(UWBP_LinedNotebook_Rewards_C) == 0x000308, "Wrong size on UWBP_LinedNotebook_Rewards_C");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_LinedNotebook_Rewards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, Spacer_58) == 0x0002D8, "Member 'UWBP_LinedNotebook_Rewards_C::Spacer_58' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, Text_CompletionMessage) == 0x0002E0, "Member 'UWBP_LinedNotebook_Rewards_C::Text_CompletionMessage' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, ProgressClimbComponent) == 0x0002E8, "Member 'UWBP_LinedNotebook_Rewards_C::ProgressClimbComponent' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, SpraypaintSound) == 0x0002F0, "Member 'UWBP_LinedNotebook_Rewards_C::SpraypaintSound' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, TileFillSound) == 0x0002F8, "Member 'UWBP_LinedNotebook_Rewards_C::TileFillSound' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_Rewards_C, TileFillCompleteSound) == 0x000300, "Member 'UWBP_LinedNotebook_Rewards_C::TileFillCompleteSound' has a wrong offset!");

}

