#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SearchBar_Block_Background

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_UI_BackplateCornerRadiusValues_structs.hpp"
#include "WBP_UIKit_BlockBackground_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SearchBar_Block_Background.WBP_SearchBar_Block_Background_C
// 0x0060 (0x0380 - 0x0320)
class UWBP_SearchBar_Block_Background_C final : public UWBP_UIKit_BlockBackground_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SearchBar_Block_Background_C;   // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Glass_C*           WBP_UIKit_Backplate_Glass;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          SelectionIsAvailable;                              // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_BackplateCornerRadiusValues      CornerRadiusValues;                                // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SearchBar_Block_Background(int32 EntryPoint);
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundBrush(const struct FSlateBrush& InBrush);
	void SetBackgroundMaterial(const class UMaterialInstance*& Material_Instance);
	void SetCornerRadius(bool Radius_in_Pixels, double CornerRadiusValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SearchBar_Block_Background_C">();
	}
	static class UWBP_SearchBar_Block_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SearchBar_Block_Background_C>();
	}
};
static_assert(alignof(UWBP_SearchBar_Block_Background_C) == 0x000008, "Wrong alignment on UWBP_SearchBar_Block_Background_C");
static_assert(sizeof(UWBP_SearchBar_Block_Background_C) == 0x000380, "Wrong size on UWBP_SearchBar_Block_Background_C");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, UberGraphFrame_WBP_SearchBar_Block_Background_C) == 0x000320, "Member 'UWBP_SearchBar_Block_Background_C::UberGraphFrame_WBP_SearchBar_Block_Background_C' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, Anim_Disabled_Transition) == 0x000328, "Member 'UWBP_SearchBar_Block_Background_C::Anim_Disabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, Anim_Pressed_Transition) == 0x000330, "Member 'UWBP_SearchBar_Block_Background_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, Anim_Focused_Transition) == 0x000338, "Member 'UWBP_SearchBar_Block_Background_C::Anim_Focused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, Overlay) == 0x000340, "Member 'UWBP_SearchBar_Block_Background_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, WBP_UIKit_Backplate_Glass) == 0x000348, "Member 'UWBP_SearchBar_Block_Background_C::WBP_UIKit_Backplate_Glass' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, SelectionIsAvailable) == 0x000350, "Member 'UWBP_SearchBar_Block_Background_C::SelectionIsAvailable' has a wrong offset!");
static_assert(offsetof(UWBP_SearchBar_Block_Background_C, CornerRadiusValues) == 0x000358, "Member 'UWBP_SearchBar_Block_Background_C::CornerRadiusValues' has a wrong offset!");

}

