#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_Collection

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LinedNotebook_Collection.WBP_LinedNotebook_Collection_C.ExecuteUbergraph_WBP_LinedNotebook_Collection
// 0x0078 (0x0078 - 0x0000)
struct WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_1;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_2;         // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_3;         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_4;         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_5;         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_OwnsChaseReward_return;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection) == 0x000008, "Wrong alignment on WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection");
static_assert(sizeof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection) == 0x000078, "Wrong size on WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, EntryPoint) == 0x000000, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, Temp_bool_Variable) == 0x000004, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, Temp_byte_Variable) == 0x000005, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_DetermineIntroAnim_ReturnValue) == 0x000008, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_DetermineIntroAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_DetermineIntroAnim_ReturnValue_1) == 0x000018, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_DetermineIntroAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_DetermineIntroAnim_ReturnValue_2) == 0x000028, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_DetermineIntroAnim_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_DetermineIntroAnim_ReturnValue_3) == 0x000040, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_DetermineIntroAnim_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_DetermineIntroAnim_ReturnValue_4) == 0x000050, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_DetermineIntroAnim_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_DetermineIntroAnim_ReturnValue_5) == 0x000060, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_DetermineIntroAnim_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, CallFunc_OwnsChaseReward_return) == 0x000070, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::CallFunc_OwnsChaseReward_return' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection, K2Node_Select_Default) == 0x000071, "Member 'WBP_LinedNotebook_Collection_C_ExecuteUbergraph_WBP_LinedNotebook_Collection::K2Node_Select_Default' has a wrong offset!");

// Function WBP_LinedNotebook_Collection.WBP_LinedNotebook_Collection_C.OwnsChaseReward
// 0x0006 (0x0006 - 0x0000)
struct WBP_LinedNotebook_Collection_C_OwnsChaseReward final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_Collection_C_OwnsChaseReward) == 0x000001, "Wrong alignment on WBP_LinedNotebook_Collection_C_OwnsChaseReward");
static_assert(sizeof(WBP_LinedNotebook_Collection_C_OwnsChaseReward) == 0x000006, "Wrong size on WBP_LinedNotebook_Collection_C_OwnsChaseReward");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OwnsChaseReward, Return) == 0x000000, "Member 'WBP_LinedNotebook_Collection_C_OwnsChaseReward::Return' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OwnsChaseReward, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WBP_LinedNotebook_Collection_C_OwnsChaseReward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OwnsChaseReward, CallFunc_BooleanAND_ReturnValue_1) == 0x000002, "Member 'WBP_LinedNotebook_Collection_C_OwnsChaseReward::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OwnsChaseReward, CallFunc_BooleanAND_ReturnValue_2) == 0x000003, "Member 'WBP_LinedNotebook_Collection_C_OwnsChaseReward::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OwnsChaseReward, CallFunc_BooleanAND_ReturnValue_3) == 0x000004, "Member 'WBP_LinedNotebook_Collection_C_OwnsChaseReward::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OwnsChaseReward, CallFunc_BooleanAND_ReturnValue_4) == 0x000005, "Member 'WBP_LinedNotebook_Collection_C_OwnsChaseReward::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");

// Function WBP_LinedNotebook_Collection.WBP_LinedNotebook_Collection_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_Collection_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_Collection_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LinedNotebook_Collection_C_PreConstruct");
static_assert(sizeof(WBP_LinedNotebook_Collection_C_PreConstruct) == 0x000001, "Wrong size on WBP_LinedNotebook_Collection_C_PreConstruct");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LinedNotebook_Collection_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LinedNotebook_Collection.WBP_LinedNotebook_Collection_C.OnGatherTokenCollectionWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets final
{
public:
	TArray<class UFortEventTokenCollectionWidget*> OutCollectionWidgets;                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UFortEventTokenCollectionWidget*> K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets) == 0x000008, "Wrong alignment on WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets");
static_assert(sizeof(WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets) == 0x000020, "Wrong size on WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets, OutCollectionWidgets) == 0x000000, "Member 'WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets::OutCollectionWidgets' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_LinedNotebook_Collection_C_OnGatherTokenCollectionWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

