#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_Image

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.ExecuteUbergraph_WBP_UIKit_Block_Image
// 0x0014 (0x0014 - 0x0000)
struct WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_1;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_3;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_4;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_5;               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_6;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_7;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_8;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected_9;               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_2;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image) == 0x000004, "Wrong alignment on WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image");
static_assert(sizeof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image) == 0x000014, "Wrong size on WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000004, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_IsAnyAnimationPlaying_ReturnValue_1) == 0x000005, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_IsAnyAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected) == 0x000006, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_1) == 0x000007, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_2) == 0x000008, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_3) == 0x000009, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_4) == 0x00000A, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_4' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_5) == 0x00000B, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_5' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_6) == 0x00000C, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_6' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_7) == 0x00000D, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_7' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_8) == 0x00000E, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_8' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_GetIsSelected_IsSelected_9) == 0x00000F, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_GetIsSelected_IsSelected_9' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image, CallFunc_IsAnyAnimationPlaying_ReturnValue_2) == 0x000010, "Member 'WBP_UIKit_Block_Image_C_ExecuteUbergraph_WBP_UIKit_Block_Image::CallFunc_IsAnyAnimationPlaying_ReturnValue_2' has a wrong offset!");

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.RefreshImageMID
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_Image_C_RefreshImageMID final
{
public:
	class UMaterialInstanceDynamic*               NewMID;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_RefreshImageMID) == 0x000008, "Wrong alignment on WBP_UIKit_Block_Image_C_RefreshImageMID");
static_assert(sizeof(WBP_UIKit_Block_Image_C_RefreshImageMID) == 0x000010, "Wrong size on WBP_UIKit_Block_Image_C_RefreshImageMID");
static_assert(offsetof(WBP_UIKit_Block_Image_C_RefreshImageMID, NewMID) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_RefreshImageMID::NewMID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_RefreshImageMID, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Block_Image_C_RefreshImageMID::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.SetBrush
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_UIKit_Block_Image_C_SetBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_SetBrush) == 0x000010, "Wrong alignment on WBP_UIKit_Block_Image_C_SetBrush");
static_assert(sizeof(WBP_UIKit_Block_Image_C_SetBrush) == 0x0000C0, "Wrong size on WBP_UIKit_Block_Image_C_SetBrush");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetBrush, InBrush) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_SetBrush::InBrush' has a wrong offset!");

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.SetMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_Image_C_SetMaterial final
{
public:
	const class UMaterialInstance*                InMaterial;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_SetMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_Block_Image_C_SetMaterial");
static_assert(sizeof(WBP_UIKit_Block_Image_C_SetMaterial) == 0x000010, "Wrong size on WBP_UIKit_Block_Image_C_SetMaterial");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetMaterial, InMaterial) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_SetMaterial::InMaterial' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetMaterial, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Block_Image_C_SetMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.SetSize
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_Image_C_SetSize final
{
public:
	struct FVector2D                              Desired_Size;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_SetSize) == 0x000008, "Wrong alignment on WBP_UIKit_Block_Image_C_SetSize");
static_assert(sizeof(WBP_UIKit_Block_Image_C_SetSize) == 0x000010, "Wrong size on WBP_UIKit_Block_Image_C_SetSize");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetSize, Desired_Size) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_SetSize::Desired_Size' has a wrong offset!");

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_Image_C_SetTexture final
{
public:
	const class UTexture2D*                       InTexture;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockVisible;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_SetTexture) == 0x000008, "Wrong alignment on WBP_UIKit_Block_Image_C_SetTexture");
static_assert(sizeof(WBP_UIKit_Block_Image_C_SetTexture) == 0x000010, "Wrong size on WBP_UIKit_Block_Image_C_SetTexture");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTexture, InTexture) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_SetTexture::InTexture' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTexture, BlockVisible) == 0x000008, "Member 'WBP_UIKit_Block_Image_C_SetTexture::BlockVisible' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTexture, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_UIKit_Block_Image_C_SetTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTexture, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'WBP_UIKit_Block_Image_C_SetTexture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTexture, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'WBP_UIKit_Block_Image_C_SetTexture::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C.SetTextureWithParameter
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Block_Image_C_SetTextureWithParameter final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture2D*                       InTexture;                                         // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockVisible;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_Image_C_SetTextureWithParameter) == 0x000008, "Wrong alignment on WBP_UIKit_Block_Image_C_SetTextureWithParameter");
static_assert(sizeof(WBP_UIKit_Block_Image_C_SetTextureWithParameter) == 0x000018, "Wrong size on WBP_UIKit_Block_Image_C_SetTextureWithParameter");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTextureWithParameter, ParameterName) == 0x000000, "Member 'WBP_UIKit_Block_Image_C_SetTextureWithParameter::ParameterName' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTextureWithParameter, InTexture) == 0x000008, "Member 'WBP_UIKit_Block_Image_C_SetTextureWithParameter::InTexture' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTextureWithParameter, BlockVisible) == 0x000010, "Member 'WBP_UIKit_Block_Image_C_SetTextureWithParameter::BlockVisible' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTextureWithParameter, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_UIKit_Block_Image_C_SetTextureWithParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTextureWithParameter, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'WBP_UIKit_Block_Image_C_SetTextureWithParameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_Image_C_SetTextureWithParameter, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'WBP_UIKit_Block_Image_C_SetTextureWithParameter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

