#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_Screen

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_Screen.WBP_MPItemShop_Screen_C
// 0x0178 (0x0950 - 0x07D8)
class UWBP_MPItemShop_Screen_C final : public UFortMPItemShopScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x07E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CollapseSpacerCameraFrame;                         // 0x07E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_CameraFrameContainer;                       // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_SongInfo;                                   // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_BackToGame;                                 // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_BackToNav;                                  // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_OpenQuickNavTouch;                          // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_SAC;                                        // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_ShopRefreshTimer;                           // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Quiet_C*              Button_ShowPreviewTouch;                           // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Content;                                   // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoOffers;                                  // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Prompts;                                  // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MPItemShop_ItemInfo_C*             SongInfo;                                          // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_CameraFrame;                                // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Main;                                     // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ShopRefresh_Spacer;                           // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBarContainer_C*              WBP_ActionBarContainer;                            // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptureForPostBufferUpdate_C*      WBP_CaptureForPostBufferUpdate;                    // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MPItemShop_Content_C*              WBP_MPItemShop_Content;                            // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MPItemShop_SectionNavigatorEnhanced_C* WBP_MPItemShop_SectionNavigatorEnhanced;           // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           MarkAllOfferGroupsAsItemShopVisitedHandler;        // 0x0890(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MarkAllOfferGroupsAsItemShopVisitedDelay;          // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FocusedOfferId;                                    // 0x08A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsSoftActivation;                                  // 0x08B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemShopLayout                    CachedFeaturedLayout;                              // 0x08B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BackgroundTransitionTimerDelay;                    // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PendingBackgroundTimer;                            // 0x08E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNavigatingToOffer;                               // 0x08E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             IntroWhooshSound;                                  // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NavRevealWhooshSound;                              // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NavHideWhooshSound;                                // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortItemShopOfferGroupVM*              RequestedOfferGroupVM;                             // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortItemShopOfferVM*                   RequestedOfferVM;                                  // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingOfferInspect;                             // 0x0918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CameraFrameCollapseAnimationValue;                 // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        CameraFrameWidth;                                  // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmptyCameraFrameWidth;                             // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECosmeticCompatibleMode                       CachedItemShopContext;                             // 0x0938(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitialActivation;                               // 0x0939(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93A[0x6];                                      // 0x093A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReplaceDialogInfoKeytag;                           // 0x0940(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPItemShop_Screen_Button_BackToGame_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_BackToNav_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_OpenQuickNavTouch_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_SAC_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_Button_ShowPreviewTouch_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MPItemShop_Screen_WBP_MPItemShop_Content_K2Node_ComponentBoundEvent_3_OnOfferFocused__DelegateSignature(const class FString& OfferId);
	void BndEvt__WBP_MPItemShop_Screen_WBP_UIKit_Button_Quiet_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CancelRequestMarkAllOfferGroupsAsItemShopVisited();
	void ClearSectionNavigatorVM();
	void CreateNavigationBindings();
	void CreateSectionNavigatorBindings();
	void ExecuteUbergraph_WBP_MPItemShop_Screen(int32 EntryPoint);
	class UWidget* FocusContent(EUINavigation Navigation_0);
	void FocusFirstOfferInCurrentRow();
	void FocusSectionNavigator();
	void FullActivate();
	void FullDeactivate();
	class UFortItemShopVM* GetItemShopVM();
	void Handle_Quicknav_or_Content_Focus(bool ShouldFocusSectionNavigator);
	void HandleItemPreview(class UFortItemVM* PreviewedItem_0);
	void MarkAllOfferGroupsAsItemShopVisited();
	void OnBackgroundDataLoaded(class UObject* LoadedBackground);
	void OnContentFocused();
	void OnHandlePreviewItem();
	void OnInputModeChanged(bool bUsingGamepad);
	void OnIsItemPreviewEnabledChanged(bool IsItemPreviewEnabled);
	void OnNavigateToOffer(const class FString& OfferTrackingId, bool bShowOfferDetails);
	void OnOfferInspectionScreenShown(const class UCommonActivatableWidget* OfferInspectionScreenWidget);
	void OnPendingBackgroundTImerExpired();
	void OnScrollInput(const float ScrollAmount);
	void OnSectionNavigatorFocused();
	void OnSectionNavigatorUnfocused();
	void OnSetFeaturedOfferId(const class FString& FeaturedOfferId);
	void OnUpdateBackground(const struct FFortItemShopLayout& InLayout);
	void OverrideDialogInfoText(class UUIKitDialogViewModel* ModalVM, class UUIKitDialogViewModel** Out_ModalVM);
	void PreviewOfferFromID(const class FString& Offer_ID);
	void PushModal(class UCommonActivatableWidget* ActivatableWidget);
	void RefreshWidgetCameraFrame();
	void RequestMarkAllOfferGroupsAsItemShopVisited();
	void SetAllInteractionsEnabled(bool bInIsInteractionEnabled);
	void SetCameraFrameCollapseAnimationValue(double Alpha);
	void SetMobileStyle();
	void SetSectionNavigatorCollapsed(bool ShouldCollapse);
	void SetSectionNavigatorFortItemShopVM();
	void SetupAndPushInfoModal(class UUIKitDialogViewModel* ModalVM);
	void SetupSectionNavigator();
	void SoftActivate();
	void SoftDeactivate();
	void TryShowJunoOutfitsFTUEModal();
	void Update_Preview_Quick_Nav_Buttons_Visibility();
	void UpdateCameraButtonVisibility();
	void UpdateHasSeenItemShop();
	void UpdateInGameButtons();
	void UpdateItemPreview();
	void UpdateMainActiveWidget();
	void UpdateMainActiveWidgetFromLoadingState(EFortItemShopLoadingState LoadingState);
	void UpdateMainActiveWidgetFromOfferGroups(TArray<class UFortItemShopOfferGroupVM*>& AllOfferGroupsWithOffers);
	void UpdateSongInfoSizing();
	void UpdateSongInfoVisibility(bool ShouldShow);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetFirstSectionID(class FString* SectionId) const;
	class UWidget* GetSectionNavigatorFocusTarget() const;
	void GetSongInfoText(class UFortItemVM* PreviewedItem_0, class FText* FormattedText) const;
	void GetSongInfoVisibility(class UFortItemVM* PreviewedItem_0, ESlateVisibility* Visibility_0) const;
	void GetSupportCreatorText(const class FString& AffiliateName, class FText* TimerText) const;
	bool HasContextChanged() const;
	void IsSectionNavigatorCollapsed(bool* IsCollapsed) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_Screen_C">();
	}
	static class UWBP_MPItemShop_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_Screen_C>();
	}
};
static_assert(alignof(UWBP_MPItemShop_Screen_C) == 0x000008, "Wrong alignment on UWBP_MPItemShop_Screen_C");
static_assert(sizeof(UWBP_MPItemShop_Screen_C) == 0x000950, "Wrong size on UWBP_MPItemShop_Screen_C");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, UberGraphFrame) == 0x0007D8, "Member 'UWBP_MPItemShop_Screen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, FortItemShopVM) == 0x0007E0, "Member 'UWBP_MPItemShop_Screen_C::FortItemShopVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, CollapseSpacerCameraFrame) == 0x0007E8, "Member 'UWBP_MPItemShop_Screen_C::CollapseSpacerCameraFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Border_CameraFrameContainer) == 0x0007F0, "Member 'UWBP_MPItemShop_Screen_C::Border_CameraFrameContainer' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Border_SongInfo) == 0x0007F8, "Member 'UWBP_MPItemShop_Screen_C::Border_SongInfo' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Button_BackToGame) == 0x000800, "Member 'UWBP_MPItemShop_Screen_C::Button_BackToGame' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Button_BackToNav) == 0x000808, "Member 'UWBP_MPItemShop_Screen_C::Button_BackToNav' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Button_OpenQuickNavTouch) == 0x000810, "Member 'UWBP_MPItemShop_Screen_C::Button_OpenQuickNavTouch' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Button_SAC) == 0x000818, "Member 'UWBP_MPItemShop_Screen_C::Button_SAC' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Button_ShopRefreshTimer) == 0x000820, "Member 'UWBP_MPItemShop_Screen_C::Button_ShopRefreshTimer' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Button_ShowPreviewTouch) == 0x000828, "Member 'UWBP_MPItemShop_Screen_C::Button_ShowPreviewTouch' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Overlay_Content) == 0x000830, "Member 'UWBP_MPItemShop_Screen_C::Overlay_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Overlay_Loading) == 0x000838, "Member 'UWBP_MPItemShop_Screen_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Overlay_NoOffers) == 0x000840, "Member 'UWBP_MPItemShop_Screen_C::Overlay_NoOffers' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, SafeZone_Prompts) == 0x000848, "Member 'UWBP_MPItemShop_Screen_C::SafeZone_Prompts' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, SongInfo) == 0x000850, "Member 'UWBP_MPItemShop_Screen_C::SongInfo' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Spacer_CameraFrame) == 0x000858, "Member 'UWBP_MPItemShop_Screen_C::Spacer_CameraFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Switcher_Main) == 0x000860, "Member 'UWBP_MPItemShop_Screen_C::Switcher_Main' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, Text_ShopRefresh_Spacer) == 0x000868, "Member 'UWBP_MPItemShop_Screen_C::Text_ShopRefresh_Spacer' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, WBP_ActionBarContainer) == 0x000870, "Member 'UWBP_MPItemShop_Screen_C::WBP_ActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, WBP_CaptureForPostBufferUpdate) == 0x000878, "Member 'UWBP_MPItemShop_Screen_C::WBP_CaptureForPostBufferUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, WBP_MPItemShop_Content) == 0x000880, "Member 'UWBP_MPItemShop_Screen_C::WBP_MPItemShop_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, WBP_MPItemShop_SectionNavigatorEnhanced) == 0x000888, "Member 'UWBP_MPItemShop_Screen_C::WBP_MPItemShop_SectionNavigatorEnhanced' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, MarkAllOfferGroupsAsItemShopVisitedHandler) == 0x000890, "Member 'UWBP_MPItemShop_Screen_C::MarkAllOfferGroupsAsItemShopVisitedHandler' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, MarkAllOfferGroupsAsItemShopVisitedDelay) == 0x000898, "Member 'UWBP_MPItemShop_Screen_C::MarkAllOfferGroupsAsItemShopVisitedDelay' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, FocusedOfferId) == 0x0008A0, "Member 'UWBP_MPItemShop_Screen_C::FocusedOfferId' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, IsSoftActivation) == 0x0008B0, "Member 'UWBP_MPItemShop_Screen_C::IsSoftActivation' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, CachedFeaturedLayout) == 0x0008B8, "Member 'UWBP_MPItemShop_Screen_C::CachedFeaturedLayout' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, BackgroundTransitionTimerDelay) == 0x0008D8, "Member 'UWBP_MPItemShop_Screen_C::BackgroundTransitionTimerDelay' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, PendingBackgroundTimer) == 0x0008E0, "Member 'UWBP_MPItemShop_Screen_C::PendingBackgroundTimer' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, IsNavigatingToOffer) == 0x0008E8, "Member 'UWBP_MPItemShop_Screen_C::IsNavigatingToOffer' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, IntroWhooshSound) == 0x0008F0, "Member 'UWBP_MPItemShop_Screen_C::IntroWhooshSound' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, NavRevealWhooshSound) == 0x0008F8, "Member 'UWBP_MPItemShop_Screen_C::NavRevealWhooshSound' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, NavHideWhooshSound) == 0x000900, "Member 'UWBP_MPItemShop_Screen_C::NavHideWhooshSound' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, RequestedOfferGroupVM) == 0x000908, "Member 'UWBP_MPItemShop_Screen_C::RequestedOfferGroupVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, RequestedOfferVM) == 0x000910, "Member 'UWBP_MPItemShop_Screen_C::RequestedOfferVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, IsShowingOfferInspect) == 0x000918, "Member 'UWBP_MPItemShop_Screen_C::IsShowingOfferInspect' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, CameraFrameCollapseAnimationValue) == 0x000920, "Member 'UWBP_MPItemShop_Screen_C::CameraFrameCollapseAnimationValue' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, CameraFrameWidth) == 0x000928, "Member 'UWBP_MPItemShop_Screen_C::CameraFrameWidth' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, EmptyCameraFrameWidth) == 0x000930, "Member 'UWBP_MPItemShop_Screen_C::EmptyCameraFrameWidth' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, CachedItemShopContext) == 0x000938, "Member 'UWBP_MPItemShop_Screen_C::CachedItemShopContext' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, IsInitialActivation) == 0x000939, "Member 'UWBP_MPItemShop_Screen_C::IsInitialActivation' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Screen_C, ReplaceDialogInfoKeytag) == 0x000940, "Member 'UWBP_MPItemShop_Screen_C::ReplaceDialogInfoKeytag' has a wrong offset!");

}

