#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallyPopupModal_QRCode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallyPopupModal_QRCode.WBP_RebootRallyPopupModal_QRCode_C
// 0x0040 (0x14D0 - 0x1490)
class UWBP_RebootRallyPopupModal_QRCode_C final : public URebootRallyQRCode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_QRCode;                                      // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QRAction;                                     // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsInvite;                                         // 0x14A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A9[0x7];                                     // 0x14A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 QRCodeURL;                                         // 0x14B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsSwitch;                                         // 0x14C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void Construct();
	void ExecuteUbergraph_WBP_RebootRallyPopupModal_QRCode(int32 EntryPoint);
	void InputMethodChanged(ECommonInputType NewInputType);
	void OnInitialized();
	void SetIsInvite(bool bIsInvite_0);
	void UpdateQRCode(ECommonInputType NewInputType);
	void UpdateText(ECommonInputType NewInputType);
	void UpdateURL(ECommonInputType NewInputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallyPopupModal_QRCode_C">();
	}
	static class UWBP_RebootRallyPopupModal_QRCode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallyPopupModal_QRCode_C>();
	}
};
static_assert(alignof(UWBP_RebootRallyPopupModal_QRCode_C) == 0x000010, "Wrong alignment on UWBP_RebootRallyPopupModal_QRCode_C");
static_assert(sizeof(UWBP_RebootRallyPopupModal_QRCode_C) == 0x0014D0, "Wrong size on UWBP_RebootRallyPopupModal_QRCode_C");
static_assert(offsetof(UWBP_RebootRallyPopupModal_QRCode_C, UberGraphFrame) == 0x001490, "Member 'UWBP_RebootRallyPopupModal_QRCode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_QRCode_C, Image_QRCode) == 0x001498, "Member 'UWBP_RebootRallyPopupModal_QRCode_C::Image_QRCode' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_QRCode_C, Text_QRAction) == 0x0014A0, "Member 'UWBP_RebootRallyPopupModal_QRCode_C::Text_QRAction' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_QRCode_C, bIsInvite) == 0x0014A8, "Member 'UWBP_RebootRallyPopupModal_QRCode_C::bIsInvite' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_QRCode_C, QRCodeURL) == 0x0014B0, "Member 'UWBP_RebootRallyPopupModal_QRCode_C::QRCodeURL' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_QRCode_C, bIsSwitch) == 0x0014C0, "Member 'UWBP_RebootRallyPopupModal_QRCode_C::bIsSwitch' has a wrong offset!");

}

