#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StepWizard_Base

#include "Basic.hpp"

#include "S_UI_StepWizard_Entry_structs.hpp"
#include "S_UI_StepWizard_StepList_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.Get Next Step Data
// 0x0080 (0x0080 - 0x0000)
struct WBP_StepWizard_Base_C_Get_Next_Step_Data final
{
public:
	int32                                         Current_Step;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextStepNum;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	struct FS_UI_StepWizard_Entry                 CallFunc_Array_Get_Item;                           // 0x0048(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_Get_Next_Step_Data) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_Get_Next_Step_Data");
static_assert(sizeof(WBP_StepWizard_Base_C_Get_Next_Step_Data) == 0x000080, "Wrong size on WBP_StepWizard_Base_C_Get_Next_Step_Data");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, Current_Step) == 0x000000, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::Current_Step' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, NextStepNum) == 0x000004, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::NextStepNum' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Next_Step_Data, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_StepWizard_Base_C_Get_Next_Step_Data::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.Add Step
// 0x0060 (0x0060 - 0x0000)
struct WBP_StepWizard_Base_C_Add_Step final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Step_Num;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UI_StepWizard_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_StepWizard_Entry                 CallFunc_Array_Get_Item;                           // 0x0028(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast; // 0x005C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_Add_Step) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_Add_Step");
static_assert(sizeof(WBP_StepWizard_Base_C_Add_Step) == 0x000060, "Wrong size on WBP_StepWizard_Base_C_Add_Step");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Step) == 0x000000, "Member 'WBP_StepWizard_Base_C_Add_Step::Step' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Step_Num) == 0x000004, "Member 'WBP_StepWizard_Base_C_Add_Step::Step_Num' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Temp_bool_Variable) == 0x000008, "Member 'WBP_StepWizard_Base_C_Add_Step::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Temp_byte_Variable) == 0x000009, "Member 'WBP_StepWizard_Base_C_Add_Step::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_StepWizard_Base_C_Add_Step::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Temp_bool_Variable_1) == 0x00000B, "Member 'WBP_StepWizard_Base_C_Add_Step::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Temp_byte_Variable_2) == 0x00000C, "Member 'WBP_StepWizard_Base_C_Add_Step::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, Temp_byte_Variable_3) == 0x00000D, "Member 'WBP_StepWizard_Base_C_Add_Step::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_StepWizard_Base_C_Add_Step::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, CallFunc_GetNumItems_ReturnValue) == 0x000018, "Member 'WBP_StepWizard_Base_C_Add_Step::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_StepWizard_Base_C_Add_Step::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_StepWizard_Base_C_Add_Step::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_StepWizard_Base_C_Add_Step::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, K2Node_Select_Default) == 0x000058, "Member 'WBP_StepWizard_Base_C_Add_Step::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, K2Node_Select_Default_1) == 0x000059, "Member 'WBP_StepWizard_Base_C_Add_Step::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Add_Step, CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast) == 0x00005C, "Member 'WBP_StepWizard_Base_C_Add_Step::CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.Get Current Step Name
// 0x0038 (0x0038 - 0x0000)
struct WBP_StepWizard_Base_C_Get_Current_Step_Name final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_StepWizard_Entry                 CallFunc_Array_Get_Item;                           // 0x0008(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_Get_Current_Step_Name) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_Get_Current_Step_Name");
static_assert(sizeof(WBP_StepWizard_Base_C_Get_Current_Step_Name) == 0x000038, "Wrong size on WBP_StepWizard_Base_C_Get_Current_Step_Name");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Current_Step_Name, Step) == 0x000000, "Member 'WBP_StepWizard_Base_C_Get_Current_Step_Name::Step' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Current_Step_Name, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_StepWizard_Base_C_Get_Current_Step_Name::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.Get Total Steps
// 0x0050 (0x0050 - 0x0000)
struct WBP_StepWizard_Base_C_Get_Total_Steps final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_StepWizard_Entry                 CallFunc_Array_Get_Item;                           // 0x0018(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_Get_Total_Steps) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_Get_Total_Steps");
static_assert(sizeof(WBP_StepWizard_Base_C_Get_Total_Steps) == 0x000050, "Wrong size on WBP_StepWizard_Base_C_Get_Total_Steps");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, Temp_int_Variable) == 0x00000C, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Get_Total_Steps, K2Node_SwitchEnum_CmpSuccess) == 0x00004D, "Member 'WBP_StepWizard_Base_C_Get_Total_Steps::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.Create Step Wizard
// 0x0018 (0x0018 - 0x0000)
struct WBP_StepWizard_Base_C_Create_Step_Wizard final
{
public:
	class FString                                 List_Name;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                Parent_Widget_0;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_Create_Step_Wizard) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_Create_Step_Wizard");
static_assert(sizeof(WBP_StepWizard_Base_C_Create_Step_Wizard) == 0x000018, "Wrong size on WBP_StepWizard_Base_C_Create_Step_Wizard");
static_assert(offsetof(WBP_StepWizard_Base_C_Create_Step_Wizard, List_Name) == 0x000000, "Member 'WBP_StepWizard_Base_C_Create_Step_Wizard::List_Name' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Create_Step_Wizard, Parent_Widget_0) == 0x000010, "Member 'WBP_StepWizard_Base_C_Create_Step_Wizard::Parent_Widget_0' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.Load Step From List
// 0x0018 (0x0018 - 0x0000)
struct WBP_StepWizard_Base_C_Load_Step_From_List final
{
public:
	class FString                                 List_Name;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Step;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_Load_Step_From_List) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_Load_Step_From_List");
static_assert(sizeof(WBP_StepWizard_Base_C_Load_Step_From_List) == 0x000018, "Wrong size on WBP_StepWizard_Base_C_Load_Step_From_List");
static_assert(offsetof(WBP_StepWizard_Base_C_Load_Step_From_List, List_Name) == 0x000000, "Member 'WBP_StepWizard_Base_C_Load_Step_From_List::List_Name' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_Load_Step_From_List, Step) == 0x000010, "Member 'WBP_StepWizard_Base_C_Load_Step_From_List::Step' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_Close_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_ListView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_StepWizard_Base_C_BndEvt__WBP_StepWizard_Base_Button_TouchClose_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_StepWizard_Base.WBP_StepWizard_Base_C.ExecuteUbergraph_WBP_StepWizard_Base
// 0x0188 (0x0188 - 0x0000)
struct WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_VoiceRep_Reporting_Step_C*         K2Node_DynamicCast_AsWBP_Voice_Rep_Reporting_Step; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_List_Name_1;                    // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_Parent_Widget;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_StepWizard_StepList              CallFunc_Map_Find_Value;                           // 0x0060(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_List_Name;                      // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Step;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_StepWizard_StepList              CallFunc_Map_Find_Value_1;                         // 0x00B0(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_StepWizard_List_Entry_C*           K2Node_DynamicCast_AsWBP_Step_Wizard_List_Entry;   // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast; // 0x0180(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base) == 0x000008, "Wrong alignment on WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base");
static_assert(sizeof(WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base) == 0x000188, "Wrong size on WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base");
static_assert(offsetof(WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base, EntryPoint) == 0x000000, "Member 'WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base, Temp_int_Variable) == 0x000004, "Member 'WBP_StepWizard_Base_C_ExecuteUbergraph_WBP_StepWizard_Base::Temp_int_Variable' has a wrong offset!");
