#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ContextMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_ContextMenu.WBP_UIKit_ContextMenu_C.ExecuteUbergraph_WBP_UIKit_ContextMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu");
static_assert(sizeof(WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu) == 0x000010, "Wrong size on WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu, EntryPoint) == 0x000000, "Member 'WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UIKit_ContextMenu_C_ExecuteUbergraph_WBP_UIKit_ContextMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_ContextMenu.WBP_UIKit_ContextMenu_C.InitViewModels
// 0x0038 (0x0038 - 0x0000)
struct WBP_UIKit_ContextMenu_C_InitViewModels final
{
public:
	TArray<class UUIKitSelectableButtonViewModel*> MVVM_ForButtons;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitSelectableButtonViewModel*        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIKitContextMenuButtonViewModel*       K2Node_DynamicCast_AsUIKit_Context_Menu_Button_View_Model; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenu_C_InitViewModels) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenu_C_InitViewModels");
static_assert(sizeof(WBP_UIKit_ContextMenu_C_InitViewModels) == 0x000038, "Wrong size on WBP_UIKit_ContextMenu_C_InitViewModels");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, MVVM_ForButtons) == 0x000000, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::MVVM_ForButtons' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, K2Node_DynamicCast_AsUIKit_Context_Menu_Button_View_Model) == 0x000028, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::K2Node_DynamicCast_AsUIKit_Context_Menu_Button_View_Model' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_InitViewModels, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_UIKit_ContextMenu_C_InitViewModels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_ContextMenu.WBP_UIKit_ContextMenu_C.SetUIKitContextMenuViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel final
{
public:
	class UUIKitContextMenuViewModel*             ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel");
static_assert(sizeof(WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel) == 0x000028, "Wrong size on WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel, ViewModel) == 0x000000, "Member 'WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_UIKit_ContextMenu_C_SetUIKitContextMenuViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

}

