#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Expandable_SurvivorTier

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Expandable_SurvivorTier.WBP_Expandable_SurvivorTier_C.ExecuteUbergraph_WBP_Expandable_SurvivorTier
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_SurvivorTiers* CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrestigeAndTier_OutSurvivorPrestige;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrestigeAndTier_OutSurvivorTierRaw;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrestigeAndTier_OutSurvivorTierDisplay; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0034(0x0004)(NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	const class UAthenaSeasonalSurvivorTiersDisplayData* CallFunc_GetSurvivorTierDisplayData_ReturnValue;   // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSurvivorPresigeData                   CallFunc_GetPrestigeData_ReturnValue;              // 0x0098(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
};
static_assert(alignof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier) == 0x000008, "Wrong alignment on WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier");
static_assert(sizeof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier) == 0x0001A0, "Wrong size on WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, EntryPoint) == 0x000000, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetPrestigeAndTier_OutSurvivorPrestige) == 0x000028, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetPrestigeAndTier_OutSurvivorPrestige' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetPrestigeAndTier_OutSurvivorTierRaw) == 0x00002C, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetPrestigeAndTier_OutSurvivorTierRaw' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetPrestigeAndTier_OutSurvivorTierDisplay) == 0x000030, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetPrestigeAndTier_OutSurvivorTierDisplay' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000034, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetSurvivorTierDisplayData_ReturnValue) == 0x000090, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetSurvivorTierDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_GetPrestigeData_ReturnValue) == 0x000098, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_GetPrestigeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, K2Node_MakeArray_Array) == 0x000178, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier, CallFunc_Format_ReturnValue) == 0x000188, "Member 'WBP_Expandable_SurvivorTier_C_ExecuteUbergraph_WBP_Expandable_SurvivorTier::CallFunc_Format_ReturnValue' has a wrong offset!");

}

