#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LockerEmptyWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LockerEmptyWarning.WBP_LockerEmptyWarning_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_LockerEmptyWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_Variables;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SelectedFilterLabel;                               // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SelectedCategoryLabel;                             // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LockerEmptyWarning(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LockerEmptyWarning_C">();
	}
	static class UWBP_LockerEmptyWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LockerEmptyWarning_C>();
	}
};
static_assert(alignof(UWBP_LockerEmptyWarning_C) == 0x000008, "Wrong alignment on UWBP_LockerEmptyWarning_C");
static_assert(sizeof(UWBP_LockerEmptyWarning_C) == 0x000300, "Wrong size on UWBP_LockerEmptyWarning_C");
static_assert(offsetof(UWBP_LockerEmptyWarning_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_LockerEmptyWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LockerEmptyWarning_C, CommonTextBlock_Variables) == 0x0002C8, "Member 'UWBP_LockerEmptyWarning_C::CommonTextBlock_Variables' has a wrong offset!");
static_assert(offsetof(UWBP_LockerEmptyWarning_C, SelectedFilterLabel) == 0x0002D0, "Member 'UWBP_LockerEmptyWarning_C::SelectedFilterLabel' has a wrong offset!");
static_assert(offsetof(UWBP_LockerEmptyWarning_C, SelectedCategoryLabel) == 0x0002E8, "Member 'UWBP_LockerEmptyWarning_C::SelectedCategoryLabel' has a wrong offset!");

}

