#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_Row

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_Row.WBP_MPItemShop_Row_C
// 0x0148 (0x0430 - 0x02E8)
class UWBP_MPItemShop_Row_C final : public UFortMPItemShopRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopOfferGroupVM*              FortItemShopOfferGroupVM;                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UButton*                                Button_RowHitbox;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_RowContent;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_SubsectionTopPadding;                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SectionTitle;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SubsectionTitle;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Headers;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsRowActive;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRowPeeked;                                       // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUserWidget* RowWidget)> OnRowFocused;                                      // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ParentHasFocus;                                    // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MarkOfferGroupAsVisitedDelay;                      // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MarkOfferGroupAsVisitedHandler;                    // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         NumOfColumns;                                      // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         HeaderFontInfoEnhanced;                            // 0x0360(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SubheaderFontInfoEnhanced;                         // 0x03B8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EUINavigation Direction, const struct FVector2D& FocusedTilePosition)> OnRowNavigatedFrom;                                // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUserWidget*                            FocusedTile;                                       // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWidePreview;                                     // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPItemShop_Row_Button_RowHitbox_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_Row_Button_RowHitbox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_Row_Button_RowHitbox_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void CalculateTileSize();
	void CancelRequestMarkOfferGroupAsVisited();
	void ExecuteUbergraph_WBP_MPItemShop_Row(int32 EntryPoint);
	void GetClosestTile(const struct FVector2D& TargetLocation, class UWBP_MPItemShop_Tile_C** Tile);
	void GetDesiredFocusTile(class UUserWidget** TileWidget);
	void GetFirstTile(class UUserWidget** TileWidget);
	void GetLastTileWidget(class UUserWidget** LastTileWidget);
	void GetTileAtIndex(int32 Index_0, class UUserWidget** TileWidget);
	void GetTileByOfferId(const class FString& OfferId, class UUserWidget** TileWidget);
	void InitializeHeaders();
	void InitializeSubheader(class UFortItemShopSectionVM* SectionVM);
	bool IsFirstRowInSection(class UFortItemShopSectionVM* SectionVM);
	bool IsLastRowInSection(class UFortItemShopSectionVM* SectionVM);
	void IsSongRow(bool* Result);
	void MarkOfferGroupAsVisited();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	class UWidget* OnNavigatedFrom(EUINavigation Navigation_0);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnTileFocused(class UUserWidget* FocusedTile_0);
	void OnUpdateOffers(TArray<class UFortItemShopOfferVM*>& OffersVM);
	void RequestMarkOfferGroupAsVisited();
	void ResetAllTiles();
	void ResetRow();
	void SetFortItemShopOfferGroupVM(class UFortItemShopOfferGroupVM* ViewModel);
	void SetHeaderText(const class FText& Text);
	void SetParentHasFocusState(bool HasFocus);
	void SetRowActiveState(bool IsActiveState);
	void SetRowHitboxVisibility();
	void SetRowPeekState(bool IsInPeekState);
	void SetRowWidth(double Width);
	void SetSubheaderText(const class FText& Text);
	void SetTileNavigation();
	bool ShouldShowHeader(class UFortItemShopSectionVM* SectionVM);
	void ShowSectionHeader(bool ShouldShowHeader_0);
	void ShowSubsectionHeader(bool ShouldShowHeader_0);
	void ShowSubsectionHeaderSpacer(bool Show);
	void UpdateHeaderStyle();
	void UpdateTileSizes(TArray<class UFortItemShopOfferVM*>& Offers);

	class FText __1c01b1a9_45ab_9040_3eb9_9dab19ca9413_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_Row_C">();
	}
	static class UWBP_MPItemShop_Row_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_Row_C>();
	}
};
static_assert(alignof(UWBP_MPItemShop_Row_C) == 0x000008, "Wrong alignment on UWBP_MPItemShop_Row_C");
static_assert(sizeof(UWBP_MPItemShop_Row_C) == 0x000430, "Wrong size on UWBP_MPItemShop_Row_C");
static_assert(offsetof(UWBP_MPItemShop_Row_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_MPItemShop_Row_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, FortItemShopOfferGroupVM) == 0x0002F0, "Member 'UWBP_MPItemShop_Row_C::FortItemShopOfferGroupVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, Button_RowHitbox) == 0x0002F8, "Member 'UWBP_MPItemShop_Row_C::Button_RowHitbox' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, SizeBox_RowContent) == 0x000300, "Member 'UWBP_MPItemShop_Row_C::SizeBox_RowContent' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, Spacer_SubsectionTopPadding) == 0x000308, "Member 'UWBP_MPItemShop_Row_C::Spacer_SubsectionTopPadding' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, Text_SectionTitle) == 0x000310, "Member 'UWBP_MPItemShop_Row_C::Text_SectionTitle' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, Text_SubsectionTitle) == 0x000318, "Member 'UWBP_MPItemShop_Row_C::Text_SubsectionTitle' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, VerticalBox_Headers) == 0x000320, "Member 'UWBP_MPItemShop_Row_C::VerticalBox_Headers' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, FortItemShopVM) == 0x000328, "Member 'UWBP_MPItemShop_Row_C::FortItemShopVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, IsRowActive) == 0x000330, "Member 'UWBP_MPItemShop_Row_C::IsRowActive' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, IsRowPeeked) == 0x000331, "Member 'UWBP_MPItemShop_Row_C::IsRowPeeked' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, OnRowFocused) == 0x000338, "Member 'UWBP_MPItemShop_Row_C::OnRowFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, ParentHasFocus) == 0x000348, "Member 'UWBP_MPItemShop_Row_C::ParentHasFocus' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, MarkOfferGroupAsVisitedDelay) == 0x00034C, "Member 'UWBP_MPItemShop_Row_C::MarkOfferGroupAsVisitedDelay' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, MarkOfferGroupAsVisitedHandler) == 0x000350, "Member 'UWBP_MPItemShop_Row_C::MarkOfferGroupAsVisitedHandler' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, NumOfColumns) == 0x000358, "Member 'UWBP_MPItemShop_Row_C::NumOfColumns' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, HeaderFontInfoEnhanced) == 0x000360, "Member 'UWBP_MPItemShop_Row_C::HeaderFontInfoEnhanced' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, SubheaderFontInfoEnhanced) == 0x0003B8, "Member 'UWBP_MPItemShop_Row_C::SubheaderFontInfoEnhanced' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, OnRowNavigatedFrom) == 0x000410, "Member 'UWBP_MPItemShop_Row_C::OnRowNavigatedFrom' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, FocusedTile) == 0x000420, "Member 'UWBP_MPItemShop_Row_C::FocusedTile' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_Row_C, IsWidePreview) == 0x000428, "Member 'UWBP_MPItemShop_Row_C::IsWidePreview' has a wrong offset!");

}

