#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CategoriesTabs

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.ChangeNamesVisibility
// 0x0058 (0x0058 - 0x0000)
struct WBP_CategoriesTabs_C_ChangeNamesVisibility final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CategoriesButton_C*                K2Node_DynamicCast_AsWBP_Categories_Button;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_ChangeNamesVisibility) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_ChangeNamesVisibility");
static_assert(sizeof(WBP_CategoriesTabs_C_ChangeNamesVisibility) == 0x000058, "Wrong size on WBP_CategoriesTabs_C_ChangeNamesVisibility");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, Show) == 0x000000, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::Show' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, K2Node_DynamicCast_AsWBP_Categories_Button) == 0x000038, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::K2Node_DynamicCast_AsWBP_Categories_Button' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ChangeNamesVisibility, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'WBP_CategoriesTabs_C_ChangeNamesVisibility::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.Event On Input Method Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_CategoriesTabs_C_Event_On_Input_Method_Changed final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_Event_On_Input_Method_Changed) == 0x000001, "Wrong alignment on WBP_CategoriesTabs_C_Event_On_Input_Method_Changed");
static_assert(sizeof(WBP_CategoriesTabs_C_Event_On_Input_Method_Changed) == 0x000001, "Wrong size on WBP_CategoriesTabs_C_Event_On_Input_Method_Changed");
static_assert(offsetof(WBP_CategoriesTabs_C_Event_On_Input_Method_Changed, bNewInputType) == 0x000000, "Member 'WBP_CategoriesTabs_C_Event_On_Input_Method_Changed::bNewInputType' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.ExecuteUbergraph_WBP_CategoriesTabs
// 0x0168 (0x0168 - 0x0000)
struct WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0008(0x0078)(ConstParm)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_bNewInputType;                        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHoveredItem_IsHovering;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0078)(ConstParm)
	class FName                                   K2Node_Event_TabNameID;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_Event_TabButton;                            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabIndexByID_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CategoriesButton_C*                K2Node_DynamicCast_AsWBP_Categories_Button;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLockerCategoryGroupVM*             CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs");
static_assert(sizeof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs) == 0x000168, "Wrong size on WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, EntryPoint) == 0x000000, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_MouseEvent_1) == 0x000008, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, CallFunc_IsUsingTouch_ReturnValue) == 0x000080, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_bNewInputType) == 0x000081, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000083, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, CallFunc_HasHoveredItem_IsHovering) == 0x000084, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::CallFunc_HasHoveredItem_IsHovering' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_IsDesignTime) == 0x000085, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_MyGeometry) == 0x000088, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_TabNameID) == 0x000138, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_Event_TabButton) == 0x000140, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_Event_TabButton' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, CallFunc_GetTabIndexByID_ReturnValue) == 0x000148, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::CallFunc_GetTabIndexByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_DynamicCast_AsWBP_Categories_Button) == 0x000150, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_DynamicCast_AsWBP_Categories_Button' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs, CallFunc_Array_Get_Item) == 0x000160, "Member 'WBP_CategoriesTabs_C_ExecuteUbergraph_WBP_CategoriesTabs::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.HandleTabCreation
// 0x0010 (0x0010 - 0x0000)
struct WBP_CategoriesTabs_C_HandleTabCreation final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_HandleTabCreation) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_HandleTabCreation");
static_assert(sizeof(WBP_CategoriesTabs_C_HandleTabCreation) == 0x000010, "Wrong size on WBP_CategoriesTabs_C_HandleTabCreation");
static_assert(offsetof(WBP_CategoriesTabs_C_HandleTabCreation, TabNameID) == 0x000000, "Member 'WBP_CategoriesTabs_C_HandleTabCreation::TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HandleTabCreation, TabButton) == 0x000008, "Member 'WBP_CategoriesTabs_C_HandleTabCreation::TabButton' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.HasHoveredItem
// 0x0048 (0x0048 - 0x0000)
struct WBP_CategoriesTabs_C_HasHoveredItem final
{
public:
	bool                                          IsHovering;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CategoriesButton_C*                K2Node_DynamicCast_AsWBP_Categories_Button;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_HasHoveredItem) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_HasHoveredItem");
static_assert(sizeof(WBP_CategoriesTabs_C_HasHoveredItem) == 0x000048, "Wrong size on WBP_CategoriesTabs_C_HasHoveredItem");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, IsHovering) == 0x000000, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::IsHovering' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, K2Node_DynamicCast_AsWBP_Categories_Button) == 0x000038, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::K2Node_DynamicCast_AsWBP_Categories_Button' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_HasHoveredItem, CallFunc_IsHovered_ReturnValue) == 0x000041, "Member 'WBP_CategoriesTabs_C_HasHoveredItem::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_CategoriesTabs_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CategoriesTabs_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_OnMouseEnter");
static_assert(sizeof(WBP_CategoriesTabs_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_CategoriesTabs_C_OnMouseEnter");
static_assert(offsetof(WBP_CategoriesTabs_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_CategoriesTabs_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_CategoriesTabs_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_CategoriesTabs_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CategoriesTabs_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_OnMouseLeave");
static_assert(sizeof(WBP_CategoriesTabs_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_CategoriesTabs_C_OnMouseLeave");
static_assert(offsetof(WBP_CategoriesTabs_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_CategoriesTabs_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.PopulateTabs
// 0x0050 (0x0050 - 0x0000)
struct WBP_CategoriesTabs_C_PopulateTabs final
{
public:
	TArray<class UFortLockerCategoryGroupVM*>     Categories_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UUIKitTabGroupViewModel*                tabsVM;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupViewModel*                CallFunc_SpawnObject_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortLockerCategoryGroupVM*             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFortLockerCategoryGroupConfig*   CallFunc_GetConfig_ReturnValue;                    // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_PopulateTabs) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_PopulateTabs");
static_assert(sizeof(WBP_CategoriesTabs_C_PopulateTabs) == 0x000050, "Wrong size on WBP_CategoriesTabs_C_PopulateTabs");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, Categories_0) == 0x000000, "Member 'WBP_CategoriesTabs_C_PopulateTabs::Categories_0' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, tabsVM) == 0x000010, "Member 'WBP_CategoriesTabs_C_PopulateTabs::tabsVM' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_CategoriesTabs_C_PopulateTabs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_CategoriesTabs_C_PopulateTabs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_SpawnObject_ReturnValue_1) == 0x000030, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_GetConfig_ReturnValue) == 0x000040, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_GetConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_PopulateTabs, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_CategoriesTabs_C_PopulateTabs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CategoriesTabs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CategoriesTabs_C_PreConstruct");
static_assert(sizeof(WBP_CategoriesTabs_C_PreConstruct) == 0x000001, "Wrong size on WBP_CategoriesTabs_C_PreConstruct");
static_assert(offsetof(WBP_CategoriesTabs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CategoriesTabs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.Select Tab
// 0x0008 (0x0008 - 0x0000)
struct WBP_CategoriesTabs_C_Select_Tab final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByIndex_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_Select_Tab) == 0x000004, "Wrong alignment on WBP_CategoriesTabs_C_Select_Tab");
static_assert(sizeof(WBP_CategoriesTabs_C_Select_Tab) == 0x000008, "Wrong size on WBP_CategoriesTabs_C_Select_Tab");
static_assert(offsetof(WBP_CategoriesTabs_C_Select_Tab, Index_0) == 0x000000, "Member 'WBP_CategoriesTabs_C_Select_Tab::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_Select_Tab, CallFunc_SelectTabByIndex_ReturnValue) == 0x000004, "Member 'WBP_CategoriesTabs_C_Select_Tab::CallFunc_SelectTabByIndex_ReturnValue' has a wrong offset!");

// Function WBP_CategoriesTabs.WBP_CategoriesTabs_C.SetInteractionEnabled
// 0x0050 (0x0050 - 0x0000)
struct WBP_CategoriesTabs_C_SetInteractionEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CategoriesButton_C*                K2Node_DynamicCast_AsWBP_Categories_Button;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesTabs_C_SetInteractionEnabled) == 0x000008, "Wrong alignment on WBP_CategoriesTabs_C_SetInteractionEnabled");
static_assert(sizeof(WBP_CategoriesTabs_C_SetInteractionEnabled) == 0x000050, "Wrong size on WBP_CategoriesTabs_C_SetInteractionEnabled");
static_assert(offsetof(WBP_CategoriesTabs_C_SetInteractionEnabled, Enabled) == 0x000000, "Member 'WBP_CategoriesTabs_C_SetInteractionEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_SetInteractionEnabled, Temp_bool_Variable) == 0x000001, "Member 'WBP_CategoriesTabs_C_SetInteractionEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesTabs_C_SetInteractionEnabled, Temp_byte_Variable) == 0x000002, "Member 'WBP_CategoriesTabs_C_SetInteractionEnabled::Temp_byte_Variable' has a wrong offset!");
