#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPLocker_SortFilterOptionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPLocker_SortFilterOptionButton.WBP_MPLocker_SortFilterOptionButton_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_MPLocker_SortFilterOptionButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortOptionItemVM*                      FortOptionItemVM;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonWithToggle_C*          WBP_UIKit_ButtonWithToggle;                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPLocker_SortFilterButton_WBP_UIKit_ButtonWithToggle_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_MPLocker_SortFilterOptionButton(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void SetButtonText(const class FText& Text);
	void SetFortOptionItemVM(class UFortOptionItemVM* ViewModel);

	void __175e7439_42a2_73b1_6615_ae910b2fa94e_SourceToDest(class FText* Button_text) const;
	ESlateVisibility __dcc51faf_465d_1ab3_907b_d19e520d6a61_SourceToDest() const;
	void BuildButtonText(const class FText& Text, int32 Count, class FText* Button_text) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPLocker_SortFilterOptionButton_C">();
	}
	static class UWBP_MPLocker_SortFilterOptionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPLocker_SortFilterOptionButton_C>();
	}
};
static_assert(alignof(UWBP_MPLocker_SortFilterOptionButton_C) == 0x000008, "Wrong alignment on UWBP_MPLocker_SortFilterOptionButton_C");
static_assert(sizeof(UWBP_MPLocker_SortFilterOptionButton_C) == 0x0002D8, "Wrong size on UWBP_MPLocker_SortFilterOptionButton_C");
static_assert(offsetof(UWBP_MPLocker_SortFilterOptionButton_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_MPLocker_SortFilterOptionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_SortFilterOptionButton_C, FortOptionItemVM) == 0x0002C8, "Member 'UWBP_MPLocker_SortFilterOptionButton_C::FortOptionItemVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_SortFilterOptionButton_C, WBP_UIKit_ButtonWithToggle) == 0x0002D0, "Member 'UWBP_MPLocker_SortFilterOptionButton_C::WBP_UIKit_ButtonWithToggle' has a wrong offset!");

}

