#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PanelRebootRally

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PanelRebootRally.WBP_PanelRebootRally_C
// 0x0030 (0x04C8 - 0x0498)
class UWBP_PanelRebootRally_C final : public UFortSidebarPanelReboot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_MissingFriends;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMoreInfo_Ressources_Button_C*          MoreInfo_Ressources_Button_67;                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MoreInfoOverlay;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SeasonName;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebootRallyEligiblePlayersOnboardingTooltip_C* RebootRallyEligiblePlayersOnboardingTooltip;       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PanelRebootRally_MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void ExecuteUbergraph_WBP_PanelRebootRally(int32 EntryPoint);
	void OnInitialized();
	void SetTooltipAlignment();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PanelRebootRally_C">();
	}
	static class UWBP_PanelRebootRally_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PanelRebootRally_C>();
	}
};
static_assert(alignof(UWBP_PanelRebootRally_C) == 0x000008, "Wrong alignment on UWBP_PanelRebootRally_C");
static_assert(sizeof(UWBP_PanelRebootRally_C) == 0x0004C8, "Wrong size on UWBP_PanelRebootRally_C");
static_assert(offsetof(UWBP_PanelRebootRally_C, UberGraphFrame) == 0x000498, "Member 'UWBP_PanelRebootRally_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PanelRebootRally_C, HB_MissingFriends) == 0x0004A0, "Member 'UWBP_PanelRebootRally_C::HB_MissingFriends' has a wrong offset!");
static_assert(offsetof(UWBP_PanelRebootRally_C, MoreInfo_Ressources_Button_67) == 0x0004A8, "Member 'UWBP_PanelRebootRally_C::MoreInfo_Ressources_Button_67' has a wrong offset!");
static_assert(offsetof(UWBP_PanelRebootRally_C, MoreInfoOverlay) == 0x0004B0, "Member 'UWBP_PanelRebootRally_C::MoreInfoOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_PanelRebootRally_C, Text_SeasonName) == 0x0004B8, "Member 'UWBP_PanelRebootRally_C::Text_SeasonName' has a wrong offset!");
static_assert(offsetof(UWBP_PanelRebootRally_C, RebootRallyEligiblePlayersOnboardingTooltip) == 0x0004C0, "Member 'UWBP_PanelRebootRally_C::RebootRallyEligiblePlayersOnboardingTooltip' has a wrong offset!");

}

