#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AthenaBottomBarWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AthenaBottomBarWidget.WBP_AthenaBottomBarWidget_C
// 0x0030 (0x0318 - 0x02E8)
class UWBP_AthenaBottomBarWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortHUDElementWrapper_C*               FortHUDElementWrapper;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_ActionBar;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBarContainer_C*              WBP_ActionBarContainer;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Display_Owner_Actions_Only;                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBoundActionBar*                  ActionBarWidget;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateButtonSpacing();
	void SetActionBarWidget(class UAthenaBoundActionBar* NewActionBarWidget);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void OnActionBarUpdated();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void ExecuteUbergraph_WBP_AthenaBottomBarWidget(int32 EntryPoint);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AthenaBottomBarWidget_C">();
	}
	static class UWBP_AthenaBottomBarWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AthenaBottomBarWidget_C>();
	}
};
static_assert(alignof(UWBP_AthenaBottomBarWidget_C) == 0x000008, "Wrong alignment on UWBP_AthenaBottomBarWidget_C");
static_assert(sizeof(UWBP_AthenaBottomBarWidget_C) == 0x000318, "Wrong size on UWBP_AthenaBottomBarWidget_C");
static_assert(offsetof(UWBP_AthenaBottomBarWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_AthenaBottomBarWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AthenaBottomBarWidget_C, FortHUDElementWrapper) == 0x0002F0, "Member 'UWBP_AthenaBottomBarWidget_C::FortHUDElementWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_AthenaBottomBarWidget_C, Slot_ActionBar) == 0x0002F8, "Member 'UWBP_AthenaBottomBarWidget_C::Slot_ActionBar' has a wrong offset!");
static_assert(offsetof(UWBP_AthenaBottomBarWidget_C, WBP_ActionBarContainer) == 0x000300, "Member 'UWBP_AthenaBottomBarWidget_C::WBP_ActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_AthenaBottomBarWidget_C, Display_Owner_Actions_Only) == 0x000308, "Member 'UWBP_AthenaBottomBarWidget_C::Display_Owner_Actions_Only' has a wrong offset!");
static_assert(offsetof(UWBP_AthenaBottomBarWidget_C, ActionBarWidget) == 0x000310, "Member 'UWBP_AthenaBottomBarWidget_C::ActionBarWidget' has a wrong offset!");

}

