#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Discovery_ContextualButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Button_Generic_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Discovery_ContextualButton.WBP_Discovery_ContextualButton_C
// 0x0010 (0x1850 - 0x1840)
class UWBP_Discovery_ContextualButton_C final : public UWBP_UIKit_Button_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Discovery_ContextualButton_C;   // 0x1838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_Backplate_Glass_C*           WBP_UIKit_Backplate_Glass;                         // 0x1840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Outline_C*             WBP_UIKit_Block_Outline;                           // 0x1848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_Discovery_ContextualButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Discovery_ContextualButton_C">();
	}
	static class UWBP_Discovery_ContextualButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Discovery_ContextualButton_C>();
	}
};
static_assert(alignof(UWBP_Discovery_ContextualButton_C) == 0x000010, "Wrong alignment on UWBP_Discovery_ContextualButton_C");
static_assert(sizeof(UWBP_Discovery_ContextualButton_C) == 0x001850, "Wrong size on UWBP_Discovery_ContextualButton_C");
static_assert(offsetof(UWBP_Discovery_ContextualButton_C, UberGraphFrame_WBP_Discovery_ContextualButton_C) == 0x001838, "Member 'UWBP_Discovery_ContextualButton_C::UberGraphFrame_WBP_Discovery_ContextualButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_ContextualButton_C, WBP_UIKit_Backplate_Glass) == 0x001840, "Member 'UWBP_Discovery_ContextualButton_C::WBP_UIKit_Backplate_Glass' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_ContextualButton_C, WBP_UIKit_Block_Outline) == 0x001848, "Member 'UWBP_Discovery_ContextualButton_C::WBP_UIKit_Block_Outline' has a wrong offset!");

}

