#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Tag_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_UI_TagType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Tag_Base.WBP_UIKit_Tag_Base_C
// 0x0268 (0x0528 - 0x02C0)
class UWBP_UIKit_Tag_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         StyleContainer;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TagContainer;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Label;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Style;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Style_Divider;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Tag;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_UI_TagType                                  TagType;                                           // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TagText;                                           // 0x0308(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           TagColor;                                          // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TagPadding;                                        // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           LabelColor;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                LabelPadding;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           BackgroundColor;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   LabelText;                                         // 0x0378(0x0018)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         RarityFont;                                        // 0x0390(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         PrimaryFont;                                       // 0x03E8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         TertiaryFont_Bold;                                 // 0x0440(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         TertiaryFont_Regular;                              // 0x0498(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           StyleColor;                                        // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                StylePadding;                                      // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FText                                   StyleText;                                         // 0x0510(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_UIKit_Tag_Base(int32 EntryPoint);
	void InitializeTag();
	void PreConstruct(bool IsDesignTime);
	void SetLabelText(const class FText& Text);
	void SetLabelTextColor(const struct FLinearColor& Color);
	void SetLabelTextPadding(const struct FMargin& Padding_0);
	void SetStyleText(const class FText& Text);
	void SetStyleTextColor(const struct FLinearColor& Color);
	void SetStyleTextPadding(const struct FMargin& Padding_0);
	void SetTagBackgroundColor(const struct FLinearColor& Color);
	void SetTagText(const class FText& Text);
	void SetTagTextColor(const struct FLinearColor& Color);
	void SetTagTextPadding(const struct FMargin& Padding_0);
	void SetTagType(E_UI_TagType Type);
	void SetTagVisibility(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Tag_Base_C">();
	}
	static class UWBP_UIKit_Tag_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Tag_Base_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Tag_Base_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Tag_Base_C");
static_assert(sizeof(UWBP_UIKit_Tag_Base_C) == 0x000528, "Wrong size on UWBP_UIKit_Tag_Base_C");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_Tag_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, Background) == 0x0002C8, "Member 'UWBP_UIKit_Tag_Base_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, StyleContainer) == 0x0002D0, "Member 'UWBP_UIKit_Tag_Base_C::StyleContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TagContainer) == 0x0002D8, "Member 'UWBP_UIKit_Tag_Base_C::TagContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, Text_Label) == 0x0002E0, "Member 'UWBP_UIKit_Tag_Base_C::Text_Label' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, Text_Style) == 0x0002E8, "Member 'UWBP_UIKit_Tag_Base_C::Text_Style' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, Text_Style_Divider) == 0x0002F0, "Member 'UWBP_UIKit_Tag_Base_C::Text_Style_Divider' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, Text_Tag) == 0x0002F8, "Member 'UWBP_UIKit_Tag_Base_C::Text_Tag' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TagType) == 0x000300, "Member 'UWBP_UIKit_Tag_Base_C::TagType' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TagText) == 0x000308, "Member 'UWBP_UIKit_Tag_Base_C::TagText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TagColor) == 0x000320, "Member 'UWBP_UIKit_Tag_Base_C::TagColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TagPadding) == 0x000330, "Member 'UWBP_UIKit_Tag_Base_C::TagPadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, LabelColor) == 0x000340, "Member 'UWBP_UIKit_Tag_Base_C::LabelColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, LabelPadding) == 0x000350, "Member 'UWBP_UIKit_Tag_Base_C::LabelPadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, BackgroundColor) == 0x000360, "Member 'UWBP_UIKit_Tag_Base_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, BackgroundMaterial) == 0x000370, "Member 'UWBP_UIKit_Tag_Base_C::BackgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, LabelText) == 0x000378, "Member 'UWBP_UIKit_Tag_Base_C::LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, RarityFont) == 0x000390, "Member 'UWBP_UIKit_Tag_Base_C::RarityFont' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, PrimaryFont) == 0x0003E8, "Member 'UWBP_UIKit_Tag_Base_C::PrimaryFont' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TertiaryFont_Bold) == 0x000440, "Member 'UWBP_UIKit_Tag_Base_C::TertiaryFont_Bold' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, TertiaryFont_Regular) == 0x000498, "Member 'UWBP_UIKit_Tag_Base_C::TertiaryFont_Regular' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, StyleColor) == 0x0004F0, "Member 'UWBP_UIKit_Tag_Base_C::StyleColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, StylePadding) == 0x000500, "Member 'UWBP_UIKit_Tag_Base_C::StylePadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tag_Base_C, StyleText) == 0x000510, "Member 'UWBP_UIKit_Tag_Base_C::StyleText' has a wrong offset!");

}

