#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceReport

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_VoiceReport.WBP_VoiceReport_C.Complete Report
// 0x0002 (0x0002 - 0x0000)
struct WBP_VoiceReport_C_Complete_Report final
{
public:
	bool                                          Sent;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceRepUploadRecordResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceReport_C_Complete_Report) == 0x000001, "Wrong alignment on WBP_VoiceReport_C_Complete_Report");
static_assert(sizeof(WBP_VoiceReport_C_Complete_Report) == 0x000002, "Wrong size on WBP_VoiceReport_C_Complete_Report");
static_assert(offsetof(WBP_VoiceReport_C_Complete_Report, Sent) == 0x000000, "Member 'WBP_VoiceReport_C_Complete_Report::Sent' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_Complete_Report, Result) == 0x000001, "Member 'WBP_VoiceReport_C_Complete_Report::Result' has a wrong offset!");

// Function WBP_VoiceReport.WBP_VoiceReport_C.ExecuteUbergraph_WBP_VoiceReport
// 0x0048 (0x0048 - 0x0000)
struct WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Sent;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoiceRepUploadRecordResult                   K2Node_CustomEvent_Result;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StepWizard_Base_C*                 K2Node_DynamicCast_AsWBP_Step_Wizard_Base;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Loaded;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StepWizard_Base_C*                 K2Node_DynamicCast_AsWBP_Step_Wizard_Base_1;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_VoiceRep_Reporting_Step_C*         K2Node_DynamicCast_AsWBP_Voice_Rep_Reporting_Step; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StepWizard_Base_C*                 K2Node_DynamicCast_AsWBP_Step_Wizard_Base_2;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport) == 0x000008, "Wrong alignment on WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport");
static_assert(sizeof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport) == 0x000048, "Wrong size on WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, EntryPoint) == 0x000000, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_CustomEvent_Sent) == 0x000004, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_CustomEvent_Sent' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_CustomEvent_Result) == 0x000005, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_AsWBP_Step_Wizard_Base) == 0x000008, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_AsWBP_Step_Wizard_Base' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_CustomEvent_Loaded) == 0x000012, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_AsWBP_Step_Wizard_Base_1) == 0x000018, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_AsWBP_Step_Wizard_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_AsWBP_Voice_Rep_Reporting_Step) == 0x000028, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_AsWBP_Voice_Rep_Reporting_Step' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_AsWBP_Step_Wizard_Base_2) == 0x000038, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_AsWBP_Step_Wizard_Base_2' has a wrong offset!");
static_assert(offsetof(WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'WBP_VoiceReport_C_ExecuteUbergraph_WBP_VoiceReport::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function WBP_VoiceReport.WBP_VoiceReport_C.Voice Chat Audio
// 0x0001 (0x0001 - 0x0000)
struct WBP_VoiceReport_C_Voice_Chat_Audio final
{
public:
	bool                                          Loaded;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoiceReport_C_Voice_Chat_Audio) == 0x000001, "Wrong alignment on WBP_VoiceReport_C_Voice_Chat_Audio");
static_assert(sizeof(WBP_VoiceReport_C_Voice_Chat_Audio) == 0x000001, "Wrong size on WBP_VoiceReport_C_Voice_Chat_Audio");
static_assert(offsetof(WBP_VoiceReport_C_Voice_Chat_Audio, Loaded) == 0x000000, "Member 'WBP_VoiceReport_C_Voice_Chat_Audio::Loaded' has a wrong offset!");

}

