#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_SectionNavigator_Categories

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.CollapseOthers
// 0x0004 (0x0004 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers final
{
public:
	class FName                                   ExceptCategoryID;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers) == 0x000004, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers) == 0x000004, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers, ExceptCategoryID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_CollapseOthers::ExceptCategoryID' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.Event OnCategoryExpandedStateChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExpanded;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged) == 0x000004, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged) == 0x000008, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged, CategoryID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged, IsExpanded) == 0x000004, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryExpandedStateChanged::IsExpanded' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.Event OnCategoryTabSelected
// 0x0010 (0x0010 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          TabVM;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected) == 0x000010, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected, CategoryID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected, TabID) == 0x000004, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected::TabID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected, TabVM) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnCategoryTabSelected::TabVM' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.Event OnTabSelected
// 0x0004 (0x0004 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected) == 0x000004, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected) == 0x000004, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected, TabID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_Event_OnTabSelected::TabID' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories
// 0x0098 (0x0098 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_TabID;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CallFunc_GetTabButtonBaseByID_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      CallFunc_GetCategorySelectedTabButton_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDelayed;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CategoryID;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsExpanded;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CallFunc_GetTabButtonBaseByID_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Tab_Collapsible_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CategoryID_1;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TabID_1;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupButtonViewModel*          K2Node_Event_TabVM;                                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      CallFunc_GetCategoryTabButton_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container_1;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories) == 0x000098, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, EntryPoint) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_TabID) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_TabID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetTabButtonBaseByID_ReturnValue) == 0x000010, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetTabButtonBaseByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetCategorySelectedTabButton_ReturnValue) == 0x000018, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetCategorySelectedTabButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetCategoryContainer_Container) == 0x000020, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetCategoryContainer_Container' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_CustomEvent_Widget) == 0x000030, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_CustomEvent_IsDelayed) == 0x000038, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_CustomEvent_IsDelayed' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_CategoryID) == 0x00003C, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_IsExpanded) == 0x000040, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_IsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetTabButtonBaseByID_ReturnValue_1) == 0x000048, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetTabButtonBaseByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base) == 0x000050, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_CategoryID_1) == 0x00005C, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_CategoryID_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_TabID_1) == 0x000060, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_TabID_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_Event_TabVM) == 0x000068, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_Event_TabVM' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetCategoryTabButton_ReturnValue) == 0x000070, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetCategoryTabButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetCategoryContainer_Container_1) == 0x000078, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetCategoryContainer_Container_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000080, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000088, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, CallFunc_GetCurrentInputType_ReturnValue) == 0x000090, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories, K2Node_SwitchEnum_CmpSuccess) == 0x000091, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExecuteUbergraph_WBP_MPItemShop_SectionNavigator_Categories::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.ExpandCategory
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory) == 0x000004, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory) == 0x000008, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory, CategoryID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ExpandCategory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.HandleCategoryClick
// 0x0004 (0x0004 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick) == 0x000004, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick) == 0x000004, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick, CategoryID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_HandleCategoryClick::CategoryID' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.InjectScrollBox
// 0x0018 (0x0018 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox final
{
public:
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox) == 0x000018, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox, CallFunc_AddChild_ReturnValue) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox, CallFunc_AddChild_ReturnValue_1) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox, CallFunc_RemoveChild_ReturnValue) == 0x000010, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_InjectScrollBox::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct) == 0x000001, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.RefreshScrollBoxContentStyle
// 0x0030 (0x0030 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle) == 0x000030, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, Temp_bool_Variable) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, Temp_real_Variable) == 0x000004, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, Temp_real_Variable_1) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000010, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, K2Node_Select_Default) == 0x00001C, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle, K2Node_MakeStruct_Margin) == 0x000020, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_RefreshScrollBoxContentStyle::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.ScrollToWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDelayed;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget) == 0x000010, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget, Widget) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget, IsDelayed) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ScrollToWidget::IsDelayed' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.SetIsCollapsed
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed final
{
public:
	bool                                          IsCollapsed_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          CurrentTabCategory;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_GetCategoryTabs_InnerTabs;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Tab_Collapsible_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedTabId_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_GetCategoryTabs_InnerTabs_1;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_UIKit_Button_Tab_Collapsible_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Tab_Collapsible_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base_2; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          K2Node_DynamicCast_AsWBP_UIKit_Tab_Category_Base;  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed) == 0x0000C8, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, IsCollapsed_0) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::IsCollapsed_0' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CurrentTabCategory) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CurrentTabCategory' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_GetCategoryTabs_InnerTabs) == 0x000028, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_GetCategoryTabs_InnerTabs' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base) == 0x000030, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_GetSelectedTabId_ReturnValue) == 0x00003C, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_GetSelectedTabId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_NotEqual_NameName_ReturnValue) == 0x000040, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000041, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_GetCategoryTabs_InnerTabs_1) == 0x000048, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_GetCategoryTabs_InnerTabs_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_GetAllChildren_ReturnValue) == 0x000050, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_GetAllChildren_ReturnValue_1) == 0x000068, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base_1) == 0x000078, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base_2) == 0x000090, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base_2' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_AsWBP_UIKit_Tab_Category_Base) == 0x0000A0, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_AsWBP_UIKit_Tab_Category_Base' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, Temp_int_Loop_Counter_Variable_1) == 0x0000B8, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C0, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetIsCollapsed::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.SetTabButtonCollapsedState
// 0x0010 (0x0010 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState final
{
public:
	class UWBP_UIKit_Button_Tab_Collapsible_Base_C* Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldCollapse;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState) == 0x000010, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState, Button) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState::Button' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState, ShouldCollapse) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState::ShouldCollapse' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetTabButtonCollapsedState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.SetupTabButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton final
{
public:
	class FName                                   Tab_ID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CreatedButtonReference;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Tab_Collapsible_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton) == 0x000008, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton) == 0x000028, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton, Tab_ID) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton::Tab_ID' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton, CreatedButtonReference) == 0x000008, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton::CreatedButtonReference' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton, CallFunc_GetCategoryContainer_Container) == 0x000010, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton::CallFunc_GetCategoryContainer_Container' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton, K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base) == 0x000018, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton::K2Node_DynamicCast_AsWBP_UIKit_Button_Tab_Collapsible_Base' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_SetupTabButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.GetIsCollapsed
// 0x0001 (0x0001 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed final
{
public:
	bool                                          IsCollapsed_0;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed) == 0x000001, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed) == 0x000001, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed, IsCollapsed_0) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_GetIsCollapsed::IsCollapsed_0' has a wrong offset!");

// Function WBP_MPItemShop_SectionNavigator_Categories.WBP_MPItemShop_SectionNavigator_Categories_C.ShouldDisplaySelectionOnCollapsedCategory
// 0x0003 (0x0003 - 0x0000)
struct WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplaySelectionOnCollapsedCategory_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory) == 0x000001, "Wrong alignment on WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory");
static_assert(sizeof(WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory) == 0x000003, "Wrong size on WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory");
static_assert(offsetof(WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory, ReturnValue) == 0x000000, "Member 'WBP_MPItemShop_SectionNavigator_Categories_C_ShouldDisplaySelectionOnCollapsedCategory::ReturnValue' has a wrong offset!");
