#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatsRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatsRow.WBP_StatsRow_C
// 0x0078 (0x0338 - 0x02C0)
class UWBP_StatsRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_245;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Divisor;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Divisor_1;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsBlock_C*                      WBP_StatsBlock;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsBlock_C*                      WBP_StatsBlock_1;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatsBlock_C*                      WBP_StatsBlock_2;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           Label;                                             // 0x0308(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           RatioTextFormat;                                   // 0x0318(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     Icons;                                             // 0x0328(0x0010)(Edit, BlueprintVisible)

public:
	void ApplyBlocksTemplates();
	void ExecuteUbergraph_WBP_StatsRow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBlocksData(int32 Index_0, const class FText& ValueText, const class FText& RatioText);
	void SetBlockTemplate(int32 Index_0, const class FText& Label_0, const class FText& RatioTextFormat_0, class UTexture2D* IconTexture);
	void SetEmptyDataState(bool IsEmpty);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatsRow_C">();
	}
	static class UWBP_StatsRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatsRow_C>();
	}
};
static_assert(alignof(UWBP_StatsRow_C) == 0x000008, "Wrong alignment on UWBP_StatsRow_C");
static_assert(sizeof(UWBP_StatsRow_C) == 0x000338, "Wrong size on UWBP_StatsRow_C");
static_assert(offsetof(UWBP_StatsRow_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_StatsRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, CommonTextBlock_2) == 0x0002C8, "Member 'UWBP_StatsRow_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, HorizontalBox_245) == 0x0002D0, "Member 'UWBP_StatsRow_C::HorizontalBox_245' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, Image_32) == 0x0002D8, "Member 'UWBP_StatsRow_C::Image_32' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, Image_Divisor) == 0x0002E0, "Member 'UWBP_StatsRow_C::Image_Divisor' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, Image_Divisor_1) == 0x0002E8, "Member 'UWBP_StatsRow_C::Image_Divisor_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, WBP_StatsBlock) == 0x0002F0, "Member 'UWBP_StatsRow_C::WBP_StatsBlock' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, WBP_StatsBlock_1) == 0x0002F8, "Member 'UWBP_StatsRow_C::WBP_StatsBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, WBP_StatsBlock_2) == 0x000300, "Member 'UWBP_StatsRow_C::WBP_StatsBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, Label) == 0x000308, "Member 'UWBP_StatsRow_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, RatioTextFormat) == 0x000318, "Member 'UWBP_StatsRow_C::RatioTextFormat' has a wrong offset!");
static_assert(offsetof(UWBP_StatsRow_C, Icons) == 0x000328, "Member 'UWBP_StatsRow_C::Icons' has a wrong offset!");

}

