#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Habanero_ShieldSmall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Habanero_ShieldSmall.WBP_Habanero_ShieldSmall_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_Habanero_ShieldSmall_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroSmall;                                        // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_36;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DebugPreview(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Habanero_ShieldSmall(int32 EntryPoint);
	void PlayShieldResetedAnimation();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Habanero_ShieldSmall_C">();
	}
	static class UWBP_Habanero_ShieldSmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Habanero_ShieldSmall_C>();
	}
};
static_assert(alignof(UWBP_Habanero_ShieldSmall_C) == 0x000008, "Wrong alignment on UWBP_Habanero_ShieldSmall_C");
static_assert(sizeof(UWBP_Habanero_ShieldSmall_C) == 0x0002D8, "Wrong size on UWBP_Habanero_ShieldSmall_C");
static_assert(offsetof(UWBP_Habanero_ShieldSmall_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Habanero_ShieldSmall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Habanero_ShieldSmall_C, IntroSmall) == 0x0002C8, "Member 'UWBP_Habanero_ShieldSmall_C::IntroSmall' has a wrong offset!");
static_assert(offsetof(UWBP_Habanero_ShieldSmall_C, Image_36) == 0x0002D0, "Member 'UWBP_Habanero_ShieldSmall_C::Image_36' has a wrong offset!");

}

