#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Discover_Tile_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Discover_Tile_Base.WBP_Discover_Tile_Base_C
// 0x00A0 (0x0388 - 0x02E8)
class UWBP_Discover_Tile_Base_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_OnHoverSelect;                                // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_main;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_LowerRight;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_OutsideOfTile;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_TileContents;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortVisualAttachment*                  VisualAttachment_OutsideContent;                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActivityBrowserSocialProof_NEW_C*  WBP_ActivityBrowserSocialProof_NEW;                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BottomBarDecoyButton_C*            WBP_BottomBarHackButton_ContextMenu;               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Outline_C*            WBP_UIKit_Button_Outline;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_ContextMenuAnchorButton_C*   WBP_UIKit_ContextMenuAnchorButton;                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TileSize;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    No_Input_Action_Row;                               // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    ContextMenuInputAction;                            // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsTileActive;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasContextMenuItems;                               // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitContextMenuActionContext*         ContextMenuActionContext;                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSquareTilesTemp;                                 // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsJoinablePartyTile;                               // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_IslandTile_Minimal_WBP_BottomBarHackButton_ContextMenu_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void CleanupContextMenuOnRelease();
	void CloseContextMenu();
	void ColumnSizeToTileSize(int32 NewColumnSize, struct FVector2D* NewTileSize);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Discover_Tile_Base(int32 EntryPoint);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnRightClickMouse(const struct FPointerEvent& MouseEvent, struct FEventReply* WasHandled);
	void OnTileBaseSelectionActive();
	void OnTileBaseSelectionNotActive();
	void PreConstruct(bool IsDesignTime);
	void RemoveAllInteractions();
	void RemoveInteractionByName(class FName ActionToRemove);
	void Set_Tile_Size(const struct FVector2D& InSize);
	void SetColumnSize(int32 NewSize);
	void SetupContextMenu();
	void UpdateContextMenuButtonsVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Discover_Tile_Base_C">();
	}
	static class UWBP_Discover_Tile_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Discover_Tile_Base_C>();
	}
};
static_assert(alignof(UWBP_Discover_Tile_Base_C) == 0x000008, "Wrong alignment on UWBP_Discover_Tile_Base_C");
static_assert(sizeof(UWBP_Discover_Tile_Base_C) == 0x000388, "Wrong size on UWBP_Discover_Tile_Base_C");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Discover_Tile_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, Anim_OnHoverSelect) == 0x0002F0, "Member 'UWBP_Discover_Tile_Base_C::Anim_OnHoverSelect' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, SizeBox_main) == 0x0002F8, "Member 'UWBP_Discover_Tile_Base_C::SizeBox_main' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, Slot_LowerRight) == 0x000300, "Member 'UWBP_Discover_Tile_Base_C::Slot_LowerRight' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, Slot_OutsideOfTile) == 0x000308, "Member 'UWBP_Discover_Tile_Base_C::Slot_OutsideOfTile' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, Slot_TileContents) == 0x000310, "Member 'UWBP_Discover_Tile_Base_C::Slot_TileContents' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, VisualAttachment_OutsideContent) == 0x000318, "Member 'UWBP_Discover_Tile_Base_C::VisualAttachment_OutsideContent' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, WBP_ActivityBrowserSocialProof_NEW) == 0x000320, "Member 'UWBP_Discover_Tile_Base_C::WBP_ActivityBrowserSocialProof_NEW' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, WBP_BottomBarHackButton_ContextMenu) == 0x000328, "Member 'UWBP_Discover_Tile_Base_C::WBP_BottomBarHackButton_ContextMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, WBP_UIKit_Button_Outline) == 0x000330, "Member 'UWBP_Discover_Tile_Base_C::WBP_UIKit_Button_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, WBP_UIKit_ContextMenuAnchorButton) == 0x000338, "Member 'UWBP_Discover_Tile_Base_C::WBP_UIKit_ContextMenuAnchorButton' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, TileSize) == 0x000340, "Member 'UWBP_Discover_Tile_Base_C::TileSize' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, No_Input_Action_Row) == 0x000350, "Member 'UWBP_Discover_Tile_Base_C::No_Input_Action_Row' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, ContextMenuInputAction) == 0x000360, "Member 'UWBP_Discover_Tile_Base_C::ContextMenuInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, IsTileActive) == 0x000370, "Member 'UWBP_Discover_Tile_Base_C::IsTileActive' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, HasContextMenuItems) == 0x000371, "Member 'UWBP_Discover_Tile_Base_C::HasContextMenuItems' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, ContextMenuActionContext) == 0x000378, "Member 'UWBP_Discover_Tile_Base_C::ContextMenuActionContext' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, IsSquareTilesTemp) == 0x000380, "Member 'UWBP_Discover_Tile_Base_C::IsSquareTilesTemp' has a wrong offset!");
static_assert(offsetof(UWBP_Discover_Tile_Base_C, IsJoinablePartyTile) == 0x000381, "Member 'UWBP_Discover_Tile_Base_C::IsJoinablePartyTile' has a wrong offset!");

}

