#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ButtonWithToggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_ButtonGeneric_Base_classes.hpp"
#include "E_UI_ToggleType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ButtonWithToggle.WBP_UIKit_ButtonWithToggle_C
// 0x0020 (0x1840 - 0x1820)
class UWBP_UIKit_ButtonWithToggle_C final : public UWBP_UIKit_ButtonGeneric_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_ButtonWithToggle_C;       // 0x1820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_Block_Outline_C*             Block_Outline;                                     // 0x1828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Toggle_C*              Block_Toggle;                                      // 0x1830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_UI_ToggleType                               ToggleType;                                        // 0x1838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnWidgetStyled();
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_ButtonWithToggle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetToggleType(E_UI_ToggleType Type_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ButtonWithToggle_C">();
	}
	static class UWBP_UIKit_ButtonWithToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ButtonWithToggle_C>();
	}
};
static_assert(alignof(UWBP_UIKit_ButtonWithToggle_C) == 0x000010, "Wrong alignment on UWBP_UIKit_ButtonWithToggle_C");
static_assert(sizeof(UWBP_UIKit_ButtonWithToggle_C) == 0x001840, "Wrong size on UWBP_UIKit_ButtonWithToggle_C");
static_assert(offsetof(UWBP_UIKit_ButtonWithToggle_C, UberGraphFrame_WBP_UIKit_ButtonWithToggle_C) == 0x001820, "Member 'UWBP_UIKit_ButtonWithToggle_C::UberGraphFrame_WBP_UIKit_ButtonWithToggle_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonWithToggle_C, Block_Outline) == 0x001828, "Member 'UWBP_UIKit_ButtonWithToggle_C::Block_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonWithToggle_C, Block_Toggle) == 0x001830, "Member 'UWBP_UIKit_ButtonWithToggle_C::Block_Toggle' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonWithToggle_C, ToggleType) == 0x001838, "Member 'UWBP_UIKit_ButtonWithToggle_C::ToggleType' has a wrong offset!");

}

