#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augments_InteractionIndicatorInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo
// 0x0060 (0x0060 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_Asset;                          // 0x0028(0x0020)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo) == 0x000008, "Wrong alignment on WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo");
static_assert(sizeof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo) == 0x000060, "Wrong size on WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, EntryPoint) == 0x000000, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, Temp_object_Variable) == 0x000010, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, K2Node_DynamicCast_AsTexture_2D) == 0x000018, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, K2Node_CustomEvent_Asset) == 0x000028, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::K2Node_CustomEvent_Asset' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_Augments_InteractionIndicatorInfo_C_ExecuteUbergraph_WBP_Augments_InteractionIndicatorInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9
// 0x0008 (0x0008 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9) == 0x000008, "Wrong alignment on WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9");
static_assert(sizeof(WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9) == 0x000008, "Wrong size on WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9, Loaded) == 0x000000, "Member 'WBP_Augments_InteractionIndicatorInfo_C_OnLoaded_2A5949E64DAB0291DE31D1B67C0E8EB9::Loaded' has a wrong offset!");

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.SetAugmentIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon final
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon) == 0x000008, "Wrong alignment on WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon");
static_assert(sizeof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon) == 0x000020, "Wrong size on WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon, Asset) == 0x000000, "Member 'WBP_Augments_InteractionIndicatorInfo_C_SetAugmentIcon::Asset' has a wrong offset!");

// Function WBP_Augments_InteractionIndicatorInfo.WBP_Augments_InteractionIndicatorInfo_C.SetAugmentInfo
// 0x0028 (0x0028 - 0x0000)
struct WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo final
{
public:
	class UFortPlayerAugmentItemDefinition*       InAugmentItemDefinition;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetHUDEffectImage_ReturnValue;            // 0x0008(0x0020)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo) == 0x000008, "Wrong alignment on WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo");
static_assert(sizeof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo) == 0x000028, "Wrong size on WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo, InAugmentItemDefinition) == 0x000000, "Member 'WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo::InAugmentItemDefinition' has a wrong offset!");
static_assert(offsetof(WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo, CallFunc_GetHUDEffectImage_ReturnValue) == 0x000008, "Member 'WBP_Augments_InteractionIndicatorInfo_C_SetAugmentInfo::CallFunc_GetHUDEffectImage_ReturnValue' has a wrong offset!");

}

