#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_STI_ItemsCategoryList

#include "Basic.hpp"

#include "CrewUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_STI_ItemsCategoryList.WBP_STI_ItemsCategoryList_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_STI_ItemsCategoryList_C final : public UFortTemporaryItemsRow
{
public:
	class UFortTemporaryItemsRewardGroupVM*       FortTemporaryItemsRewardGroupVM;                   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCommonTextBlock*                       CategoryTitleText;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTileView*                              TileView_ItemRewards;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetFortTemporaryItemsRewardGroupVM(class UFortTemporaryItemsRewardGroupVM* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_STI_ItemsCategoryList_C">();
	}
	static class UWBP_STI_ItemsCategoryList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_STI_ItemsCategoryList_C>();
	}
};
static_assert(alignof(UWBP_STI_ItemsCategoryList_C) == 0x000008, "Wrong alignment on UWBP_STI_ItemsCategoryList_C");
static_assert(sizeof(UWBP_STI_ItemsCategoryList_C) == 0x0002F8, "Wrong size on UWBP_STI_ItemsCategoryList_C");
static_assert(offsetof(UWBP_STI_ItemsCategoryList_C, FortTemporaryItemsRewardGroupVM) == 0x0002E0, "Member 'UWBP_STI_ItemsCategoryList_C::FortTemporaryItemsRewardGroupVM' has a wrong offset!");
static_assert(offsetof(UWBP_STI_ItemsCategoryList_C, CategoryTitleText) == 0x0002E8, "Member 'UWBP_STI_ItemsCategoryList_C::CategoryTitleText' has a wrong offset!");
static_assert(offsetof(UWBP_STI_ItemsCategoryList_C, TileView_ItemRewards) == 0x0002F0, "Member 'UWBP_STI_ItemsCategoryList_C::TileView_ItemRewards' has a wrong offset!");

}

