#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DynamicSubtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DynamicSubtitle.WBP_DynamicSubtitle_C
// 0x0068 (0x0328 - 0x02C0)
class UWBP_DynamicSubtitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SubtitleFont;                                      // 0x02D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DynamicSubtitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSubtitleFont(const struct FSlateFontInfo& Font);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DynamicSubtitle_C">();
	}
	static class UWBP_DynamicSubtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DynamicSubtitle_C>();
	}
};
static_assert(alignof(UWBP_DynamicSubtitle_C) == 0x000008, "Wrong alignment on UWBP_DynamicSubtitle_C");
static_assert(sizeof(UWBP_DynamicSubtitle_C) == 0x000328, "Wrong size on UWBP_DynamicSubtitle_C");
static_assert(offsetof(UWBP_DynamicSubtitle_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_DynamicSubtitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSubtitle_C, Text_Subtitle) == 0x0002C8, "Member 'UWBP_DynamicSubtitle_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UWBP_DynamicSubtitle_C, SubtitleFont) == 0x0002D0, "Member 'UWBP_DynamicSubtitle_C::SubtitleFont' has a wrong offset!");

}

