#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_PriceSwitcher

#include "Basic.hpp"

#include "E_PriceSwitcherState_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.ExecuteUbergraph_WBP_UIKit_PriceSwitcher
// 0x0004 (0x0004 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher) == 0x000004, "Wrong alignment on WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher) == 0x000004, "Wrong size on WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher, EntryPoint) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C_ExecuteUbergraph_WBP_UIKit_PriceSwitcher::EntryPoint' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.SetFortItemShopOfferVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM final
{
public:
	class UFortItemShopOfferVM*                   ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM) == 0x000008, "Wrong alignment on WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM) == 0x000028, "Wrong size on WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM, ViewModel) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortItemShopOfferVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.SetFortSubscriptionVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM final
{
public:
	class UFortSubscriptionVM*                    ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM) == 0x000008, "Wrong alignment on WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM) == 0x000028, "Wrong size on WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM, ViewModel) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_UIKit_PriceSwitcher_C_SetFortSubscriptionVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.__24b4991b-48f7-e478-a76a-d0b1ec0af2c1_SourceToDest
// 0x0030 (0x0030 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest final
{
public:
	class FText                                   SalePrice;                                         // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetPriceFormattedText_SalePrice;          // 0x0018(0x0018)()
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest) == 0x000008, "Wrong alignment on WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest) == 0x000030, "Wrong size on WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest, SalePrice) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest::SalePrice' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest, CallFunc_GetPriceFormattedText_SalePrice) == 0x000018, "Member 'WBP_UIKit_PriceSwitcher_C___24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest::CallFunc_GetPriceFormattedText_SalePrice' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.__731a614b-45a3-7f0d-eeab-168c09c90858_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest final
{
public:
	ESlateVisibility                              StrikethroughPriceVisibility;                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetStrikethroughPriceVisibility_StrikethroughPriceVisibility; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest) == 0x000001, "Wrong alignment on WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest) == 0x000002, "Wrong size on WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest, StrikethroughPriceVisibility) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest::StrikethroughPriceVisibility' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest, CallFunc_GetStrikethroughPriceVisibility_StrikethroughPriceVisibility) == 0x000001, "Member 'WBP_UIKit_PriceSwitcher_C___731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest::CallFunc_GetStrikethroughPriceVisibility_StrikethroughPriceVisibility' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.__8aa7d011-47c6-fe44-1c90-658e43fe1574_SourceToDest
// 0x0030 (0x0030 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest final
{
public:
	class FText                                   SubInfoText;                                       // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetSubInfoText_SubInfoText;               // 0x0018(0x0018)()
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest) == 0x000008, "Wrong alignment on WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest) == 0x000030, "Wrong size on WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest, SubInfoText) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest::SubInfoText' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest, CallFunc_GetSubInfoText_SubInfoText) == 0x000018, "Member 'WBP_UIKit_PriceSwitcher_C___8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest::CallFunc_GetSubInfoText_SubInfoText' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.__c9eda1e1-46f7-a82a-146c-d2af770cc10b_SourceToDest
// 0x0030 (0x0030 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest final
{
public:
	class FText                                   SalePrice;                                         // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetPriceFormattedText_SalePrice;          // 0x0018(0x0018)()
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest) == 0x000008, "Wrong alignment on WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest) == 0x000030, "Wrong size on WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest, SalePrice) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest::SalePrice' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest, CallFunc_GetPriceFormattedText_SalePrice) == 0x000018, "Member 'WBP_UIKit_PriceSwitcher_C___c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest::CallFunc_GetPriceFormattedText_SalePrice' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.__f683aab4-4856-773c-db32-309fbbdf138e_SourceToDest
// 0x0002 (0x0002 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest final
{
public:
	E_PriceSwitcherState                          SwitcherState;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PriceSwitcherState                          CallFunc_GetPriceInfoState_SwitcherState;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest) == 0x000001, "Wrong alignment on WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest) == 0x000002, "Wrong size on WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest, SwitcherState) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest::SwitcherState' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest, CallFunc_GetPriceInfoState_SwitcherState) == 0x000001, "Member 'WBP_UIKit_PriceSwitcher_C___f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest::CallFunc_GetPriceInfoState_SwitcherState' has a wrong offset!");

// Function WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C.GetPriceFormattedText
// 0x0058 (0x0058 - 0x0000)
struct WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText final
{
public:
	bool                                          IsSalePrice;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Price;                                             // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SalePrice;                                         // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetSalePrice_SalePrice;                   // 0x0020(0x0018)()
	bool                                          CallFunc_GetSalePrice_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRegularPrice_ReturnValue;              // 0x0040(0x0018)()
};
static_assert(alignof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText) == 0x000008, "Wrong alignment on WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText");
static_assert(sizeof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText) == 0x000058, "Wrong size on WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText, IsSalePrice) == 0x000000, "Member 'WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText::IsSalePrice' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText, Price) == 0x000004, "Member 'WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText::Price' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText, SalePrice) == 0x000008, "Member 'WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText::SalePrice' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText, CallFunc_GetSalePrice_SalePrice) == 0x000020, "Member 'WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText::CallFunc_GetSalePrice_SalePrice' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText, CallFunc_GetSalePrice_ReturnValue) == 0x000038, "Member 'WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText::CallFunc_GetSalePrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText, CallFunc_GetRegularPrice_ReturnValue) == 0x000040, "Member 'WBP_UIKit_PriceSwitcher_C_GetPriceFormattedText::CallFunc_GetRegularPrice_ReturnValue' has a wrong offset!");

}

