#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_RewardTracks

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LinedNotebook_RewardTracks.WBP_LinedNotebook_RewardTracks_C.BPOnEventScreenDataSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet final
{
public:
	const class UFortEventScreenData*             InEventScreenData;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet) == 0x000008, "Wrong alignment on WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet");
static_assert(sizeof(WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet) == 0x000008, "Wrong size on WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet, InEventScreenData) == 0x000000, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnEventScreenDataSet::InEventScreenData' has a wrong offset!");

// Function WBP_LinedNotebook_RewardTracks.WBP_LinedNotebook_RewardTracks_C.BPOnSetRewardItem
// 0x0018 (0x0018 - 0x0000)
struct WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem final
{
public:
	int32                                         RequiredProgress;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemainingProgress;                                 // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RewardProgressPercent;                             // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviewProgressPercent;                            // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverallProgressPercent;                            // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPreviewMode;                                    // 0x0014(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem) == 0x000004, "Wrong alignment on WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem");
static_assert(sizeof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem) == 0x000018, "Wrong size on WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem, RequiredProgress) == 0x000000, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem::RequiredProgress' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem, RemainingProgress) == 0x000004, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem::RemainingProgress' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem, RewardProgressPercent) == 0x000008, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem::RewardProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem, PreviewProgressPercent) == 0x00000C, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem::PreviewProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem, OverallProgressPercent) == 0x000010, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem::OverallProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem, bInPreviewMode) == 0x000014, "Member 'WBP_LinedNotebook_RewardTracks_C_BPOnSetRewardItem::bInPreviewMode' has a wrong offset!");

// Function WBP_LinedNotebook_RewardTracks.WBP_LinedNotebook_RewardTracks_C.BPSetAllRewardsCollected
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected final
{
public:
	bool                                          bAllCollected;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected) == 0x000001, "Wrong alignment on WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected");
static_assert(sizeof(WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected) == 0x000001, "Wrong size on WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected, bAllCollected) == 0x000000, "Member 'WBP_LinedNotebook_RewardTracks_C_BPSetAllRewardsCollected::bAllCollected' has a wrong offset!");

// Function WBP_LinedNotebook_RewardTracks.WBP_LinedNotebook_RewardTracks_C.BPSetProgressPercent
// 0x0004 (0x0004 - 0x0000)
struct WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent) == 0x000004, "Wrong alignment on WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent");
static_assert(sizeof(WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent) == 0x000004, "Wrong size on WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent, Percent) == 0x000000, "Member 'WBP_LinedNotebook_RewardTracks_C_BPSetProgressPercent::Percent' has a wrong offset!");

// Function WBP_LinedNotebook_RewardTracks.WBP_LinedNotebook_RewardTracks_C.ExecuteUbergraph_WBP_LinedNotebook_RewardTracks
// 0x0080 (0x0080 - 0x0000)
struct WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllCollected;                        // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortEventScreenData*             K2Node_Event_InEventScreenData;                    // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RequiredProgress;                     // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RemainingProgress;                    // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RewardProgressPercent;                // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_PreviewProgressPercent;               // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OverallProgressPercent;               // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInPreviewMode;                       // 0x0034(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	float                                         K2Node_Event_Percent;                              // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks) == 0x000008, "Wrong alignment on WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks");
static_assert(sizeof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks) == 0x000080, "Wrong size on WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, EntryPoint) == 0x000000, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_bAllCollected) == 0x000004, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_bAllCollected' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, Temp_byte_Variable) == 0x000005, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_InEventScreenData) == 0x000018, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_InEventScreenData' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_RequiredProgress) == 0x000020, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_RequiredProgress' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_RemainingProgress) == 0x000024, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_RemainingProgress' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_RewardProgressPercent) == 0x000028, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_RewardProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_PreviewProgressPercent) == 0x00002C, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_PreviewProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_OverallProgressPercent) == 0x000030, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_OverallProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_bInPreviewMode) == 0x000034, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_bInPreviewMode' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Event_Percent) == 0x000050, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Event_Percent' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000054, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, Temp_bool_Variable) == 0x000060, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, K2Node_Select_Default) == 0x000061, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000078, "Member 'WBP_LinedNotebook_RewardTracks_C_ExecuteUbergraph_WBP_LinedNotebook_RewardTracks::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

