#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_TabCategory_Base

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.ConstructTabGroup
// 0x0048 (0x0048 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_ConstructTabGroup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName TabID)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TabID)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_ConstructTabGroup");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup) == 0x000048, "Wrong size on WBP_UIKit_TabCategory_Base_C_ConstructTabGroup");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, K2Node_DynamicCast_AsBorder_Slot) == 0x000038, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::K2Node_DynamicCast_AsBorder_Slot' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ConstructTabGroup, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_UIKit_TabCategory_Base_C_ConstructTabGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.Event OnCategoryTabClicked
// 0x0004 (0x0004 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked) == 0x000004, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked) == 0x000004, "Wrong size on WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked, TabID) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabClicked::TabID' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.Event OnCategoryTabSelected
// 0x0004 (0x0004 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected) == 0x000004, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected) == 0x000004, "Wrong size on WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected, TabID) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_Event_OnCategoryTabSelected::TabID' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.ExecuteUbergraph_WBP_UIKit_TabCategory_Base
// 0x0038 (0x0038 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId_1;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          CallFunc_GetTabViewModelByID_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupButtonViewModel*          CallFunc_GetTabViewModelByID_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base) == 0x000038, "Wrong size on WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, EntryPoint) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, K2Node_CustomEvent_TabId_1) == 0x000004, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::K2Node_CustomEvent_TabId_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, CallFunc_GetTabViewModelByID_ReturnValue) == 0x000008, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::CallFunc_GetTabViewModelByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, K2Node_CustomEvent_TabId) == 0x000010, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::K2Node_CustomEvent_TabId' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, CallFunc_GetTabViewModelByID_ReturnValue_1) == 0x000018, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::CallFunc_GetTabViewModelByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000020, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, K2Node_Event_IsDesignTime) == 0x000021, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000028, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, CallFunc_GetCurrentInputType_ReturnValue) == 0x000030, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'WBP_UIKit_TabCategory_Base_C_ExecuteUbergraph_WBP_UIKit_TabCategory_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.ExpandToSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem final
{
public:
	class UCommonButtonBase*                      SelectedTab;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem) == 0x000008, "Wrong size on WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem, SelectedTab) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_ExpandToSelectedItem::SelectedTab' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.FocusSelectedCategoryTab
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab final
{
public:
	class UCommonButtonBase*                      SelectedTab;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedTabId_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      CallFunc_GetTabButtonBaseByID_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab) == 0x000028, "Wrong size on WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, SelectedTab) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::SelectedTab' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000008, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, CallFunc_GetSelectedTabId_ReturnValue) == 0x00001C, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::CallFunc_GetSelectedTabId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab, CallFunc_GetTabButtonBaseByID_ReturnValue) == 0x000020, "Member 'WBP_UIKit_TabCategory_Base_C_FocusSelectedCategoryTab::CallFunc_GetTabButtonBaseByID_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.InitContainer
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_InitContainer final
{
public:
	class UCommonButtonBase*                      HeaderTabButton;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CategoryID_0;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupCategoryViewModel*        CategoryVM;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_InitContainer) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_InitContainer");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_InitContainer) == 0x000028, "Wrong size on WBP_UIKit_TabCategory_Base_C_InitContainer");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, HeaderTabButton) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::HeaderTabButton' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, CategoryID_0) == 0x000008, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::CategoryID_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, CategoryVM) == 0x000010, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::CategoryVM' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, CallFunc_NotEqual_NameName_ReturnValue) == 0x000019, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_InitContainer, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_UIKit_TabCategory_Base_C_InitContainer::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_TabCategory_Base_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.RefreshLayout
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_RefreshLayout final
{
public:
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_RefreshLayout) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_RefreshLayout");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_RefreshLayout) == 0x000018, "Wrong size on WBP_UIKit_TabCategory_Base_C_RefreshLayout");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_RefreshLayout, CallFunc_SelectInt_ReturnValue) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_RefreshLayout::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_RefreshLayout, CallFunc_SelectInt_ReturnValue_1) == 0x000004, "Member 'WBP_UIKit_TabCategory_Base_C_RefreshLayout::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_RefreshLayout, CallFunc_AddChildToGrid_ReturnValue) == 0x000008, "Member 'WBP_UIKit_TabCategory_Base_C_RefreshLayout::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_RefreshLayout, CallFunc_AddChildToGrid_ReturnValue_1) == 0x000010, "Member 'WBP_UIKit_TabCategory_Base_C_RefreshLayout::CallFunc_AddChildToGrid_ReturnValue_1' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.SetArrowVisibilty
// 0x0005 (0x0005 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty) == 0x000001, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty) == 0x000005, "Wrong size on WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty, IsVisible_0) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty::IsVisible_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty, Temp_bool_Variable) == 0x000001, "Member 'WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty, Temp_byte_Variable) == 0x000002, "Member 'WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty, K2Node_Select_Default) == 0x000004, "Member 'WBP_UIKit_TabCategory_Base_C_SetArrowVisibilty::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.SetBackground
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_SetBackground final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_SetBackground) == 0x000010, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_SetBackground");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_SetBackground) == 0x0000C0, "Wrong size on WBP_UIKit_TabCategory_Base_C_SetBackground");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetBackground, InBrush) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_SetBackground::InBrush' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.SetIsExpanded
// 0x0090 (0x0090 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_SetIsExpanded final
{
public:
	bool                                          InIsExpanded;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_SetIsExpanded");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded) == 0x000090, "Wrong size on WBP_UIKit_TabCategory_Base_C_SetIsExpanded");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, InIsExpanded) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::InIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, SkipAnim) == 0x000001, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::SkipAnim' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_struct_Variable) == 0x000008, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_bool_Variable) == 0x000028, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_bool_Variable_1) == 0x000029, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_byte_Variable) == 0x00002A, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_SelectFloat_ReturnValue_1) == 0x000038, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_byte_Variable_1) == 0x000041, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000048, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_GetCurrentInputType_ReturnValue) == 0x000050, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000052, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_SelectColor_ReturnValue) == 0x000054, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_Not_PreBool_ReturnValue_1) == 0x000064, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, K2Node_Select_Default) == 0x000068, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_Not_PreBool_ReturnValue_2) == 0x000078, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, Temp_bool_Variable_2) == 0x000079, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, K2Node_Select_Default_1) == 0x00007A, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x00007B, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, K2Node_Select_Default_2) == 0x000080, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000088, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_SetIsExpanded, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x00008C, "Member 'WBP_UIKit_TabCategory_Base_C_SetIsExpanded::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_TabCategory_Base.WBP_UIKit_TabCategory_Base_C.GetCategoryTabs
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_TabCategory_Base_C_GetCategoryTabs final
{
public:
	class UWBP_UIKit_Tabs_Base_C*                 InnerTabs;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_TabCategory_Base_C_GetCategoryTabs) == 0x000008, "Wrong alignment on WBP_UIKit_TabCategory_Base_C_GetCategoryTabs");
static_assert(sizeof(WBP_UIKit_TabCategory_Base_C_GetCategoryTabs) == 0x000008, "Wrong size on WBP_UIKit_TabCategory_Base_C_GetCategoryTabs");
static_assert(offsetof(WBP_UIKit_TabCategory_Base_C_GetCategoryTabs, InnerTabs) == 0x000000, "Member 'WBP_UIKit_TabCategory_Base_C_GetCategoryTabs::InnerTabs' has a wrong offset!");

}

