#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ItemCard_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ItemCard_Base.WBP_UIKit_ItemCard_Base_C
// 0x01B0 (0x1740 - 0x1590)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_UIKit_ItemCard_Base_C : public UUIKitHoldableModularButton
{
public:
	uint8                                         Pad_1588[0x8];                                     // 0x1588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hovered_Base;                                 // 0x1598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Outline_C*             Block_Outline;                                     // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Compatibility_Icon;                                // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGating_WarningIcon_C*      CosmeticGating_Icon;                               // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_EquippedState_C*             EquippedState_Outline;                             // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_BottomLeftStates;                               // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_Item;                                    // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Background;                                   // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Custom;                                       // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Main;                                         // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Archived;                          // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Conflict;                          // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Crew;                              // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Equipped;                          // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Equipped_Secondary;                // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Favorite;                          // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_JunoStyle;                         // 0x1628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Locked;                            // 0x1630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_New;                               // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Transference_C*              UIKit_Transference;                                // 0x1640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              ItemCardSize;                                      // 0x1648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ItemMaterial;                                      // 0x1658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ItemImage;                                         // 0x1660(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ItemDynamicMaterial;                               // 0x1680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MobileItemSize;                                    // 0x1688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MobileRewardItemSize;                              // 0x1698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemScaleDelta;                                    // 0x16A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoveredSound;                                      // 0x16B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PressedSound;                                      // 0x16B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquippedStateSet;                                // 0x16C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLockedStateSet;                                  // 0x16C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFavoriteStateSet;                                // 0x16C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsArchiveStateSet;                                 // 0x16C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C4[0x4];                                     // 0x16C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Fallback_Image;                                    // 0x16C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnCardHovered;                                     // 0x16D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCardUnhovered;                                   // 0x16E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsConflictStateSet;                                // 0x16F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNewStateSet;                                     // 0x16F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowSmallAgeGateIcon;                              // 0x16F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAgeGateStateSet;                                 // 0x16F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F4[0x4];                                     // 0x16F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BackgroundDynamicMaterial;                         // 0x16F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Equipped;                                       // 0x1700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Secondary_Equipped;                             // 0x1701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1702[0x6];                                     // 0x1702(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DefaultBackgroundMaterial;                         // 0x1708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Equipped_Slot;                                     // 0x1710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowEquipNumbers;                                  // 0x1714(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAdaptiveBackground;                             // 0x1715(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1716[0x2];                                     // 0x1716(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemPreviewWidget*                 PreviewWidget;                                     // 0x1718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Preview_Actions;                                   // 0x1720(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_UIKit_ContextMenuAnchorButton_Base_C* Context_Menu;                                      // 0x1730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Bind_Preview_Actions(class UFortItemPreviewWidget* Preview_Widget, class UWBP_UIKit_ContextMenuAnchorButton_Base_C* Context_Menu_0, class UFortItemVM* Item_VM);
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_UIKit_ItemCard_Base(int32 EntryPoint);
	void InitializeItemCard();
	void On_Primary_Preview_Action_Button_Clicked();
	void On_Secondary_Action_Button_Clicked();
	void OnLoaded_3676C6CA4C3EB62147F5FD96AF4186A1(class UObject* Loaded);
	void PlaySoundHovered();
	void PlaySoundPressed();
	void PreConstruct(bool IsDesignTime);
	void PresetForDesignTime();
	void Refresh_Equipped_Visibility(int32 EquippedSlot);
	void ResetAnimationState();
	void ResetIconStates();
	void Set_Context_Menu_Action(class UWBP_UIKit_ContextMenuAnchorButton_Base_C* Context_Menu_0, class FName Preview_Action_ID, const class FText& Preview_Action_Text, const TDelegate<void()>& Preview_Action_IteractionDelegate);
	void Set_Custom_Widget(class UFortItemVM* ItemVM);
	void Set_Default_Background(const struct FLinearColor& Color_1, const struct FLinearColor& Color_2, float GradientStart, float GradientEnd, float GradientAngle);
	void Set_Item_Color(const struct FSlateColor& VariantColor);
	void Set_Item_Is_Juno(bool IsIconVisible);
	void SetAsyncBackground(TSoftObjectPtr<class UMaterialInterface> MaterialInterfaceValue);
	void SetBackgroundBlendMode(bool UseAdaptiveColor);
	void SetFocusState(bool IsFocused);
	void SetGridAlignment(class UWidget* Widget, EHorizontalAlignment Horizontal, EVerticalAlignment Vertical);
	void SetGridColumnAndRow(class UWidget* Widget, int32 Row, int32 Row_Span, int32 Column, int32 Column_Span);
	void SetGridLayer(class UWidget* Widget, int32 Layer);
	void SetGridNudge(class UWidget* Widget, const struct FVector2D& Nudge);
	void SetGridPadding(class UWidget* Widget, const struct FMargin& Padding_0);
	void SetItemAnimationScale(double& Item_Scale);
	void SetItemCardSize(const struct FVector2D& ItemSize);
	void SetItemHasConflict(bool HasConflict);
	void SetItemImage(TSoftObjectPtr<class UTexture2D> Item_Image);
	void SetItemIsAgeGated(bool IsAgeGated);
	void SetItemIsArchived(bool Is_Archived);
	void SetItemIsEnhanced(bool Is_Enhanced);
	void SetItemIsEquipped(bool Is_Equipped_0);
	void SetItemIsEquippedSecondary(bool Is_Equipped_0, int32 EquippedSlot);
	void SetItemIsFavorite(bool Is_Favorite);
	void SetItemIsLocked(bool Is_Locked);
	void SetItemIsMultiGame(bool Has_Transference);
	void SetItemIsNew(bool Is_New);
	void SetItemIsRestricted(bool IsCompatible);
	void SetItemMaterial(class UMaterialInstance*& Material_Instance);
	void UpdateRoundCorners(class UMaterialInstanceDynamic* DynamicMaterialInstance);

	void GetAreItemsAgeGated(TArray<class UFortItemVM*>& ItemVMs, bool* Is_Item_Gated) const;
	void GetIsItemAgeGated(class UFortItemDefinition* Item_Def, bool* Is_Item_Gated) const;
	void GetIsItemAgeGatedFortCurrentExperience(class UFortItemDefinition* Item_Def, bool* Is_Item_Gated) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ItemCard_Base_C">();
	}
	static class UWBP_UIKit_ItemCard_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ItemCard_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UWBP_UIKit_ItemCard_Base_C) == 0x000010, "Wrong alignment on UWBP_UIKit_ItemCard_Base_C");
static_assert(sizeof(UWBP_UIKit_ItemCard_Base_C) == 0x001740, "Wrong size on UWBP_UIKit_ItemCard_Base_C");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, UberGraphFrame) == 0x001590, "Member 'UWBP_UIKit_ItemCard_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Anim_Hovered_Base) == 0x001598, "Member 'UWBP_UIKit_ItemCard_Base_C::Anim_Hovered_Base' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Background) == 0x0015A0, "Member 'UWBP_UIKit_ItemCard_Base_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Block_Outline) == 0x0015A8, "Member 'UWBP_UIKit_ItemCard_Base_C::Block_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Compatibility_Icon) == 0x0015B0, "Member 'UWBP_UIKit_ItemCard_Base_C::Compatibility_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, CosmeticGating_Icon) == 0x0015B8, "Member 'UWBP_UIKit_ItemCard_Base_C::CosmeticGating_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, EquippedState_Outline) == 0x0015C0, "Member 'UWBP_UIKit_ItemCard_Base_C::EquippedState_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, HB_BottomLeftStates) == 0x0015C8, "Member 'UWBP_UIKit_ItemCard_Base_C::HB_BottomLeftStates' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, LazyImage_Item) == 0x0015D0, "Member 'UWBP_UIKit_ItemCard_Base_C::LazyImage_Item' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, SizeBox) == 0x0015D8, "Member 'UWBP_UIKit_ItemCard_Base_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Slot_Background) == 0x0015E0, "Member 'UWBP_UIKit_ItemCard_Base_C::Slot_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Slot_Custom) == 0x0015E8, "Member 'UWBP_UIKit_ItemCard_Base_C::Slot_Custom' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Slot_Main) == 0x0015F0, "Member 'UWBP_UIKit_ItemCard_Base_C::Slot_Main' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Archived) == 0x0015F8, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Archived' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Conflict) == 0x001600, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Conflict' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Crew) == 0x001608, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Crew' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Equipped) == 0x001610, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Equipped' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Equipped_Secondary) == 0x001618, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Equipped_Secondary' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Favorite) == 0x001620, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Favorite' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_JunoStyle) == 0x001628, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_JunoStyle' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_Locked) == 0x001630, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_Locked' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, StatusIndicator_New) == 0x001638, "Member 'UWBP_UIKit_ItemCard_Base_C::StatusIndicator_New' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, UIKit_Transference) == 0x001640, "Member 'UWBP_UIKit_ItemCard_Base_C::UIKit_Transference' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ItemCardSize) == 0x001648, "Member 'UWBP_UIKit_ItemCard_Base_C::ItemCardSize' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ItemMaterial) == 0x001658, "Member 'UWBP_UIKit_ItemCard_Base_C::ItemMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ItemImage) == 0x001660, "Member 'UWBP_UIKit_ItemCard_Base_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ItemDynamicMaterial) == 0x001680, "Member 'UWBP_UIKit_ItemCard_Base_C::ItemDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, MobileItemSize) == 0x001688, "Member 'UWBP_UIKit_ItemCard_Base_C::MobileItemSize' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, MobileRewardItemSize) == 0x001698, "Member 'UWBP_UIKit_ItemCard_Base_C::MobileRewardItemSize' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ItemScaleDelta) == 0x0016A8, "Member 'UWBP_UIKit_ItemCard_Base_C::ItemScaleDelta' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, HoveredSound) == 0x0016B0, "Member 'UWBP_UIKit_ItemCard_Base_C::HoveredSound' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, PressedSound) == 0x0016B8, "Member 'UWBP_UIKit_ItemCard_Base_C::PressedSound' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsEquippedStateSet) == 0x0016C0, "Member 'UWBP_UIKit_ItemCard_Base_C::IsEquippedStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsLockedStateSet) == 0x0016C1, "Member 'UWBP_UIKit_ItemCard_Base_C::IsLockedStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsFavoriteStateSet) == 0x0016C2, "Member 'UWBP_UIKit_ItemCard_Base_C::IsFavoriteStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsArchiveStateSet) == 0x0016C3, "Member 'UWBP_UIKit_ItemCard_Base_C::IsArchiveStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Fallback_Image) == 0x0016C8, "Member 'UWBP_UIKit_ItemCard_Base_C::Fallback_Image' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, OnCardHovered) == 0x0016D0, "Member 'UWBP_UIKit_ItemCard_Base_C::OnCardHovered' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, OnCardUnhovered) == 0x0016E0, "Member 'UWBP_UIKit_ItemCard_Base_C::OnCardUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsConflictStateSet) == 0x0016F0, "Member 'UWBP_UIKit_ItemCard_Base_C::IsConflictStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsNewStateSet) == 0x0016F1, "Member 'UWBP_UIKit_ItemCard_Base_C::IsNewStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ShowSmallAgeGateIcon) == 0x0016F2, "Member 'UWBP_UIKit_ItemCard_Base_C::ShowSmallAgeGateIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, IsAgeGateStateSet) == 0x0016F3, "Member 'UWBP_UIKit_ItemCard_Base_C::IsAgeGateStateSet' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, BackgroundDynamicMaterial) == 0x0016F8, "Member 'UWBP_UIKit_ItemCard_Base_C::BackgroundDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Is_Equipped) == 0x001700, "Member 'UWBP_UIKit_ItemCard_Base_C::Is_Equipped' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Is_Secondary_Equipped) == 0x001701, "Member 'UWBP_UIKit_ItemCard_Base_C::Is_Secondary_Equipped' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, DefaultBackgroundMaterial) == 0x001708, "Member 'UWBP_UIKit_ItemCard_Base_C::DefaultBackgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Equipped_Slot) == 0x001710, "Member 'UWBP_UIKit_ItemCard_Base_C::Equipped_Slot' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, ShowEquipNumbers) == 0x001714, "Member 'UWBP_UIKit_ItemCard_Base_C::ShowEquipNumbers' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, UseAdaptiveBackground) == 0x001715, "Member 'UWBP_UIKit_ItemCard_Base_C::UseAdaptiveBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, PreviewWidget) == 0x001718, "Member 'UWBP_UIKit_ItemCard_Base_C::PreviewWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Preview_Actions) == 0x001720, "Member 'UWBP_UIKit_ItemCard_Base_C::Preview_Actions' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemCard_Base_C, Context_Menu) == 0x001730, "Member 'UWBP_UIKit_ItemCard_Base_C::Context_Menu' has a wrong offset!");

}

