#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActivityBrowserSocialProof

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.ExecuteUbergraph_WBP_ActivityBrowserSocialProof
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Friends_Count;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide_1;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CCU_Count;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof) == 0x000008, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof) == 0x0000B0, "Wrong size on WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, EntryPoint) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, Temp_byte_Variable) == 0x000004, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_CustomEvent_Friends_Count) == 0x000008, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_CustomEvent_Friends_Count' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_CustomEvent_Hide_1) == 0x00000C, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_CustomEvent_Hide_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, CallFunc_BooleanOR_ReturnValue) == 0x000070, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, Temp_byte_Variable_1) == 0x0000A0, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, Temp_bool_Variable) == 0x0000A1, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_CustomEvent_CCU_Count) == 0x0000A4, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_CustomEvent_CCU_Count' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_CustomEvent_Hide) == 0x0000A8, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_CustomEvent_Hide' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_Select_Default) == 0x0000A9, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof, K2Node_Event_IsDesignTime) == 0x0000AA, "Member 'WBP_ActivityBrowserSocialProof_C_ExecuteUbergraph_WBP_ActivityBrowserSocialProof::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_PreConstruct");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_PreConstruct) == 0x000001, "Wrong size on WBP_ActivityBrowserSocialProof_C_PreConstruct");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.Set CCU Count Data
// 0x0008 (0x0008 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data final
{
public:
	int32                                         CCU_Count;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data) == 0x000004, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data) == 0x000008, "Wrong size on WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data, CCU_Count) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data::CCU_Count' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data, Hide) == 0x000004, "Member 'WBP_ActivityBrowserSocialProof_C_Set_CCU_Count_Data::Hide' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.Set CCU Icon Vertical Scale
// 0x0008 (0x0008 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale) == 0x000008, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale) == 0x000008, "Wrong size on WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_Set_CCU_Icon_Vertical_Scale::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.Set Color
// 0x0014 (0x0014 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_Set_Color final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_Set_Color) == 0x000004, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_Set_Color");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_Set_Color) == 0x000014, "Wrong size on WBP_ActivityBrowserSocialProof_C_Set_Color");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_Set_Color, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_Set_Color::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.Set Friends Count Data
// 0x0008 (0x0008 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data final
{
public:
	int32                                         Friends_Count;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data) == 0x000004, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data) == 0x000008, "Wrong size on WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data, Friends_Count) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data::Friends_Count' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data, Hide) == 0x000004, "Member 'WBP_ActivityBrowserSocialProof_C_Set_Friends_Count_Data::Hide' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.SetCCUCount
// 0x0048 (0x0048 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_SetCCUCount final
{
public:
	int32                                         CCUCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_GetShorthandQuantity_ReturnValue;         // 0x0028(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_SetCCUCount) == 0x000008, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_SetCCUCount");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_SetCCUCount) == 0x000048, "Wrong size on WBP_ActivityBrowserSocialProof_C_SetCCUCount");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, CCUCount) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::CCUCount' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, Hide) == 0x000004, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::Hide' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, Temp_byte_Variable) == 0x000005, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, CallFunc_Less_IntInt_ReturnValue) == 0x000006, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, CallFunc_GetShorthandQuantity_ReturnValue) == 0x000028, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::CallFunc_GetShorthandQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, Temp_byte_Variable_1) == 0x000040, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, Temp_bool_Variable) == 0x000041, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetCCUCount, K2Node_Select_Default) == 0x000042, "Member 'WBP_ActivityBrowserSocialProof_C_SetCCUCount::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C.SetLikesVisible
// 0x0004 (0x0004 - 0x0000)
struct WBP_ActivityBrowserSocialProof_C_SetLikesVisible final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserSocialProof_C_SetLikesVisible) == 0x000001, "Wrong alignment on WBP_ActivityBrowserSocialProof_C_SetLikesVisible");
static_assert(sizeof(WBP_ActivityBrowserSocialProof_C_SetLikesVisible) == 0x000004, "Wrong size on WBP_ActivityBrowserSocialProof_C_SetLikesVisible");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetLikesVisible, Temp_bool_Variable) == 0x000000, "Member 'WBP_ActivityBrowserSocialProof_C_SetLikesVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetLikesVisible, Temp_byte_Variable) == 0x000001, "Member 'WBP_ActivityBrowserSocialProof_C_SetLikesVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetLikesVisible, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ActivityBrowserSocialProof_C_SetLikesVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserSocialProof_C_SetLikesVisible, K2Node_Select_Default) == 0x000003, "Member 'WBP_ActivityBrowserSocialProof_C_SetLikesVisible::K2Node_Select_Default' has a wrong offset!");

}

