#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AugmentSelector_AugmentDivider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AugmentSelector_AugmentDivider.WBP_AugmentSelector_AugmentDivider_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_AugmentSelector_AugmentDivider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Shadow;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_83;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_AugmentSelector_AugmentDivider(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AugmentSelector_AugmentDivider_C">();
	}
	static class UWBP_AugmentSelector_AugmentDivider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AugmentSelector_AugmentDivider_C>();
	}
};
static_assert(alignof(UWBP_AugmentSelector_AugmentDivider_C) == 0x000008, "Wrong alignment on UWBP_AugmentSelector_AugmentDivider_C");
static_assert(sizeof(UWBP_AugmentSelector_AugmentDivider_C) == 0x0002D8, "Wrong size on UWBP_AugmentSelector_AugmentDivider_C");
static_assert(offsetof(UWBP_AugmentSelector_AugmentDivider_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_AugmentSelector_AugmentDivider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentDivider_C, Shadow) == 0x0002C8, "Member 'UWBP_AugmentSelector_AugmentDivider_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_AugmentDivider_C, Spacer_83) == 0x0002D0, "Member 'UWBP_AugmentSelector_AugmentDivider_C::Spacer_83' has a wrong offset!");

}

