#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenuButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenuButton.WBP_MainMenuButton_C
// 0x0040 (0x14D0 - 0x1490)
class UWBP_MainMenuButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon_RightSide;                              // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Content;                                      // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowExternalLinkIcon;                              // 0x14A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A9[0x7];                                     // 0x14A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x14B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_MainMenuButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& Text_0);
	void UpdateRightSideIcon(TSoftObjectPtr<class UMaterialInterface> SoftMaterial);
	void UpdateRightSideIconColor(const struct FLinearColor& Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenuButton_C">();
	}
	static class UWBP_MainMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenuButton_C>();
	}
};
static_assert(alignof(UWBP_MainMenuButton_C) == 0x000010, "Wrong alignment on UWBP_MainMenuButton_C");
static_assert(sizeof(UWBP_MainMenuButton_C) == 0x0014D0, "Wrong size on UWBP_MainMenuButton_C");
static_assert(offsetof(UWBP_MainMenuButton_C, UberGraphFrame) == 0x001490, "Member 'UWBP_MainMenuButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenuButton_C, Image_Icon_RightSide) == 0x001498, "Member 'UWBP_MainMenuButton_C::Image_Icon_RightSide' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenuButton_C, Text_Content) == 0x0014A0, "Member 'UWBP_MainMenuButton_C::Text_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenuButton_C, ShowExternalLinkIcon) == 0x0014A8, "Member 'UWBP_MainMenuButton_C::ShowExternalLinkIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenuButton_C, Text) == 0x0014B0, "Member 'UWBP_MainMenuButton_C::Text' has a wrong offset!");

}

