#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_UpsellFrame

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LinedNotebook_UpsellFrame.WBP_LinedNotebook_UpsellFrame_C.ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame
// 0x0018 (0x0018 - 0x0000)
struct WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame) == 0x000008, "Wrong alignment on WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame");
static_assert(sizeof(WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame) == 0x000018, "Wrong size on WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame");
static_assert(offsetof(WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame, EntryPoint) == 0x000000, "Member 'WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_LinedNotebook_UpsellFrame_C_ExecuteUbergraph_WBP_LinedNotebook_UpsellFrame::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_LinedNotebook_UpsellFrame.WBP_LinedNotebook_UpsellFrame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_UpsellFrame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_UpsellFrame_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LinedNotebook_UpsellFrame_C_PreConstruct");
static_assert(sizeof(WBP_LinedNotebook_UpsellFrame_C_PreConstruct) == 0x000001, "Wrong size on WBP_LinedNotebook_UpsellFrame_C_PreConstruct");
static_assert(offsetof(WBP_LinedNotebook_UpsellFrame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LinedNotebook_UpsellFrame_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

