#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Sparks_Dbg_CosmeticItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Sparks_Dbg_CosmeticItem.WBP_Sparks_Dbg_CosmeticItem_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_Sparks_Dbg_CosmeticItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        cb_ItemList;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_201;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_Name;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           vb_Channels;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USparksAccountItemDefinition*           AccountItem;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ESparksAccountItemSubtype                     Subtype;                                           // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESparksInstrumentType                         Instrument;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Sparks_Dbg_CosmeticPicker_C*       ParentPicker;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Sparks_Dbg_CosmeticItem_cb_ItemList_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void ChildSetChoice(const struct FGameplayTag& Channel, const class FString& Choice);
	void ExecuteUbergraph_WBP_Sparks_Dbg_CosmeticItem(int32 EntryPoint);
	void RefreshChoices();
	void RefreshData(const TMap<struct FGameplayTag, class FString>& Choices);
	void SetItemInfo(class USparksAccountItemDefinition* Item);
	void SetTypes(ESparksAccountItemSubtype Subtype_0, ESparksInstrumentType Instrument_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Sparks_Dbg_CosmeticItem_C">();
	}
	static class UWBP_Sparks_Dbg_CosmeticItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Sparks_Dbg_CosmeticItem_C>();
	}
};
static_assert(alignof(UWBP_Sparks_Dbg_CosmeticItem_C) == 0x000008, "Wrong alignment on UWBP_Sparks_Dbg_CosmeticItem_C");
static_assert(sizeof(UWBP_Sparks_Dbg_CosmeticItem_C) == 0x000300, "Wrong size on UWBP_Sparks_Dbg_CosmeticItem_C");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, cb_ItemList) == 0x0002C8, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::cb_ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, Image_201) == 0x0002D0, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::Image_201' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, txt_Name) == 0x0002D8, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::txt_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, vb_Channels) == 0x0002E0, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::vb_Channels' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, AccountItem) == 0x0002E8, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::AccountItem' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, Subtype) == 0x0002F0, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::Subtype' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, Instrument) == 0x0002F1, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::Instrument' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_CosmeticItem_C, ParentPicker) == 0x0002F8, "Member 'UWBP_Sparks_Dbg_CosmeticItem_C::ParentPicker' has a wrong offset!");

}

