#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContentPurchaseBlocker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ContentPurchaseBlocker.WBP_ContentPurchaseBlocker_C
// 0x0068 (0x0328 - 0x02C0)
class UWBP_ContentPurchaseBlocker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Mobile;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Loud_C*               WBP_UIKit_Button_Loud;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_Details;                                      // 0x02E8(0x0018)(Edit, BlueprintVisible)
	int32                                         Max_Width;                                         // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ParentalControlsScreenClass;                       // 0x0308(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetVisuals(int32 MaxWidth);
	void Set_Data(const class FText& InText);
	void PreConstruct(bool IsDesignTime);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void ExecuteUbergraph_WBP_ContentPurchaseBlocker(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BndEvt__WBP_ContentPurchaseBlocker_WBP_UIKit_Button_Loud_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ContentPurchaseBlocker_C">();
	}
	static class UWBP_ContentPurchaseBlocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ContentPurchaseBlocker_C>();
	}
};
static_assert(alignof(UWBP_ContentPurchaseBlocker_C) == 0x000008, "Wrong alignment on UWBP_ContentPurchaseBlocker_C");
static_assert(sizeof(UWBP_ContentPurchaseBlocker_C) == 0x000328, "Wrong size on UWBP_ContentPurchaseBlocker_C");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ContentPurchaseBlocker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, SizeBox_Mobile) == 0x0002C8, "Member 'UWBP_ContentPurchaseBlocker_C::SizeBox_Mobile' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Text_Description) == 0x0002D0, "Member 'UWBP_ContentPurchaseBlocker_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Text_Title) == 0x0002D8, "Member 'UWBP_ContentPurchaseBlocker_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, WBP_UIKit_Button_Loud) == 0x0002E0, "Member 'UWBP_ContentPurchaseBlocker_C::WBP_UIKit_Button_Loud' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Text_Details) == 0x0002E8, "Member 'UWBP_ContentPurchaseBlocker_C::Text_Details' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Max_Width) == 0x000300, "Member 'UWBP_ContentPurchaseBlocker_C::Max_Width' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, ParentalControlsScreenClass) == 0x000308, "Member 'UWBP_ContentPurchaseBlocker_C::ParentalControlsScreenClass' has a wrong offset!");

}

