#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Discovery_Favorite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Discovery_Favorite.WBP_Discovery_Favorite_C
// 0x0080 (0x0340 - 0x02C0)
class UWBP_Discovery_Favorite_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnUnfavoriteAnim;                                  // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFavoriteAnim;                                    // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ColorInterpolationValue;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StartInnerColor;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EndInnerColor;                                     // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   InnerColor;                                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OuterColor;                                        // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StartOuterColor;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EndOuterColor;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFavorited;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OuterColor2;                                       // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Discovery_Favorite(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetColorInterpolationValue(double FavoriteRatio);
	void SetFavorite(bool IsFavorite, bool IsInit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Discovery_Favorite_C">();
	}
	static class UWBP_Discovery_Favorite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Discovery_Favorite_C>();
	}
};
static_assert(alignof(UWBP_Discovery_Favorite_C) == 0x000008, "Wrong alignment on UWBP_Discovery_Favorite_C");
static_assert(sizeof(UWBP_Discovery_Favorite_C) == 0x000340, "Wrong size on UWBP_Discovery_Favorite_C");
static_assert(offsetof(UWBP_Discovery_Favorite_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Discovery_Favorite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, OnUnfavoriteAnim) == 0x0002C8, "Member 'UWBP_Discovery_Favorite_C::OnUnfavoriteAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, OnFavoriteAnim) == 0x0002D0, "Member 'UWBP_Discovery_Favorite_C::OnFavoriteAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, Icon) == 0x0002D8, "Member 'UWBP_Discovery_Favorite_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, ColorInterpolationValue) == 0x0002E0, "Member 'UWBP_Discovery_Favorite_C::ColorInterpolationValue' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, StartInnerColor) == 0x0002E8, "Member 'UWBP_Discovery_Favorite_C::StartInnerColor' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, EndInnerColor) == 0x0002F8, "Member 'UWBP_Discovery_Favorite_C::EndInnerColor' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, DynamicMaterial) == 0x000308, "Member 'UWBP_Discovery_Favorite_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, InnerColor) == 0x000310, "Member 'UWBP_Discovery_Favorite_C::InnerColor' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, OuterColor) == 0x000314, "Member 'UWBP_Discovery_Favorite_C::OuterColor' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, StartOuterColor) == 0x000318, "Member 'UWBP_Discovery_Favorite_C::StartOuterColor' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, EndOuterColor) == 0x000328, "Member 'UWBP_Discovery_Favorite_C::EndOuterColor' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, IsFavorited) == 0x000338, "Member 'UWBP_Discovery_Favorite_C::IsFavorited' has a wrong offset!");
static_assert(offsetof(UWBP_Discovery_Favorite_C, OuterColor2) == 0x00033C, "Member 'UWBP_Discovery_Favorite_C::OuterColor2' has a wrong offset!");

}

