#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Dialog_Base

#include "Basic.hpp"

#include "S_UI_SizeBox_structs.hpp"
#include "Engine_structs.hpp"
#include "S_UI_BackplateCornerRadiusValues_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_UI_DialogButtons_structs.hpp"
#include "E_UI_DialogTextType_structs.hpp"
#include "S_UI_Image_structs.hpp"
#include "S_UI_Text_structs.hpp"
#include "S_UI_Backplate_structs.hpp"
#include "S_UI_Placement_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Dialog_Base.WBP_UIKit_Dialog_Base_C
// 0x0508 (0x07C8 - 0x02C0)
class UWBP_UIKit_Dialog_Base_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIKitDialogViewModel*                  UIKitDialogViewModel;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnDeactivate_Base;                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnActivate_Base;                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonsContainer;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Content;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Main;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Text;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Dialog;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Background;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Content;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Main;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Root;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_UIKit_ButtonCTA_Base_C*>    ButtonWidgets;                                     // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> DialogButtonClickedDispatcher;                     // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             DefaultInputActionDataTable;                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Scrim_C*                     Scrim;                                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseScrim;                                          // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Blur;                                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DimColor;                                          // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DimMaterial;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseClickCatch;                                     // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTitle;                                          // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       ContentTitle;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ContentText;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ContentRichText;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_UI_DialogTextType                           UseText;                                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Text                             TitleProperties;                                   // 0x03B8(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_Text                             TextProperties;                                    // 0x0478(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UImage*                                 ContentImage;                                      // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseImage;                                          // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Image                            ImageProperties;                                   // 0x0548(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ContentBackground;                                 // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackplate;                                      // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Backplate                        BackplateProperties;                               // 0x05B0(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackground;                                     // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Image                            BackgroundProperties;                              // 0x0608(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_SizeBox                          DialogSIze;                                        // 0x0660(0x0080)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_DialogButtons                    Buttons;                                           // 0x06E0(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_Placement                        DialogPlacement;                                   // 0x0750(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Glass_C*           ContentBackplate;                                  // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BackplateCornerRadiusValues      CornerRadiusValues;                                // 0x07A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateDialog(class UWidgetAnimation* IntroAnimation);
	void AddBackground();
	void AddBackplate();
	void AddDialogButtons(TArray<class UUIKitDialogButtonViewModel*>& Action_Buttons);
	void AddImage();
	void AddScrim();
	void AddText();
	void AddTitle();
	void Cleanup(class UWidget* Widget);
	void ClearButtonWidgets();
	void DeactivateDialog(class UWidgetAnimation* OutroAnimation);
	void ExecuteUbergraph_WBP_UIKit_Dialog_Base(int32 EntryPoint);
	void InitializeDialog();
	void OnDialogButtonClicked(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex);
	void PreConstruct(bool IsDesignTime);
	void PresetForDesignTime();
	void SetBackgroundProperties(const struct FS_UI_Image& Data);
	void SetBackplateProperties(const struct FS_UI_Backplate& Data);
	void SetButton(class UWBP_UIKit_ButtonCTA_Base_C*& Button, class UUIKitDialogButtonViewModel* Button_Data);
	void SetButtonFocus(int32& Focus_Index);
	void SetButtonsProperties(const struct FS_UI_DialogButtons& Data);
	void SetDialogData(class UUIKitDialogViewModel* Data);
	void SetDialogImage(class UTexture2D* Texture);
	void SetDialogText(const class FText& Text);
	void SetDialogTitle(const class FText& Title);
	void SetGridAlignment(class UWidget* Widget, EHorizontalAlignment Horizontal, EVerticalAlignment Vertical);
	void SetGridColumnAndRow(class UWidget* Widget, int32 Row, int32 Row_Span, int32 Column, int32 Column_Span);
	void SetGridLayer(class UWidget* Widget, int32 Layer);
	void SetGridNudge(class UWidget* Widget, const struct FVector2D& Nudge);
	void SetGridPadding(class UWidget* Widget, const struct FMargin& Padding_0);
	void SetImageProperties(const struct FS_UI_Image& Data);
	void SetPlacement(class UWidget* Widget, const struct FS_UI_Placement& Placement);
	void SetScrim(float Blur_Strength, const struct FLinearColor& Color, class UMaterialInstance* Material_Instance, bool Enable);
	void SetSizeBox(const struct FS_UI_SizeBox& Data);
	void SetTextProperties(const struct FS_UI_Text& Data);
	void SetTitleProperties(const struct FS_UI_Text& Data);
	void SetUIKitDialogViewModel(class UUIKitDialogViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Dialog_Base_C">();
	}
	static class UWBP_UIKit_Dialog_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Dialog_Base_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Dialog_Base_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Dialog_Base_C");
static_assert(sizeof(UWBP_UIKit_Dialog_Base_C) == 0x0007C8, "Wrong size on UWBP_UIKit_Dialog_Base_C");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_Dialog_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UIKitDialogViewModel) == 0x0002C8, "Member 'UWBP_UIKit_Dialog_Base_C::UIKitDialogViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Anim_OnDeactivate_Base) == 0x0002D0, "Member 'UWBP_UIKit_Dialog_Base_C::Anim_OnDeactivate_Base' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Anim_OnActivate_Base) == 0x0002D8, "Member 'UWBP_UIKit_Dialog_Base_C::Anim_OnActivate_Base' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ButtonsContainer) == 0x0002E0, "Member 'UWBP_UIKit_Dialog_Base_C::ButtonsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Content) == 0x0002E8, "Member 'UWBP_UIKit_Dialog_Base_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Main) == 0x0002F0, "Member 'UWBP_UIKit_Dialog_Base_C::Main' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Root) == 0x0002F8, "Member 'UWBP_UIKit_Dialog_Base_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ScrollBox_Text) == 0x000300, "Member 'UWBP_UIKit_Dialog_Base_C::ScrollBox_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, SizeBox_Dialog) == 0x000308, "Member 'UWBP_UIKit_Dialog_Base_C::SizeBox_Dialog' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Slot_Background) == 0x000310, "Member 'UWBP_UIKit_Dialog_Base_C::Slot_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Slot_Content) == 0x000318, "Member 'UWBP_UIKit_Dialog_Base_C::Slot_Content' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Slot_Main) == 0x000320, "Member 'UWBP_UIKit_Dialog_Base_C::Slot_Main' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Slot_Root) == 0x000328, "Member 'UWBP_UIKit_Dialog_Base_C::Slot_Root' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ButtonWidgets) == 0x000330, "Member 'UWBP_UIKit_Dialog_Base_C::ButtonWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ButtonGroup) == 0x000340, "Member 'UWBP_UIKit_Dialog_Base_C::ButtonGroup' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, DialogButtonClickedDispatcher) == 0x000348, "Member 'UWBP_UIKit_Dialog_Base_C::DialogButtonClickedDispatcher' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, DefaultInputActionDataTable) == 0x000358, "Member 'UWBP_UIKit_Dialog_Base_C::DefaultInputActionDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Scrim) == 0x000360, "Member 'UWBP_UIKit_Dialog_Base_C::Scrim' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseScrim) == 0x000368, "Member 'UWBP_UIKit_Dialog_Base_C::UseScrim' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Blur) == 0x000370, "Member 'UWBP_UIKit_Dialog_Base_C::Blur' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, DimColor) == 0x000378, "Member 'UWBP_UIKit_Dialog_Base_C::DimColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, DimMaterial) == 0x000388, "Member 'UWBP_UIKit_Dialog_Base_C::DimMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseClickCatch) == 0x000390, "Member 'UWBP_UIKit_Dialog_Base_C::UseClickCatch' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseTitle) == 0x000391, "Member 'UWBP_UIKit_Dialog_Base_C::UseTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ContentTitle) == 0x000398, "Member 'UWBP_UIKit_Dialog_Base_C::ContentTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ContentText) == 0x0003A0, "Member 'UWBP_UIKit_Dialog_Base_C::ContentText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ContentRichText) == 0x0003A8, "Member 'UWBP_UIKit_Dialog_Base_C::ContentRichText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseText) == 0x0003B0, "Member 'UWBP_UIKit_Dialog_Base_C::UseText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, TitleProperties) == 0x0003B8, "Member 'UWBP_UIKit_Dialog_Base_C::TitleProperties' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, TextProperties) == 0x000478, "Member 'UWBP_UIKit_Dialog_Base_C::TextProperties' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ContentImage) == 0x000538, "Member 'UWBP_UIKit_Dialog_Base_C::ContentImage' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseImage) == 0x000540, "Member 'UWBP_UIKit_Dialog_Base_C::UseImage' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ImageProperties) == 0x000548, "Member 'UWBP_UIKit_Dialog_Base_C::ImageProperties' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ContentBackground) == 0x0005A0, "Member 'UWBP_UIKit_Dialog_Base_C::ContentBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseBackplate) == 0x0005A8, "Member 'UWBP_UIKit_Dialog_Base_C::UseBackplate' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, BackplateProperties) == 0x0005B0, "Member 'UWBP_UIKit_Dialog_Base_C::BackplateProperties' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, UseBackground) == 0x000600, "Member 'UWBP_UIKit_Dialog_Base_C::UseBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, BackgroundProperties) == 0x000608, "Member 'UWBP_UIKit_Dialog_Base_C::BackgroundProperties' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, DialogSIze) == 0x000660, "Member 'UWBP_UIKit_Dialog_Base_C::DialogSIze' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, Buttons) == 0x0006E0, "Member 'UWBP_UIKit_Dialog_Base_C::Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, DialogPlacement) == 0x000750, "Member 'UWBP_UIKit_Dialog_Base_C::DialogPlacement' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ContentBackplate) == 0x000790, "Member 'UWBP_UIKit_Dialog_Base_C::ContentBackplate' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, ImageMID) == 0x000798, "Member 'UWBP_UIKit_Dialog_Base_C::ImageMID' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Dialog_Base_C, CornerRadiusValues) == 0x0007A0, "Member 'UWBP_UIKit_Dialog_Base_C::CornerRadiusValues' has a wrong offset!");

}

