#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Block_Base_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_Text.WBP_UIKit_Block_Text_C
// 0x0068 (0x0360 - 0x02F8)
class UWBP_UIKit_Block_Text_C final : public UWBP_UIKit_Block_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SelectedDisabled_Transition;                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedPressed_Transition;                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedFocused_Transition;                   // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedHovered_Transition;                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Selected_Transition;                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FontMID;                                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               OutlineMID;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Block_Text(int32 EntryPoint);
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnInstantTransitionToSelected();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionHoveredRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void OnTransitionUnhoveredRequested();
	void RefreshFontMID();
	void RefreshOutlineMID();
	void SetFont(struct FSlateFontInfo& Font);
	void SetFontMaterial(class UMaterialInstance* In_Material);
	void SetJustification(ETextJustify Justification);
	void SetMobileFontSizeMultiplier(double MobileFontSizeMultiplier);
	void SetOutlineMaterial(class UMaterialInstance* In_Material);
	void SetOutlineSize(int32 Size);
	void SetText(const class FText& Text);
	void SetTransformPolicy(ETextTransformPolicy Transform_Policy);
	void SetWrapping(bool IsAutoWrap, int32 WrapTextAt);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_Text_C">();
	}
	static class UWBP_UIKit_Block_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_Text_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Block_Text_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Block_Text_C");
static_assert(sizeof(UWBP_UIKit_Block_Text_C) == 0x000360, "Wrong size on UWBP_UIKit_Block_Text_C");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UIKit_Block_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_SelectedDisabled_Transition) == 0x000300, "Member 'UWBP_UIKit_Block_Text_C::Anim_SelectedDisabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_SelectedPressed_Transition) == 0x000308, "Member 'UWBP_UIKit_Block_Text_C::Anim_SelectedPressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_SelectedFocused_Transition) == 0x000310, "Member 'UWBP_UIKit_Block_Text_C::Anim_SelectedFocused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_SelectedHovered_Transition) == 0x000318, "Member 'UWBP_UIKit_Block_Text_C::Anim_SelectedHovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_Selected_Transition) == 0x000320, "Member 'UWBP_UIKit_Block_Text_C::Anim_Selected_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_Disabled_Transition) == 0x000328, "Member 'UWBP_UIKit_Block_Text_C::Anim_Disabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_Pressed_Transition) == 0x000330, "Member 'UWBP_UIKit_Block_Text_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_Focused_Transition) == 0x000338, "Member 'UWBP_UIKit_Block_Text_C::Anim_Focused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, Anim_Hovered_Transition) == 0x000340, "Member 'UWBP_UIKit_Block_Text_C::Anim_Hovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, TextBlock) == 0x000348, "Member 'UWBP_UIKit_Block_Text_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, FontMID) == 0x000350, "Member 'UWBP_UIKit_Block_Text_C::FontMID' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Text_C, OutlineMID) == 0x000358, "Member 'UWBP_UIKit_Block_Text_C::OutlineMID' has a wrong offset!");

}

