#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExpressYourSupportThumbsUpButtonRight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ExpressYourSupportThumbsUpButtonRight.WBP_ExpressYourSupportThumbsUpButtonRight_C
// 0x0070 (0x1590 - 0x1520)
class UWBP_ExpressYourSupportThumbsUpButtonRight_C final : public UFortExpressYourSupportThumbsUpButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnhoveredToggleOff;                                // 0x1528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoveredToggleOn;                                 // 0x1530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoverToggledOff;                                 // 0x1538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggledOff;                                   // 0x1540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoverToggledOn;                                  // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggledOn;                                    // 0x1550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredToggleOff;                                  // 0x1558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredToggleOn;                                   // 0x1560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x1568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FavoriteIcon;                                // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pulse;                                       // 0x1578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TextSwitcher;                                      // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_ExpressYourSupportThumbsUpButtonRight(int32 EntryPoint);
	void SetButtonHeight(bool IsTouch);
	void StopHoveringAnimations();
	void StopTogglingAnimations();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ExpressYourSupportThumbsUpButtonRight_C">();
	}
	static class UWBP_ExpressYourSupportThumbsUpButtonRight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExpressYourSupportThumbsUpButtonRight_C>();
	}
};
static_assert(alignof(UWBP_ExpressYourSupportThumbsUpButtonRight_C) == 0x000010, "Wrong alignment on UWBP_ExpressYourSupportThumbsUpButtonRight_C");
static_assert(sizeof(UWBP_ExpressYourSupportThumbsUpButtonRight_C) == 0x001590, "Wrong size on UWBP_ExpressYourSupportThumbsUpButtonRight_C");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, UberGraphFrame) == 0x001520, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, UnhoveredToggleOff) == 0x001528, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::UnhoveredToggleOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, UnhoveredToggleOn) == 0x001530, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::UnhoveredToggleOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, UnhoverToggledOff) == 0x001538, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::UnhoverToggledOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, HoverToggledOff) == 0x001540, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::HoverToggledOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, UnhoverToggledOn) == 0x001548, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::UnhoverToggledOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, HoverToggledOn) == 0x001550, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::HoverToggledOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, HoveredToggleOff) == 0x001558, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::HoveredToggleOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, HoveredToggleOn) == 0x001560, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::HoveredToggleOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, Border_Background) == 0x001568, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, Image_FavoriteIcon) == 0x001570, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::Image_FavoriteIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, Image_Pulse) == 0x001578, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::Image_Pulse' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, SizeBox_0) == 0x001580, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportThumbsUpButtonRight_C, TextSwitcher) == 0x001588, "Member 'UWBP_ExpressYourSupportThumbsUpButtonRight_C::TextSwitcher' has a wrong offset!");

}

