#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPL_Customize_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_BndEvt__FortCosmeticVariantRow_Slider_Slider_Value_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.CommitSliderValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_MPL_Customize_Slider_C_CommitSliderValue final
{
public:
	float                                         CallFunc_SetFloatValue_InFloatValue_ImplicitCast;  // 0x0000(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_CommitSliderValue) == 0x000004, "Wrong alignment on WBP_MPL_Customize_Slider_C_CommitSliderValue");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_CommitSliderValue) == 0x000004, "Wrong size on WBP_MPL_Customize_Slider_C_CommitSliderValue");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_CommitSliderValue, CallFunc_SetFloatValue_InFloatValue_ImplicitCast) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_CommitSliderValue::CallFunc_SetFloatValue_InFloatValue_ImplicitCast' has a wrong offset!");

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.ExecuteUbergraph_WBP_MPL_Customize_Slider
// 0x0050 (0x0050 - 0x0000)
struct WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_LockerOperation*       CallFunc_EquipItem_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_PendingCommitValue_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider) == 0x000050, "Wrong size on WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, EntryPoint) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, K2Node_CustomEvent_Success) == 0x000004, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, Temp_bool_Variable) == 0x000014, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, K2Node_ComponentBoundEvent_Value) == 0x000024, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, CallFunc_EquipItem_ReturnValue) == 0x000030, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::CallFunc_EquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, K2Node_VariableSet_PendingCommitValue_ImplicitCast) == 0x000040, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::K2Node_VariableSet_PendingCommitValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000048, "Member 'WBP_MPL_Customize_Slider_C_ExecuteUbergraph_WBP_MPL_Customize_Slider::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.OnOperationCompleted_1C304E9643CD48B579D817ABE815127D
// 0x0001 (0x0001 - 0x0000)
struct WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D) == 0x000001, "Wrong alignment on WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D) == 0x000001, "Wrong size on WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D, Success) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_OnOperationCompleted_1C304E9643CD48B579D817ABE815127D::Success' has a wrong offset!");

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.SetFortVariantSliderChannelVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM final
{
public:
	class UFortVariantSliderChannelVM*            ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM) == 0x000028, "Wrong size on WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM, ViewModel) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_MPL_Customize_Slider_C_SetFortVariantSliderChannelVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.UpdateSliderValue
// 0x0010 (0x0010 - 0x0000)
struct WBP_MPL_Customize_Slider_C_UpdateSliderValue final
{
public:
	double                                        InFloatValue;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_UpdateSliderValue) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Slider_C_UpdateSliderValue");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_UpdateSliderValue) == 0x000010, "Wrong size on WBP_MPL_Customize_Slider_C_UpdateSliderValue");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_UpdateSliderValue, InFloatValue) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_UpdateSliderValue::InFloatValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_UpdateSliderValue, CallFunc_SetValue_InValue_ImplicitCast) == 0x000008, "Member 'WBP_MPL_Customize_Slider_C_UpdateSliderValue::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_MPL_Customize_Slider.WBP_MPL_Customize_Slider_C.GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                FocusTarget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget");
static_assert(sizeof(WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget");
static_assert(offsetof(WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget, FocusTarget) == 0x000000, "Member 'WBP_MPL_Customize_Slider_C_GetDesiredFocusTarget::FocusTarget' has a wrong offset!");

}

