#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_PresetSubTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_ItemCard_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_PresetSubTile.WBP_UIKit_PresetSubTile_C
// 0x0030 (0x1770 - 0x1740)
class UWBP_UIKit_PresetSubTile_C final : public UWBP_UIKit_ItemCard_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_PresetSubTile_C;          // 0x1738(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortModularLoadoutItemVM*              FortModularLoadoutItemVM;                          // 0x1740(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnSelected;                                   // 0x1748(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LargePreviewImage;                                 // 0x1750(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_UIKit_PresetSubTile(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void SetFortModularLoadoutItemVM(class UFortModularLoadoutItemVM* ViewModel);
	void SetTileImage(TSoftObjectPtr<class UTexture2D> Image);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_PresetSubTile_C">();
	}
	static class UWBP_UIKit_PresetSubTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_PresetSubTile_C>();
	}
};
static_assert(alignof(UWBP_UIKit_PresetSubTile_C) == 0x000010, "Wrong alignment on UWBP_UIKit_PresetSubTile_C");
static_assert(sizeof(UWBP_UIKit_PresetSubTile_C) == 0x001770, "Wrong size on UWBP_UIKit_PresetSubTile_C");
static_assert(offsetof(UWBP_UIKit_PresetSubTile_C, UberGraphFrame_WBP_UIKit_PresetSubTile_C) == 0x001738, "Member 'UWBP_UIKit_PresetSubTile_C::UberGraphFrame_WBP_UIKit_PresetSubTile_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_PresetSubTile_C, FortModularLoadoutItemVM) == 0x001740, "Member 'UWBP_UIKit_PresetSubTile_C::FortModularLoadoutItemVM' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_PresetSubTile_C, Anim_OnSelected) == 0x001748, "Member 'UWBP_UIKit_PresetSubTile_C::Anim_OnSelected' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_PresetSubTile_C, LargePreviewImage) == 0x001750, "Member 'UWBP_UIKit_PresetSubTile_C::LargePreviewImage' has a wrong offset!");

}

