#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPLocker_Presets

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPLocker_Presets.WBP_MPLocker_Presets_C
// 0x0160 (0x0560 - 0x0400)
class UWBP_MPLocker_Presets_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortTypedModularLoadoutsVM*            FortTypedModularLoadoutsVM;                        // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortTypedModularLoadoutVM*             SelectedFortTypedLoadoutVM;                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortLockerVM*                          FortLockerVM;                                      // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideSubItems;                                     // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IsActive;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             ContentMover;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fade_Bottom;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fade_Top;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Mobile;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       SubItems;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SubItems_ScrollBox;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NumPresets;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCommonTileView*                    TileView_Presets;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                TopPadding;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGate_Warning_C*            WarningMessage;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Time;                                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0498(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollTimer;                                       // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSaveMode;                                        // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_PresetCard_C*                SaveShuffleButton;                                 // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortTypedModularLoadoutVM*             SaveDestination;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UFortTypedModularLoadoutVM* PresetLoadout)> PresetDisplayItem;                                 // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UFortItemVM*>                    HoveredPresetItems;                                // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              LoadoutLoad;                                       // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortTypedModularLoadoutVM*             CurrentSelectedLoadout;                            // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PresetSaved;                                       // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              DisableOptionsHint;                                // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              EnableOptionsHint;                                 // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortTypedModularLoadoutVM*             HoveredFortTypedLoadoutVM;                         // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortTypedModularLoadoutVM*>     Typed_Modular_Loadouts;                            // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        Loadouts;                                          // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LastItemIndex;                                     // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetFadeMath;                                     // 0x0554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstTimeFadeCheck;                                // 0x0555(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_556[0x2];                                      // 0x0556(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastTileDistance;                                  // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MPLocker_Presets_TileView_Presets_K2Node_ComponentBoundEvent_6_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WBP_MPLocker_Presets_TileView_Presets_K2Node_ComponentBoundEvent_7_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void changeSelectedLoadout(class UObject* Item);
	void DeletedPreset(const class FString& NewName);
	void DisableOptions();
	void EnableOptions();
	void ExecuteUbergraph_WBP_MPLocker_Presets(int32 EntryPoint);
	void GetFirstUnusedLoadout(class UFortTypedModularLoadoutVM** Item);
	void HandleEquipRelatedPresets();
	void HandleTouchLoadoutEuip();
	void Is_Active_State(bool IsActive_0, bool Instant);
	void LoadoutClick(class UCommonButtonBase* Button);
	void LoadoutHover(class UCommonButtonBase* Button);
	void OnCMDeleteFIred(class UWBP_UIKit_PresetCard_C* PresetCard);
	void OnCMRenamedConfirmed(const class FString& NewName);
	void OnCMRenameFired(class UWBP_UIKit_PresetCard_C* PresetCard);
	void OnEquipComplete_Event();
	void OnOperationCompleted_7FF5F2FD4966BCFFECD6E4B44F4F63C9(bool Success);
	void OnOperationCompleted_83A5B93E472D276D45397D8D03EDC857(bool Success);
	void OnOperationCompleted_BB6B932B45187F592158548786B873C5(bool Success);
	void OnOperationCompleted_BC5881FE4F992A5BBCB020B91F0FB428(bool Success);
	void OnOperationCompleted_D5FEC460434743E2FA4C95BC16410DA9(bool Success);
	void OnSaveConfirmed(const class FString& NewName);
	void PreConstruct(bool IsDesignTime);
	void SaveShuffleClick(class UCommonButtonBase* Button);
	void SaveShuffleHovered(class UCommonButtonBase* Button);
	void SetHeader(const class FText& Category);
	void SetLoadouts(TArray<class UObject*>& Items);
	void SetMobileStyle();
	void SetNumLoadouts(int32 NumLoadouts);
	void SetSaveMode(bool SaveMode);
	void SetScrollTimer(double ScrollProgress);
	void SetSelectedFortTypedLoadoutVM(class UFortTypedModularLoadoutVM* ViewModel);
	void SetupPresetSubItems(class UObject* Items);
	void Show_Context_Menu_for_Current_Selected_Item(bool* bPassTrough);
	void UpdateLoadouts();
	void UpdateScroll(double ItemOffset, double DistanceRemaining);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPLocker_Presets_C">();
	}
	static class UWBP_MPLocker_Presets_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPLocker_Presets_C>();
	}
};
static_assert(alignof(UWBP_MPLocker_Presets_C) == 0x000008, "Wrong alignment on UWBP_MPLocker_Presets_C");
static_assert(sizeof(UWBP_MPLocker_Presets_C) == 0x000560, "Wrong size on UWBP_MPLocker_Presets_C");
static_assert(offsetof(UWBP_MPLocker_Presets_C, UberGraphFrame) == 0x000400, "Member 'UWBP_MPLocker_Presets_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, FortTypedModularLoadoutsVM) == 0x000408, "Member 'UWBP_MPLocker_Presets_C::FortTypedModularLoadoutsVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SelectedFortTypedLoadoutVM) == 0x000410, "Member 'UWBP_MPLocker_Presets_C::SelectedFortTypedLoadoutVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, FortLockerVM) == 0x000418, "Member 'UWBP_MPLocker_Presets_C::FortLockerVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, FortItemSelectionVM) == 0x000420, "Member 'UWBP_MPLocker_Presets_C::FortItemSelectionVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SlideSubItems) == 0x000428, "Member 'UWBP_MPLocker_Presets_C::SlideSubItems' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, IsActive) == 0x000430, "Member 'UWBP_MPLocker_Presets_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, ContentMover) == 0x000438, "Member 'UWBP_MPLocker_Presets_C::ContentMover' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Image_Fade_Bottom) == 0x000440, "Member 'UWBP_MPLocker_Presets_C::Image_Fade_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Image_Fade_Top) == 0x000448, "Member 'UWBP_MPLocker_Presets_C::Image_Fade_Top' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SizeBox_Mobile) == 0x000450, "Member 'UWBP_MPLocker_Presets_C::SizeBox_Mobile' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SubItems) == 0x000458, "Member 'UWBP_MPLocker_Presets_C::SubItems' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SubItems_ScrollBox) == 0x000460, "Member 'UWBP_MPLocker_Presets_C::SubItems_ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Text_Header) == 0x000468, "Member 'UWBP_MPLocker_Presets_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Text_NumPresets) == 0x000470, "Member 'UWBP_MPLocker_Presets_C::Text_NumPresets' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, TileView_Presets) == 0x000478, "Member 'UWBP_MPLocker_Presets_C::TileView_Presets' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, TopPadding) == 0x000480, "Member 'UWBP_MPLocker_Presets_C::TopPadding' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, WarningMessage) == 0x000488, "Member 'UWBP_MPLocker_Presets_C::WarningMessage' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Time) == 0x000490, "Member 'UWBP_MPLocker_Presets_C::Time' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, TimerHandle) == 0x000498, "Member 'UWBP_MPLocker_Presets_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, ScrollTimer) == 0x0004A0, "Member 'UWBP_MPLocker_Presets_C::ScrollTimer' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, IsSaveMode) == 0x0004A8, "Member 'UWBP_MPLocker_Presets_C::IsSaveMode' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SaveShuffleButton) == 0x0004B0, "Member 'UWBP_MPLocker_Presets_C::SaveShuffleButton' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, SaveDestination) == 0x0004B8, "Member 'UWBP_MPLocker_Presets_C::SaveDestination' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, PresetDisplayItem) == 0x0004C0, "Member 'UWBP_MPLocker_Presets_C::PresetDisplayItem' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, HoveredPresetItems) == 0x0004D0, "Member 'UWBP_MPLocker_Presets_C::HoveredPresetItems' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, LoadoutLoad) == 0x0004E0, "Member 'UWBP_MPLocker_Presets_C::LoadoutLoad' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, CurrentSelectedLoadout) == 0x0004F0, "Member 'UWBP_MPLocker_Presets_C::CurrentSelectedLoadout' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, PresetSaved) == 0x0004F8, "Member 'UWBP_MPLocker_Presets_C::PresetSaved' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, DisableOptionsHint) == 0x000508, "Member 'UWBP_MPLocker_Presets_C::DisableOptionsHint' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, EnableOptionsHint) == 0x000518, "Member 'UWBP_MPLocker_Presets_C::EnableOptionsHint' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, HoveredFortTypedLoadoutVM) == 0x000528, "Member 'UWBP_MPLocker_Presets_C::HoveredFortTypedLoadoutVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Typed_Modular_Loadouts) == 0x000530, "Member 'UWBP_MPLocker_Presets_C::Typed_Modular_Loadouts' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, Loadouts) == 0x000540, "Member 'UWBP_MPLocker_Presets_C::Loadouts' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, LastItemIndex) == 0x000550, "Member 'UWBP_MPLocker_Presets_C::LastItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, ResetFadeMath) == 0x000554, "Member 'UWBP_MPLocker_Presets_C::ResetFadeMath' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, FirstTimeFadeCheck) == 0x000555, "Member 'UWBP_MPLocker_Presets_C::FirstTimeFadeCheck' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Presets_C, LastTileDistance) == 0x000558, "Member 'UWBP_MPLocker_Presets_C::LastTileDistance' has a wrong offset!");

}

