#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C
// 0x0008 (0x02F8 - 0x02F0)
class UWBP_UIKit_Block_Base_C : public UUIKitBlock
{
public:
	bool                                          IsSelectable;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocked;                                          // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetIsLocked(bool* IsLocked_0);
	void GetIsSelectable(bool* IsSelectable_0);
	void GetIsSelected(bool* IsSelected_0);
	void SetBlockVisibility(bool Visible);
	void SetIsLocked(bool Is_Locked);
	void SetIsSelectable(bool Is_Selectable);
	void SetIsSelected(bool IsSelected_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_Base_C">();
	}
	static class UWBP_UIKit_Block_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_Base_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Block_Base_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Block_Base_C");
static_assert(sizeof(UWBP_UIKit_Block_Base_C) == 0x0002F8, "Wrong size on UWBP_UIKit_Block_Base_C");
static_assert(offsetof(UWBP_UIKit_Block_Base_C, IsSelectable) == 0x0002F0, "Member 'UWBP_UIKit_Block_Base_C::IsSelectable' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Base_C, IsSelected) == 0x0002F1, "Member 'UWBP_UIKit_Block_Base_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Base_C, IsLocked) == 0x0002F2, "Member 'UWBP_UIKit_Block_Base_C::IsLocked' has a wrong offset!");

}

