#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatsOptionsDisplayUnit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatsOptionsDisplayUnit.WBP_StatsOptionsDisplayUnit_C
// 0x0028 (0x02E8 - 0x02C0)
class UWBP_StatsOptionsDisplayUnit_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_24;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_StatsOptionsDisplayUnit(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDisplayText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatsOptionsDisplayUnit_C">();
	}
	static class UWBP_StatsOptionsDisplayUnit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatsOptionsDisplayUnit_C>();
	}
};
static_assert(alignof(UWBP_StatsOptionsDisplayUnit_C) == 0x000008, "Wrong alignment on UWBP_StatsOptionsDisplayUnit_C");
static_assert(sizeof(UWBP_StatsOptionsDisplayUnit_C) == 0x0002E8, "Wrong size on UWBP_StatsOptionsDisplayUnit_C");
static_assert(offsetof(UWBP_StatsOptionsDisplayUnit_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_StatsOptionsDisplayUnit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatsOptionsDisplayUnit_C, CommonTextBlock_24) == 0x0002C8, "Member 'UWBP_StatsOptionsDisplayUnit_C::CommonTextBlock_24' has a wrong offset!");
static_assert(offsetof(UWBP_StatsOptionsDisplayUnit_C, In_Text) == 0x0002D0, "Member 'UWBP_StatsOptionsDisplayUnit_C::In_Text' has a wrong offset!");

}

