#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActivityBrowserSocialProof

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActivityBrowserSocialProof.WBP_ActivityBrowserSocialProof_C
// 0x0078 (0x0338 - 0x02C0)
class UWBP_ActivityBrowserSocialProof_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_CCUAndFriendsCount;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_CCUCount;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_FriendsPlaying;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_LikesPercent;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_CCU;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_LikeIcon;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CCUCount;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FriendCount;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LikesPercent;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           CCU_And_Friends_Text_Color;                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CCU_Icon_Vertical_Scale;                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CCU_Icon;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLikesVisible;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ActivityBrowserSocialProof(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_CCU_Count_Data(int32 CCU_Count, bool Hide);
	void Set_CCU_Icon_Vertical_Scale();
	void Set_Color();
	void Set_Friends_Count_Data(int32 Friends_Count, bool Hide);
	void SetCCUCount(int32 CCUCount, bool Hide);
	void SetLikesVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActivityBrowserSocialProof_C">();
	}
	static class UWBP_ActivityBrowserSocialProof_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActivityBrowserSocialProof_C>();
	}
};
static_assert(alignof(UWBP_ActivityBrowserSocialProof_C) == 0x000008, "Wrong alignment on UWBP_ActivityBrowserSocialProof_C");
static_assert(sizeof(UWBP_ActivityBrowserSocialProof_C) == 0x000338, "Wrong size on UWBP_ActivityBrowserSocialProof_C");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ActivityBrowserSocialProof_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, HB_CCUAndFriendsCount) == 0x0002C8, "Member 'UWBP_ActivityBrowserSocialProof_C::HB_CCUAndFriendsCount' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, HB_CCUCount) == 0x0002D0, "Member 'UWBP_ActivityBrowserSocialProof_C::HB_CCUCount' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, HB_FriendsPlaying) == 0x0002D8, "Member 'UWBP_ActivityBrowserSocialProof_C::HB_FriendsPlaying' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, HB_LikesPercent) == 0x0002E0, "Member 'UWBP_ActivityBrowserSocialProof_C::HB_LikesPercent' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, Image_CCU) == 0x0002E8, "Member 'UWBP_ActivityBrowserSocialProof_C::Image_CCU' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, Image_LikeIcon) == 0x0002F0, "Member 'UWBP_ActivityBrowserSocialProof_C::Image_LikeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, Text_CCUCount) == 0x0002F8, "Member 'UWBP_ActivityBrowserSocialProof_C::Text_CCUCount' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, Text_FriendCount) == 0x000300, "Member 'UWBP_ActivityBrowserSocialProof_C::Text_FriendCount' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, Text_LikesPercent) == 0x000308, "Member 'UWBP_ActivityBrowserSocialProof_C::Text_LikesPercent' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, CCU_And_Friends_Text_Color) == 0x000310, "Member 'UWBP_ActivityBrowserSocialProof_C::CCU_And_Friends_Text_Color' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, CCU_Icon_Vertical_Scale) == 0x000320, "Member 'UWBP_ActivityBrowserSocialProof_C::CCU_Icon_Vertical_Scale' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, CCU_Icon) == 0x000328, "Member 'UWBP_ActivityBrowserSocialProof_C::CCU_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserSocialProof_C, IsLikesVisible) == 0x000330, "Member 'UWBP_ActivityBrowserSocialProof_C::IsLikesVisible' has a wrong offset!");

}

