#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Throbber_Base

#include "Basic.hpp"

#include "E_UI_ThrobberSize_structs.hpp"
#include "Engine_structs.hpp"
#include "E_UI_ThrobberType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Throbber_Base.WBP_UIKit_Throbber_Base_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_UIKit_Throbber_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Throbber;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_UI_ThrobberSize                             ThrobberSize;                                      // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SizeSmall;                                         // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeMedium;                                        // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeLarge;                                         // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_ThrobberType                             ThrobberStyle;                                     // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      MonochromaticInstance;                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CurrentMaterialInstance;                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayBackground;                                 // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Throbber_Base(int32 EntryPoint);
	void InitializeStyle(E_UI_ThrobberType StyleType);
	void InitializeThrobber();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundVisibility(bool ShowBackground);
	void SetThrobberSize(E_UI_ThrobberSize Size);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Throbber_Base_C">();
	}
	static class UWBP_UIKit_Throbber_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Throbber_Base_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Throbber_Base_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Throbber_Base_C");
static_assert(sizeof(UWBP_UIKit_Throbber_Base_C) == 0x000300, "Wrong size on UWBP_UIKit_Throbber_Base_C");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_Throbber_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, Throbber) == 0x0002C8, "Member 'UWBP_UIKit_Throbber_Base_C::Throbber' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, ThrobberSize) == 0x0002D0, "Member 'UWBP_UIKit_Throbber_Base_C::ThrobberSize' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, SizeSmall) == 0x0002D4, "Member 'UWBP_UIKit_Throbber_Base_C::SizeSmall' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, SizeMedium) == 0x0002D8, "Member 'UWBP_UIKit_Throbber_Base_C::SizeMedium' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, SizeLarge) == 0x0002DC, "Member 'UWBP_UIKit_Throbber_Base_C::SizeLarge' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, ThrobberStyle) == 0x0002E0, "Member 'UWBP_UIKit_Throbber_Base_C::ThrobberStyle' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, MonochromaticInstance) == 0x0002E8, "Member 'UWBP_UIKit_Throbber_Base_C::MonochromaticInstance' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, CurrentMaterialInstance) == 0x0002F0, "Member 'UWBP_UIKit_Throbber_Base_C::CurrentMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Throbber_Base_C, DisplayBackground) == 0x0002F8, "Member 'UWBP_UIKit_Throbber_Base_C::DisplayBackground' has a wrong offset!");

}

