#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallyIcon

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallyIcon.WBP_RebootRallyIcon_C
// 0x0018 (0x02F0 - 0x02D8)
class UWBP_RebootRallyIcon_C final : public URebootRallyIcon
{
public:
	class UWidgetAnimation*                       Highlighted;                                       // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_RebootRally;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallyIcon_C">();
	}
	static class UWBP_RebootRallyIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallyIcon_C>();
	}
};
static_assert(alignof(UWBP_RebootRallyIcon_C) == 0x000008, "Wrong alignment on UWBP_RebootRallyIcon_C");
static_assert(sizeof(UWBP_RebootRallyIcon_C) == 0x0002F0, "Wrong size on UWBP_RebootRallyIcon_C");
static_assert(offsetof(UWBP_RebootRallyIcon_C, Highlighted) == 0x0002D8, "Member 'UWBP_RebootRallyIcon_C::Highlighted' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyIcon_C, Default) == 0x0002E0, "Member 'UWBP_RebootRallyIcon_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyIcon_C, Image_RebootRally) == 0x0002E8, "Member 'UWBP_RebootRallyIcon_C::Image_RebootRally' has a wrong offset!");

}

