#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ContextMenuAnchorButton_Base

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_BndEvt__TestCall_PopupMenuAnchor_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.BP_OnMenuSpawned
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned) == 0x000008, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned, Widget) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_BP_OnMenuSpawned::Widget' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.CloseMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu final
{
public:
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu) == 0x000010, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu, CallFunc_IsInSubGame_ReturnValue) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu::CallFunc_IsInSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_CloseMenu::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base
// 0x0138 (0x0138 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitContextMenuViewModel*             CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0020(0x0078)(ConstParm)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonGeneric_Base_C*        CallFunc_Create_ReturnValue;                       // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base) == 0x000138, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, EntryPoint) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsOpen_ReturnValue) == 0x000018, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_Event_MouseEvent) == 0x000020, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsOpen_ReturnValue_1) == 0x000098, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_Event_IsDesignTime) == 0x000099, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_Event_Widget) == 0x0000A0, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_ComponentBoundEvent_bIsOpen) == 0x0000A8, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_CustomEvent_Button) == 0x0000B0, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsHovered_ReturnValue) == 0x0000B8, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsHovered_ReturnValue_1) == 0x0000B9, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_CustomEvent_Item) == 0x0000C0, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsInSubGame_ReturnValue) == 0x0000D4, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsInSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, Temp_class_Variable) == 0x0000D8, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, Temp_bool_Variable) == 0x0000EC, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000F0, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_GetParent_ReturnValue) == 0x0000F8, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_GetCurrentInputType_ReturnValue) == 0x000100, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_RemoveChild_ReturnValue) == 0x000101, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000102, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsValid_ReturnValue) == 0x000103, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000108, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x000111, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_SwitchEnum_CmpSuccess_1) == 0x000112, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_AddChildToGrid_ReturnValue) == 0x000118, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_IsValidClass_ReturnValue) == 0x000120, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, K2Node_Select_Default) == 0x000128, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base, CallFunc_Create_ReturnValue) == 0x000130, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_ExecuteUbergraph_WBP_UIKit_ContextMenuAnchorButton_Base::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.Init Context Menu
// 0x0020 (0x0020 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu final
{
public:
	class UObject*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ContextMenu_C*               K2Node_DynamicCast_AsWBP_UIKit_Context_Menu;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Item)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu) == 0x000020, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu, Widget) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu::Widget' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu, K2Node_DynamicCast_AsWBP_UIKit_Context_Menu) == 0x000008, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu::K2Node_DynamicCast_AsWBP_UIKit_Context_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_Init_Context_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.OnBackPressed
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed) == 0x000001, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed) == 0x000001, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed, bPassThrough) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_OnBackPressed::bPassThrough' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.OnButtonBaseClicked_ContextMenuButtonDynamic
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic) == 0x000008, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic, Button) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_OnButtonBaseClicked_ContextMenuButtonDynamic::Button' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.OnContextClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked) == 0x000008, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked, Item) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_OnContextClicked::Item' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.Set Focus for STW
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW final
{
public:
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW) == 0x000010, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW, CallFunc_IsInSubGame_ReturnValue) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW::CallFunc_IsInSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW, CallFunc_GetUINavigationManager_ReturnValue) == 0x000008, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_Set_Focus_for_STW::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.SetContext
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext final
{
public:
	class UUIKitContextMenuActionContext*         InteractionContext_Data;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext) == 0x000008, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext, InteractionContext_Data) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_SetContext::InteractionContext_Data' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.UpdateBackground
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground final
{
public:
	class UMaterialInstance*                      Background_MI;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Outline_MI;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground) == 0x000010, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground, Background_MI) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground::Background_MI' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground, Outline_MI) == 0x000008, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateBackground::Outline_MI' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.UpdateIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon) == 0x000008, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon, Icon) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateIcon::Icon' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.UpdatePadding
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding final
{
public:
	struct FMargin                                Padding_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding) == 0x000004, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding) == 0x000010, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding, Padding_0) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdatePadding::Padding_0' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.UpdateText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText) == 0x000018, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText, Text) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateText::Text' has a wrong offset!");

// Function WBP_UIKit_ContextMenuAnchorButton_Base.WBP_UIKit_ContextMenuAnchorButton_Base_C.UpdateTextFont
// 0x0058 (0x0058 - 0x0000)
struct WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont final
{
public:
	struct FSlateFontInfo                         In_Font;                                           // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont) == 0x000008, "Wrong alignment on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont");
static_assert(sizeof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont) == 0x000058, "Wrong size on WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont");
static_assert(offsetof(WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont, In_Font) == 0x000000, "Member 'WBP_UIKit_ContextMenuAnchorButton_Base_C_UpdateTextFont::In_Font' has a wrong offset!");

}

