#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_BlockBackground_Tab_Enhanced

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_BlockBackground_Tab_Enhanced.WBP_UIKit_BlockBackground_Tab_Enhanced_C.ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable_1;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable_2;           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable_3;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced");
static_assert(sizeof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced) == 0x000018, "Wrong size on WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, EntryPoint) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, CallFunc_GetIsSelectable_IsSelectable) == 0x000010, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::CallFunc_GetIsSelectable_IsSelectable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, CallFunc_GetIsSelected_IsSelected) == 0x000011, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::CallFunc_GetIsSelected_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, CallFunc_GetIsSelectable_IsSelectable_1) == 0x000012, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::CallFunc_GetIsSelectable_IsSelectable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, CallFunc_GetIsSelectable_IsSelectable_2) == 0x000013, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::CallFunc_GetIsSelectable_IsSelectable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, CallFunc_GetIsSelectable_IsSelectable_3) == 0x000014, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::CallFunc_GetIsSelectable_IsSelectable_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced, K2Node_Event_IsDesignTime) == 0x000015, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_ExecuteUbergraph_WBP_UIKit_BlockBackground_Tab_Enhanced::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Tab_Enhanced.WBP_UIKit_BlockBackground_Tab_Enhanced_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Tab_Enhanced.WBP_UIKit_BlockBackground_Tab_Enhanced_C.SetBackgroundBrush
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush) == 0x000010, "Wrong alignment on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush");
static_assert(sizeof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush) == 0x0000D0, "Wrong size on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush, InBrush) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush::InBrush' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C0, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundBrush::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Tab_Enhanced.WBP_UIKit_BlockBackground_Tab_Enhanced_C.SetBackgroundMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial");
static_assert(sizeof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial) == 0x000010, "Wrong size on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial::Material_Instance' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetBackgroundMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Tab_Enhanced.WBP_UIKit_BlockBackground_Tab_Enhanced_C.SetCornerRadiuses
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses final
{
public:
	float                                         CornerRadius;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RadiusInPixels;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses");
static_assert(sizeof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses) == 0x000028, "Wrong size on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses, CornerRadius) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses::CornerRadius' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses, RadiusInPixels) == 0x000004, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses::RadiusInPixels' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetCornerRadiuses::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_BlockBackground_Tab_Enhanced.WBP_UIKit_BlockBackground_Tab_Enhanced_C.SetOutlineMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial");
static_assert(sizeof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial) == 0x000010, "Wrong size on WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial::Material_Instance' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UIKit_BlockBackground_Tab_Enhanced_C_SetOutlineMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

