#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Tabs_Categories

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.AddCategoriesWidget
// 0x0050 (0x0050 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget final
{
public:
	TDelegate<void(class FName TabID)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TabID)>            K2Node_CreateDelegate_OutputDelegate_3;            // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Categories_Base_C*      CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget) == 0x000050, "Wrong size on WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00000C, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000018, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000024, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'WBP_UIKit_Tabs_Categories_C_AddCategoriesWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.Event OnCategoryButtonClicked
// 0x0004 (0x0004 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked) == 0x000004, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked) == 0x000004, "Wrong size on WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked, TabID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryButtonClicked::TabID' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.Event OnCategoryTabClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          TabVM;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked) == 0x000010, "Wrong size on WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked, TabID) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked::TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked, TabVM) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabClicked::TabVM' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.Event OnCategoryTabSelected
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          TabVM;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected) == 0x000010, "Wrong size on WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected, TabID) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected::TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected, TabVM) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnCategoryTabSelected::TabVM' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.Event OnTabSelected
// 0x0004 (0x0004 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected) == 0x000004, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected) == 0x000004, "Wrong size on WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected, TabID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_Event_OnTabSelected::TabID' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.ExecuteUbergraph_WBP_UIKit_Tabs_Categories
// 0x0050 (0x0050 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CategoryID_1;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId_2;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupButtonViewModel*          K2Node_CustomEvent_TabVM_1;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CategoryID;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIKitTabGroupButtonViewModel*          K2Node_CustomEvent_TabVM;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_TabId;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TabId_3;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCategoryExpanded_IsExpanded;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedCategoryTabID_TabID;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupCategoryViewModel*        CallFunc_GetCategoryViewModelByID_Category;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      CallFunc_GetTabButtonBaseByID_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories) == 0x000050, "Wrong size on WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_CategoryID_1) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_CategoryID_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_TabId_2) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_TabId_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_TabVM_1) == 0x000010, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_TabVM_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_CategoryID) == 0x000018, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_TabId_1) == 0x00001C, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_TabId_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_TabVM) == 0x000020, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_TabVM' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_TabId) == 0x00002C, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_TabId' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, K2Node_CustomEvent_TabId_3) == 0x000030, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::K2Node_CustomEvent_TabId_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, CallFunc_IsCategoryExpanded_IsExpanded) == 0x000034, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::CallFunc_IsCategoryExpanded_IsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, CallFunc_GetSelectedCategoryTabID_TabID) == 0x000038, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::CallFunc_GetSelectedCategoryTabID_TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, CallFunc_GetCategoryViewModelByID_Category) == 0x000040, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::CallFunc_GetCategoryViewModelByID_Category' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories, CallFunc_GetTabButtonBaseByID_ReturnValue) == 0x000048, "Member 'WBP_UIKit_Tabs_Categories_C_ExecuteUbergraph_WBP_UIKit_Tabs_Categories::CallFunc_GetTabButtonBaseByID_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.NotifySelectionChanged
// 0x000C (0x000C - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CategoryTabID;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged) == 0x000004, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged) == 0x00000C, "Wrong size on WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged, CategoryTabID) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged::CategoryTabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged, CallFunc_NotEqual_NameName_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000009, "Member 'WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'WBP_UIKit_Tabs_Categories_C_NotifySelectionChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_Tabs_Categories_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.RemoveCategoriesWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget) == 0x000001, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget) == 0x000001, "Wrong size on WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_RemoveCategoriesWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.SelectCategoryTabByID
// 0x0050 (0x0050 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuppressClickFeedback;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          CategoryContainer;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectedCategoryID_CategoryID;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CallFunc_GetCategoryTabButton_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedCategoryTabID_TabID;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_GetCategoryTabs_InnerTabs;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue_1;              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID) == 0x000050, "Wrong size on WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, TabID) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, bSuppressClickFeedback) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::bSuppressClickFeedback' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, ReturnValue) == 0x000009, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CategoryContainer) == 0x000010, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CategoryContainer' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_GetSelectedCategoryID_CategoryID) == 0x000018, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_GetSelectedCategoryID_CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00001C, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_GetCategoryTabButton_ReturnValue) == 0x000020, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_GetCategoryTabButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_NotEqual_NameName_ReturnValue) == 0x000028, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_GetSelectedCategoryTabID_TabID) == 0x00002C, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_GetSelectedCategoryTabID_TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000030, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000031, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_GetCategoryContainer_Container) == 0x000038, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_GetCategoryContainer_Container' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_GetCategoryTabs_InnerTabs) == 0x000040, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_GetCategoryTabs_InnerTabs' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_SelectTabByID_ReturnValue) == 0x000049, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_SelectTabByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_SelectTabByID_ReturnValue_1) == 0x00004A, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_SelectTabByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID, CallFunc_IsValid_ReturnValue_2) == 0x00004B, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByID::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.SelectCategoryTabByIndex
// 0x0068 (0x0068 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex final
{
public:
	int32                                         CategoryIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TabIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuppressClickFeedback;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CategoryID;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_TabCategory_Base_C*          CategoryContainer;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectedCategoryID_CategoryID;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedCategoryTabIndex_Index;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCategoryTabsCount_Count;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCategoryTabIDAtIndex_TabID;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      CallFunc_GetCategoryTabButton_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_GetCategoryTabs_InnerTabs;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByIndex_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByIndex_ReturnValue_1;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex) == 0x000068, "Wrong size on WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CategoryIndex) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CategoryIndex' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, TabIndex) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::TabIndex' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, bSuppressClickFeedback) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::bSuppressClickFeedback' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, ReturnValue) == 0x000009, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CategoryID) == 0x00000C, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CategoryContainer) == 0x000010, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CategoryContainer' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetSelectedCategoryID_CategoryID) == 0x000018, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetSelectedCategoryID_CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00001C, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetSelectedCategoryTabIndex_Index) == 0x000020, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetSelectedCategoryTabIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetCategoryTabsCount_Count) == 0x000024, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetCategoryTabsCount_Count' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetCategoryTabIDAtIndex_TabID) == 0x00002C, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetCategoryTabIDAtIndex_TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetCategoryTabButton_ReturnValue) == 0x000030, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetCategoryTabButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetTabIdAtIndex_ReturnValue) == 0x00003C, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetTabIdAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000041, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_BooleanAND_ReturnValue_1) == 0x000042, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetCategoryTabs_InnerTabs) == 0x000048, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetCategoryTabs_InnerTabs' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_NotEqual_NameName_ReturnValue) == 0x000051, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_GetCategoryContainer_Container) == 0x000058, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_GetCategoryContainer_Container' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_SelectTabByIndex_ReturnValue) == 0x000060, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_SelectTabByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_SelectTabByIndex_ReturnValue_1) == 0x000061, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_SelectTabByIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex, CallFunc_IsValid_ReturnValue_2) == 0x000062, "Member 'WBP_UIKit_Tabs_Categories_C_SelectCategoryTabByIndex::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.SetCategoriesData
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_SetCategoriesData final
{
public:
	TArray<class UUIKitTabGroupCategoryViewModel*> Categories;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_SetCategoriesData) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_SetCategoriesData");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_SetCategoriesData) == 0x000018, "Wrong size on WBP_UIKit_Tabs_Categories_C_SetCategoriesData");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SetCategoriesData, Categories) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_SetCategoriesData::Categories' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SetCategoriesData, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_UIKit_Tabs_Categories_C_SetCategoriesData::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.SetUIKitTabGroupCategoriesViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel final
{
public:
	class UUIKitTabGroupCategoriesViewModel*      ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel) == 0x000028, "Wrong size on WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel, ViewModel) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_UIKit_Tabs_Categories_C_SetUIKitTabGroupCategoriesViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.GetCategoryIDAtIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CategoryID;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex) == 0x000004, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex) == 0x000010, "Wrong size on WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex, Index_0) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex, CategoryID) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex, CallFunc_GetTabIdAtIndex_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex::CallFunc_GetTabIdAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIDAtIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.GetCategoryIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_GetCategoryIndex final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabIndexByID_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_GetCategoryIndex) == 0x000004, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_GetCategoryIndex");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_GetCategoryIndex) == 0x000010, "Wrong size on WBP_UIKit_Tabs_Categories_C_GetCategoryIndex");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIndex, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIndex::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIndex, Index_0) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIndex, CallFunc_GetTabIndexByID_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIndex::CallFunc_GetTabIndexByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryIndex, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.GetCategoryTabIDAtIndex
// 0x0038 (0x0038 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabID;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          ContainerWidget;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_GetCategoryTabs_InnerTabs;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex) == 0x000038, "Wrong size on WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, Index_0) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, TabID) == 0x000008, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::TabID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, ContainerWidget) == 0x000010, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::ContainerWidget' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, CallFunc_GetCategoryTabs_InnerTabs) == 0x000018, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::CallFunc_GetCategoryTabs_InnerTabs' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, CallFunc_GetTabIdAtIndex_ReturnValue) == 0x000020, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::CallFunc_GetTabIdAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, CallFunc_GetCategoryContainer_Container) == 0x000028, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::CallFunc_GetCategoryContainer_Container' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIDAtIndex::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_UIKit_Tabs_Categories.WBP_UIKit_Tabs_Categories_C.GetCategoryTabIndex
// 0x0038 (0x0038 - 0x0000)
struct WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          ContainerWidget;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Base_C*                 CallFunc_GetCategoryTabs_InnerTabs;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabIndexByID_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_TabCategory_Base_C*          CallFunc_GetCategoryContainer_Container;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex");
static_assert(sizeof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex) == 0x000038, "Wrong size on WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex, CategoryID) == 0x000000, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex::CategoryID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex, TabID) == 0x000004, "Member 'WBP_UIKit_Tabs_Categories_C_GetCategoryTabIndex::TabID' has a wrong offset!");
