#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CategoriesTabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Tabs_Base_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CategoriesTabs.WBP_CategoriesTabs_C
// 0x0058 (0x0678 - 0x0620)
class UWBP_CategoriesTabs_C final : public UWBP_UIKit_Tabs_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_CategoriesTabs_C;               // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLockerVM*                          FortLockerVM;                                      // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenCategoriesTab;                                 // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldShowNamesOnHover;                            // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortLockerCategoryGroupVM*>     Categories;                                        // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnMouseHover;                                      // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnMouseUnHover;                                    // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsNameShowing;                                     // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeNamesVisibility(bool Show);
	void Construct();
	void Event_On_Input_Method_Changed(ECommonInputType bNewInputType);
	void ExecuteUbergraph_WBP_CategoriesTabs(int32 EntryPoint);
	void HandleTabCreation(class FName TabNameID, class UCommonButtonBase* TabButton);
	void HasHoveredItem(bool* IsHovering);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PopulateTabs(TArray<class UFortLockerCategoryGroupVM*>& Categories_0);
	void PreConstruct(bool IsDesignTime);
	void Select_Tab(int32 Index_0);
	void SetInteractionEnabled(bool Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CategoriesTabs_C">();
	}
	static class UWBP_CategoriesTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CategoriesTabs_C>();
	}
};
static_assert(alignof(UWBP_CategoriesTabs_C) == 0x000008, "Wrong alignment on UWBP_CategoriesTabs_C");
static_assert(sizeof(UWBP_CategoriesTabs_C) == 0x000678, "Wrong size on UWBP_CategoriesTabs_C");
static_assert(offsetof(UWBP_CategoriesTabs_C, UberGraphFrame_WBP_CategoriesTabs_C) == 0x000620, "Member 'UWBP_CategoriesTabs_C::UberGraphFrame_WBP_CategoriesTabs_C' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, FortLockerVM) == 0x000628, "Member 'UWBP_CategoriesTabs_C::FortLockerVM' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, OpenCategoriesTab) == 0x000630, "Member 'UWBP_CategoriesTabs_C::OpenCategoriesTab' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, ShouldShowNamesOnHover) == 0x000638, "Member 'UWBP_CategoriesTabs_C::ShouldShowNamesOnHover' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, Categories) == 0x000640, "Member 'UWBP_CategoriesTabs_C::Categories' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, OnMouseHover) == 0x000650, "Member 'UWBP_CategoriesTabs_C::OnMouseHover' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, OnMouseUnHover) == 0x000660, "Member 'UWBP_CategoriesTabs_C::OnMouseUnHover' has a wrong offset!");
static_assert(offsetof(UWBP_CategoriesTabs_C, IsNameShowing) == 0x000670, "Member 'UWBP_CategoriesTabs_C::IsNameShowing' has a wrong offset!");

}

