#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArrowPagination

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ArrowPagination.WBP_ArrowPagination_C
// 0x0060 (0x14F0 - 0x1490)
class UWBP_ArrowPagination_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Idle;                                         // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Normal;                                       // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disabled;                                     // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Clicked;                                      // 0x14B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x14B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ArrowOverlay;                                      // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Scratch_A;                                         // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Scratch_B;                                         // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Flip;                                              // 0x14E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled;                                          // 0x14E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E2[0x6];                                     // 0x14E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ClickedSound;                                      // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnUnhovered();
	void ButtonClicked(EUMGSequencePlayMode PlayMode);
	void ExecuteUbergraph_WBP_ArrowPagination(int32 EntryPoint);
	void HueShift(double HueShiftValue);
	void OnDisable();
	void OnEnable();
	void PlayHover(EUMGSequencePlayMode PlayMode);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ArrowPagination_C">();
	}
	static class UWBP_ArrowPagination_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ArrowPagination_C>();
	}
};
static_assert(alignof(UWBP_ArrowPagination_C) == 0x000010, "Wrong alignment on UWBP_ArrowPagination_C");
static_assert(sizeof(UWBP_ArrowPagination_C) == 0x0014F0, "Wrong size on UWBP_ArrowPagination_C");
static_assert(offsetof(UWBP_ArrowPagination_C, UberGraphFrame) == 0x001490, "Member 'UWBP_ArrowPagination_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Anim_Idle) == 0x001498, "Member 'UWBP_ArrowPagination_C::Anim_Idle' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Anim_Normal) == 0x0014A0, "Member 'UWBP_ArrowPagination_C::Anim_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Anim_Disabled) == 0x0014A8, "Member 'UWBP_ArrowPagination_C::Anim_Disabled' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Anim_Clicked) == 0x0014B0, "Member 'UWBP_ArrowPagination_C::Anim_Clicked' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Anim_Hover) == 0x0014B8, "Member 'UWBP_ArrowPagination_C::Anim_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, ArrowOverlay) == 0x0014C0, "Member 'UWBP_ArrowPagination_C::ArrowOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Overlay) == 0x0014C8, "Member 'UWBP_ArrowPagination_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Scratch_A) == 0x0014D0, "Member 'UWBP_ArrowPagination_C::Scratch_A' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Scratch_B) == 0x0014D8, "Member 'UWBP_ArrowPagination_C::Scratch_B' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Flip) == 0x0014E0, "Member 'UWBP_ArrowPagination_C::Flip' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, Disabled) == 0x0014E1, "Member 'UWBP_ArrowPagination_C::Disabled' has a wrong offset!");
static_assert(offsetof(UWBP_ArrowPagination_C, ClickedSound) == 0x0014E8, "Member 'UWBP_ArrowPagination_C::ClickedSound' has a wrong offset!");

}

