#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab_Collapsible

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_UI_Alignment_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible
// 0x0058 (0x0058 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIKitBlockTiming                      K2Node_MakeStruct_UIKitBlockTiming;                // 0x0004(0x002C)(NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible) == 0x000008, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible) == 0x000058, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, K2Node_MakeStruct_UIKitBlockTiming) == 0x000004, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::K2Node_MakeStruct_UIKitBlockTiming' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000040, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000048, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible, K2Node_Event_IsDesignTime) == 0x000050, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ExecuteUbergraph_WBP_UIKit_Button_Tab_Collapsible::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.ResetAnimations
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations) == 0x000008, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations) == 0x000018, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations, CallFunc_GetEndTime_ReturnValue_1) == 0x000004, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_ResetAnimations::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.SetCollapsedAnimValue
// 0x0070 (0x0070 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue final
{
public:
	double                                        CollapsedAnimationProgress;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue) == 0x000008, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue) == 0x000070, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CollapsedAnimationProgress) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CollapsedAnimationProgress' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_GetDesiredSize_ReturnValue) == 0x000010, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_Lerp_ReturnValue) == 0x000030, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_Lerp_ReturnValue_1) == 0x000048, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_Lerp_ReturnValue_2) == 0x000050, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_Lerp_B_ImplicitCast) == 0x000058, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_Lerp_A_ImplicitCast) == 0x000060, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000068, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetCollapsedAnimValue::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.SetSelectedAnimValue
// 0x0040 (0x0040 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue final
{
public:
	double                                        AnimValue;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue) == 0x000008, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue) == 0x000040, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, AnimValue) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::AnimValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, CallFunc_Lerp_A_ImplicitCast) == 0x000030, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000038, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectedAnimValue::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.SetSelectionAlignment
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment final
{
public:
	E_UI_Alignment                                Selection_Alignment;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment) == 0x000001, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment) == 0x000001, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment, Selection_Alignment) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetSelectionAlignment::Selection_Alignment' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.SetTextOnOneLine
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine) == 0x000008, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine) == 0x000018, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine, Value) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine::Value' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine, Temp_bool_Variable) == 0x000008, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine, Temp_int_Variable) == 0x00000C, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine, K2Node_Select_Default) == 0x000010, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_SetTextOnOneLine::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.UpdateAlignment
// 0x000D (0x000D - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment final
{
public:
	E_UI_Alignment                                Selection_Alignment;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_Alignment                                Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_Alignment                                Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_6;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_7;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_8;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_9;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment) == 0x000001, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment) == 0x00000D, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Selection_Alignment) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Selection_Alignment' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable) == 0x000001, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_4) == 0x000005, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_5) == 0x000006, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, K2Node_Select_Default) == 0x000007, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_6) == 0x000008, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_7) == 0x000009, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_8) == 0x00000A, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, Temp_byte_Variable_9) == 0x00000B, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment, K2Node_Select_Default_1) == 0x00000C, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdateAlignment::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UIKit_Button_Tab_Collapsible.WBP_UIKit_Button_Tab_Collapsible_C.UpdatePadding
// 0x0058 (0x0058 - 0x0000)
struct WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding final
{
public:
	E_UI_Alignment                                SelectionAlignment;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_Alignment                                Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default;                             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_1;                           // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_2;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_3;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_4;                           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding) == 0x000004, "Wrong alignment on WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding");
static_assert(sizeof(WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding) == 0x000058, "Wrong size on WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding, SelectionAlignment) == 0x000000, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding::SelectionAlignment' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding, Temp_bool_Variable) == 0x000001, "Member 'WBP_UIKit_Button_Tab_Collapsible_C_UpdatePadding::Temp_bool_Variable' has a wrong offset!");
