#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_Collection_RewardPreview

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LinedNotebook_Collection_RewardPreview.WBP_LinedNotebook_Collection_RewardPreview_C.AnimFadeIn
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn final
{
public:
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn) == 0x000001, "Wrong alignment on WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn");
static_assert(sizeof(WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn) == 0x000001, "Wrong size on WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn, PlayMode) == 0x000000, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_AnimFadeIn::PlayMode' has a wrong offset!");

// Function WBP_LinedNotebook_Collection_RewardPreview.WBP_LinedNotebook_Collection_RewardPreview_C.ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview
// 0x0090 (0x0090 - 0x0000)
struct WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_1;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_2;         // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_3;         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_4;         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_CustomEvent_PlayMode;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DetermineIntroAnim_ReturnValue_5;         // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview) == 0x000008, "Wrong alignment on WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview");
static_assert(sizeof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview) == 0x000090, "Wrong size on WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, EntryPoint) == 0x000000, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_DetermineIntroAnim_ReturnValue) == 0x000008, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_DetermineIntroAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_DetermineIntroAnim_ReturnValue_1) == 0x000018, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_DetermineIntroAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_DetermineIntroAnim_ReturnValue_2) == 0x000028, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_DetermineIntroAnim_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_DetermineIntroAnim_ReturnValue_3) == 0x000038, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_DetermineIntroAnim_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_DetermineIntroAnim_ReturnValue_4) == 0x000048, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_DetermineIntroAnim_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, K2Node_CustomEvent_PlayMode) == 0x000058, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::K2Node_CustomEvent_PlayMode' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview, CallFunc_DetermineIntroAnim_ReturnValue_5) == 0x000080, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_ExecuteUbergraph_WBP_LinedNotebook_Collection_RewardPreview::CallFunc_DetermineIntroAnim_ReturnValue_5' has a wrong offset!");

// Function WBP_LinedNotebook_Collection_RewardPreview.WBP_LinedNotebook_Collection_RewardPreview_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct");
static_assert(sizeof(WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct) == 0x000001, "Wrong size on WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LinedNotebook_Collection_RewardPreview.WBP_LinedNotebook_Collection_RewardPreview_C.OnGatherTokenCollectionWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets final
{
public:
	TArray<class UFortEventTokenCollectionWidget*> OutCollectionWidgets;                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UFortEventTokenCollectionWidget*> K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets) == 0x000008, "Wrong alignment on WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets");
static_assert(sizeof(WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets) == 0x000020, "Wrong size on WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets, OutCollectionWidgets) == 0x000000, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets::OutCollectionWidgets' has a wrong offset!");
static_assert(offsetof(WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_LinedNotebook_Collection_RewardPreview_C_OnGatherTokenCollectionWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

