#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallySelectionHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallySelectionHeader.WBP_RebootRallySelectionHeader_C
// 0x00A0 (0x1540 - 0x14A0)
class UWBP_RebootRallySelectionHeader_C final : public URebootRallySelectionHeaderBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x14B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x14B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border;                                            // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LinearFade;                                  // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rewards;                                     // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRally_Logo_Banner_C*         WBP_RebootRally_Logo_Banner;                       // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        InterpolationValue;                                // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorA;                                            // 0x14F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorB;                                            // 0x1500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RadialGradientA;                                   // 0x1510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RadialGradientB;                                   // 0x1520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorA_Name;                                       // 0x1530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorB_Name;                                       // 0x1534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RadialGradientA_Name;                              // 0x1538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RadialGradientB_Name;                              // 0x153C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_RebootRallySelectionHeader(int32 EntryPoint);
	void Finished_83AA4B0145343A56061784AA887827D3();
	void InputMethodChanged(ECommonInputType bNewInputType);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetInterpolationValue(double NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallySelectionHeader_C">();
	}
	static class UWBP_RebootRallySelectionHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallySelectionHeader_C>();
	}
};
static_assert(alignof(UWBP_RebootRallySelectionHeader_C) == 0x000010, "Wrong alignment on UWBP_RebootRallySelectionHeader_C");
static_assert(sizeof(UWBP_RebootRallySelectionHeader_C) == 0x001540, "Wrong size on UWBP_RebootRallySelectionHeader_C");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, UberGraphFrame) == 0x0014A0, "Member 'UWBP_RebootRallySelectionHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Unhovered) == 0x0014A8, "Member 'UWBP_RebootRallySelectionHeader_C::Unhovered' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Hovered) == 0x0014B0, "Member 'UWBP_RebootRallySelectionHeader_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Default) == 0x0014B8, "Member 'UWBP_RebootRallySelectionHeader_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Border) == 0x0014C0, "Member 'UWBP_RebootRallySelectionHeader_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, CommonActionWidget) == 0x0014C8, "Member 'UWBP_RebootRallySelectionHeader_C::CommonActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Image_LinearFade) == 0x0014D0, "Member 'UWBP_RebootRallySelectionHeader_C::Image_LinearFade' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Image_Rewards) == 0x0014D8, "Member 'UWBP_RebootRallySelectionHeader_C::Image_Rewards' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, WBP_RebootRally_Logo_Banner) == 0x0014E0, "Member 'UWBP_RebootRallySelectionHeader_C::WBP_RebootRally_Logo_Banner' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, InterpolationValue) == 0x0014E8, "Member 'UWBP_RebootRallySelectionHeader_C::InterpolationValue' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, ColorA) == 0x0014F0, "Member 'UWBP_RebootRallySelectionHeader_C::ColorA' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, ColorB) == 0x001500, "Member 'UWBP_RebootRallySelectionHeader_C::ColorB' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, RadialGradientA) == 0x001510, "Member 'UWBP_RebootRallySelectionHeader_C::RadialGradientA' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, RadialGradientB) == 0x001520, "Member 'UWBP_RebootRallySelectionHeader_C::RadialGradientB' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, ColorA_Name) == 0x001530, "Member 'UWBP_RebootRallySelectionHeader_C::ColorA_Name' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, ColorB_Name) == 0x001534, "Member 'UWBP_RebootRallySelectionHeader_C::ColorB_Name' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, RadialGradientA_Name) == 0x001538, "Member 'UWBP_RebootRallySelectionHeader_C::RadialGradientA_Name' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, RadialGradientB_Name) == 0x00153C, "Member 'UWBP_RebootRallySelectionHeader_C::RadialGradientB_Name' has a wrong offset!");

}

