#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPL_Customize_Redirector

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_MPL_Customize_Redirector.WBP_MPL_Customize_Redirector_C.Add Variant Channel
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPL_Customize_Redirector_C_Add_Variant_Channel final
{
public:
	class UFortVariantChannelVM*                  ChannelVM;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Redirector_C_Add_Variant_Channel) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Redirector_C_Add_Variant_Channel");
static_assert(sizeof(WBP_MPL_Customize_Redirector_C_Add_Variant_Channel) == 0x000008, "Wrong size on WBP_MPL_Customize_Redirector_C_Add_Variant_Channel");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_Add_Variant_Channel, ChannelVM) == 0x000000, "Member 'WBP_MPL_Customize_Redirector_C_Add_Variant_Channel::ChannelVM' has a wrong offset!");

// Function WBP_MPL_Customize_Redirector.WBP_MPL_Customize_Redirector_C.ExecuteUbergraph_WBP_MPL_Customize_Redirector
// 0x0060 (0x0060 - 0x0000)
struct WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMcpVariantChannelInfo                 K2Node_Event_InVariantChannelInfo;                 // 0x0008(0x0040)(ConstParm, HasGetValueTypeHash)
	const class UFortVariantItemVM*               K2Node_Event_ItemVM;                               // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortVariantChannelVM*                  CallFunc_Map_Find_Value;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector");
static_assert(sizeof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector) == 0x000060, "Wrong size on WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector, EntryPoint) == 0x000000, "Member 'WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector, K2Node_Event_InVariantChannelInfo) == 0x000008, "Member 'WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector::K2Node_Event_InVariantChannelInfo' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector, K2Node_Event_ItemVM) == 0x000048, "Member 'WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector::K2Node_Event_ItemVM' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector, CallFunc_Map_Find_Value) == 0x000050, "Member 'WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'WBP_MPL_Customize_Redirector_C_ExecuteUbergraph_WBP_MPL_Customize_Redirector::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_MPL_Customize_Redirector.WBP_MPL_Customize_Redirector_C.HandleVariantEngaged
// 0x0048 (0x0048 - 0x0000)
struct WBP_MPL_Customize_Redirector_C_HandleVariantEngaged final
{
public:
	struct FMcpVariantChannelInfo                 InVariantChannelInfo;                              // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	const class UFortVariantItemVM*               ItemVM;                                            // 0x0040(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Redirector_C_HandleVariantEngaged) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Redirector_C_HandleVariantEngaged");
static_assert(sizeof(WBP_MPL_Customize_Redirector_C_HandleVariantEngaged) == 0x000048, "Wrong size on WBP_MPL_Customize_Redirector_C_HandleVariantEngaged");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_HandleVariantEngaged, InVariantChannelInfo) == 0x000000, "Member 'WBP_MPL_Customize_Redirector_C_HandleVariantEngaged::InVariantChannelInfo' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_HandleVariantEngaged, ItemVM) == 0x000040, "Member 'WBP_MPL_Customize_Redirector_C_HandleVariantEngaged::ItemVM' has a wrong offset!");

// Function WBP_MPL_Customize_Redirector.WBP_MPL_Customize_Redirector_C.GetDesiredFocusTarget
// 0x0030 (0x0030 - 0x0000)
struct WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                FocusTarget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_DynVariantRow_FocusTargetWidget_C> K2Node_DynamicCast_AsBPI_Dyn_Variant_Row_Focus_Target_Widget; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_FocusTarget;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget");
static_assert(sizeof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget) == 0x000030, "Wrong size on WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget, FocusTarget) == 0x000000, "Member 'WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget::FocusTarget' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget, K2Node_DynamicCast_AsBPI_Dyn_Variant_Row_Focus_Target_Widget) == 0x000010, "Member 'WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget::K2Node_DynamicCast_AsBPI_Dyn_Variant_Row_Focus_Target_Widget' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_FocusTarget) == 0x000028, "Member 'WBP_MPL_Customize_Redirector_C_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_FocusTarget' has a wrong offset!");

}

