#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Button_Tab.WBP_UIKit_Button_Tab_C.ExecuteUbergraph_WBP_UIKit_Button_Tab
// 0x0058 (0x0058 - 0x0000)
struct WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Block_BackgroundTopNavBar_C* K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIKitBlockTiming                      K2Node_MakeStruct_UIKitBlockTiming;                // 0x0014(0x002C)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Block_BackgroundTopNavBar_C* K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab) == 0x000008, "Wrong alignment on WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab");
static_assert(sizeof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab) == 0x000058, "Wrong size on WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar) == 0x000008, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, K2Node_MakeStruct_UIKitBlockTiming) == 0x000014, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::K2Node_MakeStruct_UIKitBlockTiming' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar_1) == 0x000048, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, CallFunc_IsUsingTouch_ReturnValue) == 0x000051, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab, CallFunc_IsUsingTouch_ReturnValue_1) == 0x000052, "Member 'WBP_UIKit_Button_Tab_C_ExecuteUbergraph_WBP_UIKit_Button_Tab::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");

// Function WBP_UIKit_Button_Tab.WBP_UIKit_Button_Tab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Button_Tab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Button_Tab_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_Button_Tab_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_Button_Tab_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_Button_Tab_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_Button_Tab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_Button_Tab_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

