#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallyTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallyTimer.WBP_RebootRallyTimer_C
// 0x0018 (0x0310 - 0x02F8)
class UWBP_RebootRallyTimer_C final : public URebootRallyTimerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Timer;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Timer;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RebootRallyTimer(int32 EntryPoint);
	void UpdateRemainingTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallyTimer_C">();
	}
	static class UWBP_RebootRallyTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallyTimer_C>();
	}
};
static_assert(alignof(UWBP_RebootRallyTimer_C) == 0x000008, "Wrong alignment on UWBP_RebootRallyTimer_C");
static_assert(sizeof(UWBP_RebootRallyTimer_C) == 0x000310, "Wrong size on UWBP_RebootRallyTimer_C");
static_assert(offsetof(UWBP_RebootRallyTimer_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_RebootRallyTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyTimer_C, Image_Timer) == 0x000300, "Member 'UWBP_RebootRallyTimer_C::Image_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyTimer_C, Text_Timer) == 0x000308, "Member 'UWBP_RebootRallyTimer_C::Text_Timer' has a wrong offset!");

}

