#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CategoriesButton

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_CategoriesButton.WBP_CategoriesButton_C.ChangeEnabledStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_CategoriesButton_C_ChangeEnabledStyle final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesButton_C_ChangeEnabledStyle) == 0x000001, "Wrong alignment on WBP_CategoriesButton_C_ChangeEnabledStyle");
static_assert(sizeof(WBP_CategoriesButton_C_ChangeEnabledStyle) == 0x000001, "Wrong size on WBP_CategoriesButton_C_ChangeEnabledStyle");
static_assert(offsetof(WBP_CategoriesButton_C_ChangeEnabledStyle, Enabled) == 0x000000, "Member 'WBP_CategoriesButton_C_ChangeEnabledStyle::Enabled' has a wrong offset!");

// Function WBP_CategoriesButton.WBP_CategoriesButton_C.ExecuteUbergraph_WBP_CategoriesButton
// 0x0070 (0x0070 - 0x0000)
struct WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_BlockBackground_Tab_Enhanced_C* K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Tab_Enhanced; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLockerCategoryGroupVM*             K2Node_CustomEvent_VM_1;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x0048(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLockerCategoryGroupVM*             K2Node_DynamicCast_AsFort_Locker_Category_Group_VM; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLockerCategoryGroupVM*             K2Node_CustomEvent_VM;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAreAnyItemsNew_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 K2Node_Select_Default;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton) == 0x000008, "Wrong alignment on WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton");
static_assert(sizeof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton) == 0x000070, "Wrong size on WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, EntryPoint) == 0x000000, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_CustomEvent_Enabled) == 0x000004, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, Temp_bool_Variable) == 0x000014, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, Temp_byte_Variable) == 0x000015, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, Temp_byte_Variable_1) == 0x000016, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_Event_IsDesignTime) == 0x000017, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, CallFunc_IsMobileGame_ReturnValue) == 0x000018, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Tab_Enhanced) == 0x000020, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Tab_Enhanced' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_CustomEvent_VM_1) == 0x000030, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_CustomEvent_VM_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_CustomEvent_Object) == 0x000040, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_CustomEvent_Field) == 0x000048, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_CustomEvent_Field' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_DynamicCast_AsFort_Locker_Category_Group_VM) == 0x000050, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_DynamicCast_AsFort_Locker_Category_Group_VM' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_CustomEvent_VM) == 0x000060, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_CustomEvent_VM' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, CallFunc_GetAreAnyItemsNew_ReturnValue) == 0x000068, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::CallFunc_GetAreAnyItemsNew_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton, K2Node_Select_Default) == 0x000069, "Member 'WBP_CategoriesButton_C_ExecuteUbergraph_WBP_CategoriesButton::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CategoriesButton.WBP_CategoriesButton_C.HandleFieldValueChanged_GetAreAnyItemsNew
// 0x0010 (0x0010 - 0x0000)
struct WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew) == 0x000008, "Wrong alignment on WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew");
static_assert(sizeof(WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew) == 0x000010, "Wrong size on WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew");
static_assert(offsetof(WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew, Object) == 0x000000, "Member 'WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew::Object' has a wrong offset!");
static_assert(offsetof(WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew, Field) == 0x000008, "Member 'WBP_CategoriesButton_C_HandleFieldValueChanged_GetAreAnyItemsNew::Field' has a wrong offset!");

// Function WBP_CategoriesButton.WBP_CategoriesButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CategoriesButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CategoriesButton_C_PreConstruct");
static_assert(sizeof(WBP_CategoriesButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_CategoriesButton_C_PreConstruct");
static_assert(offsetof(WBP_CategoriesButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CategoriesButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CategoriesButton.WBP_CategoriesButton_C.RefreshBang
// 0x0008 (0x0008 - 0x0000)
struct WBP_CategoriesButton_C_RefreshBang final
{
public:
	class UFortLockerCategoryGroupVM*             VM;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesButton_C_RefreshBang) == 0x000008, "Wrong alignment on WBP_CategoriesButton_C_RefreshBang");
static_assert(sizeof(WBP_CategoriesButton_C_RefreshBang) == 0x000008, "Wrong size on WBP_CategoriesButton_C_RefreshBang");
static_assert(offsetof(WBP_CategoriesButton_C_RefreshBang, VM) == 0x000000, "Member 'WBP_CategoriesButton_C_RefreshBang::VM' has a wrong offset!");

// Function WBP_CategoriesButton.WBP_CategoriesButton_C.SetVM
// 0x0008 (0x0008 - 0x0000)
struct WBP_CategoriesButton_C_SetVM final
{
public:
	class UFortLockerCategoryGroupVM*             VM;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoriesButton_C_SetVM) == 0x000008, "Wrong alignment on WBP_CategoriesButton_C_SetVM");
static_assert(sizeof(WBP_CategoriesButton_C_SetVM) == 0x000008, "Wrong size on WBP_CategoriesButton_C_SetVM");
static_assert(offsetof(WBP_CategoriesButton_C_SetVM, VM) == 0x000000, "Member 'WBP_CategoriesButton_C_SetVM::VM' has a wrong offset!");

}

