#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augments_Quickbar

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Augments_Quickbar.WBP_Augments_Quickbar_C.AugmentSelectionStatusChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged final
{
public:
	bool                                          IsOpened;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged) == 0x000008, "Wrong alignment on WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged");
static_assert(sizeof(WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged) == 0x000018, "Wrong size on WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged");
static_assert(offsetof(WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged, IsOpened) == 0x000000, "Member 'WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged::IsOpened' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_Augments_Quickbar_C_AugmentSelectionStatusChanged::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_Augments_Quickbar.WBP_Augments_Quickbar_C.ExecuteUbergraph_WBP_Augments_Quickbar
// 0x0040 (0x0040 - 0x0000)
struct WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortPlayerAugmentItemDefinition*> K2Node_Event_ActiveAugments;                       // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Augments_QuickbarSlot_C*           CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar) == 0x000008, "Wrong alignment on WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar");
static_assert(sizeof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar) == 0x000040, "Wrong size on WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, EntryPoint) == 0x000000, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, K2Node_Event_ActiveAugments) == 0x000008, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::K2Node_Event_ActiveAugments' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, Temp_int_Variable) == 0x000028, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Augments_Quickbar_C_ExecuteUbergraph_WBP_Augments_Quickbar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Augments_Quickbar.WBP_Augments_Quickbar_C.OnAugmentsUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_Augments_Quickbar_C_OnAugmentsUpdated final
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> ActiveAugments;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Augments_Quickbar_C_OnAugmentsUpdated) == 0x000008, "Wrong alignment on WBP_Augments_Quickbar_C_OnAugmentsUpdated");
static_assert(sizeof(WBP_Augments_Quickbar_C_OnAugmentsUpdated) == 0x000010, "Wrong size on WBP_Augments_Quickbar_C_OnAugmentsUpdated");
static_assert(offsetof(WBP_Augments_Quickbar_C_OnAugmentsUpdated, ActiveAugments) == 0x000000, "Member 'WBP_Augments_Quickbar_C_OnAugmentsUpdated::ActiveAugments' has a wrong offset!");

// Function WBP_Augments_Quickbar.WBP_Augments_Quickbar_C.PopulateAugments
// 0x0120 (0x0120 - 0x0000)
struct WBP_Augments_Quickbar_C_PopulateAugments final
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> InActiveAugments;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	class UWBP_Augments_QuickbarSlot_C*           CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Augments_QuickbarSlot_C*           CallFunc_Create_ReturnValue_1;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAugmentItemDefinition*       CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_Quickbar_C_PopulateAugments) == 0x000008, "Wrong alignment on WBP_Augments_Quickbar_C_PopulateAugments");
static_assert(sizeof(WBP_Augments_Quickbar_C_PopulateAugments) == 0x000120, "Wrong size on WBP_Augments_Quickbar_C_PopulateAugments");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, InActiveAugments) == 0x000000, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::InActiveAugments' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Array_LastIndex_ReturnValue) == 0x000014, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Array_LastIndex_ReturnValue_1) == 0x00001C, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Array_LastIndex_ReturnValue_2) == 0x000040, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, K2Node_MakeArray_Array) == 0x000098, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0000D0, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, Temp_int_Variable) == 0x0000DC, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E1, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E2, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E4, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E8, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Create_ReturnValue_1) == 0x0000F0, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, Temp_int_Array_Index_Variable) == 0x0000F8, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x000100, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000108, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Array_Get_Item) == 0x000110, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, Temp_bool_True_if_break_was_hit_Variable) == 0x000118, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augments_Quickbar_C_PopulateAugments, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'WBP_Augments_Quickbar_C_PopulateAugments::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Augments_Quickbar.WBP_Augments_Quickbar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Augments_Quickbar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augments_Quickbar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Augments_Quickbar_C_PreConstruct");
static_assert(sizeof(WBP_Augments_Quickbar_C_PreConstruct) == 0x000001, "Wrong size on WBP_Augments_Quickbar_C_PreConstruct");
static_assert(offsetof(WBP_Augments_Quickbar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Augments_Quickbar_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

