#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IconTwoTextDesc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IconTwoTextDesc.WBP_IconTwoTextDesc_C
// 0x00C8 (0x0388 - 0x02C0)
class UWBP_IconTwoTextDesc_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Timer;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Primary;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Secondary;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TimerText;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon_Texture;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     IconMaterial;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconShear;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconAngle;                                         // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColor;                                         // 0x0324(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PrimaryText;                                       // 0x0338(0x0018)(Edit, BlueprintVisible)
	class FText                                   SecondaryText;                                     // 0x0350(0x0018)(Edit, BlueprintVisible)
	double                                        IconToTextSpacing;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            SecondaryTextColor;                                // 0x0370(0x0014)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_IconTwoTextDesc(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateMainText(const class FText& InText);
	void UpdateSecondaryText(const class FText& InText);
	void UpdateTimerText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IconTwoTextDesc_C">();
	}
	static class UWBP_IconTwoTextDesc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IconTwoTextDesc_C>();
	}
};
static_assert(alignof(UWBP_IconTwoTextDesc_C) == 0x000008, "Wrong alignment on UWBP_IconTwoTextDesc_C");
static_assert(sizeof(UWBP_IconTwoTextDesc_C) == 0x000388, "Wrong size on UWBP_IconTwoTextDesc_C");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_IconTwoTextDesc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, Image_Icon) == 0x0002C8, "Member 'UWBP_IconTwoTextDesc_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, Image_Timer) == 0x0002D0, "Member 'UWBP_IconTwoTextDesc_C::Image_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, Primary) == 0x0002D8, "Member 'UWBP_IconTwoTextDesc_C::Primary' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, Secondary) == 0x0002E0, "Member 'UWBP_IconTwoTextDesc_C::Secondary' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, TimerText) == 0x0002E8, "Member 'UWBP_IconTwoTextDesc_C::TimerText' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, Icon_Texture) == 0x0002F0, "Member 'UWBP_IconTwoTextDesc_C::Icon_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, IconMaterial) == 0x0002F8, "Member 'UWBP_IconTwoTextDesc_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, IconSize) == 0x000300, "Member 'UWBP_IconTwoTextDesc_C::IconSize' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, IconShear) == 0x000310, "Member 'UWBP_IconTwoTextDesc_C::IconShear' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, IconAngle) == 0x000320, "Member 'UWBP_IconTwoTextDesc_C::IconAngle' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, IconColor) == 0x000324, "Member 'UWBP_IconTwoTextDesc_C::IconColor' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, PrimaryText) == 0x000338, "Member 'UWBP_IconTwoTextDesc_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, SecondaryText) == 0x000350, "Member 'UWBP_IconTwoTextDesc_C::SecondaryText' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, IconToTextSpacing) == 0x000368, "Member 'UWBP_IconTwoTextDesc_C::IconToTextSpacing' has a wrong offset!");
static_assert(offsetof(UWBP_IconTwoTextDesc_C, SecondaryTextColor) == 0x000370, "Member 'UWBP_IconTwoTextDesc_C::SecondaryTextColor' has a wrong offset!");

}

