#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SubcategoryCarouselButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WBP_UIKit_Button_Selectable_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SubcategoryCarouselButton.WBP_SubcategoryCarouselButton_C
// 0x00B0 (0x18E0 - 0x1830)
class UWBP_SubcategoryCarouselButton_C final : public UWBP_UIKit_Button_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SubcategoryCarouselButton_C;    // 0x1830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_UnSelected;                                   // 0x1838(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_IsSelected;                                   // 0x1840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x1848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBackGround;                                    // 0x1850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Outline_C*             WBP_UIKit_Block_Outline;                           // 0x1858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FontOutline;                                       // 0x1860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         TabFont;                                           // 0x1868(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      TabFontMaterial;                                   // 0x18C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   TabLabel;                                          // 0x18C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_SubcategoryCarouselButton(int32 EntryPoint);
	void PlaySelectAnim();
	void PreConstruct(bool IsDesignTime);
	void Set_Tab_Text(const class FText& Text_0);
	void SetBangType(EFortBangType EBangType);
	void SetFontOutline(double NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SubcategoryCarouselButton_C">();
	}
	static class UWBP_SubcategoryCarouselButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SubcategoryCarouselButton_C>();
	}
};
static_assert(alignof(UWBP_SubcategoryCarouselButton_C) == 0x000010, "Wrong alignment on UWBP_SubcategoryCarouselButton_C");
static_assert(sizeof(UWBP_SubcategoryCarouselButton_C) == 0x0018E0, "Wrong size on UWBP_SubcategoryCarouselButton_C");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, UberGraphFrame_WBP_SubcategoryCarouselButton_C) == 0x001830, "Member 'UWBP_SubcategoryCarouselButton_C::UberGraphFrame_WBP_SubcategoryCarouselButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, Anim_UnSelected) == 0x001838, "Member 'UWBP_SubcategoryCarouselButton_C::Anim_UnSelected' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, Anim_IsSelected) == 0x001840, "Member 'UWBP_SubcategoryCarouselButton_C::Anim_IsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, SizeBox) == 0x001848, "Member 'UWBP_SubcategoryCarouselButton_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, TextBackGround) == 0x001850, "Member 'UWBP_SubcategoryCarouselButton_C::TextBackGround' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, WBP_UIKit_Block_Outline) == 0x001858, "Member 'UWBP_SubcategoryCarouselButton_C::WBP_UIKit_Block_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, FontOutline) == 0x001860, "Member 'UWBP_SubcategoryCarouselButton_C::FontOutline' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, TabFont) == 0x001868, "Member 'UWBP_SubcategoryCarouselButton_C::TabFont' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, TabFontMaterial) == 0x0018C0, "Member 'UWBP_SubcategoryCarouselButton_C::TabFontMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_SubcategoryCarouselButton_C, TabLabel) == 0x0018C8, "Member 'UWBP_SubcategoryCarouselButton_C::TabLabel' has a wrong offset!");

}

