#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_BackgroundTabSideNav

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C.ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav
// 0x0038 (0x0038 - 0x0000)
struct WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCornerRadiuses_CornerRadius_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav) == 0x000008, "Wrong alignment on WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav");
static_assert(sizeof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav) == 0x000038, "Wrong size on WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000020, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000021, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_GetIsSelected_IsSelected) == 0x000022, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_GetIsSelected_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, K2Node_Event_IsDesignTime) == 0x000023, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000028, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav, CallFunc_SetCornerRadiuses_CornerRadius_ImplicitCast) == 0x000030, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav::CallFunc_SetCornerRadiuses_CornerRadius_ImplicitCast' has a wrong offset!");

// Function WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C.SetBackgroundMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial");
static_assert(sizeof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial) == 0x000010, "Wrong size on WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial::Material_Instance' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetBackgroundMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C.SetCornerRadiuses
// 0x0030 (0x0030 - 0x0000)
struct WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses final
{
public:
	float                                         CornerRadius_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RadiusInPixels_0;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CornerRadius_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses) == 0x000008, "Wrong alignment on WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses");
static_assert(sizeof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses) == 0x000030, "Wrong size on WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, CornerRadius_0) == 0x000000, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::CornerRadius_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, RadiusInPixels_0) == 0x000004, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::RadiusInPixels_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, K2Node_VariableSet_CornerRadius_ImplicitCast) == 0x000020, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::K2Node_VariableSet_CornerRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00002C, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetCornerRadiuses::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C.SetOutlineMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial");
static_assert(sizeof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial) == 0x000010, "Wrong size on WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial::Material_Instance' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Block_BackgroundTabSideNav_C_SetOutlineMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

