#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CategoryTile

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CategoryTile.WBP_CategoryTile_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CategoryTile_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryTile_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_CategoryTile_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_CategoryTile_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_CategoryTile_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_CategoryTile_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_CategoryTile_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_CategoryTile.WBP_CategoryTile_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CategoryTile_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryTile_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_CategoryTile_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_CategoryTile_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_CategoryTile_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_CategoryTile_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_CategoryTile_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_CategoryTile.WBP_CategoryTile_C.ExecuteUbergraph_WBP_CategoryTile
// 0x0090 (0x0090 - 0x0000)
struct WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* ActivatableWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_ActivatableWidget;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActivityCategoryPageView_VM_C*         K2Node_DynamicCast_AsActivity_Category_Page_View_VM; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortActivityViewModel*                 K2Node_DynamicCast_AsDiscover_Activity_View_Model; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_PushPrimaryContent*    CallFunc_PushPrimaryContentClassAsync_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0050(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetReferenceSurfaceName_ReturnValue;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetReferencePanelName_ReturnValue;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile) == 0x000008, "Wrong alignment on WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile");
static_assert(sizeof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile) == 0x000090, "Wrong size on WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, EntryPoint) == 0x000000, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_CustomEvent_ActivatableWidget) == 0x000010, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_CustomEvent_ActivatableWidget' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, Temp_object_Variable) == 0x000018, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_DynamicCast_AsActivity_Category_Page_View_VM) == 0x000020, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_DynamicCast_AsActivity_Category_Page_View_VM' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_Event_bIsSelected) == 0x000029, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_Event_bIsExpanded) == 0x00002A, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_Event_ListItemObject) == 0x000030, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_DynamicCast_AsDiscover_Activity_View_Model) == 0x000038, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_DynamicCast_AsDiscover_Activity_View_Model' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_PushPrimaryContentClassAsync_ReturnValue) == 0x000048, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_PushPrimaryContentClassAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_GetDisplayName_ReturnValue) == 0x000050, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_GetReferenceSurfaceName_ReturnValue) == 0x00006C, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_GetReferenceSurfaceName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_GetReferencePanelName_ReturnValue) == 0x000070, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_GetReferencePanelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000078, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000088, "Member 'WBP_CategoryTile_C_ExecuteUbergraph_WBP_CategoryTile::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");

// Function WBP_CategoryTile.WBP_CategoryTile_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_CategoryTile_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryTile_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_CategoryTile_C_OnListItemObjectSet");
static_assert(sizeof(WBP_CategoryTile_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_CategoryTile_C_OnListItemObjectSet");
static_assert(offsetof(WBP_CategoryTile_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_CategoryTile_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_CategoryTile.WBP_CategoryTile_C.OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7
// 0x0008 (0x0008 - 0x0000)
struct WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7 final
{
public:
	class UCommonActivatableWidget*               ActivatableWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7) == 0x000008, "Wrong alignment on WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7");
static_assert(sizeof(WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7) == 0x000008, "Wrong size on WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7");
static_assert(offsetof(WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7, ActivatableWidget) == 0x000000, "Member 'WBP_CategoryTile_C_OnPrimaryContentPushed_E44531CF45620B12E753548D2E7E69C7::ActivatableWidget' has a wrong offset!");

// Function WBP_CategoryTile.WBP_CategoryTile_C.SetFortActivityViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_CategoryTile_C_SetFortActivityViewModel final
{
public:
	class UFortActivityViewModel*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CategoryTile_C_SetFortActivityViewModel) == 0x000008, "Wrong alignment on WBP_CategoryTile_C_SetFortActivityViewModel");
static_assert(sizeof(WBP_CategoryTile_C_SetFortActivityViewModel) == 0x000028, "Wrong size on WBP_CategoryTile_C_SetFortActivityViewModel");
static_assert(offsetof(WBP_CategoryTile_C_SetFortActivityViewModel, ViewModel) == 0x000000, "Member 'WBP_CategoryTile_C_SetFortActivityViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_SetFortActivityViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_CategoryTile_C_SetFortActivityViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_SetFortActivityViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_CategoryTile_C_SetFortActivityViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_CategoryTile_C_SetFortActivityViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_CategoryTile_C_SetFortActivityViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_CategoryTile.WBP_CategoryTile_C.Update Display Name
// 0x0018 (0x0018 - 0x0000)
struct WBP_CategoryTile_C_Update_Display_Name final
{
public:
	class FText                                   In_Display_Name;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CategoryTile_C_Update_Display_Name) == 0x000008, "Wrong alignment on WBP_CategoryTile_C_Update_Display_Name");
static_assert(sizeof(WBP_CategoryTile_C_Update_Display_Name) == 0x000018, "Wrong size on WBP_CategoryTile_C_Update_Display_Name");
static_assert(offsetof(WBP_CategoryTile_C_Update_Display_Name, In_Display_Name) == 0x000000, "Member 'WBP_CategoryTile_C_Update_Display_Name::In_Display_Name' has a wrong offset!");

}

