#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Sparks_Dbg_Cosmetic_Group

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C.BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C.ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group
// 0x000C (0x000C - 0x0000)
struct WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group) == 0x000004, "Wrong alignment on WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group");
static_assert(sizeof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group) == 0x00000C, "Wrong size on WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group, EntryPoint) == 0x000000, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group, Temp_bool_Variable) == 0x000004, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group, Temp_byte_Variable) == 0x000005, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group, K2Node_ComponentBoundEvent_bIsChecked) == 0x000007, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group, K2Node_Select_Default) == 0x000008, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C.OnChoiceChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged final
{
public:
	ESparksInstrumentType                         Instrument;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Sparks_Dbg_CosmeticItem_C*         CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged) == 0x000008, "Wrong alignment on WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged");
static_assert(sizeof(WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged) == 0x000018, "Wrong size on WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged, Instrument) == 0x000000, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged::Instrument' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_OnChoiceChanged::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C.RefreshAll
// 0x0038 (0x0038 - 0x0000)
struct WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Sparks_Dbg_CosmeticItem_C*         CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll) == 0x000008, "Wrong alignment on WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll");
static_assert(sizeof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll) == 0x000038, "Wrong size on WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, Temp_int_Variable) == 0x000000, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, Temp_int_Variable_1) == 0x000004, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000011, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000012, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, K2Node_SwitchEnum_CmpSuccess) == 0x000013, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, K2Node_SwitchEnum_CmpSuccess_1) == 0x000018, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_MakeLiteralInt_ReturnValue) == 0x000030, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_RefreshAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C.SetGroupSubtype
// 0x0040 (0x0040 - 0x0000)
struct WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype final
{
public:
	ESparksAccountItemSubtype                     ItemType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype) == 0x000008, "Wrong alignment on WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype");
static_assert(sizeof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype) == 0x000040, "Wrong size on WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype, ItemType) == 0x000000, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetGroupSubtype::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C.SetItemInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo final
{
public:
	class USparksAccountItemDefinition*           NewItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESparksInstrumentType                         CallFunc_GetInstrumentType_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Sparks_Dbg_CosmeticItem_C*         CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo) == 0x000008, "Wrong alignment on WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo");
static_assert(sizeof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo) == 0x000020, "Wrong size on WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo, NewItem) == 0x000000, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo, CallFunc_GetInstrumentType_ReturnValue) == 0x000009, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo::CallFunc_GetInstrumentType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_Sparks_Dbg_Cosmetic_Group_C_SetItemInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

