#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LockerEmptyWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_LockerEmptyWarning.WBP_LockerEmptyWarning_C.ExecuteUbergraph_WBP_LockerEmptyWarning
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
};
static_assert(alignof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning) == 0x000008, "Wrong alignment on WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning");
static_assert(sizeof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning) == 0x0000D0, "Wrong size on WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning");
static_assert(offsetof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning, EntryPoint) == 0x000000, "Member 'WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_LockerEmptyWarning_C_ExecuteUbergraph_WBP_LockerEmptyWarning::CallFunc_Format_ReturnValue' has a wrong offset!");

}

