#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SearchBar_Block_Background

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SearchBar_Block_Background.WBP_SearchBar_Block_Background_C.ExecuteUbergraph_WBP_SearchBar_Block_Background
// 0x000C (0x000C - 0x0000)
struct WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_IsSelected;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable_1;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable_2;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelectable_IsSelectable_3;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background) == 0x000004, "Wrong alignment on WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background");
static_assert(sizeof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background) == 0x00000C, "Wrong size on WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, EntryPoint) == 0x000000, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, CallFunc_GetIsSelected_IsSelected) == 0x000004, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::CallFunc_GetIsSelected_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, CallFunc_GetIsSelectable_IsSelectable) == 0x000005, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::CallFunc_GetIsSelectable_IsSelectable' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, CallFunc_GetIsSelectable_IsSelectable_1) == 0x000006, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::CallFunc_GetIsSelectable_IsSelectable_1' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, CallFunc_GetIsSelectable_IsSelectable_2) == 0x000007, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::CallFunc_GetIsSelectable_IsSelectable_2' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, CallFunc_GetIsSelectable_IsSelectable_3) == 0x000008, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::CallFunc_GetIsSelectable_IsSelectable_3' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background, K2Node_Event_IsDesignTime) == 0x000009, "Member 'WBP_SearchBar_Block_Background_C_ExecuteUbergraph_WBP_SearchBar_Block_Background::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_SearchBar_Block_Background.WBP_SearchBar_Block_Background_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SearchBar_Block_Background_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBar_Block_Background_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SearchBar_Block_Background_C_PreConstruct");
static_assert(sizeof(WBP_SearchBar_Block_Background_C_PreConstruct) == 0x000001, "Wrong size on WBP_SearchBar_Block_Background_C_PreConstruct");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SearchBar_Block_Background_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SearchBar_Block_Background.WBP_SearchBar_Block_Background_C.SetBackgroundBrush
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_SearchBar_Block_Background_C_SetBackgroundBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBar_Block_Background_C_SetBackgroundBrush) == 0x000010, "Wrong alignment on WBP_SearchBar_Block_Background_C_SetBackgroundBrush");
static_assert(sizeof(WBP_SearchBar_Block_Background_C_SetBackgroundBrush) == 0x0000D0, "Wrong size on WBP_SearchBar_Block_Background_C_SetBackgroundBrush");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetBackgroundBrush, InBrush) == 0x000000, "Member 'WBP_SearchBar_Block_Background_C_SetBackgroundBrush::InBrush' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetBackgroundBrush, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C0, "Member 'WBP_SearchBar_Block_Background_C_SetBackgroundBrush::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_SearchBar_Block_Background.WBP_SearchBar_Block_Background_C.SetBackgroundMaterial
// 0x0010 (0x0010 - 0x0000)
struct WBP_SearchBar_Block_Background_C_SetBackgroundMaterial final
{
public:
	const class UMaterialInstance*                Material_Instance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBar_Block_Background_C_SetBackgroundMaterial) == 0x000008, "Wrong alignment on WBP_SearchBar_Block_Background_C_SetBackgroundMaterial");
static_assert(sizeof(WBP_SearchBar_Block_Background_C_SetBackgroundMaterial) == 0x000010, "Wrong size on WBP_SearchBar_Block_Background_C_SetBackgroundMaterial");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetBackgroundMaterial, Material_Instance) == 0x000000, "Member 'WBP_SearchBar_Block_Background_C_SetBackgroundMaterial::Material_Instance' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetBackgroundMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_SearchBar_Block_Background_C_SetBackgroundMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_SearchBar_Block_Background.WBP_SearchBar_Block_Background_C.SetCornerRadius
// 0x0020 (0x0020 - 0x0000)
struct WBP_SearchBar_Block_Background_C_SetCornerRadius final
{
public:
	bool                                          Radius_in_Pixels;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CornerRadiusValue;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBar_Block_Background_C_SetCornerRadius) == 0x000008, "Wrong alignment on WBP_SearchBar_Block_Background_C_SetCornerRadius");
static_assert(sizeof(WBP_SearchBar_Block_Background_C_SetCornerRadius) == 0x000020, "Wrong size on WBP_SearchBar_Block_Background_C_SetCornerRadius");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetCornerRadius, Radius_in_Pixels) == 0x000000, "Member 'WBP_SearchBar_Block_Background_C_SetCornerRadius::Radius_in_Pixels' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetCornerRadius, CornerRadiusValue) == 0x000008, "Member 'WBP_SearchBar_Block_Background_C_SetCornerRadius::CornerRadiusValue' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetCornerRadius, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000010, "Member 'WBP_SearchBar_Block_Background_C_SetCornerRadius::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetCornerRadius, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_SearchBar_Block_Background_C_SetCornerRadius::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SearchBar_Block_Background_C_SetCornerRadius, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00001C, "Member 'WBP_SearchBar_Block_Background_C_SetCornerRadius::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

}

