#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPItemShop_SectionNavigatorEnhanced

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPItemShop_SectionNavigatorEnhanced.WBP_MPItemShop_SectionNavigatorEnhanced_C
// 0x00B8 (0x0378 - 0x02C0)
class UWBP_MPItemShop_SectionNavigatorEnhanced_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemShopVM*                        FortItemShopVM;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Collapse;                                          // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Hitbox;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Generic_C*            Button_OpenNav_PromptBelowNav;                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_All;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Tabs_Categories_C*           TabsCategories;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCollapsed;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIKitTabGroupCategoriesViewModel*      TabGroupCategoriesViewModel;                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItemShopSectionVM*>         SectionsViewModels;                                // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnSectionNavigatorFocused;                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IgnoreNextLayoutUpdate;                            // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSectionNavigatorUnfocused;                       // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IgnoreHoverUntilUnhover;                           // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelectionLocked;                                 // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             NavScrollSound;                                    // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIKitTabGroupCategoryViewModel*> TabCategoriesViewModels;                           // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IgnoreInitialSectionSelection;                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ShopIntroWhooshSound;                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnalyticsSectionInteracted(struct FFortItemShopLayout& NewFeaturedLayout);
	void BndEvt__WBP_MPItemShop_SectionNavigator_Button_Hitbox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_SectionNavigator_Button_Hitbox_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MPItemShop_SectionNavigator_Button_Open_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void CheckIsHovered(bool* IsHovered_0);
	void Clear3DPreview();
	void Construct();
	void CreateCategoryVM(class UFortItemShopSectionVM* SectionVM, class UUIKitTabGroupCategoryViewModel** CategoryVM);
	void CreateTabBindings();
	void ExecuteUbergraph_WBP_MPItemShop_SectionNavigatorEnhanced(int32 EntryPoint);
	void FocusSelectedCategory();
	void ForceSetFocus();
	void GenerateTabsFromSections(TArray<class UFortItemShopSectionVM*>& SectionViewModels);
	void GetSectionAtIndex(int32 Index_0, class UFortItemShopSectionVM** Output);
	void GetTabIndexFromFeaturedLayout(const class FString& SectionId, int32* Index_0);
	void HandleCategorySelectionChanged(class FName CategoryID, class FName TabID);
	bool IsQuickNavCollapsible();
	void On_Featured_Layout_Updated(const struct FFortItemShopLayout& NewLayout);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnCategoryClicked(class UCommonButtonBase* Button, class FName CategoryID, bool IsCategoryExpanded, class UUIKitTabGroupCategoryViewModel* CategoryVM);
	void OnCategorySelectionChanged(class FName CategoryID, class FName TabID);
	void OnCategoryTabClicked(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SelectSection(const class FString& SectionId);
	void SetFortItemShopVM(class UFortItemShopVM* ViewModel);
	void SetIsCollapsed(bool ShouldCollapse);
	void SetTabButtonsCollapsedState(bool ShouldCollapse);
	void TryCollapseSection(const class FString& SectionId);
	void Update_Featured_Layout(const class FString& SectionId);

	void GetCategoryVM(class UFortItemShopSectionVM* SectionVM, class UUIKitTabGroupCategoryViewModel** CategoryVM) const;
	void GetSectionButton(const class FString& SectionId, class UCommonButtonBase** Button) const;
	void GetSectionViewModelByID(const class FString& SectionId, class UFortItemShopSectionVM** SectionVM) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPItemShop_SectionNavigatorEnhanced_C">();
	}
	static class UWBP_MPItemShop_SectionNavigatorEnhanced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPItemShop_SectionNavigatorEnhanced_C>();
	}
};
static_assert(alignof(UWBP_MPItemShop_SectionNavigatorEnhanced_C) == 0x000008, "Wrong alignment on UWBP_MPItemShop_SectionNavigatorEnhanced_C");
static_assert(sizeof(UWBP_MPItemShop_SectionNavigatorEnhanced_C) == 0x000378, "Wrong size on UWBP_MPItemShop_SectionNavigatorEnhanced_C");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, FortItemShopVM) == 0x0002C8, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::FortItemShopVM' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, Collapse) == 0x0002D0, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::Collapse' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, Border) == 0x0002D8, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, Button_Hitbox) == 0x0002E0, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::Button_Hitbox' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, Button_OpenNav_PromptBelowNav) == 0x0002E8, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::Button_OpenNav_PromptBelowNav' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, SizeBox_All) == 0x0002F0, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::SizeBox_All' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, TabsCategories) == 0x0002F8, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::TabsCategories' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, IsCollapsed) == 0x000300, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::IsCollapsed' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, TabGroupCategoriesViewModel) == 0x000308, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::TabGroupCategoriesViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, SectionsViewModels) == 0x000310, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::SectionsViewModels' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, OnSectionNavigatorFocused) == 0x000320, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::OnSectionNavigatorFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, IgnoreNextLayoutUpdate) == 0x000330, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::IgnoreNextLayoutUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, OnSectionNavigatorUnfocused) == 0x000338, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::OnSectionNavigatorUnfocused' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, IgnoreHoverUntilUnhover) == 0x000348, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::IgnoreHoverUntilUnhover' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, IsSelectionLocked) == 0x000349, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::IsSelectionLocked' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, NavScrollSound) == 0x000350, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::NavScrollSound' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, TabCategoriesViewModels) == 0x000358, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::TabCategoriesViewModels' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, IgnoreInitialSectionSelection) == 0x000368, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::IgnoreInitialSectionSelection' has a wrong offset!");
static_assert(offsetof(UWBP_MPItemShop_SectionNavigatorEnhanced_C, ShopIntroWhooshSound) == 0x000370, "Member 'UWBP_MPItemShop_SectionNavigatorEnhanced_C::ShopIntroWhooshSound' has a wrong offset!");

}

