#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PriceSwitcher_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_PriceSwitcherState_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PriceSwitcher_Base.WBP_PriceSwitcher_Base_C
// 0x0310 (0x05D0 - 0x02C0)
class UWBP_PriceSwitcher_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_PriceContainer;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Currency;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Strike;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_RegularPrice;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayStationStoreLogo;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_PriceStateSwitcher;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_498;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_BottomInfo;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SwitcherState_NotOwned;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SwitcherState_Owned;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SwitcherState_SubscriptionInfo;                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Owned;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Price;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RegularPrice;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SubInfo;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OwnedText;                                         // 0x0350(0x0018)(Edit, BlueprintVisible)
	E_PriceSwitcherState                          PreviewPriceState;                                 // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewPrice;                                      // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewRegularPrice;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopCurrency                             PreviewCurrency;                                   // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             VBucksIcon;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrencyImageSize;                                 // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             RealMoneyIcon;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewPlayStationPlatform;                        // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         PriceTextFont;                                     // 0x03A0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          SuppressStrikethrough;                             // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         OwnedTextFont;                                     // 0x0400(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         RegularPriceTextFont;                              // 0x0458(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         SpecialOfferTextFont;                              // 0x04B0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector2D                              DefaultCurrencyImageScale;                         // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MobileCurrencyImageScale;                          // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewMobileState;                                // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StrikeLineRotateAngle;                             // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetHeight;                                      // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     StrikeLineMaterial;                                // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                DefaultPricePadding;                               // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                MobilePricePadding;                                // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   SubscriptionDefaultStatusText;                     // 0x0568(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SubscriptionActiveStatusText;                      // 0x0580(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SubscriptionPaymentErrorStatusText;                // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMargin                                DefaultRegularPricePadding;                        // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                MobileRegularPricePadding;                         // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PriceSwitcher_Base(int32 EntryPoint);
	void FlipHorizontalBoxLayout();
	void InitializeWidget();
	void OnHovered();
	void OnUnhovered();
	void PreConstruct(bool IsDesignTime);
	void SetCurrency(EItemShopCurrency Currency);
	void SetMobileState(bool InMobileState);
	void SetPrice(const class FText& Price);
	void SetRegularPrice(const class FText& Price);
	void SetStrikethroughPriceVisibility(ESlateVisibility Visibility_0);
	void SetSubInfoText(const class FText& SubInfoText);
	void SetSwitcherState(E_PriceSwitcherState PriceState);
	bool ShouldShowPSLogo(EItemShopCurrency Currency);

	void GetPriceInfoState(bool IsOwned, bool IsSubscriptionOffer, bool IsProgressiveCosmetic, E_PriceSwitcherState* SwitcherState) const;
	void GetStrikethroughPriceVisibility(int32 Price, int32 OriginalPrice, bool SuppressStrikethrough_0, ESlateVisibility* StrikethroughPriceVisibility) const;
	void GetSubInfoText(EMcpSubscriptionState SubscriptionState, bool IsSubscription, class FText* SubInfoText) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PriceSwitcher_Base_C">();
	}
	static class UWBP_PriceSwitcher_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PriceSwitcher_Base_C>();
	}
};
static_assert(alignof(UWBP_PriceSwitcher_Base_C) == 0x000008, "Wrong alignment on UWBP_PriceSwitcher_Base_C");
static_assert(sizeof(UWBP_PriceSwitcher_Base_C) == 0x0005D0, "Wrong size on UWBP_PriceSwitcher_Base_C");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PriceSwitcher_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Hover) == 0x0002C8, "Member 'UWBP_PriceSwitcher_Base_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, HB_PriceContainer) == 0x0002D0, "Member 'UWBP_PriceSwitcher_Base_C::HB_PriceContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Image_Currency) == 0x0002D8, "Member 'UWBP_PriceSwitcher_Base_C::Image_Currency' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Image_Strike) == 0x0002E0, "Member 'UWBP_PriceSwitcher_Base_C::Image_Strike' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Overlay_RegularPrice) == 0x0002E8, "Member 'UWBP_PriceSwitcher_Base_C::Overlay_RegularPrice' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PlayStationStoreLogo) == 0x0002F0, "Member 'UWBP_PriceSwitcher_Base_C::PlayStationStoreLogo' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SizeBox_PriceStateSwitcher) == 0x0002F8, "Member 'UWBP_PriceSwitcher_Base_C::SizeBox_PriceStateSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Spacer) == 0x000300, "Member 'UWBP_PriceSwitcher_Base_C::Spacer' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Spacer_498) == 0x000308, "Member 'UWBP_PriceSwitcher_Base_C::Spacer_498' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Switcher_BottomInfo) == 0x000310, "Member 'UWBP_PriceSwitcher_Base_C::Switcher_BottomInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SwitcherState_NotOwned) == 0x000318, "Member 'UWBP_PriceSwitcher_Base_C::SwitcherState_NotOwned' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SwitcherState_Owned) == 0x000320, "Member 'UWBP_PriceSwitcher_Base_C::SwitcherState_Owned' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SwitcherState_SubscriptionInfo) == 0x000328, "Member 'UWBP_PriceSwitcher_Base_C::SwitcherState_SubscriptionInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Text_Owned) == 0x000330, "Member 'UWBP_PriceSwitcher_Base_C::Text_Owned' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Text_Price) == 0x000338, "Member 'UWBP_PriceSwitcher_Base_C::Text_Price' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Text_RegularPrice) == 0x000340, "Member 'UWBP_PriceSwitcher_Base_C::Text_RegularPrice' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, Text_SubInfo) == 0x000348, "Member 'UWBP_PriceSwitcher_Base_C::Text_SubInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, OwnedText) == 0x000350, "Member 'UWBP_PriceSwitcher_Base_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PreviewPriceState) == 0x000368, "Member 'UWBP_PriceSwitcher_Base_C::PreviewPriceState' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PreviewPrice) == 0x00036C, "Member 'UWBP_PriceSwitcher_Base_C::PreviewPrice' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PreviewRegularPrice) == 0x000370, "Member 'UWBP_PriceSwitcher_Base_C::PreviewRegularPrice' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PreviewCurrency) == 0x000374, "Member 'UWBP_PriceSwitcher_Base_C::PreviewCurrency' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, VBucksIcon) == 0x000378, "Member 'UWBP_PriceSwitcher_Base_C::VBucksIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, CurrencyImageSize) == 0x000380, "Member 'UWBP_PriceSwitcher_Base_C::CurrencyImageSize' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, RealMoneyIcon) == 0x000390, "Member 'UWBP_PriceSwitcher_Base_C::RealMoneyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PreviewPlayStationPlatform) == 0x000398, "Member 'UWBP_PriceSwitcher_Base_C::PreviewPlayStationPlatform' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PriceTextFont) == 0x0003A0, "Member 'UWBP_PriceSwitcher_Base_C::PriceTextFont' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SuppressStrikethrough) == 0x0003F8, "Member 'UWBP_PriceSwitcher_Base_C::SuppressStrikethrough' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, OwnedTextFont) == 0x000400, "Member 'UWBP_PriceSwitcher_Base_C::OwnedTextFont' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, RegularPriceTextFont) == 0x000458, "Member 'UWBP_PriceSwitcher_Base_C::RegularPriceTextFont' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SpecialOfferTextFont) == 0x0004B0, "Member 'UWBP_PriceSwitcher_Base_C::SpecialOfferTextFont' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, DefaultCurrencyImageScale) == 0x000508, "Member 'UWBP_PriceSwitcher_Base_C::DefaultCurrencyImageScale' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, MobileCurrencyImageScale) == 0x000518, "Member 'UWBP_PriceSwitcher_Base_C::MobileCurrencyImageScale' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, PreviewMobileState) == 0x000528, "Member 'UWBP_PriceSwitcher_Base_C::PreviewMobileState' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, StrikeLineRotateAngle) == 0x000530, "Member 'UWBP_PriceSwitcher_Base_C::StrikeLineRotateAngle' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, WidgetHeight) == 0x000538, "Member 'UWBP_PriceSwitcher_Base_C::WidgetHeight' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, StrikeLineMaterial) == 0x000540, "Member 'UWBP_PriceSwitcher_Base_C::StrikeLineMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, DefaultPricePadding) == 0x000548, "Member 'UWBP_PriceSwitcher_Base_C::DefaultPricePadding' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, MobilePricePadding) == 0x000558, "Member 'UWBP_PriceSwitcher_Base_C::MobilePricePadding' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SubscriptionDefaultStatusText) == 0x000568, "Member 'UWBP_PriceSwitcher_Base_C::SubscriptionDefaultStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SubscriptionActiveStatusText) == 0x000580, "Member 'UWBP_PriceSwitcher_Base_C::SubscriptionActiveStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, SubscriptionPaymentErrorStatusText) == 0x000598, "Member 'UWBP_PriceSwitcher_Base_C::SubscriptionPaymentErrorStatusText' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, DefaultRegularPricePadding) == 0x0005B0, "Member 'UWBP_PriceSwitcher_Base_C::DefaultRegularPricePadding' has a wrong offset!");
static_assert(offsetof(UWBP_PriceSwitcher_Base_C, MobileRegularPricePadding) == 0x0005C0, "Member 'UWBP_PriceSwitcher_Base_C::MobileRegularPricePadding' has a wrong offset!");

}

