#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPLocker_Heading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MPLocker_Heading.WBP_MPLocker_Heading_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_MPLocker_Heading_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_Header;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SubHeader;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Show_Sub_Heading_;                                 // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MPLocker_Heading(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void PresetForDesignTime();
	void SetHeader(const class FText& Text);
	void SetSubHeader(const class FText& Text);
	void SetSubHeadingVisibility(bool ShowSubHeading_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MPLocker_Heading_C">();
	}
	static class UWBP_MPLocker_Heading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MPLocker_Heading_C>();
	}
};
static_assert(alignof(UWBP_MPLocker_Heading_C) == 0x000008, "Wrong alignment on UWBP_MPLocker_Heading_C");
static_assert(sizeof(UWBP_MPLocker_Heading_C) == 0x0002E0, "Wrong size on UWBP_MPLocker_Heading_C");
static_assert(offsetof(UWBP_MPLocker_Heading_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_MPLocker_Heading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Heading_C, Text_Header) == 0x0002C8, "Member 'UWBP_MPLocker_Heading_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Heading_C, Text_SubHeader) == 0x0002D0, "Member 'UWBP_MPLocker_Heading_C::Text_SubHeader' has a wrong offset!");
static_assert(offsetof(UWBP_MPLocker_Heading_C, Show_Sub_Heading_) == 0x0002D8, "Member 'UWBP_MPLocker_Heading_C::Show_Sub_Heading_' has a wrong offset!");

}

