#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AugmentSelector_Reroll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerAugmentsUI_classes.hpp"
#include "UMG_structs.hpp"
#include "PlayerAugmentsCodeRuntime_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AugmentSelector_Reroll.WBP_AugmentSelector_Reroll_C
// 0x0050 (0x0388 - 0x0338)
class UWBP_AugmentSelector_Reroll_C final : public UFortPlayerAugmentHUDRerollWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Reroll;                                       // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortTouchUserWidget*                   FortTouchUserWidget;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       Keybind_RerollAction;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AlertIcon;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NotEnoughCurrency;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RerollText;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Cost;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_RerollAction;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Alert;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void DisplayAlert(bool InDisplayAlert);
	void ExecuteUbergraph_WBP_AugmentSelector_Reroll(int32 EntryPoint);
	void OnAugmentHoldRerollChanged(EAugmentHoldInputRerollState HoldState, float HoldDurationSeconds);
	void OnInitialized();
	void OnRerollAugments();
	void OnUpdateCurrency(const int32 OwnedCurrency, const int32 RerollCost);
	void PreConstruct(bool IsDesignTime);
	void UpdateRerollInfo(int32 OwnedCurrency, int32 AugmentCost);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AugmentSelector_Reroll_C">();
	}
	static class UWBP_AugmentSelector_Reroll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AugmentSelector_Reroll_C>();
	}
};
static_assert(alignof(UWBP_AugmentSelector_Reroll_C) == 0x000008, "Wrong alignment on UWBP_AugmentSelector_Reroll_C");
static_assert(sizeof(UWBP_AugmentSelector_Reroll_C) == 0x000388, "Wrong size on UWBP_AugmentSelector_Reroll_C");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, UberGraphFrame) == 0x000338, "Member 'UWBP_AugmentSelector_Reroll_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Anim_Reroll) == 0x000340, "Member 'UWBP_AugmentSelector_Reroll_C::Anim_Reroll' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, FortTouchUserWidget) == 0x000348, "Member 'UWBP_AugmentSelector_Reroll_C::FortTouchUserWidget' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Keybind_RerollAction) == 0x000350, "Member 'UWBP_AugmentSelector_Reroll_C::Keybind_RerollAction' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Overlay_AlertIcon) == 0x000358, "Member 'UWBP_AugmentSelector_Reroll_C::Overlay_AlertIcon' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Overlay_NotEnoughCurrency) == 0x000360, "Member 'UWBP_AugmentSelector_Reroll_C::Overlay_NotEnoughCurrency' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, RerollText) == 0x000368, "Member 'UWBP_AugmentSelector_Reroll_C::RerollText' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Switcher_Cost) == 0x000370, "Member 'UWBP_AugmentSelector_Reroll_C::Switcher_Cost' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Switcher_RerollAction) == 0x000378, "Member 'UWBP_AugmentSelector_Reroll_C::Switcher_RerollAction' has a wrong offset!");
static_assert(offsetof(UWBP_AugmentSelector_Reroll_C, Text_Alert) == 0x000380, "Member 'UWBP_AugmentSelector_Reroll_C::Text_Alert' has a wrong offset!");

}

