#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UpsellFrame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_UpsellFrame_C_BndEvt__WBP_UpsellFrame_Button_Prompt_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.ExecuteUbergraph_WBP_UpsellFrame
// 0x0108 (0x0108 - 0x0000)
struct WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_HeaderText;                           // 0x0010(0x0018)(ConstParm)
	class FText                                   K2Node_Event_BodyText;                             // 0x0028(0x0018)(ConstParm)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         K2Node_Event_LoadedTexture;                        // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_shrink;                         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPremiumTrackOwned_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame) == 0x000008, "Wrong alignment on WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame");
static_assert(sizeof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame) == 0x000108, "Wrong size on WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, EntryPoint) == 0x000000, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_Event_HeaderText) == 0x000010, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_Event_HeaderText' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_Event_BodyText) == 0x000028, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_Event_BodyText' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, Temp_byte_Variable) == 0x000040, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_Event_LoadedTexture) == 0x000048, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_Event_LoadedTexture' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, Temp_byte_Variable_1) == 0x000050, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_Event_IsDesignTime) == 0x000051, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_CustomEvent_shrink) == 0x000052, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_CustomEvent_shrink' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_ComponentBoundEvent_Button_1) == 0x000058, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_IsPremiumTrackOwned_ReturnValue) == 0x000068, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_IsPremiumTrackOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000070, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000088, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000098, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000A0, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, Temp_bool_Variable) == 0x0000A8, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, K2Node_Select_Default) == 0x0000A9, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_BreakVector2D_X) == 0x0000B0, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_BreakVector2D_Y) == 0x0000B8, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_BreakVector2D_X_1) == 0x0000D0, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_BreakVector2D_Y_1) == 0x0000D8, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000F8, "Member 'WBP_UpsellFrame_C_ExecuteUbergraph_WBP_UpsellFrame::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.Grow_ConnectionLine
// 0x0001 (0x0001 - 0x0000)
struct WBP_UpsellFrame_C_Grow_ConnectionLine final
{
public:
	bool                                          Shrink;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UpsellFrame_C_Grow_ConnectionLine) == 0x000001, "Wrong alignment on WBP_UpsellFrame_C_Grow_ConnectionLine");
static_assert(sizeof(WBP_UpsellFrame_C_Grow_ConnectionLine) == 0x000001, "Wrong size on WBP_UpsellFrame_C_Grow_ConnectionLine");
static_assert(offsetof(WBP_UpsellFrame_C_Grow_ConnectionLine, Shrink) == 0x000000, "Member 'WBP_UpsellFrame_C_Grow_ConnectionLine::Shrink' has a wrong offset!");

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.OnIconLoaded
// 0x0008 (0x0008 - 0x0000)
struct WBP_UpsellFrame_C_OnIconLoaded final
{
public:
	const class UTexture*                         LoadedTexture;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UpsellFrame_C_OnIconLoaded) == 0x000008, "Wrong alignment on WBP_UpsellFrame_C_OnIconLoaded");
static_assert(sizeof(WBP_UpsellFrame_C_OnIconLoaded) == 0x000008, "Wrong size on WBP_UpsellFrame_C_OnIconLoaded");
static_assert(offsetof(WBP_UpsellFrame_C_OnIconLoaded, LoadedTexture) == 0x000000, "Member 'WBP_UpsellFrame_C_OnIconLoaded::LoadedTexture' has a wrong offset!");

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.OnPopulateText
// 0x0030 (0x0030 - 0x0000)
struct WBP_UpsellFrame_C_OnPopulateText final
{
public:
	class FText                                   HeaderText;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   BodyText;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UpsellFrame_C_OnPopulateText) == 0x000008, "Wrong alignment on WBP_UpsellFrame_C_OnPopulateText");
static_assert(sizeof(WBP_UpsellFrame_C_OnPopulateText) == 0x000030, "Wrong size on WBP_UpsellFrame_C_OnPopulateText");
static_assert(offsetof(WBP_UpsellFrame_C_OnPopulateText, HeaderText) == 0x000000, "Member 'WBP_UpsellFrame_C_OnPopulateText::HeaderText' has a wrong offset!");
static_assert(offsetof(WBP_UpsellFrame_C_OnPopulateText, BodyText) == 0x000018, "Member 'WBP_UpsellFrame_C_OnPopulateText::BodyText' has a wrong offset!");

// Function WBP_UpsellFrame.WBP_UpsellFrame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UpsellFrame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UpsellFrame_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UpsellFrame_C_PreConstruct");
static_assert(sizeof(WBP_UpsellFrame_C_PreConstruct) == 0x000001, "Wrong size on WBP_UpsellFrame_C_PreConstruct");
static_assert(offsetof(WBP_UpsellFrame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UpsellFrame_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

