#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_Image

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Block_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_Image.WBP_UIKit_Block_Image_C
// 0x0068 (0x0360 - 0x02F8)
class UWBP_UIKit_Block_Image_C final : public UWBP_UIKit_Block_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SelectedDisabled_Transition;                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedPressed_Transition;                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedFocused_Transition;                   // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SelectedHovered_Transition;                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Selected_Transition;                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       Image;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      ImageMaterial;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Block_Image(int32 EntryPoint);
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnInstantTransitionToSelected();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionHoveredRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void OnTransitionUnhoveredRequested();
	void RefreshImageMID();
	void SetBrush(const struct FSlateBrush& InBrush);
	void SetMaterial(const class UMaterialInstance*& InMaterial);
	void SetSize(const struct FVector2D& Desired_Size);
	void SetTexture(const class UTexture2D*& InTexture);
	void SetTextureWithParameter(class FName ParameterName, const class UTexture2D*& InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_Image_C">();
	}
	static class UWBP_UIKit_Block_Image_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_Image_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Block_Image_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Block_Image_C");
static_assert(sizeof(UWBP_UIKit_Block_Image_C) == 0x000360, "Wrong size on UWBP_UIKit_Block_Image_C");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UIKit_Block_Image_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_SelectedDisabled_Transition) == 0x000300, "Member 'UWBP_UIKit_Block_Image_C::Anim_SelectedDisabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_SelectedPressed_Transition) == 0x000308, "Member 'UWBP_UIKit_Block_Image_C::Anim_SelectedPressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_SelectedFocused_Transition) == 0x000310, "Member 'UWBP_UIKit_Block_Image_C::Anim_SelectedFocused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_SelectedHovered_Transition) == 0x000318, "Member 'UWBP_UIKit_Block_Image_C::Anim_SelectedHovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_Selected_Transition) == 0x000320, "Member 'UWBP_UIKit_Block_Image_C::Anim_Selected_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_Disabled_Transition) == 0x000328, "Member 'UWBP_UIKit_Block_Image_C::Anim_Disabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_Pressed_Transition) == 0x000330, "Member 'UWBP_UIKit_Block_Image_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_Focused_Transition) == 0x000338, "Member 'UWBP_UIKit_Block_Image_C::Anim_Focused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Anim_Hovered_Transition) == 0x000340, "Member 'UWBP_UIKit_Block_Image_C::Anim_Hovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, Image) == 0x000348, "Member 'UWBP_UIKit_Block_Image_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, ImageMaterial) == 0x000350, "Member 'UWBP_UIKit_Block_Image_C::ImageMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_Image_C, ImageMID) == 0x000358, "Member 'UWBP_UIKit_Block_Image_C::ImageMID' has a wrong offset!");

}

