#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Tabs

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Tabs.WBP_UIKit_Tabs_C.ExecuteUbergraph_WBP_UIKit_Tabs
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TabNameID;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_Event_TabButton;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs");
static_assert(sizeof(WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs) == 0x000018, "Wrong size on WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs");
static_assert(offsetof(WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs, K2Node_Event_TabNameID) == 0x000004, "Member 'WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs::K2Node_Event_TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs, K2Node_Event_TabButton) == 0x000008, "Member 'WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs::K2Node_Event_TabButton' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_UIKit_Tabs_C_ExecuteUbergraph_WBP_UIKit_Tabs::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Tabs.WBP_UIKit_Tabs_C.HandleTabCreation
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Tabs_C_HandleTabCreation final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_C_HandleTabCreation) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_C_HandleTabCreation");
static_assert(sizeof(WBP_UIKit_Tabs_C_HandleTabCreation) == 0x000010, "Wrong size on WBP_UIKit_Tabs_C_HandleTabCreation");
static_assert(offsetof(WBP_UIKit_Tabs_C_HandleTabCreation, TabNameID) == 0x000000, "Member 'WBP_UIKit_Tabs_C_HandleTabCreation::TabNameID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_HandleTabCreation, TabButton) == 0x000008, "Member 'WBP_UIKit_Tabs_C_HandleTabCreation::TabButton' has a wrong offset!");

// Function WBP_UIKit_Tabs.WBP_UIKit_Tabs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Tabs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_Tabs_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_Tabs_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_Tabs_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_Tabs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_Tabs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Tabs.WBP_UIKit_Tabs_C.SetUIKitTabGroupViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel final
{
public:
	class UUIKitTabGroupViewModel*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel) == 0x000008, "Wrong alignment on WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel");
static_assert(sizeof(WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel) == 0x000028, "Wrong size on WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel");
static_assert(offsetof(WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel, ViewModel) == 0x000000, "Member 'WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_UIKit_Tabs_C_SetUIKitTabGroupViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

}

