#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Sparks_Dbg_VariantChannel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Sparks_Dbg_VariantChannel.WBP_Sparks_Dbg_VariantChannel_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_Sparks_Dbg_VariantChannel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        cb_ItemList;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_201;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       txt_Name;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Sparks_Dbg_CosmeticItem_C*         ParentItem;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ChannelTag;                                        // 0x02E8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SendUpdates;                                       // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Sparks_Dbg_VariantChannel_cb_ItemList_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void ExecuteUbergraph_WBP_Sparks_Dbg_VariantChannel(int32 EntryPoint);
	void SetNameAndChannels(const struct FGameplayTag& tag, const class FText& Channel_Name, TArray<class FString>& Options);
	void SetSelection(const class FString& Choice);
	void ShouldSendUpdates(bool ShouldSend);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Sparks_Dbg_VariantChannel_C">();
	}
	static class UWBP_Sparks_Dbg_VariantChannel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Sparks_Dbg_VariantChannel_C>();
	}
};
static_assert(alignof(UWBP_Sparks_Dbg_VariantChannel_C) == 0x000008, "Wrong alignment on UWBP_Sparks_Dbg_VariantChannel_C");
static_assert(sizeof(UWBP_Sparks_Dbg_VariantChannel_C) == 0x0002F0, "Wrong size on UWBP_Sparks_Dbg_VariantChannel_C");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, cb_ItemList) == 0x0002C8, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::cb_ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, Image_201) == 0x0002D0, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::Image_201' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, txt_Name) == 0x0002D8, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::txt_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, ParentItem) == 0x0002E0, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::ParentItem' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, ChannelTag) == 0x0002E8, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::ChannelTag' has a wrong offset!");
static_assert(offsetof(UWBP_Sparks_Dbg_VariantChannel_C, SendUpdates) == 0x0002EC, "Member 'UWBP_Sparks_Dbg_VariantChannel_C::SendUpdates' has a wrong offset!");

}

