#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_PriceSwitcher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_PriceSwitcher_Base_classes.hpp"
#include "E_PriceSwitcherState_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_PriceSwitcher.WBP_UIKit_PriceSwitcher_C
// 0x0018 (0x05E8 - 0x05D0)
class UWBP_UIKit_PriceSwitcher_C : public UWBP_PriceSwitcher_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_PriceSwitcher_C;          // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortSubscriptionVM*                    FortSubscriptionVM;                                // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItemShopOfferVM*                   FortItemShopOfferVM;                               // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_PriceSwitcher(int32 EntryPoint);
	void SetFortItemShopOfferVM(class UFortItemShopOfferVM* ViewModel);
	void SetFortSubscriptionVM(class UFortSubscriptionVM* ViewModel);

	void __24b4991b_48f7_e478_a76a_d0b1ec0af2c1_SourceToDest(class FText* SalePrice) const;
	void __731a614b_45a3_7f0d_eeab_168c09c90858_SourceToDest(ESlateVisibility* StrikethroughPriceVisibility) const;
	void __8aa7d011_47c6_fe44_1c90_658e43fe1574_SourceToDest(class FText* SubInfoText) const;
	void __c9eda1e1_46f7_a82a_146c_d2af770cc10b_SourceToDest(class FText* SalePrice) const;
	void __f683aab4_4856_773c_db32_309fbbdf138e_SourceToDest(E_PriceSwitcherState* SwitcherState) const;
	void GetPriceFormattedText(bool IsSalePrice, const int32 Price, class FText* SalePrice) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_PriceSwitcher_C">();
	}
	static class UWBP_UIKit_PriceSwitcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_PriceSwitcher_C>();
	}
};
static_assert(alignof(UWBP_UIKit_PriceSwitcher_C) == 0x000008, "Wrong alignment on UWBP_UIKit_PriceSwitcher_C");
static_assert(sizeof(UWBP_UIKit_PriceSwitcher_C) == 0x0005E8, "Wrong size on UWBP_UIKit_PriceSwitcher_C");
static_assert(offsetof(UWBP_UIKit_PriceSwitcher_C, UberGraphFrame_WBP_UIKit_PriceSwitcher_C) == 0x0005D0, "Member 'UWBP_UIKit_PriceSwitcher_C::UberGraphFrame_WBP_UIKit_PriceSwitcher_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_PriceSwitcher_C, FortSubscriptionVM) == 0x0005D8, "Member 'UWBP_UIKit_PriceSwitcher_C::FortSubscriptionVM' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_PriceSwitcher_C, FortItemShopOfferVM) == 0x0005E0, "Member 'UWBP_UIKit_PriceSwitcher_C::FortItemShopOfferVM' has a wrong offset!");

}

