#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRally_Logo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRally_Logo.WBP_RebootRally_Logo_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_RebootRally_Logo_C final : public UUserWidget
{
public:
	class UImage*                                 Image_GlitchPanel;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RebootRallyLogo;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextGlow01;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRally_Logo_C">();
	}
	static class UWBP_RebootRally_Logo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRally_Logo_C>();
	}
};
static_assert(alignof(UWBP_RebootRally_Logo_C) == 0x000008, "Wrong alignment on UWBP_RebootRally_Logo_C");
static_assert(sizeof(UWBP_RebootRally_Logo_C) == 0x0002D8, "Wrong size on UWBP_RebootRally_Logo_C");
static_assert(offsetof(UWBP_RebootRally_Logo_C, Image_GlitchPanel) == 0x0002C0, "Member 'UWBP_RebootRally_Logo_C::Image_GlitchPanel' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRally_Logo_C, Image_RebootRallyLogo) == 0x0002C8, "Member 'UWBP_RebootRally_Logo_C::Image_RebootRallyLogo' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRally_Logo_C, Image_TextGlow01) == 0x0002D0, "Member 'UWBP_RebootRally_Logo_C::Image_TextGlow01' has a wrong offset!");

}

