#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinedNotebook_BackblingClaimedText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LinedNotebook_BackblingClaimedText.WBP_LinedNotebook_BackblingClaimedText_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_LinedNotebook_BackblingClaimedText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_StatusIndicator_C*           Checkmark;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETextJustify                                  TextJustification;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LinedNotebook_BackblingClaimedText(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LinedNotebook_BackblingClaimedText_C">();
	}
	static class UWBP_LinedNotebook_BackblingClaimedText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LinedNotebook_BackblingClaimedText_C>();
	}
};
static_assert(alignof(UWBP_LinedNotebook_BackblingClaimedText_C) == 0x000008, "Wrong alignment on UWBP_LinedNotebook_BackblingClaimedText_C");
static_assert(sizeof(UWBP_LinedNotebook_BackblingClaimedText_C) == 0x0002D8, "Wrong size on UWBP_LinedNotebook_BackblingClaimedText_C");
static_assert(offsetof(UWBP_LinedNotebook_BackblingClaimedText_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_LinedNotebook_BackblingClaimedText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_BackblingClaimedText_C, Checkmark) == 0x0002C8, "Member 'UWBP_LinedNotebook_BackblingClaimedText_C::Checkmark' has a wrong offset!");
static_assert(offsetof(UWBP_LinedNotebook_BackblingClaimedText_C, TextJustification) == 0x0002D0, "Member 'UWBP_LinedNotebook_BackblingClaimedText_C::TextJustification' has a wrong offset!");

}

