#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SupportACreator_Dialog

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKey_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_BndEvt__AffiliateKeyModal_LaunchWebsite_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_BndEvt__WBP_SupportACreator_Dialog_SearchButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.ExecuteUbergraph_WBP_SupportACreator_Dialog
// 0x0358 (0x0358 - 0x0000)
struct WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAffiliateName_ReturnValue;             // 0x0018(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class UDialogVM_SupportACreator_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDialogVM_SupportACreator_C*            CallFunc_SpawnObject_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAffiliateName_ReturnValue_1;           // 0x0050(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetValidAffiliateNames_ReturnValue;       // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_3;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0080(0x0018)()
	class FString                                 CallFunc_GetAffiliateName_ReturnValue_2;           // 0x0098(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x00C0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_2;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	bool                                          CallFunc_CanLaunchURL_ReturnValue;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_3;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01B0(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_4;          // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_4;                 // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x0200(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess, bool bWasValidAffiliateName, const class FString& AffilateNameChecked)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x022C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_5;          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x0240(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasValidAffiliateName;         // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_AffilateNameChecked;            // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x0280(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_6;                    // 0x02B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x02E8(0x0018)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_6;          // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LimitTextLength_WasTrimmed;               // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog) == 0x000358, "Wrong size on WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, EntryPoint) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, Temp_bool_Variable) == 0x000004, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, Temp_byte_Variable) == 0x000005, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetAffiliateName_ReturnValue) == 0x000018, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetAffiliateName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_SpawnObject_ReturnValue_1) == 0x000030, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetContext_ReturnValue_2) == 0x000040, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000048, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetAffiliateName_ReturnValue_1) == 0x000050, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetAffiliateName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetValidAffiliateNames_ReturnValue) == 0x000060, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetValidAffiliateNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_CustomEvent_bSuccess_1) == 0x000070, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_CustomEvent_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetContext_ReturnValue_3) == 0x000078, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue) == 0x000080, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetAffiliateName_ReturnValue_2) == 0x000098, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetAffiliateName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue_1) == 0x0000C0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Array_Find_ReturnValue) == 0x0000F4, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000100, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue_2) == 0x000108, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000110, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_MakeStruct_FormatArgumentData) == 0x000128, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_MakeArray_Array) == 0x000178, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_CanLaunchURL_ReturnValue) == 0x000188, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_CanLaunchURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Format_ReturnValue) == 0x000190, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue_3) == 0x0001A8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue_2) == 0x0001B0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Len_ReturnValue) == 0x0001C8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001D0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Greater_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_Select_Default) == 0x0001E1, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue_4) == 0x0001E8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetContext_ReturnValue_4) == 0x0001F0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, Temp_byte_Variable_2) == 0x0001F8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue_3) == 0x000200, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000218, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000228, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_CreateDelegate_OutputDelegate_1) == 0x00022C, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue_5) == 0x000238, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue_4) == 0x000240, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000258, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_CustomEvent_bSuccess) == 0x000268, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_CustomEvent_bWasValidAffiliateName) == 0x000269, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_CustomEvent_bWasValidAffiliateName' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_CustomEvent_AffilateNameChecked) == 0x000270, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_CustomEvent_AffilateNameChecked' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue_5) == 0x000280, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000298, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0002A8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, Temp_byte_Variable_3) == 0x0002A9, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetText_ReturnValue_6) == 0x0002B0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Conv_TextToString_ReturnValue_5) == 0x0002C8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x0002D8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002E0, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_ComponentBoundEvent_Text) == 0x0002E8, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_Not_PreBool_ReturnValue) == 0x000300, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetRuntimeOptions_ReturnValue_6) == 0x000308, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetRuntimeOptions_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_PlayAnimationByName_ReturnValue) == 0x000310, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_GetOwningPlayer_ReturnValue) == 0x000318, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_LimitTextLength_WasTrimmed) == 0x000320, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_LimitTextLength_WasTrimmed' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000328, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_DynamicCast_bSuccess) == 0x000330, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, CallFunc_BooleanAND_ReturnValue) == 0x000331, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_ComponentBoundEvent_Button_2) == 0x000338, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_Event_IsDesignTime) == 0x000340, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, Temp_bool_Variable_1) == 0x000341, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_Select_Default_1) == 0x000342, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_ComponentBoundEvent_Button_1) == 0x000348, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog, K2Node_ComponentBoundEvent_Button) == 0x000350, "Member 'WBP_SupportACreator_Dialog_C_ExecuteUbergraph_WBP_SupportACreator_Dialog::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.IsAffiliateKeyReadOnly
// 0x0001 (0x0001 - 0x0000)
struct WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly final
{
public:
	bool                                          bIsAffiliateKeyReadOnly_0;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly) == 0x000001, "Wrong alignment on WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly) == 0x000001, "Wrong size on WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly, bIsAffiliateKeyReadOnly_0) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_IsAffiliateKeyReadOnly::bIsAffiliateKeyReadOnly_0' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.OnCheckComplete
// 0x0018 (0x0018 - 0x0000)
struct WBP_SupportACreator_Dialog_C_OnCheckComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasValidAffiliateName;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AffilateNameChecked;                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_OnCheckComplete) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_OnCheckComplete");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_OnCheckComplete) == 0x000018, "Wrong size on WBP_SupportACreator_Dialog_C_OnCheckComplete");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_OnCheckComplete, bSuccess) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_OnCheckComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_OnCheckComplete, bWasValidAffiliateName) == 0x000001, "Member 'WBP_SupportACreator_Dialog_C_OnCheckComplete::bWasValidAffiliateName' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_OnCheckComplete, AffilateNameChecked) == 0x000008, "Member 'WBP_SupportACreator_Dialog_C_OnCheckComplete::AffilateNameChecked' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.OnSet
// 0x0001 (0x0001 - 0x0000)
struct WBP_SupportACreator_Dialog_C_OnSet final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_OnSet) == 0x000001, "Wrong alignment on WBP_SupportACreator_Dialog_C_OnSet");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_OnSet) == 0x000001, "Wrong size on WBP_SupportACreator_Dialog_C_OnSet");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_OnSet, bSuccess) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_OnSet::bSuccess' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SupportACreator_Dialog_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SupportACreator_Dialog_C_PreConstruct");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_PreConstruct) == 0x000001, "Wrong size on WBP_SupportACreator_Dialog_C_PreConstruct");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SupportACreator_Dialog.WBP_SupportACreator_Dialog_C.SetupAffiliateField
// 0x0028 (0x0028 - 0x0000)
struct WBP_SupportACreator_Dialog_C_SetupAffiliateField final
{
public:
	class FString                                 AffilateName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_SupportACreator_Dialog_C_SetupAffiliateField) == 0x000008, "Wrong alignment on WBP_SupportACreator_Dialog_C_SetupAffiliateField");
static_assert(sizeof(WBP_SupportACreator_Dialog_C_SetupAffiliateField) == 0x000028, "Wrong size on WBP_SupportACreator_Dialog_C_SetupAffiliateField");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_SetupAffiliateField, AffilateName) == 0x000000, "Member 'WBP_SupportACreator_Dialog_C_SetupAffiliateField::AffilateName' has a wrong offset!");
static_assert(offsetof(WBP_SupportACreator_Dialog_C_SetupAffiliateField, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_SupportACreator_Dialog_C_SetupAffiliateField::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

