#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MPL_Customize_ColorRow

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_MPL_Customize_ColorRow_C_BndEvt__FortCosmeticVariantRow_RichColor_TileView_VariantOptions_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_BndEvt__WBP_MPL_Customize_ColorRow_TileView_VariantOptions_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.ExecuteUbergraph_WBP_MPL_Customize_ColorRow
// 0x0068 (0x0068 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortVariantItemVM*                     K2Node_DynamicCast_AsFort_Variant_Item_VM;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
	class UFortAsyncAction_LockerOperation*       CallFunc_EquipItem_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow) == 0x000008, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow) == 0x000068, "Wrong size on WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, EntryPoint) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_CustomEvent_Success) == 0x000004, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, Temp_bool_Variable) == 0x000014, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_ComponentBoundEvent_Item_1) == 0x000018, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_ComponentBoundEvent_bIsSelected) == 0x000020, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_ComponentBoundEvent_Item) == 0x000028, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_DynamicCast_AsFort_Variant_Item_VM) == 0x000030, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_DynamicCast_AsFort_Variant_Item_VM' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, K2Node_Select_Default) == 0x000040, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, CallFunc_EquipItem_ReturnValue) == 0x000058, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::CallFunc_EquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_MPL_Customize_ColorRow_C_ExecuteUbergraph_WBP_MPL_Customize_ColorRow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4
// 0x0001 (0x0001 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4 final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4) == 0x000001, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4) == 0x000001, "Wrong size on WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4, Success) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_OnOperationCompleted_396F202A4FCCDD917515A3B0AEDE92E4::Success' has a wrong offset!");

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.SetErrorMessage
// 0x0020 (0x0020 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_SetErrorMessage final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage) == 0x000008, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_SetErrorMessage");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage) == 0x000020, "Wrong size on WBP_MPL_Customize_ColorRow_C_SetErrorMessage");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage, ErrorText) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_SetErrorMessage::ErrorText' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage, Temp_bool_Variable) == 0x000018, "Member 'WBP_MPL_Customize_ColorRow_C_SetErrorMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'WBP_MPL_Customize_ColorRow_C_SetErrorMessage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage, Temp_byte_Variable) == 0x00001A, "Member 'WBP_MPL_Customize_ColorRow_C_SetErrorMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage, Temp_byte_Variable_1) == 0x00001B, "Member 'WBP_MPL_Customize_ColorRow_C_SetErrorMessage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetErrorMessage, K2Node_Select_Default) == 0x00001C, "Member 'WBP_MPL_Customize_ColorRow_C_SetErrorMessage::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.SetFortVariantRichColorChannelVM
// 0x0028 (0x0028 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM final
{
public:
	class UFortVariantRichColorChannelVM*         ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM) == 0x000008, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM) == 0x000028, "Wrong size on WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM, ViewModel) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_MPL_Customize_ColorRow_C_SetFortVariantRichColorChannelVM::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_MPL_Customize_ColorRow.WBP_MPL_Customize_ColorRow_C.GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                FocusTarget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget");
static_assert(sizeof(WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget");
static_assert(offsetof(WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget, FocusTarget) == 0x000000, "Member 'WBP_MPL_Customize_ColorRow_C_GetDesiredFocusTarget::FocusTarget' has a wrong offset!");

}

