#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_EquippedState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_EquippedState.WBP_UIKit_EquippedState_C
// 0x01A0 (0x0460 - 0x02C0)
class UWBP_UIKit_EquippedState_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          EquippedSection;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Outline;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EquippedSlot;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            OutlineColor;                                      // 0x02E0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            SlotColor;                                         // 0x03A0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UIKit_EquippedState(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetEquippedState(bool IsCurrentSlotEquipped, bool DisplaySlot, const class FText& EquippedSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_EquippedState_C">();
	}
	static class UWBP_UIKit_EquippedState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_EquippedState_C>();
	}
};
static_assert(alignof(UWBP_UIKit_EquippedState_C) == 0x000010, "Wrong alignment on UWBP_UIKit_EquippedState_C");
static_assert(sizeof(UWBP_UIKit_EquippedState_C) == 0x000460, "Wrong size on UWBP_UIKit_EquippedState_C");
static_assert(offsetof(UWBP_UIKit_EquippedState_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_EquippedState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_EquippedState_C, EquippedSection) == 0x0002C8, "Member 'UWBP_UIKit_EquippedState_C::EquippedSection' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_EquippedState_C, Outline) == 0x0002D0, "Member 'UWBP_UIKit_EquippedState_C::Outline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_EquippedState_C, Text_EquippedSlot) == 0x0002D8, "Member 'UWBP_UIKit_EquippedState_C::Text_EquippedSlot' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_EquippedState_C, OutlineColor) == 0x0002E0, "Member 'UWBP_UIKit_EquippedState_C::OutlineColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_EquippedState_C, SlotColor) == 0x0003A0, "Member 'UWBP_UIKit_EquippedState_C::SlotColor' has a wrong offset!");

}

