#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_EditableText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Block_Base_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_EditableText.WBP_UIKit_Block_EditableText_C
// 0x0038 (0x0330 - 0x02F8)
class UWBP_UIKit_Block_EditableText_C final : public UWBP_UIKit_Block_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered_Transition;                           // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIKitEditableText*                     EditableText;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FontDynamicMaterial;                               // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Block_EditableText(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetFont(const struct FSlateFontInfo& Font);
	void SetFontMaterial(class UMaterialInstance* Material_Instance);
	void SetHintText(const class FText& Hint_Text);
	void SetIsPassword(bool IsPassword);
	void SetJustification(ETextJustify Justification);
	void SetMinDesiredWidth(double Min_Width);
	void SetMobileFontSizeMultiplier(float MobileFontSizeMultiplier);
	void SetReadOnly(bool IsReadOnly);
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_EditableText_C">();
	}
	static class UWBP_UIKit_Block_EditableText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_EditableText_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Block_EditableText_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Block_EditableText_C");
static_assert(sizeof(UWBP_UIKit_Block_EditableText_C) == 0x000330, "Wrong size on UWBP_UIKit_Block_EditableText_C");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UIKit_Block_EditableText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, Anim_Disabled_Transition) == 0x000300, "Member 'UWBP_UIKit_Block_EditableText_C::Anim_Disabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, Anim_Pressed_Transition) == 0x000308, "Member 'UWBP_UIKit_Block_EditableText_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, Anim_Focused_Transition) == 0x000310, "Member 'UWBP_UIKit_Block_EditableText_C::Anim_Focused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, Anim_Hovered_Transition) == 0x000318, "Member 'UWBP_UIKit_Block_EditableText_C::Anim_Hovered_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, EditableText) == 0x000320, "Member 'UWBP_UIKit_Block_EditableText_C::EditableText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_EditableText_C, FontDynamicMaterial) == 0x000328, "Member 'UWBP_UIKit_Block_EditableText_C::FontDynamicMaterial' has a wrong offset!");

}

