#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_BackgroundTabSideNav

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_BlockBackground_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C
// 0x0040 (0x0360 - 0x0320)
class UWBP_UIKit_Block_BackgroundTabSideNav_C final : public UWBP_UIKit_BlockBackground_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Block_BackgroundTabSideNav_C; // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Selected_Transition;                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OutlineUnhover;                               // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OutlineHover;                                 // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusOutline;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          RadiusInPixels;                                    // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CornerRadius;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav(int32 EntryPoint);
	void OnInitialized();
	void OnInstantTransitionToSelected();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundMaterial(const class UMaterialInstance*& Material_Instance);
	void SetCornerRadiuses(float CornerRadius_0, bool RadiusInPixels_0);
	void SetOutlineMaterial(const class UMaterialInstance*& Material_Instance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_BackgroundTabSideNav_C">();
	}
	static class UWBP_UIKit_Block_BackgroundTabSideNav_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_BackgroundTabSideNav_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Block_BackgroundTabSideNav_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Block_BackgroundTabSideNav_C");
static_assert(sizeof(UWBP_UIKit_Block_BackgroundTabSideNav_C) == 0x000360, "Wrong size on UWBP_UIKit_Block_BackgroundTabSideNav_C");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, UberGraphFrame_WBP_UIKit_Block_BackgroundTabSideNav_C) == 0x000320, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::UberGraphFrame_WBP_UIKit_Block_BackgroundTabSideNav_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, Anim_Selected_Transition) == 0x000328, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::Anim_Selected_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, Anim_OutlineUnhover) == 0x000330, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::Anim_OutlineUnhover' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, Anim_OutlineHover) == 0x000338, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::Anim_OutlineHover' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, Backing) == 0x000340, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::Backing' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, FocusOutline) == 0x000348, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::FocusOutline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, RadiusInPixels) == 0x000350, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::RadiusInPixels' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Block_BackgroundTabSideNav_C, CornerRadius) == 0x000358, "Member 'UWBP_UIKit_Block_BackgroundTabSideNav_C::CornerRadius' has a wrong offset!");

}

