#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActivityBrowserTile_JoinableParty_RoundedCorners

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActivityBrowserTile_JoinableParty_RoundedCorners.WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C
// 0x0120 (0x16F0 - 0x15D0)
class UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C final : public UFortActivityBrowserPlayWithFriendsTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_OnTouchSelected;                              // 0x15D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnImageLoaded;                                // 0x15E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnHoverSelect;                                // 0x15E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Grid_BottomInfo_Clips;                             // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Names;                                          // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_PresenceTexts;                                  // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_DisplayNamesOrSingleFriendName;           // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Icons;                                     // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_MaxWidthForLongPresenceToForceEllipses;    // 0x1628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_72;                                         // 0x1630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_Tag;                                  // 0x1638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InviteToParty;                                // 0x1640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_JoinableParty;                                // 0x1648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_OtherPlayers;                                 // 0x1650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RichPresence;                                 // 0x1658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SingleUserName;                               // 0x1660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TimeAgoPartied;                               // 0x1668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Regular_C*            WBP_CTA_ButtonPrimary;                             // 0x1670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discover_Tile_Base_C*              WBP_Discover_Tile_Base;                            // 0x1678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_JoinableParty_State_Private_C*     WBP_JoinableParty_State_Private;                   // 0x1680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Glass_C*           WBP_UIKit_Backplate_Glass;                         // 0x1688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ColorSharedTextAndImages;                          // 0x1690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TileSize;                                          // 0x16A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlareOpacity;                                      // 0x16B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B4[0x4];                                     // 0x16B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BackgroundDynamicMaterialInstance;                 // 0x16B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ThumbnailOpacity;                                  // 0x16C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ThumbnailTexture;                                  // 0x16C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Current_Input_Type;                                // 0x16C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C9[0x7];                                     // 0x16C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        HorizontalBoxcontent;                              // 0x16D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstance*                      BackgroundInstance;                                // 0x16E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void AddContextMenuItems();
	void BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnClicked();
	void BP_OnEntryReleased();
	void BP_OnSelectionChanged(bool bIsSelected);
	void BP_PartyInformationUpdated(bool bInIsTileSelected);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners(int32 EntryPoint);
	void InputMethodChanged(ECommonInputType bNewInputType);
	void Is_Arabic_Language(bool* IsArabic);
	void OnGameActivityChanged(class UFortGameActivity* GameActivity);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnTextureBeginLoading();
	void OnTextureLoadingComplete(const class UTexture* ThumbnailTexture_0);
	void OnTileActiveChanged(const bool bIsTileActive);
	void PreConstruct(bool IsDesignTime);
	void Set_CTAButton_Padding(ECommonInputType InputType);
	void Set_Right_Left_Background();
	void Set_Single_Player_Visuals();
	void SetCCUCount(int32 CCUCount);
	void SetInviteVisuals();
	void SetPrivacyVisuals();
	void SetThumbnail(class UTexture* Texture, bool IsLoaded);
	void UpdateCTAButtonInfo(const class FText& InteractionText, const bool bInteractionFound);
	void UpdateCTAButtonInteraction(const bool bIsInteractionEnabled);
	void UpdateIslandThumbnail(const class UTexture* ThumbnailTexture_0);
	void UpdateLastInteraction(const class FText& LastInteraction);
	void UpdateOtherPlayersSubText(const class FText& OtherPlayersSubText);
	void UpdatePartyMemberNames(const class FText& Names);
	void UpdateRichPresence(const class FText& RichPresence);
	void UpdateSingleFriendName(const class FText& SingleFriendName);
	void View_in_Sidebar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C">();
	}
	static class UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C>();
	}
};
static_assert(alignof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C) == 0x000010, "Wrong alignment on UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C");
static_assert(sizeof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C) == 0x0016F0, "Wrong size on UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, UberGraphFrame) == 0x0015D0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Anim_OnTouchSelected) == 0x0015D8, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Anim_OnTouchSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Anim_OnImageLoaded) == 0x0015E0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Anim_OnImageLoaded' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Anim_OnHoverSelect) == 0x0015E8, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Anim_OnHoverSelect' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, BG) == 0x0015F0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Grid_BottomInfo_Clips) == 0x0015F8, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Grid_BottomInfo_Clips' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, HB_Names) == 0x001600, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::HB_Names' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, HB_PresenceTexts) == 0x001608, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::HB_PresenceTexts' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, HorizontalBox_0) == 0x001610, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, RichText_DisplayNamesOrSingleFriendName) == 0x001618, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::RichText_DisplayNamesOrSingleFriendName' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, SizeBox_Icons) == 0x001620, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::SizeBox_Icons' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, SizeBox_MaxWidthForLongPresenceToForceEllipses) == 0x001628, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::SizeBox_MaxWidthForLongPresenceToForceEllipses' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Spacer_72) == 0x001630, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Spacer_72' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, SqueegeeSlot_Tag) == 0x001638, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::SqueegeeSlot_Tag' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Text_InviteToParty) == 0x001640, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Text_InviteToParty' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Text_JoinableParty) == 0x001648, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Text_JoinableParty' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Text_OtherPlayers) == 0x001650, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Text_OtherPlayers' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Text_RichPresence) == 0x001658, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Text_RichPresence' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Text_SingleUserName) == 0x001660, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Text_SingleUserName' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Text_TimeAgoPartied) == 0x001668, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Text_TimeAgoPartied' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, WBP_CTA_ButtonPrimary) == 0x001670, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::WBP_CTA_ButtonPrimary' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, WBP_Discover_Tile_Base) == 0x001678, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::WBP_Discover_Tile_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, WBP_JoinableParty_State_Private) == 0x001680, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::WBP_JoinableParty_State_Private' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, WBP_UIKit_Backplate_Glass) == 0x001688, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::WBP_UIKit_Backplate_Glass' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, ColorSharedTextAndImages) == 0x001690, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::ColorSharedTextAndImages' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, TileSize) == 0x0016A0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::TileSize' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, FlareOpacity) == 0x0016B0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::FlareOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, BackgroundDynamicMaterialInstance) == 0x0016B8, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::BackgroundDynamicMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, ThumbnailOpacity) == 0x0016C0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::ThumbnailOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, ThumbnailTexture) == 0x0016C4, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::ThumbnailTexture' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, Current_Input_Type) == 0x0016C8, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::Current_Input_Type' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, HorizontalBoxcontent) == 0x0016D0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::HorizontalBoxcontent' has a wrong offset!");
static_assert(offsetof(UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C, BackgroundInstance) == 0x0016E0, "Member 'UWBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C::BackgroundInstance' has a wrong offset!");

}

