#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ItemDescription_MPL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "WBP_UIKit_ItemDescription_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ItemDescription_MPL.WBP_UIKit_ItemDescription_MPL_C
// 0x0020 (0x0430 - 0x0410)
class UWBP_UIKit_ItemDescription_MPL_C final : public UWBP_UIKit_ItemDescription_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_ItemDescription_MPL_C;    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLockerCategoryItemVM*              FortLockerCategoryItemVM;                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItemDetailsVM*                     FortItemDetailsVM;                                 // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_CosmeticGate_Warning_C*            AccessRestriction_Warning;                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Access_Restrictions_Changed(EItemAccessRestriction Restriction);
	void ExecuteUbergraph_WBP_UIKit_ItemDescription_MPL(int32 EntryPoint);
	void isDetailedFigureIncoming(bool isDetailedFigureIncoming_0);
	void PreConstruct(bool IsDesignTime);
	void SetFortItemDetailsVM(class UFortItemDetailsVM* ViewModel);
	void SetFortLockerCategoryItemVM(class UFortLockerCategoryItemVM* ViewModel);
	void TrySetCategoryText(const class FText& NewParam);

	void __569107d4_4513_b561_d0f9_999fd629fbc7_SourceToDest(struct FFortColorPalette* RarityColors) const;
	void GetRarityColors(bool IsSeries, const struct FFortColorPalette& FortColorPalette, struct FFortColorPalette* RarityColors) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ItemDescription_MPL_C">();
	}
	static class UWBP_UIKit_ItemDescription_MPL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ItemDescription_MPL_C>();
	}
};
static_assert(alignof(UWBP_UIKit_ItemDescription_MPL_C) == 0x000008, "Wrong alignment on UWBP_UIKit_ItemDescription_MPL_C");
static_assert(sizeof(UWBP_UIKit_ItemDescription_MPL_C) == 0x000430, "Wrong size on UWBP_UIKit_ItemDescription_MPL_C");
static_assert(offsetof(UWBP_UIKit_ItemDescription_MPL_C, UberGraphFrame_WBP_UIKit_ItemDescription_MPL_C) == 0x000410, "Member 'UWBP_UIKit_ItemDescription_MPL_C::UberGraphFrame_WBP_UIKit_ItemDescription_MPL_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemDescription_MPL_C, FortLockerCategoryItemVM) == 0x000418, "Member 'UWBP_UIKit_ItemDescription_MPL_C::FortLockerCategoryItemVM' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemDescription_MPL_C, FortItemDetailsVM) == 0x000420, "Member 'UWBP_UIKit_ItemDescription_MPL_C::FortItemDetailsVM' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ItemDescription_MPL_C, AccessRestriction_Warning) == 0x000428, "Member 'UWBP_UIKit_ItemDescription_MPL_C::AccessRestriction_Warning' has a wrong offset!");

}

