#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class WeaponModsUI.AthenaEquippedItemInfoWeaponMods
// 0x0000 (0x02C0 - 0x02C0)
class UAthenaEquippedItemInfoWeaponMods final : public UUserWidget
{
public:
	void HandleWeaponFullyEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ResetItemInfo();
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEquippedItemInfoWeaponMods">();
	}
	static class UAthenaEquippedItemInfoWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquippedItemInfoWeaponMods>();
	}
};
static_assert(alignof(UAthenaEquippedItemInfoWeaponMods) == 0x000008, "Wrong alignment on UAthenaEquippedItemInfoWeaponMods");
static_assert(sizeof(UAthenaEquippedItemInfoWeaponMods) == 0x0002C0, "Wrong size on UAthenaEquippedItemInfoWeaponMods");

// Class WeaponModsUI.AthenaInventoryGroupWeaponMods
// 0x0000 (0x0350 - 0x0350)
class UAthenaInventoryGroupWeaponMods final : public UAthenaInventoryGroupBase
{
public:
	void HandleButtonClicked(class UObject* Object);

	bool CanWeaponEquipMod(const class AFortWeapon* Weapon, const class UFortWeaponModItemDefinition* Mod) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryGroupWeaponMods">();
	}
	static class UAthenaInventoryGroupWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryGroupWeaponMods>();
	}
};
static_assert(alignof(UAthenaInventoryGroupWeaponMods) == 0x000010, "Wrong alignment on UAthenaInventoryGroupWeaponMods");
static_assert(sizeof(UAthenaInventoryGroupWeaponMods) == 0x000350, "Wrong size on UAthenaInventoryGroupWeaponMods");

// Class WeaponModsUI.AthenaInventoryItemInfoWeaponMods
// 0x0000 (0x02C0 - 0x02C0)
class UAthenaInventoryItemInfoWeaponMods : public UUserWidget
{
public:
	void HandleInventoryItemSelected(class UFortItem* SelectedItem);
	void HandleInventoryPanelOpened();
	void HandleWeaponModSlotsChanged(class AFortWeapon* Weapon);
	void ResetItemInfo();
	void SetIsModifiableWeapon(const bool bIsModifiable);
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);
	void UpdateItemMods();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoWeaponMods">();
	}
	static class UAthenaInventoryItemInfoWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoWeaponMods>();
	}
};
static_assert(alignof(UAthenaInventoryItemInfoWeaponMods) == 0x000008, "Wrong alignment on UAthenaInventoryItemInfoWeaponMods");
static_assert(sizeof(UAthenaInventoryItemInfoWeaponMods) == 0x0002C0, "Wrong size on UAthenaInventoryItemInfoWeaponMods");

// Class WeaponModsUI.AthenaInventoryItemInfoWeaponModsConfigurator
// 0x0000 (0x02C0 - 0x02C0)
class UAthenaInventoryItemInfoWeaponModsConfigurator final : public UAthenaInventoryItemInfoWeaponMods
{
public:
	void RemoveMod(class UFortWeaponModItemDefinition* ModItemDef);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoWeaponModsConfigurator">();
	}
	static class UAthenaInventoryItemInfoWeaponModsConfigurator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoWeaponModsConfigurator>();
	}
};
static_assert(alignof(UAthenaInventoryItemInfoWeaponModsConfigurator) == 0x000008, "Wrong alignment on UAthenaInventoryItemInfoWeaponModsConfigurator");
static_assert(sizeof(UAthenaInventoryItemInfoWeaponModsConfigurator) == 0x0002C0, "Wrong size on UAthenaInventoryItemInfoWeaponModsConfigurator");

// Class WeaponModsUI.AthenaLastKillerWeaponModsInfo
// 0x0008 (0x0330 - 0x0328)
class UAthenaLastKillerWeaponModsInfo final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillerWeaponMods(const TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLastKillerWeaponModsInfo">();
	}
	static class UAthenaLastKillerWeaponModsInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLastKillerWeaponModsInfo>();
	}
};
static_assert(alignof(UAthenaLastKillerWeaponModsInfo) == 0x000008, "Wrong alignment on UAthenaLastKillerWeaponModsInfo");
static_assert(sizeof(UAthenaLastKillerWeaponModsInfo) == 0x000330, "Wrong size on UAthenaLastKillerWeaponModsInfo");

// Class WeaponModsUI.AthenaPickupIndicatorWeaponMods
// 0x0000 (0x02C0 - 0x02C0)
class UAthenaPickupIndicatorWeaponMods final : public UFortInteractContextInfoWidget
{
public:
	void HandlePickupHovered(class AFortPickup* Pickup);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ResetItemInfo();
	void SetEquippedWeaponItemInfo(const class UFortItemDefinition* ItemDef);
	void SetEquippedWeaponItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);
	void SetItemModifiedWeaponName(const class FText& ModifiedWeaponName);
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);

	bool IsInspectViewCollapsedBySettings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaPickupIndicatorWeaponMods">();
	}
	static class UAthenaPickupIndicatorWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPickupIndicatorWeaponMods>();
	}
};
static_assert(alignof(UAthenaPickupIndicatorWeaponMods) == 0x000008, "Wrong alignment on UAthenaPickupIndicatorWeaponMods");
static_assert(sizeof(UAthenaPickupIndicatorWeaponMods) == 0x0002C0, "Wrong size on UAthenaPickupIndicatorWeaponMods");

// Class WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator
// 0x0018 (0x0308 - 0x02F0)
class UAthenaQuickBarSlotWeaponModsIndicator final : public UAthenaQuickBarSlotExtensionWidgetBase
{
public:
	uint8                                         Pad_2F0[0x18];                                     // 0x02F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleQuickBarSlotFocusChanged(EFortQuickBars QuickBarType, int32 QuickBarSlot);
	void HandleWeaponFullyEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleWeaponModSlotsChanged(class AFortWeapon* Weapon);
	void ResetItemInfo();
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);
	void SetItemSlotSelected(bool bIsSelected);
	void SetItemSlotsInfo(const TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaQuickBarSlotWeaponModsIndicator">();
	}
	static class UAthenaQuickBarSlotWeaponModsIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickBarSlotWeaponModsIndicator>();
	}
};
static_assert(alignof(UAthenaQuickBarSlotWeaponModsIndicator) == 0x000008, "Wrong alignment on UAthenaQuickBarSlotWeaponModsIndicator");
static_assert(sizeof(UAthenaQuickBarSlotWeaponModsIndicator) == 0x000308, "Wrong size on UAthenaQuickBarSlotWeaponModsIndicator");

// Class WeaponModsUI.FortGameSettingRegistryExtension_WeaponModsUI
// 0x0000 (0x0028 - 0x0028)
class UFortGameSettingRegistryExtension_WeaponModsUI final : public UFortGameSettingRegistryExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameSettingRegistryExtension_WeaponModsUI">();
	}
	static class UFortGameSettingRegistryExtension_WeaponModsUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameSettingRegistryExtension_WeaponModsUI>();
	}
};
static_assert(alignof(UFortGameSettingRegistryExtension_WeaponModsUI) == 0x000008, "Wrong alignment on UFortGameSettingRegistryExtension_WeaponModsUI");
static_assert(sizeof(UFortGameSettingRegistryExtension_WeaponModsUI) == 0x000028, "Wrong size on UFortGameSettingRegistryExtension_WeaponModsUI");

// Class WeaponModsUI.FortPickupInteractOverrideComponent_ModdableWeapons
// 0x0010 (0x00D0 - 0x00C0)
class UFortPickupInteractOverrideComponent_ModdableWeapons final : public UFortPickupInteractOverrideComponent
{
public:
	TMulticastInlineDelegate<void(class AActor* PickUpActor)> OnAttemptSecondInteractDelegate;                   // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_ModdableWeapons">();
	}
	static class UFortPickupInteractOverrideComponent_ModdableWeapons* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_ModdableWeapons>();
	}
};
static_assert(alignof(UFortPickupInteractOverrideComponent_ModdableWeapons) == 0x000008, "Wrong alignment on UFortPickupInteractOverrideComponent_ModdableWeapons");
static_assert(sizeof(UFortPickupInteractOverrideComponent_ModdableWeapons) == 0x0000D0, "Wrong size on UFortPickupInteractOverrideComponent_ModdableWeapons");
static_assert(offsetof(UFortPickupInteractOverrideComponent_ModdableWeapons, OnAttemptSecondInteractDelegate) == 0x0000C0, "Member 'UFortPickupInteractOverrideComponent_ModdableWeapons::OnAttemptSecondInteractDelegate' has a wrong offset!");

}

