#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponsDynamicUIDirector

#include "Basic.hpp"


namespace SDK::Params
{

// Function WeaponsDynamicUIDirector.WeaponsDynamicUIDirector_C.ExecuteUbergraph_WeaponsDynamicUIDirector
// 0x0020 (0x0020 - 0x0000)
struct WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningLocalPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector) == 0x000008, "Wrong alignment on WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector");
static_assert(sizeof(WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector) == 0x000020, "Wrong size on WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector");
static_assert(offsetof(WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector, EntryPoint) == 0x000000, "Member 'WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector, CallFunc_GetOwningLocalPlayerController_ReturnValue) == 0x000008, "Member 'WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector::CallFunc_GetOwningLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'WeaponsDynamicUIDirector_C_ExecuteUbergraph_WeaponsDynamicUIDirector::CallFunc_IsInZone_ReturnValue' has a wrong offset!");

}

