#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WheelGrenadeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WheelGrenadeRuntime.WheelGrenadeWheel.HandleDamaged
// 0x0050 (0x0050 - 0x0000)
struct WheelGrenadeWheel_HandleDamaged final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0028(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WheelGrenadeWheel_HandleDamaged) == 0x000008, "Wrong alignment on WheelGrenadeWheel_HandleDamaged");
static_assert(sizeof(WheelGrenadeWheel_HandleDamaged) == 0x000050, "Wrong size on WheelGrenadeWheel_HandleDamaged");
static_assert(offsetof(WheelGrenadeWheel_HandleDamaged, Damage) == 0x000000, "Member 'WheelGrenadeWheel_HandleDamaged::Damage' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleDamaged, InTags) == 0x000008, "Member 'WheelGrenadeWheel_HandleDamaged::InTags' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleDamaged, EffectContext) == 0x000028, "Member 'WheelGrenadeWheel_HandleDamaged::EffectContext' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleDamaged, EventInstigator) == 0x000040, "Member 'WheelGrenadeWheel_HandleDamaged::EventInstigator' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleDamaged, DamageCauser) == 0x000048, "Member 'WheelGrenadeWheel_HandleDamaged::DamageCauser' has a wrong offset!");

// Function WheelGrenadeRuntime.WheelGrenadeWheel.HandleOutOfHealth
// 0x0050 (0x0050 - 0x0000)
struct WheelGrenadeWheel_HandleOutOfHealth final
{
public:
	float                                         InDamage;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           InEffectContext;                                   // 0x0028(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            InEventInstigator;                                 // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InDamageCauser;                                    // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WheelGrenadeWheel_HandleOutOfHealth) == 0x000008, "Wrong alignment on WheelGrenadeWheel_HandleOutOfHealth");
static_assert(sizeof(WheelGrenadeWheel_HandleOutOfHealth) == 0x000050, "Wrong size on WheelGrenadeWheel_HandleOutOfHealth");
static_assert(offsetof(WheelGrenadeWheel_HandleOutOfHealth, InDamage) == 0x000000, "Member 'WheelGrenadeWheel_HandleOutOfHealth::InDamage' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleOutOfHealth, InTags) == 0x000008, "Member 'WheelGrenadeWheel_HandleOutOfHealth::InTags' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleOutOfHealth, InEffectContext) == 0x000028, "Member 'WheelGrenadeWheel_HandleOutOfHealth::InEffectContext' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleOutOfHealth, InEventInstigator) == 0x000040, "Member 'WheelGrenadeWheel_HandleOutOfHealth::InEventInstigator' has a wrong offset!");
static_assert(offsetof(WheelGrenadeWheel_HandleOutOfHealth, InDamageCauser) == 0x000048, "Member 'WheelGrenadeWheel_HandleOutOfHealth::InDamageCauser' has a wrong offset!");

// Function WheelGrenadeRuntime.WheelGrenadeWheel.GetHealth
// 0x0004 (0x0004 - 0x0000)
struct WheelGrenadeWheel_GetHealth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WheelGrenadeWheel_GetHealth) == 0x000004, "Wrong alignment on WheelGrenadeWheel_GetHealth");
static_assert(sizeof(WheelGrenadeWheel_GetHealth) == 0x000004, "Wrong size on WheelGrenadeWheel_GetHealth");
static_assert(offsetof(WheelGrenadeWheel_GetHealth, ReturnValue) == 0x000000, "Member 'WheelGrenadeWheel_GetHealth::ReturnValue' has a wrong offset!");

// Function WheelGrenadeRuntime.WheelGrenadeWheel.GetMaxHealth
// 0x0004 (0x0004 - 0x0000)
struct WheelGrenadeWheel_GetMaxHealth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WheelGrenadeWheel_GetMaxHealth) == 0x000004, "Wrong alignment on WheelGrenadeWheel_GetMaxHealth");
static_assert(sizeof(WheelGrenadeWheel_GetMaxHealth) == 0x000004, "Wrong size on WheelGrenadeWheel_GetMaxHealth");
static_assert(offsetof(WheelGrenadeWheel_GetMaxHealth, ReturnValue) == 0x000000, "Member 'WheelGrenadeWheel_GetMaxHealth::ReturnValue' has a wrong offset!");

}

