#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WindManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FlowMapMaterials_structs.hpp"
#include "ArrayOfWaterMeshWaterBlueprintPairs_structs.hpp"
#include "StaticMeshMaterialArrayCombo_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WindManager.WindManager_C
// 0x0130 (0x0648 - 0x0518)
class AWindManager_C final : public AFortWindManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   EmptyStaticMesh;                                   // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SmallerRenderTargetOrthoWidth;                     // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         External_Test_Actor;                               // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AFortStaticMeshActor*>           World_Terrain_Meshes;                              // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                Camera_Height_Offset;                              // 0x0558(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Particle_Z_Offset;                                 // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Water_Interaction_Enabled;                      // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticMeshMaterialArrayCombo>  WorldStaticMeshArray;                              // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FArrayOfWaterMeshWaterBlueprintPairs   Array_Of_Water_Assets;                             // 0x0590(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    PrototypicalStaticMeshes;                          // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Current_Water_Mesh_Index;                          // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFlowMapMaterials>              WaterVectorMatToDefaultMaterialPairing;            // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MaterialPairingFound;                              // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WorldBoundsMinMax;                                 // 0x05CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Black_Scene_Capture_Material;                      // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   Max_level_bounds___used_to_isolate_the_level_from_the_vista; // 0x05E8(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UStaticMeshComponent*>           StormCylinderMeshes;                               // 0x0620(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Storm_Cyl_Mesh_Match;                              // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Wind_Cyl_Mesh_Array_Match_Index;                   // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Delta_Wind_Falloff_in_World_Units;                 // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWindImpulseHandle                 NewVar_1;                                          // 0x0640(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Add_Render_To_Texture_Particle(class UParticleSystem* EmitterTemplate, const struct FTransform& InTransform);
	void Add_Wind_Component(class UPrimitiveComponent* InComponent);
	void AddWindParticleSystemComponent(class UParticleSystemComponent* ParticleSystemComponent);
	struct FVector Calculate_Camera_Position(double Scale, class USceneCaptureComponent2D* Scene_Capture);
	void ExecuteUbergraph_WindManager(int32 EntryPoint);
	void Find_Matching_Wind_Mesh_Index_And_Write_Bool(const struct FVector& Wind_location, bool* Storm_Cyl_Mesh_Match_0, int32* Wind_Cyl_Mesh_Array_Match_Index_0);
	void OnWindImpulseCylinderCreation(const struct FFortWindImpulseCylinder& WindImpulseCylinder, const struct FFortWindImpulseCylinderDelta& WindImpulseCylinderDelta);
	void OnWindImpulseCylinderDeath(const struct FFortWindImpulseCylinder& WindImpulseCylinder);
	void OnWindImpulseCylinderDeltaComplete(const struct FFortWindImpulseCylinder& WindImpulseCylinder);
	void Play_Water_Splash_Particle_System_At_Location(const struct FTransform& Particle_Transform);
	void ReceiveBeginPlay();
	void Register_player_for_render_to_texture_purposes(class UPrimitiveComponent* Effect_Water_Interaction_FX, class UPrimitiveComponent* Gameplay_Wind_INteraction_Effects);
	void RemoveWindCylinder(const struct FFortWindImpulseCylinder& WindImpulseCylinder);
	void SetWindMatVariables(class UMaterialInstanceDynamic* Mid, bool Set_AnimatedCylinderCenter, const struct FVector& AnimatedCylinderCenter, bool Set_Animating_Wind_Magnitude, double Animating_Wind_Magnitude, bool Set_Static_Wind_Magnitude, double Static_Wind_Magnitude, bool Set_CylinderCenter, const struct FVector& CylinderCenter, bool Set_WindVector, const struct FVector& WindVector, bool Set_WindCrossVector, const struct FVector& WindCrossVector, bool Set_OverallOuterRadius, double OverallOuterRadius, bool Set_OverallInnerRadius, double OverallInnerRadius, bool Set_Wind_Still_0_or_Animating_1, double Wind_Still_0_or_Animating_1, bool Set_Circular_Shader_, double Circular_Shader_, bool* NewParam);
	void SpawnTestWind(double Radius, double ImpulseMagnitude);
	void Update_Test(double NewMagnitude);
	void UpdateStormWindCylinder(const struct FFortWindImpulseCylinder& Wind_Impulse, const struct FFortWindImpulseCylinderDelta& Wind_Delta);
	void UpdateWindDeltaCyl(double Static_Cylinder_Outer_Radius, double duration, class UMaterialInstanceDynamic* Mid, bool Is_Wind_Circular_);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WindManager_C">();
	}
	static class AWindManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWindManager_C>();
	}
};
static_assert(alignof(AWindManager_C) == 0x000008, "Wrong alignment on AWindManager_C");
static_assert(sizeof(AWindManager_C) == 0x000648, "Wrong size on AWindManager_C");
static_assert(offsetof(AWindManager_C, UberGraphFrame) == 0x000518, "Member 'AWindManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWindManager_C, EmptyStaticMesh) == 0x000520, "Member 'AWindManager_C::EmptyStaticMesh' has a wrong offset!");
static_assert(offsetof(AWindManager_C, DefaultSceneRoot) == 0x000528, "Member 'AWindManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWindManager_C, SmallerRenderTargetOrthoWidth) == 0x000530, "Member 'AWindManager_C::SmallerRenderTargetOrthoWidth' has a wrong offset!");
static_assert(offsetof(AWindManager_C, External_Test_Actor) == 0x000538, "Member 'AWindManager_C::External_Test_Actor' has a wrong offset!");
static_assert(offsetof(AWindManager_C, World_Terrain_Meshes) == 0x000548, "Member 'AWindManager_C::World_Terrain_Meshes' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Camera_Height_Offset) == 0x000558, "Member 'AWindManager_C::Camera_Height_Offset' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Particle_Z_Offset) == 0x000570, "Member 'AWindManager_C::Particle_Z_Offset' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Is_Water_Interaction_Enabled) == 0x000578, "Member 'AWindManager_C::Is_Water_Interaction_Enabled' has a wrong offset!");
static_assert(offsetof(AWindManager_C, WorldStaticMeshArray) == 0x000580, "Member 'AWindManager_C::WorldStaticMeshArray' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Array_Of_Water_Assets) == 0x000590, "Member 'AWindManager_C::Array_Of_Water_Assets' has a wrong offset!");
static_assert(offsetof(AWindManager_C, PrototypicalStaticMeshes) == 0x0005A0, "Member 'AWindManager_C::PrototypicalStaticMeshes' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Current_Water_Mesh_Index) == 0x0005B0, "Member 'AWindManager_C::Current_Water_Mesh_Index' has a wrong offset!");
static_assert(offsetof(AWindManager_C, WaterVectorMatToDefaultMaterialPairing) == 0x0005B8, "Member 'AWindManager_C::WaterVectorMatToDefaultMaterialPairing' has a wrong offset!");
static_assert(offsetof(AWindManager_C, MaterialPairingFound) == 0x0005C8, "Member 'AWindManager_C::MaterialPairingFound' has a wrong offset!");
static_assert(offsetof(AWindManager_C, WorldBoundsMinMax) == 0x0005CC, "Member 'AWindManager_C::WorldBoundsMinMax' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Black_Scene_Capture_Material) == 0x0005E0, "Member 'AWindManager_C::Black_Scene_Capture_Material' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Max_level_bounds___used_to_isolate_the_level_from_the_vista) == 0x0005E8, "Member 'AWindManager_C::Max_level_bounds___used_to_isolate_the_level_from_the_vista' has a wrong offset!");
static_assert(offsetof(AWindManager_C, StormCylinderMeshes) == 0x000620, "Member 'AWindManager_C::StormCylinderMeshes' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Storm_Cyl_Mesh_Match) == 0x000630, "Member 'AWindManager_C::Storm_Cyl_Mesh_Match' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Wind_Cyl_Mesh_Array_Match_Index) == 0x000634, "Member 'AWindManager_C::Wind_Cyl_Mesh_Array_Match_Index' has a wrong offset!");
static_assert(offsetof(AWindManager_C, Delta_Wind_Falloff_in_World_Units) == 0x000638, "Member 'AWindManager_C::Delta_Wind_Falloff_in_World_Units' has a wrong offset!");
static_assert(offsetof(AWindManager_C, NewVar_1) == 0x000640, "Member 'AWindManager_C::NewVar_1' has a wrong offset!");

}

