#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WolfRidingPlayerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x2E67 (0x2E68 - 0x0001)
struct WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1602;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1603;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1604;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1605;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1606;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1607;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1608;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1609;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1610;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1611;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1612;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1613;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1614;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1615;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1616;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1617;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1618;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1619;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1620;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1621;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1622;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1623;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1624;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1625;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1626;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1627;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1628;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1629;                              // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	EBlendListTransitionType                      __EnumProperty_1630;                               // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1631;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1632;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1633;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1634;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1635;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1636;                              // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1637;                              // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               __EnumProperty_1638;                               // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1639;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1640;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1641;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1642;                                 // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1643;                               // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1644;                               // 0x00F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1645;                              // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1646;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1647;                             // 0x010C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1648;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1649;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1650;                               // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1651;                               // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1652;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1653;                               // 0x014C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1654;                              // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1655;                              // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1656;                               // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1657;                               // 0x0159(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1658;                               // 0x015A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1659;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1660;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1661;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1662;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1663;                             // 0x0170(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1664;                               // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1665;                               // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0210(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                              // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;                   // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_6;                        // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_5;                        // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1;             // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1;             // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_9;                  // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_5;                     // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                              // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_5;                   // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;                    // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_17;                  // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;                        // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                        // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                        // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                        // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_62;                 // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_61;                 // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_60;                 // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_59;                 // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_58;                 // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_57;                 // 0x0678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_56;                 // 0x06A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_55;                 // 0x06D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_54;                 // 0x0708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_53;                 // 0x0738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_52;                 // 0x0768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_51;                 // 0x0798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_50;                 // 0x07C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_49;                 // 0x07F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_48;                 // 0x0828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_47;                 // 0x0858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_46;                 // 0x0888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_45;                 // 0x08B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_43;                   // 0x08E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_42;                   // 0x0918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_16;                  // 0x0948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_41;                      // 0x0978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_41;                   // 0x09A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_40;                   // 0x09D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_15;                  // 0x0A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_40;                      // 0x0A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_39;                   // 0x0A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_38;                   // 0x0A98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_14;                  // 0x0AC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_37;                   // 0x0AF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_13;                  // 0x0B28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_39;                      // 0x0B58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_36;                   // 0x0B88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_38;                      // 0x0BB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_35;                   // 0x0BE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_8;                  // 0x0C18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;                     // 0x0C48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_12;                  // 0x0C78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_34;                   // 0x0CA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_37;                      // 0x0CD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_33;                   // 0x0D08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_36;                      // 0x0D38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_44;                 // 0x0D68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_43;                 // 0x0D98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_42;                 // 0x0DC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_41;                 // 0x0DF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_40;                 // 0x0E28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_39;                 // 0x0E58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_38;                 // 0x0E88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_37;                 // 0x0EB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_32;                   // 0x0EE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_35;                      // 0x0F18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_31;                   // 0x0F48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_34;                      // 0x0F78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_30;                   // 0x0FA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_33;                      // 0x0FD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_29;                   // 0x1008(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_32;                      // 0x1038(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_36;                 // 0x1068(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_9;                      // 0x1098(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_31;                      // 0x10C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_28;                   // 0x10F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_30;                      // 0x1128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_27;                   // 0x1158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_29;                      // 0x1188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_26;                   // 0x11B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_28;                      // 0x11E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;                 // 0x1218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_8;                      // 0x1248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_27;                      // 0x1278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_25;                   // 0x12A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_11;                  // 0x12D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;                 // 0x1308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;                 // 0x1338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_24;                   // 0x1368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_26;                      // 0x1398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_2;                      // 0x13C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_25;                      // 0x13F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_7;                      // 0x1428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;                     // 0x1458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_23;                   // 0x1488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_10;                  // 0x14B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_7;                  // 0x14E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                     // 0x1518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_6;                  // 0x1548(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_24;                      // 0x1578(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;                   // 0x15A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_23;                      // 0x15D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;                      // 0x1608(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;                  // 0x1638(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                     // 0x1668(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                     // 0x1698(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x16C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x16F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;                 // 0x1728(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;                 // 0x1758(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;                 // 0x1788(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                     // 0x17B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_22;                      // 0x17E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_5;                  // 0x1818(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_21;                      // 0x1848(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                     // 0x1878(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_20;                      // 0x18A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;                      // 0x18D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;                    // 0x1908(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x1938(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x1968(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x1998(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x19C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x19F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x1A28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;                 // 0x1A58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;                 // 0x1A88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;                 // 0x1AB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;                 // 0x1AE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;                 // 0x1B18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;                 // 0x1B48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;                 // 0x1B78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;                 // 0x1BA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;                 // 0x1BD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;                 // 0x1C08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;                 // 0x1C38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;                 // 0x1C68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;                 // 0x1C98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;                 // 0x1CC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;                 // 0x1CF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;                 // 0x1D28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;                 // 0x1D58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;                 // 0x1D88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;                   // 0x1DB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;                   // 0x1DE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_9;                   // 0x1E18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_19;                      // 0x1E48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;                   // 0x1E78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;                   // 0x1EA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;                   // 0x1ED8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;                      // 0x1F08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;                   // 0x1F38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;                      // 0x1F68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;                   // 0x1F98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;                   // 0x1FC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;                   // 0x1FF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;                      // 0x2028(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;                 // 0x2058(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;                 // 0x2088(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;                  // 0x20B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;                  // 0x20E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;                  // 0x2118(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;                  // 0x2148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x2178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x21A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;                   // 0x21D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;                      // 0x2208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;                   // 0x2238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;                      // 0x2268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;                   // 0x2298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;                      // 0x22C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;                   // 0x22F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;                      // 0x2328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x2358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                      // 0x2388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;                      // 0x23B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;                   // 0x23E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                      // 0x2418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;                    // 0x2448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                       // 0x2478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;                    // 0x24A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                       // 0x24D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x2508(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                      // 0x2538(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                       // 0x2568(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x2598(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                       // 0x25C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x25F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x2628(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x2658(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;                   // 0x2688(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;                   // 0x26B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                       // 0x26E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x2718(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x2748(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x2778(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;                   // 0x27A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x27D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x2808(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_4;                  // 0x2838(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x2868(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                      // 0x2898(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x28C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x28F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;                  // 0x2928(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x2958(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;                  // 0x2988(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_1;                      // 0x29B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x29E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x2A18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x2A48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x2A78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x2AA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x2AD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                      // 0x2B08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x2B38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x2B68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x2B98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x2BC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose;                        // 0x2BF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x2C28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x2C58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x2C88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;            // 0x2CB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                              // 0x2CE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;                   // 0x2D18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;                   // 0x2D48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                              // 0x2D78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;                   // 0x2DA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;                   // 0x2DD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x2E08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x2E38(0x0030)()
};
static_assert(alignof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x002E68, "Wrong size on WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1602) == 0x000004, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1602' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1603) == 0x000008, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1603' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1604) == 0x000010, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1604' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1605) == 0x000018, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1605' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1606) == 0x00001C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1606' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1607) == 0x000020, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1607' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1608) == 0x000024, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1608' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1609) == 0x000028, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1609' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1610) == 0x00002C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1610' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1611) == 0x000030, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1611' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1612) == 0x000034, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1612' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1613) == 0x000038, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1613' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1614) == 0x00003C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1614' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1615) == 0x000040, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1615' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1616) == 0x000044, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1616' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1617) == 0x000048, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1617' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1618) == 0x00004C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1618' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1619) == 0x000050, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1619' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1620) == 0x000054, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1620' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1621) == 0x000058, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1621' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1622) == 0x00005C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1622' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1623) == 0x000060, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1623' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1624) == 0x000064, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1624' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1625) == 0x000068, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1625' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1626) == 0x00006C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1626' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1627) == 0x000070, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1627' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1628) == 0x000074, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1628' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1629) == 0x000078, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1629' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1630) == 0x000088, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1630' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1631) == 0x000090, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1631' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1632) == 0x0000A0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1632' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1633) == 0x0000A4, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1633' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1634) == 0x0000A8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1634' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1635) == 0x0000AC, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1635' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1636) == 0x0000B0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1636' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1637) == 0x0000C0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1637' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1638) == 0x0000D0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1638' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1639) == 0x0000D4, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1639' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1640) == 0x0000D8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1640' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1641) == 0x0000E0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1641' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1642) == 0x0000E8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1642' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1643) == 0x0000F0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1643' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1644) == 0x0000F1, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1644' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1645) == 0x0000F8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1645' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1646) == 0x000108, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1646' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1647) == 0x00010C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1647' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1648) == 0x000138, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1648' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1649) == 0x00013C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1649' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1650) == 0x000140, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1650' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1651) == 0x000144, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1651' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1652) == 0x000148, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1652' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1653) == 0x00014C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1653' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1654) == 0x000150, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1654' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1655) == 0x000154, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1655' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1656) == 0x000158, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1656' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1657) == 0x000159, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1657' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1658) == 0x00015A, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1658' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1659) == 0x00015C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1659' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1660) == 0x000160, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1660' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1661) == 0x000164, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1661' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1662) == 0x000168, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1662' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1663) == 0x000170, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1663' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1664) == 0x000188, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1664' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1665) == 0x00018C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1665' has a wrong offset!");
